{
    "S1950E15 - Nit-Witty Kitty_scene001.mp4": "视频展示了米高梅动画公司的标志，一只咆哮的狮子出现在红色圆环中，下方有“Metro-Goldwyn-Mayer CARTOON”字样，以及“Color by Technicolor”的字样。",
    "S1950E15 - Nit-Witty Kitty_scene002.mp4": "视频展示了一个经典的米高梅动画片头，背景为深红色，中央有一个圆形框架，里面是一只咆哮的狮子。狮子的咆哮动作在画面中不断变化，表现出强烈的动态感。下方是金色的“CARTOON”字样，以及“COLOR BY Technicolor”的蓝色字样，表明该动画片采用Technicolor彩色技术制作。整个画面充满了复古和经典的动画风格。",
    "S1950E15 - Nit-Witty Kitty_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现《猫和老鼠》的标题画面。",
    "S1950E15 - Nit-Witty Kitty_scene004.mp4": "这是一个《猫和老鼠》的片头画面，展示了主角汤姆猫和杰瑞鼠的卡通形象，背景为红色圆形图案，下方有黄色的“TOM and JERRY”字样。随后画面切换，出现“NIT-WITTY KITTY”字样和导演信息“DIRECTED BY WILLIAM HANNA AND JOSEPH BARBERA”。",
    "S1950E15 - Nit-Witty Kitty_scene005.mp4": "这是一个动画片的片头，显示了标题“NiT-WiTTY KiTTY”，导演是William Hanna和Joseph Barbera。接着，画面展示了动画师名单，包括Ray Patterson、Ed Barge、Kenneth Muse和Irven Spence，音乐由Scott Bradley负责。最后，显示了制片人Fred Quimby的名字。整个画面以黑板的形式呈现，文字用粉笔书写，风格复古。",
    "S1950E15 - Nit-Witty Kitty_scene006.mp4": "视频开始时显示“PRODUCED BY FRED QUIMBY”的字样，随后画面转为黑色，接着出现一个厨房场景，一只猫躺在地上，一只老鼠在它面前。一位穿着围裙的女性拿着扫帚站在旁边。",
    "S1950E15 - Nit-Witty Kitty_scene007.mp4": "在厨房里，一只穿着蓝色围裙的女仆拿着扫帚追赶着一只老鼠。与此同时，一只灰色的猫（汤姆）在地板上追着老鼠，试图抓住它。女仆用扫帚驱赶猫，猫被扫帚击中后，身体被压扁成纸片状，但仍然保持着愤怒的表情。老鼠则在猫和女仆之间穿梭，试图逃脱。整个场景充满了紧张和幽默的气氛。",
    "S1950E15 - Nit-Witty Kitty_scene008.mp4": "画面中是动画角色汤姆猫，他站在灰色背景前，表情显得困惑或惊讶，眼睛睁得很大，瞳孔呈螺旋状。",
    "S1950E15 - Nit-Witty Kitty_scene009.mp4": "动画片中的猫汤姆表情从愤怒变为惊讶，然后又变得有些困惑和担忧，背景颜色也随着他的情绪变化而改变。",
    "S1950E15 - Nit-Witty Kitty_scene010.mp4": "一只蓝色的猫站在黄色背景前，表情从困惑变为惊讶，然后又转为严肃。",
    "S1950E15 - Nit-Witty Kitty_scene011.mp4": "一只灰色的猫在不同颜色的背景前，表情从困惑到惊讶再到开心变化。",
    "S1950E15 - Nit-Witty Kitty_scene012.mp4": "汤姆猫从画面底部向上伸展身体，背景颜色从浅黄变为蓝色，周围出现彩色的爆炸状图案。",
    "S1950E15 - Nit-Witty Kitty_scene013.mp4": "动画片中的汤姆猫从被压缩的状态中恢复，表情从愤怒变为开心大笑，然后又转为惊讶和困惑。",
    "S1950E15 - Nit-Witty Kitty_scene015.mp4": "汤姆猫进入厨房，打开冰箱门，拿出一块奶酪。他先是开心地舔了舔奶酪，然后又得意地舔了舔自己的爪子，最后开心地吃了起来。",
    "S1950E15 - Nit-Witty Kitty_scene016.mp4": "视频中，一只灰色的猫汤姆拿着一块奶酪，坐在地上，面对着一只棕色的小老鼠杰瑞。汤姆试图用奶酪诱惑杰瑞，杰瑞起初犹豫不决，但最终被奶酪吸引，靠近并咬了一口。汤姆看到杰瑞吃奶酪，显得非常高兴。背景是室内，墙壁上有菱形图案，地板是木质的，旁边有一个拱形的洞口。整个场景充满了卡通风格的幽默和互动。",
    "S1950E15 - Nit-Witty Kitty_scene017.mp4": "一只棕色的老鼠站在一个拱形洞口前，它先是站立并环顾四周，然后转身跑进洞里，最后消失在洞中。",
    "S1950E15 - Nit-Witty Kitty_scene018.mp4": "一只猫坐在地上，手里拿着一块奶酪，眼睛盯着前方的洞口。它突然向前扑去，但摔倒在地，随后挣扎着坐起来，尾巴高高翘起。",
    "S1950E15 - Nit-Witty Kitty_scene019.mp4": "在昏暗的房间里，汤姆猫从墙洞中探出头，面带微笑地看着杰瑞鼠。杰瑞鼠站在地毯上，先是被汤姆猫吓了一跳，随后又表现出不屑和挑衅。汤姆猫逐渐从洞中爬出，完全显露身形，依旧保持着微笑，似乎在享受这场追逐游戏。杰瑞鼠则在汤姆猫身边来回躲闪，显得有些紧张。整个场景充满了紧张和幽默的气氛。",
    "S1950E15 - Nit-Witty Kitty_scene020.mp4": "在昏暗的房间里，汤姆猫进入后，兴奋地掀开床单，露出床下的黄色毯子，然后他开心地躺下，将毯子盖在身上，享受着放松的时刻。",
    "S1950E15 - Nit-Witty Kitty_scene021.mp4": "一只棕色的小老鼠站在木制家具下方，先是警惕地四处张望，然后抬起一只前爪，似乎在试探或准备逃跑。",
    "S1950E15 - Nit-Witty Kitty_scene022.mp4": "一个蓝精灵穿着蓝色衣服和白色围裙，手持黄色电话听筒，站在带有菱形图案的墙前。",
    "S1950E15 - Nit-Witty Kitty_scene023.mp4": "一只小老鼠从洞里探出头来，然后走出洞外。这时，一只大猫从洞里探出头来，露出笑容，然后从洞里爬出来，追逐小老鼠。小老鼠转身逃跑，大猫紧随其后。",
    "S1950E15 - Nit-Witty Kitty_scene024.mp4": "一个穿着蓝色围裙和白色围裙的卡通人物，手持黄色电话听筒，站在绿色梯子上。他将电话听筒放下，然后开始沿着梯子向上攀爬，背景是带有菱形图案的墙壁和楼梯。",
    "S1950E15 - Nit-Witty Kitty_scene025.mp4": "汤姆猫看到一个工人在梯子上工作，他兴奋地跑过去，试图抓住梯子。但工人突然跳下，汤姆猫被梯子夹住，他拼命挣扎，最终梯子被他弄倒，他摔倒在地，狼狈不堪。",
    "S1950E15 - Nit-Witty Kitty_scene026.mp4": "杰瑞在地板上奔跑，被汤姆从后面追上并扑倒，杰瑞摔倒在地，随后挣扎着爬起来。",
    "S1950E15 - Nit-Witty Kitty_scene027.mp4": "一只蓝色的猫从墙洞中被弹出，随后一只棕色的老鼠从洞中跑出并停下。",
    "S1950E15 - Nit-Witty Kitty_scene028.mp4": "一只蓝色的猫躺在摇椅上，手里拿着一块奶酪，闭着眼睛享受。它张开嘴，似乎在品尝奶酪，然后把奶酪放下，用手捂住脸，接着又放下手，继续闭眼享受。背景中有一张小桌子，上面放着另一块奶酪，地上铺着一块圆形地毯。",
    "S1950E15 - Nit-Witty Kitty_scene029.mp4": "一只棕色的老鼠从洞口跑出来，来到一张桌子前，用爪子翻开一本红色封面的《医学百科全书》，然后坐在桌边，专注地看着书。",
    "S1950E15 - Nit-Witty Kitty_scene030.mp4": "视频展示了一张纸上的文字，内容是关于“失忆症”的定义：一种暂时性的健忘状态，记忆有时可以通过头部的猛烈撞击恢复。文字以黑色和红色呈现，红色部分强调“在头部”。",
    "S1950E15 - Nit-Witty Kitty_scene031.mp4": "一只棕色的小老鼠站在一个红色的文件柜前，它先是警惕地观察四周，然后用前爪捂住嘴巴，似乎在思考或计划着什么。背景中可以看到书架和一个紫色的椅子。",
    "S1950E15 - Nit-Witty Kitty_scene032.mp4": "一只蓝色的猫躺在地上，双手放在脑后，面带微笑。随后，它突然睁大眼睛，张开嘴巴，显得非常惊讶。",
    "S1950E15 - Nit-Witty Kitty_scene033.mp4": "一只灰色的小老鼠从墙洞中探出头来，先是眯着眼睛露出得意的笑容，随后张大嘴巴，表情变得惊讶和兴奋，最后又转为狡黠的微笑。",
    "S1950E15 - Nit-Witty Kitty_scene034.mp4": "一只老鼠从墙角探出头，手里拿着一块奶酪，兴奋地挥舞着。它突然松开奶酪，奶酪掉落在地上，老鼠也消失在墙角。",
    "S1950E15 - Nit-Witty Kitty_scene035.mp4": "一只老鼠拿着一块奶酪和一根棒球棒，从窗帘后偷偷溜出来，爬上桌子，然后用棒球棒敲打猫的头。猫被敲得晕头转向，但仍然试图抓住老鼠。老鼠在桌子上跳来跳去，用棒球棒敲打猫的头，猫被敲得晕头转向，但仍然试图抓住老鼠。最后，老鼠把棒球棒放在桌子上，自己也爬上了桌子，猫则在地上翻滚。",
    "S1950E15 - Nit-Witty Kitty_scene037.mp4": "一只棕色的小老鼠站在一个木制柜子的顶部，它用爪子推动一个黑色的保龄球。保龄球在柜子顶部滚动，小老鼠被球推动着向后倒下，最终躺在柜子边缘，面带微笑地看着球滚走。背景是深蓝色的墙壁，柜子里摆放着银色和红色的餐具。",
    "S1950E15 - Nit-Witty Kitty_scene038.mp4": "汤姆猫坐在一个木板上，手里拿着一个铃铛，看起来很开心。一个黑色的保龄球从上方滚落，砸在木板上，导致木板倾斜，汤姆猫被弹飞出去。",
    "S1950E15 - Nit-Witty Kitty_scene039.mp4": "汤姆猫从墙上摔下，身体被拉长，随后恢复正常并惊讶地看着墙上的画。",
    "S1950E15 - Nit-Witty Kitty_scene040.mp4": "汤姆猫坐在一块木板上，木板另一端有一个保龄球。汤姆猫先是惊讶地看着保龄球，然后变得愤怒，紧握拳头，似乎在计划如何对付保龄球。",
    "S1950E15 - Nit-Witty Kitty_scene041.mp4": "一只棕色的老鼠站在一个木制柜子的顶部，柜子里有银器和红色的酒杯。老鼠先是警惕地环顾四周，然后突然张大嘴巴，似乎在大声叫喊或尖叫。",
    "S1950E15 - Nit-Witty Kitty_scene042.mp4": "一个黑色的保龄球在绿色的保龄球道上滚动，镜头跟随保龄球移动，最终保龄球滚出画面。",
    "S1950E15 - Nit-Witty Kitty_scene043.mp4": "汤姆猫坐在一块木板上，木板下方有一个蓝色的罐子和一块奶酪。一个黑色的球从左侧滚来，汤姆猫被吓了一跳，随后他捡起奶酪并吃掉，露出满意的笑容。接着，画面切换到杰瑞鼠，它背着一块大奶酪，沿途留下许多小奶酪块，然后跑出了画面。汤姆猫从墙后探出头来，看到杰瑞鼠留下的奶酪块，他高兴地吃掉一块，然后继续观察杰瑞鼠的踪迹。",
    "S1950E15 - Nit-Witty Kitty_scene044.mp4": "一只棕色的小老鼠正用嘴叼着一个蓝色的大花瓶，花瓶上有黄色的装饰图案。小老鼠站在一个白色的台子上，背景是绿色的墙板和红色的砖墙。小老鼠用力将花瓶举过头顶，花瓶逐渐倾斜，最终小老鼠用双手托住花瓶底部，花瓶倒立在它头顶上。",
    "S1950E15 - Nit-Witty Kitty_scene045.mp4": "汤姆猫在壁炉前吃奶酪，不小心打翻了蓝色的水罐，水洒了一地。杰瑞鼠从沙发底下跑出来，拖着一根绳子，似乎在玩弄汤姆。",
    "S1950E15 - Nit-Witty Kitty_scene046.mp4": "汤姆猫用绳子拉钢琴，钢琴被拉倒，汤姆猫被砸中。",
    "S1950E15 - Nit-Witty Kitty_scene047.mp4": "汤姆猫在房间里，靠近一张长桌，它先是坐着，然后站起来，伸出手去抓桌下的一个黄色小物体，接着它转身跑开了。",
    "S1950E15 - Nit-Witty Kitty_scene048.mp4": "一只蓝色的猫坐在地上，面前散落着几块黄色的物体。它先是用爪子抓起一块，然后张大嘴巴，似乎在吃或咬它。接着，它用爪子拍打门上的把手，看起来很生气或沮丧。",
    "S1950E15 - Nit-Witty Kitty_scene049.mp4": "一个蓝色的熨斗放在黄色的门上，门缓缓打开，熨斗掉入门内。",
    "S1950E15 - Nit-Witty Kitty_scene050.mp4": "汤姆猫坐在门边，手里拿着一块奶酪，正津津有味地吃着。突然，一个蓝色的物体从门后飞出，撞到了汤姆的尾巴，汤姆被吓了一跳，奶酪掉在地上。汤姆转过身，看着这个蓝色物体，表情惊讶。",
    "S1950E15 - Nit-Witty Kitty_scene051.mp4": "汤姆猫在厨房地板上发现几块奶酪，它兴奋地捡起一块大奶酪，开心地展示给观众看。",
    "S1950E15 - Nit-Witty Kitty_scene052.mp4": "一只老鼠拿着大剪刀，试图剪断绑在门上的绳子。",
    "S1950E15 - Nit-Witty Kitty_scene053.mp4": "一个黑色的铁砧被绳子吊起，随后绳子被拉断，铁砧掉落，绳子消失。",
    "S1950E15 - Nit-Witty Kitty_scene054.mp4": "汤姆猫在厨房里拿着一块奶酪，突然地板裂开，他被卡在洞口，露出惊讶的表情。",
    "S1950E15 - Nit-Witty Kitty_scene055.mp4": "一只小老鼠站在门边，被一根绳子拴住。一只猫拿着一块奶酪出现，试图引诱小老鼠。小老鼠被吸引，靠近猫，猫则表现出兴奋和期待的样子。",
    "S1950E15 - Nit-Witty Kitty_scene056.mp4": "一只棕色的老鼠抱着一块奶酪，突然奶酪被扔出去，老鼠惊讶地张开双臂，随后坐倒在地，表情显得沮丧。",
    "S1950E15 - Nit-Witty Kitty_scene057.mp4": "一个白色的陶瓷小物件在架子上滚动，从右侧滚向左侧，经过一个带有花卉图案的盘子。",
    "S1950E15 - Nit-Witty Kitty_scene058.mp4": "动画片段中，一个黄色的架子上摆放着几个盘子和一个茶壶。盘子上有花卉图案，其中一个盘子在动画中翻转并掉落。架子下方是绿色的墙壁，右侧有带红色条纹的窗帘。",
    "S1950E15 - Nit-Witty Kitty_scene059.mp4": "一个装满衣物的洗衣篮从椅子上滑落，衣物散落一地。一个蓝色的圆形物体从篮子中滚出，滚过地板，最终被一把扫帚扫走。",
    "S1950E15 - Nit-Witty Kitty_scene060.mp4": "一把红色的撬棍正在撬动一扇绿色的门，门锁被撬开，门缓缓打开。",
    "S1950E15 - Nit-Witty Kitty_scene061.mp4": "汤姆猫坐在厨房里，手里拿着一块奶酪，面带微笑。突然，一个巨大的飞盘从窗户飞进来，砸在汤姆头上，他惊慌失措地举起双手。杰瑞鼠在一旁看着，露出得意的笑容。",
    "S1950E15 - Nit-Witty Kitty_scene062.mp4": "视频中，汤姆猫站在蓝色背景前，表情从困惑到愤怒。他先是皱眉，随后抬起一只爪子遮住眼睛，接着转头并紧握双拳，显得非常生气。",
    "S1950E15 - Nit-Witty Kitty_scene063.mp4": "一只棕色的老鼠在黄色地板上兴奋地跳跃和奔跑，最后消失在画面中。",
    "S1950E15 - Nit-Witty Kitty_scene064.mp4": "一只老鼠从洞里跑出来，猫追了上去，老鼠咬住猫的鼻子，猫被激怒，但最终猫躺在地上，看起来很生气。",
    "S1950E15 - Nit-Witty Kitty_scene065.mp4": "一只棕色的小老鼠坐在一张绿色的小床上，床边有四根木棍支撑。它先是兴奋地挥舞着双臂，然后躺下，闭上眼睛，似乎在享受宁静的时刻。接着，它睁开眼睛，坐直身体，表情变得警觉。房间内有一盏绿色灯罩的台灯和一个红色的小桌子，桌子上放着一块奶酪。地板上铺着一块圆形地毯。",
    "S1950E15 - Nit-Witty Kitty_scene066.mp4": "一只灰色的猫躺在地上，眼睛半闭，看起来很困倦。一只棕色的小老鼠从墙上的洞里探出头来，然后慢慢走出来，站在洞口，张开双臂，似乎在向猫打招呼或展示自己。猫依然保持原来的姿势，没有反应。",
    "S1950E15 - Nit-Witty Kitty_scene067.mp4": "一位穿着蓝色围裙的女性角色，手持一本红色书和一根黄色棒球棒，从画面左侧走向右侧。她走过一个木制柜子，柜子上放着一个圆形镜子。在她走到画面右侧时，一只灰色的猫躺在地上，似乎在睡觉。女性角色停下脚步，低头看着猫，然后举起棒球棒，似乎准备打猫，但最终没有动手，只是将棒球棒举在空中，然后转身离开。",
    "S1950E15 - Nit-Witty Kitty_scene069.mp4": "视频开始时显示“THE END”字样，随后切换到“An MGM Tom and Jerry Cartoon”标题，下方标注“MADE IN HOLLYWOOD, U.S.A.”，背景为红色，文字为白色和蓝色。",
    "S1950E15 - Nit-Witty Kitty_scene070.mp4": "视频展示了MGM出品的《Tom and Jerry》卡通片的片头，背景为深红色，文字以蓝色和白色呈现，下方标注“MADE IN HOLLYWOOD, U.S.A.”，随后画面转为全黑。"
}