{
    "32. A Mouse in the House_scene001.mp4": "视频开始时显示黑色背景，右下角有白色数字“0110544170204083”。随后画面切换至深蓝色背景，出现“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”的金色文字，构成经典卡通片头标志。",
    "32. A Mouse in the House_scene002.mp4": "视频展示了一个经典的卡通片头，背景为深蓝色，中央是一个圆形标志，内有一只咆哮的狮子。标志上方写着“A METRO-GOLDWYN-MAYER”，下方是大字“CARTOON”，再下方是“COLOR BY TECHNICOLOR”。狮子在标志内不断咆哮，表情生动。画面底部有一串数字“0110544170204083”。整个画面风格复古，充满经典动画片的韵味。",
    "32. A Mouse in the House_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现《猫和老鼠》的标题和角色形象。",
    "32. A Mouse in the House_scene004.mp4": "这是一个《猫和老鼠》动画片的片头画面，背景为深绿色，左侧是棕色的小老鼠杰瑞，右侧是灰色的猫汤姆，中间是黄色的“Tom and Jerry”字样。随后画面淡入，出现“'A MOUSE IN THE HOUSE'”以及导演“Directed by William Hanna and Joseph Barbera”的字样。",
    "32. A Mouse in the House_scene005.mp4": "这是一个《猫和老鼠》动画片的片头，标题为“A MOUSE IN THE HOUSE”，由William Hanna和Joseph Barbera执导，动画师包括Kenneth Muse、Ed Barge、Richard Bickenbach和Don Patterson，音乐由Scott Bradley创作，由Fred Quimby制作。背景为蓝色，画面中有一个老鼠夹和一个礼物盒，下方有中文翻译“家里有只老鼠”。",
    "32. A Mouse in the House_scene006.mp4": "一个穿着蓝色花裙子、红色拖鞋的卡通人物，手里拿着一个蓝色的闹钟，正在房间里慢慢走动。",
    "32. A Mouse in the House_scene007.mp4": "一个穿着蓝色花袍、红色拖鞋的卡通角色从门后走出，手里拿着一个闹钟，表情显得很生气或沮丧。她站在厨房里，背景是橱柜和一些瓶子。画面中出现字幕：“天啊！那只烦人的老鼠在果酱里...”，表明她可能因为老鼠闯入果酱而感到烦恼。",
    "32. A Mouse in the House_scene008.mp4": "视频展示了一个厨房场景，画面中有一个面包箱，里面装着几片面包，旁边有一个装满果酱的杯子，果酱洒了一地。接着镜头转向冰箱，冰箱门打开，里面的食物如鸡腿和牛奶洒了一地。最后镜头聚焦在一个巧克力蛋糕上，蛋糕被吃掉了一部分，巧克力酱洒在盘子周围。画面下方有字幕描述老鼠在果酱、面包箱、冰箱和巧克力蛋糕上造成的破坏。",
    "32. A Mouse in the House_scene009.mp4": "一个穿着蓝色花浴袍、红色拖鞋的角色在厨房里，疑惑地自言自语，随后转身走向门口。",
    "32. A Mouse in the House_scene010.mp4": "一位穿着蓝色花袍的女性走进房间，看到两只猫懒洋洋地躺在沙发上和地上，面前散落着食物和餐具。她拿着扫帚，责备它们懒惰，并询问它们是否觉得舒服，是否吃了许多新鲜奶油。",
    "32. A Mouse in the House_scene011.mp4": "在客厅里，汤姆猫躺在沙发上，用手指蘸着碗里的奶油，然后舔舐，表情享受。旁边，杰瑞猫躺在黄色枕头上，看着汤姆，表情略带无奈。汤姆舔奶油时，奶油从嘴角滴落，他显得非常满足。杰瑞最终露出微笑，似乎在妥协或接受汤姆的行为。地上散落着吃剩的鱼骨头和一些奶油痕迹，旁边还有两个空玻璃瓶。",
    "32. A Mouse in the House_scene012.mp4": "在客厅里，汤姆猫躺在沙发上，看着地上的杰瑞鼠和散落的食物。杰瑞鼠躺在垫子上，显得非常满足。这时，一位穿着蓝色花裙子、拿着扫帚的女主人走进来，似乎要打扫卫生。汤姆猫和杰瑞鼠都表现出惊讶和不满的表情。杰瑞鼠突然坐起来，显得非常惊慌。",
    "32. A Mouse in the House_scene013.mp4": "视频中，两只猫在室内发生争执，一只灰猫和一只黑猫互相抱住对方，表情惊恐。一位穿着蓝色花袍的女性角色站在一旁，用手指着它们，似乎在训斥或宣布规则。她提到家里只允许有一只猫，并且必须是能抓到老鼠的猫。随后，她命令灰猫去抓老鼠，灰猫被黑猫推倒在地，黑猫则迅速离开。整个场景充满了紧张和戏剧性。",
    "32. A Mouse in the House_scene014.mp4": "在客厅里，两只猫——汤姆和另一只黑猫——正在追逐打闹。汤姆试图用纸张和家具来捉住黑猫，但黑猫灵活地躲避并反击。随后，场景切换到一个房间，汤姆发现一只老鼠躲在抽屉里，他试图抓住它，但黑猫也加入了进来，试图帮助老鼠。最终，黑猫成功地把老鼠从抽屉里拉了出来，而汤姆则显得非常沮丧。",
    "32. A Mouse in the House_scene015.mp4": "视频中，一只灰色的猫（汤姆）在房间里追逐一只棕色的小老鼠（杰瑞）。汤姆试图抓住杰瑞，但杰瑞机灵地躲闪。随后，汤姆拉起地毯，试图用地毯困住杰瑞，但杰瑞巧妙地逃脱。这时，另一只黑色的猫（斯派克）出现，与汤姆争夺杰瑞。两只猫为了抢夺杰瑞而互相推搡，最终双双摔倒在地，杰瑞趁机逃走。整个过程充满了幽默和紧张的追逐场面。",
    "32. A Mouse in the House_scene016.mp4": "一只小老鼠在房间里奔跑，被两只猫追逐。小老鼠躲到一个装满金币的木桶后面，然后拿走一根木头，用它击打其中一只猫，导致两只猫互相扭打。最终，黑色的猫抓住了红色的猫尾巴，而灰色的猫则躺在地上。",
    "32. A Mouse in the House_scene017.mp4": "一只小老鼠在房间里奔跑，被两只猫追逐。两只猫最终抓住了小老鼠，但它们为了争夺小老鼠而互相争斗。最后，小老鼠被放在壁炉架上，而两只猫则拿着玩具枪对峙。",
    "32. A Mouse in the House_scene018.mp4": "在室内，两只猫拿着玩具手枪对峙。灰色猫向黑色猫射击，黑色猫被击中后表现出惊恐和痛苦的表情。",
    "32. A Mouse in the House_scene019.mp4": "汤姆手持蓝色猎枪瞄准，枪口突然喷出黄色伸缩梯，梯子顶端站着一个戴绿帽的小黄人，小黄人举起蓝色杯子向汤姆喷水，汤姆被水喷中后张大嘴巴，表情惊讶，随后小黄人消失，汤姆呆立原地。",
    "32. A Mouse in the House_scene020.mp4": "汤姆猫手持一把蓝色和棕色的玩具枪，表情从专注变为得意，随后又转为惊讶和困惑。背景是粉紫色的渐变色。",
    "32. A Mouse in the House_scene021.mp4": "一只灰色的手握着一把蓝色的玩具枪，枪身上有一个棕色标签，标签上用红色字体写着“AJAX NOVELTY GUN”。画面下方出现中文字幕“亚甲斯玩具枪”。背景为粉红色。",
    "32. A Mouse in the House_scene022.mp4": "两只猫在室内对峙，各自手持玩具枪。黑猫突然开枪，灰猫被击中后向后飞出，最终撞墙消失。",
    "32. A Mouse in the House_scene023.mp4": "两只猫在室内追逐，一只黑猫手持玩具枪对准灰猫，灰猫惊慌逃跑，最终被逼至墙角，黑猫继续用玩具枪指着灰猫。",
    "32. A Mouse in the House_scene024.mp4": "两只猫对峙，一只黑猫手持玩具枪对准灰猫，灰猫先是惊恐，后变得自信并挑衅，黑猫表情愤怒。",
    "32. A Mouse in the House_scene026.mp4": "画面中出现了一只愤怒的猫，它张大嘴巴露出尖牙，表情凶狠。背景是充满云朵和星星的夜空，整体氛围显得紧张而戏剧化。",
    "32. A Mouse in the House_scene027.mp4": "视频中，汤姆猫表情愤怒，头上有一只小鸟在飞舞。随后，汤姆猫看到杰瑞鼠在厨房里逃跑，杰瑞鼠跳进烤箱。汤姆猫和另一只黑猫争夺烤箱门，最终黑猫成功关上烤箱门。",
    "32. A Mouse in the House_scene028.mp4": "一只棕色的小老鼠从收音机的扬声器里探出头来，然后跳到收音机的顶部，趴在上面观察四周。",
    "32. A Mouse in the House_scene029.mp4": "在厨房里，灰色的汤姆猫和黑色的杰瑞猫面对面站立，汤姆猫伸出爪子，杰瑞猫张开嘴露出惊讶的表情。随后，汤姆猫打开烤箱，杰瑞猫跳进烤箱里，汤姆猫也跟着跳进去，两人在烤箱里背对背站立。",
    "32. A Mouse in the House_scene030.mp4": "一只老鼠从收音机后面探出头，手里拿着一根点燃的火柴，火柴的火焰在它面前晃动，老鼠看起来很兴奋。",
    "32. A Mouse in the House_scene034.mp4": "厨房里浓烟滚滚，两只猫从烟雾中显现，它们表情惊恐，似乎被烟熏得睁不开眼，站在烤箱前。",
    "32. A Mouse in the House_scene035.mp4": "一只小老鼠从绿色的伞桶后面跑出来，然后一只猫从门后冲出来追赶它。猫在追逐过程中，身体发生了变形，变成了一只黑色的猫，然后又变回了原来的灰色猫。小老鼠则站在伞桶后面，看着猫的追逐。",
    "32. A Mouse in the House_scene036.mp4": "一只棕色的小老鼠从绿色柱子后面探出头，然后沿着墙边快速跑开。镜头跟随它移动，经过一张放有台灯和绿色盒子的木桌，接着展示了一个宽敞的房间，房间内有镜子、桌子、钢琴和楼梯。",
    "32. A Mouse in the House_scene037.mp4": "一只棕色的小老鼠从绿色柱子后面探出头来，然后迅速跑开。镜头跟随老鼠移动，逐渐展示出一个布置精致的客厅，包括粉色沙发、地毯、壁炉和书桌等家具。",
    "32. A Mouse in the House_scene038.mp4": "一只小老鼠躲在墙角，被两只猫发现并抓住。小老鼠挣脱后，黑猫得意地将它抛向空中，灰猫则被黑猫的尾巴绊倒，摔在地上。",
    "32. A Mouse in the House_scene039.mp4": "一只黑猫抓着一只小老鼠，另一只灰猫从后面拉黑猫的尾巴，黑猫试图挣脱，灰猫则愤怒地瞪着黑猫。",
    "32. A Mouse in the House_scene040.mp4": "一只黑猫悄悄靠近桌子，用爪子将一只小老鼠推入一个粉色的木琴中。老鼠被推入后，黑猫满意地退后，老鼠则在木琴中探出头来。",
    "32. A Mouse in the House_scene041.mp4": "两只猫在室内对峙，黑猫用爪子攻击灰猫，灰猫被击中后表现出痛苦和惊讶的表情，随后黑猫继续攻击，灰猫试图反击但被击退，最终黑猫得意地大笑，灰猫则显得狼狈不堪。",
    "32. A Mouse in the House_scene042.mp4": "一只老鼠坐在一个粉色的木琴上，它先是用爪子敲击木琴，然后拿起绿色的锤子敲击悬挂的黄色锣，锣发出响声。",
    "32. A Mouse in the House_scene043.mp4": "在客厅里，两只猫正在打斗。一只黑猫抓住灰猫的脖子，灰猫挣扎着，黑猫被甩开后，灰猫继续追击，黑猫躲到沙发后面，灰猫则跳到脚凳上。",
    "32. A Mouse in the House_scene044.mp4": "汤姆猫在沙发上伸懒腰，伸手拿桌上花瓶里的水喝，结果水洒了一身，他生气地把水喷向桌子，然后发现杰瑞鼠在沙发上拿着扇子扇他，汤姆猫被扇得一脸惊讶。",
    "32. A Mouse in the House_scene045.mp4": "一只小老鼠站在一只大猫的胳膊上，它先是用爪子挠猫的耳朵，然后开始跳舞，猫的表情从惊讶变为开心，最后小老鼠被猫的笑声吓跑。",
    "32. A Mouse in the House_scene046.mp4": "一只黑猫和一只小老鼠在互动。小老鼠站在黑猫的爪子上，先是用爪子轻轻拍打黑猫的脸，然后黑猫的表情从愤怒变为惊讶，最后小老鼠被吹走，黑猫看着它离开。",
    "32. A Mouse in the House_scene047.mp4": "在客厅里，一只黑猫从沙发上跳起，与灰猫汤姆扭打在一起。黑猫用爪子抓汤姆的脸，汤姆则试图挣脱。两人在客厅中激烈地搏斗。",
    "32. A Mouse in the House_scene049.mp4": "在室内，一只黑猫跪在地上，手里拿着一只小老鼠，面带得意地向灰猫展示。灰猫先是惊讶，随后变得沮丧，最终低头并慢慢向左退出画面。黑猫则始终保持着得意的姿态，没有移动。",
    "32. A Mouse in the House_scene050.mp4": "汤姆猫从窗帘后探出头，小心翼翼地观察四周，随后慢慢拉起窗帘，露出警惕的表情。",
    "32. A Mouse in the House_scene051.mp4": "一只黑猫得意地举着一只小老鼠，随后另一只手从窗帘后伸出来，把小老鼠拿走了，黑猫露出惊讶的表情。",
    "32. A Mouse in the House_scene052.mp4": "在室内，一只灰色的猫（汤姆）坐在地上，靠在一个装满黄色液体的罐子旁，另一只黑色的猫从窗帘后冲出来，与汤姆对峙。黑色猫显得愤怒，而汤姆则保持镇定，甚至做出挑衅的手势。随后，汤姆突然被黑色猫抓住耳朵，被提起并悬在空中，而汤姆的脚边有一只小老鼠在跑动。",
    "32. A Mouse in the House_scene053.mp4": "一只棕色的小老鼠在紫色的地毯上，双臂高举，身体前倾，似乎在努力伸展或保持平衡。它的表情从专注逐渐变为紧张，眼睛瞪大，嘴巴微张，显示出它正在努力应对某种挑战或困境。背景中可以看到部分红色窗帘和米色墙壁，暗示场景可能是在室内。整个画面充满了卡通风格的夸张和幽默感。",
    "32. A Mouse in the House_scene054.mp4": "在一间房子里，一只黑猫抓住一只灰猫的尾巴，把灰猫举起来扔进一个油漆桶里。黑猫得意地拿着一只小老鼠，然后跑出了画面。灰猫从桶里探出头，愤怒地盯着黑猫离开的方向，随后也跳出了桶，追赶黑猫。",
    "32. A Mouse in the House_scene055.mp4": "汤姆猫在厨房里偷穿女主人的围裙，戴上面具后假装成女主人，然后从门后偷看并试图吓唬另一只黑猫。",
    "32. A Mouse in the House_scene056.mp4": "在厨房里，汤姆穿着绿色围裙和红色头巾，背对着镜头在水槽边洗碗。杰瑞突然从左侧跳出来，手里拿着一块肉，试图吸引汤姆的注意。汤姆转过身来，发现杰瑞手里拿着肉，愤怒地伸手去抓，但杰瑞灵活地躲开了，汤姆则继续洗碗。",
    "32. A Mouse in the House_scene057.mp4": "在厨房里，一只穿着绿色围裙、戴着红色头巾的猫（汤姆）手里拿着一只小老鼠，另一只黑猫（杰瑞）则用爪子抓着汤姆的手臂。汤姆举起平底锅，愤怒地挥舞着，试图打黑猫，但黑猫灵活地躲开了。汤姆在愤怒中失去平衡，从凳子上摔了下来，身体在空中翻滚，最终倒在地上。",
    "32. A Mouse in the House_scene058.mp4": "一只黑猫在厨房里醒来，感到头晕目眩，随后开始奔跑并跳起，抓起一件绿色衣服和一条红黄相间的领带，最后迅速离开画面。",
    "32. A Mouse in the House_scene059.mp4": "一只黑猫穿着女仆装，头戴红色头巾，正在整理书架。这时，灰猫汤姆拿着一只小老鼠从楼梯走下来，他把小老鼠递给黑猫，黑猫生气地拿起扫帚，准备教训汤姆。汤姆被吓得倒在地上，黑猫则得意地跳起来，准备用扫帚打汤姆。",
    "32. A Mouse in the House_scene060.mp4": "一只黑猫在厨房里追逐一只小老鼠，黑猫抓到老鼠后，被一个从上方掉落的熨衣板砸中，最终摔倒在地。",
    "32. A Mouse in the House_scene061.mp4": "一只老鼠从猫的肚皮下钻出，趴在猫的肚皮上，然后又跳了上去，最后从猫的肚皮上跳走。",
    "32. A Mouse in the House_scene062.mp4": "一只黑猫躺在地上，随后坐起并拿起一个蓝色的锅，开始用力挥舞，最终冲向一个绿色的桶。",
    "32. A Mouse in the House_scene063.mp4": "汤姆猫躺在地上，看起来很痛苦，他挣扎着坐起来，然后捡起一把黄色的扫帚，用它猛烈地击打一把椅子，最后椅子被击打后消失。",
    "32. A Mouse in the House_scene064.mp4": "一个穿着绿色衣服、白色围裙和红色拖鞋的角色正在走上铺有红色地毯的楼梯。角色的动作从下楼梯逐渐过渡到上楼梯，步伐稳健，似乎有明确的目的。画面中出现字幕：“要去看一眼那两只猫才行”，表明角色的目的可能是去查看两只猫。整个场景发生在一个室内环境中，背景有柱子和墙壁，光线柔和。",
    "32. A Mouse in the House_scene065.mp4": "视频中，汤姆猫手持黄色铲子从楼梯旁跑过，随后一只黑猫拿着蓝色平底锅从楼梯另一侧跑出，两者在楼梯附近相遇并展开追逐。",
    "32. A Mouse in the House_scene066.mp4": "视频中，一只黑猫手持镜子，站在楼梯下，另一只灰猫从楼梯上下来，与黑猫相遇。随后，灰猫和黑猫一起追赶一个穿着绿色衣服、系着白色围裙的胖女人。胖女人被追到门口，两只猫从两侧逼近，用镜子和扫帚攻击她。胖女人被逼到墙角，两只猫继续攻击她。最后，胖女人抓住两只猫的尾巴，将它们拖走。",
    "32. A Mouse in the House_scene068.mp4": "视频显示了经典的“Tom and Jerry”动画片尾画面，背景为红色，中央有“THE END”字样，随后逐渐显示出“An MGM Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样。",
    "32. A Mouse in the House_scene069.mp4": "视频开始时显示了MGM动画片《Tom and Jerry》的标题画面，背景为红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑，持续数秒。整个片段没有其他视觉内容或动作。"
}