{
    "18. The Mouse Comes to Dinner_scene001.mp4": "视频开始时显示黑色背景和一串数字“0110544170204083”。随后，画面逐渐变亮，出现“Metro-Goldwyn-Mayer Cartoon”标志，标志中央是一只咆哮的狮子，下方有“Color by Technicolor”字样。整个画面背景为深红色。",
    "18. The Mouse Comes to Dinner_scene002.mp4": "这是一个米高梅动画片的开场标志，背景为红色，中央有一个圆形框架，内有一只咆哮的狮子。下方有文字“A METRO-GOLDWYN-MAYER CARTOON”和“COLOR BY Technicolor”。狮子在标志中不断咆哮，表情生动。",
    "18. The Mouse Comes to Dinner_scene003.mp4": "视频开始显示了米高梅动画的标志，随后画面转黑，最后出现《猫和老鼠》的标题画面。",
    "18. The Mouse Comes to Dinner_scene004.mp4": "视频展示了经典动画《猫和老鼠》的开场画面，背景为红色渐变圆环，前景是灰色大猫汤姆和棕色小鼠杰瑞的卡通形象，下方有黄色的“TOM and JERRY”字样。随后画面逐渐淡入，出现“THE MOUSE COMES TO DINNER”和导演信息“Directed by William Hanna and Joseph Barbera”。",
    "18. The Mouse Comes to Dinner_scene005.mp4": "视频展示了动画片《Tom and Jerry》的片头，标题为“The Mouse Comes to Dinner”，由William Hanna和Joseph Barbera执导，动画师包括Irwen Spence、Kenneth Muse、Pete Burness和Ray Patterson，音乐由Scott Bradley创作，制片人为Fred Quimby。背景为蓝色，右侧有一个马提尼酒杯，下方有版权和制作信息。随后画面渐暗，转为黑色。",
    "18. The Mouse Comes to Dinner_scene006.mp4": "视频展示了一张布置精美的餐桌，上面摆放着烛台、餐具和装饰品。随后，一位穿着蓝色衣服和白色围裙的服务员出现，手里拿着一叠黄色盘子，将盘子逐一放在餐桌上，为用餐做准备。背景中可以看到一些花卉装饰和橱柜。",
    "18. The Mouse Comes to Dinner_scene007.mp4": "一个穿着蓝色裙子、红色裤袜和黄色拖鞋的人物从画面左侧走向右侧。在人物走动过程中，一只棕色的小老鼠从白色窗帘后探出头来，随后迅速爬出并向上跳跃，最终消失在窗帘上方。",
    "18. The Mouse Comes to Dinner_scene008.mp4": "一只小老鼠从墙后探出头，偷偷溜到餐桌旁，躲进一束葱里，然后用葱遮住自己，小心翼翼地观察着桌上的餐具。",
    "18. The Mouse Comes to Dinner_scene009.mp4": "一位穿着蓝色衣服和白色围裙的女性正在布置餐桌，她摆放盘子和餐具，然后离开房间。当她离开后，一只猫从门口的花盆里跳出来，迅速地爬到门框上，然后又跳到地上，最后消失在画面中。",
    "18. The Mouse Comes to Dinner_scene010.mp4": "汤姆猫出现在画面中，他兴奋地走向电话，拿起听筒，然后开始打电话，表情从兴奋转为严肃，最后又恢复兴奋。",
    "18. The Mouse Comes to Dinner_scene011.mp4": "一只老鼠正在享用一碗奶酪，它吃得非常开心，奶酪屑四处飞溅。这时，一只猫突然出现，拿着勺子，表情凶狠地盯着老鼠。老鼠察觉到危险，迅速从碗里爬出来，躺在桌子上，装作若无其事的样子，但猫依然保持着威胁的姿态。",
    "18. The Mouse Comes to Dinner_scene013.mp4": "在餐桌旁，猫汤姆用叉子戏弄老鼠杰瑞，杰瑞戴着厨师帽，头顶着一盘橄榄，汤姆则用叉子挑逗杰瑞，杰瑞试图保持平衡，场面充满喜剧效果。",
    "18. The Mouse Comes to Dinner_scene014.mp4": "在餐厅里，一只戴着蓝色蝴蝶结的黄色猫坐在桌旁，面前摆着餐具和一碗汤。她面前有一只小老鼠，头上顶着一个装满绿色水果的盘子。猫先是惊讶地看着老鼠，然后伸手拿起一个水果，表情显得很享受。老鼠则保持平衡，看起来很紧张。背景中，一只灰色的猫坐在另一侧，似乎在观察这一幕。",
    "18. The Mouse Comes to Dinner_scene015.mp4": "汤姆猫坐在餐桌前，面前有一碗汤和一杯红色饮料。他戴着红色领结，表情满足。杰瑞鼠戴着厨师帽，拿着一盘绿色食物，小心翼翼地靠近汤姆。汤姆用勺子舀起汤，杰瑞鼠在一旁观察。汤姆似乎在享受美食，而杰瑞鼠则试图干扰他。",
    "18. The Mouse Comes to Dinner_scene016.mp4": "一只戴着厨师帽的老鼠站在一个大勺子旁边，勺子里盛着红色的汤，汤正冒着热气。老鼠先是惊讶地看着汤，然后露出得意的笑容，接着开始跳舞，最后用鼻子嗅了嗅汤，然后转身离开。",
    "18. The Mouse Comes to Dinner_scene017.mp4": "汤姆猫坐在餐桌前，戴着红色领结，用勺子舀起汤品尝，脸上露出满足的笑容。他享受着美食，动作优雅，表情愉悦。",
    "18. The Mouse Comes to Dinner_scene018.mp4": "一只戴着厨师帽的老鼠站在桌前，看着一勺热汤。它先是闻了闻，然后用前爪抓起勺子，把汤倒进嘴里。接着，它跳进勺子里，开始在勺子里跳舞。",
    "18. The Mouse Comes to Dinner_scene019.mp4": "汤姆猫坐在椅子上，手里拿着一把勺子，勺子上有一只戴着厨师帽的老鼠杰瑞。杰瑞突然向汤姆的脸喷洒食物，汤姆被弄得很狼狈，食物溅满了他的脸和身体。汤姆愤怒地瞪着杰瑞，而杰瑞则得意地站在勺子上。",
    "18. The Mouse Comes to Dinner_scene020.mp4": "一只戴着厨师帽的老鼠坐在勺子上，被一只猫的手用勺子举着，靠近点燃的蜡烛。老鼠被蜡烛火焰灼烧，表情痛苦，火焰在它身上蔓延。",
    "18. The Mouse Comes to Dinner_scene021.mp4": "一只戴着厨师帽的老鼠站在燃烧的蜡烛上，被一只戴着白手套的手用勺子舀起红色的蜡油。老鼠在蜡油上挣扎尖叫，最终被火焰烧焦并从勺子上掉落，留下烟雾。",
    "18. The Mouse Comes to Dinner_scene022.mp4": "一只老鼠从空中跳到一块黄油上，黄油融化后，老鼠舒适地躺在上面享受。",
    "18. The Mouse Comes to Dinner_scene023.mp4": "在餐厅里，汤姆和杰瑞坐在餐桌旁。汤姆穿着红色领结，杰瑞戴着蓝色蝴蝶结。杰瑞端着一盘三明治，递给汤姆。汤姆伸手接过一片三明治，然后又把三明治放回盘子里。杰瑞也拿起一片三明治，两人对视。",
    "18. The Mouse Comes to Dinner_scene024.mp4": "一只小老鼠试图偷吃放在桌子上的三明治，但三明治上压着一只猫的尾巴。小老鼠用尽力气推三明治，结果猫的尾巴被夹在中间，小老鼠成功地把三明治推开了，然后迅速逃跑了。",
    "18. The Mouse Comes to Dinner_scene025.mp4": "汤姆猫坐在餐桌前，先是用番茄酱瓶挤番茄酱在三明治上，然后吃三明治时被番茄酱辣到，跳起来后又喝了一杯水，最后用湿毛巾擦脸。",
    "18. The Mouse Comes to Dinner_scene026.mp4": "一只老鼠拿着一个黄色的圆形物体，跳到猫的尾巴上，然后用勺子舀起奶油和樱桃，放在猫的尾巴上，最后老鼠跑开。",
    "18. The Mouse Comes to Dinner_scene027.mp4": "汤姆猫坐在餐桌前，手里拿着一个樱桃派，他吃了一口后，突然被派里的樱桃刺到了，他痛苦地跳了起来，然后又倒下。这时，杰瑞鼠从椅子后面跑出来，汤姆猫抓住了他，把他放在一瓶香槟上，然后用香槟瓶盖把杰瑞鼠压住，杰瑞鼠被压得动弹不得。汤姆猫得意地笑了，然后把杰瑞鼠从香槟瓶上拿下来，继续享受他的派。",
    "18. The Mouse Comes to Dinner_scene028.mp4": "一只老鼠掉进一个装满绿色液体的玻璃杯中，液体溅起，老鼠在杯中挣扎。",
    "18. The Mouse Comes to Dinner_scene030.mp4": "一只猫从绿色钱包中取出一个标有“WOLF PACIFIER”的红色驱狼器，并将其放置在椅子扶手上。",
    "18. The Mouse Comes to Dinner_scene031.mp4": "在餐厅里，汤姆和杰瑞正在用餐。汤姆突然从椅子上站起来，变成了一堆叠起来的猫，然后又慢慢变回原样，最后消失在画面中。杰瑞则坐在椅子上，手里拿着一个红色的瓶子，看起来很淡定。",
    "18. The Mouse Comes to Dinner_scene032.mp4": "一只小老鼠在桌子上跳舞，然后拿起一个黄瓜啃了一口。这时，一只戴着红领结的猫出现了，手里拿着一个热狗。猫把热狗递给小老鼠，小老鼠咬了一口，然后猫笑了。",
    "18. The Mouse Comes to Dinner_scene033.mp4": "一只小老鼠站在烛台旁边，突然打喷嚏，喷出红色液体。接着，一只猫的手从画面右侧伸出，抓住小老鼠的尾巴，用火柴点燃了它的尾巴，导致小老鼠被熏得直打喷嚏并逃跑。",
    "18. The Mouse Comes to Dinner_scene034.mp4": "一只小老鼠从银色物体后跳出，迅速跑向桌上的派，然后用前爪抓住派的边缘，试图将派拉起。",
    "18. The Mouse Comes to Dinner_scene035.mp4": "汤姆猫穿着西装打着领结，嘴里叼着雪茄，用火柴点燃雪茄。雪茄点燃后，汤姆猫被黄色的液体喷溅，头部和身体被覆盖，变成一只黄色的鸭子。随后，汤姆猫恢复原状，愤怒地扔掉雪茄。",
    "18. The Mouse Comes to Dinner_scene036.mp4": "汤姆猫坐在餐桌前，眼睛盯着桌上的派，表情贪婪。他伸手去拿派，但派突然飞起来，汤姆被吓了一跳，身体后仰，最终摔倒在地。",
    "18. The Mouse Comes to Dinner_scene038.mp4": "一只戴着蓝色蝴蝶结的黄色小猫坐在椅子上，突然被红色液体溅到全身，液体从头顶流下。小猫表情痛苦，随后它举起一个装饰着奶油的蛋糕，似乎在展示或准备享用。",
    "18. The Mouse Comes to Dinner_scene039.mp4": "汤姆猫坐在餐桌前，表情焦急。突然，杰瑞鼠从桌子底下钻出，用叉子攻击汤姆。汤姆被击中后，头上冒出红色的血迹，显得狼狈不堪。杰瑞鼠则得意地站在一旁，继续用叉子攻击汤姆。",
    "18. The Mouse Comes to Dinner_scene040.mp4": "一只小老鼠在铺着白色桌布的桌子上奔跑，桌上摆放着水果、烛台和酒杯等物品。",
    "18. The Mouse Comes to Dinner_scene041.mp4": "视频中，一只戴着银色餐盖的猫坐在餐桌旁，餐盖下露出猫的头部，它正张大嘴巴，露出尖牙，表情凶狠。一只小老鼠从餐盖下钻出，它看起来很紧张，但仍然勇敢地面对猫。猫试图用嘴咬住老鼠，但老鼠灵活地躲避，最终用勺子将猫的餐盖掀开，猫被惊得张大嘴巴，老鼠则得意地跑开。",
    "18. The Mouse Comes to Dinner_scene042.mp4": "一只小老鼠从桌子底下跑出来，跳过酒杯，然后跳到一只烤鸡上。这时，一只拿着两把刀的猫出现了，他试图用刀切开烤鸡，但小老鼠从猫的尾巴上爬下来，用舌头舔了舔猫的脸，然后得意地笑了。",
    "18. The Mouse Comes to Dinner_scene043.mp4": "汤姆猫手持刀具，正准备切割盘中的火鸡。此时，杰瑞鼠从汤姆猫身后出现，用爪子拉扯汤姆猫的尾巴，汤姆猫转头怒视杰瑞鼠，杰瑞鼠则表现出惊恐和害怕。汤姆猫挥舞刀具，似乎要对杰瑞鼠采取行动，但杰瑞鼠迅速逃离。",
    "18. The Mouse Comes to Dinner_scene044.mp4": "一只小老鼠站在猫的尾巴上，猫拿着刀，老鼠用尾巴缠住猫的刀，然后被甩出去，接着老鼠捡起刀，猫被刀刺中，倒在地上，最后猫捡起刀，坐在地上。",
    "18. The Mouse Comes to Dinner_scene045.mp4": "杰瑞从桌子底下爬出来，偷走一瓶酒，然后用它当作火箭推进器，飞向汤姆。汤姆被杰瑞的突然袭击吓了一跳，惊慌失措地跳了起来，试图躲避杰瑞的攻击。",
    "18. The Mouse Comes to Dinner_scene046.mp4": "汤姆猫偷偷靠近一个装满红色液体的大碗，他试图偷喝，但被突然喷出的液体溅到脸上，狼狈不堪。随后，他露出得意的笑容。",
    "18. The Mouse Comes to Dinner_scene047.mp4": "一只小老鼠在餐桌上偷吃松饼，它用爪子抓起一个松饼，然后迅速跑开。",
    "18. The Mouse Comes to Dinner_scene048.mp4": "汤姆猫坐在一个蓝色的盆边，先是张大嘴巴，然后吐出一些食物残渣，接着舔了舔舌头，最后又张大嘴巴。",
    "18. The Mouse Comes to Dinner_scene049.mp4": "一只小老鼠在餐桌上，它先是用爪子拨弄盐瓶，然后将盐撒在煎饼上，接着它拿起一个煎饼，咬了一口，最后它被煎饼砸中，摔倒在地。",
    "18. The Mouse Comes to Dinner_scene050.mp4": "汤姆猫趴在桌子上，面前放着一个装满红色液体的大碗和几个小杯子。它张大嘴巴，似乎在打哈欠或叫喊。随后，它身体向后仰，头朝下，尾巴翘起，最终躺在桌子上，表情显得疲惫或满足。",
    "18. The Mouse Comes to Dinner_scene051.mp4": "一只小老鼠从盖着的盘子后面跑出来，跳到烛台的烛台上，然后被猫发现。猫从盘子后面跳出来，愤怒地盯着小老鼠。",
    "18. The Mouse Comes to Dinner_scene052.mp4": "一只小老鼠从烛台的灯罩中探出头，然后爬上烛台，抓住一根点燃的红色蜡烛。它用力拉扯蜡烛，导致蜡烛倾斜并最终掉落，小老鼠也随之被甩出画面。",
    "18. The Mouse Comes to Dinner_scene053.mp4": "一只灰色的猫坐在桌前，桌上有一支燃烧的蜡烛和一个银色的烛台。猫用爪子拨弄蜡烛，然后拿起一根香烟点燃，开始吸烟。吸烟时，猫的尾巴不小心碰到了蜡烛，导致蜡烛火焰变大并冒出黑烟。猫被吓到，跳了起来，但最终被火焰和烟雾包围，场面混乱。",
    "18. The Mouse Comes to Dinner_scene054.mp4": "汤姆猫在厨房里追逐一个装有冰块和瓶子的冰桶，他滑行并试图抓住它，但最终摔倒在地。",
    "18. The Mouse Comes to Dinner_scene055.mp4": "一只老鼠从桌子底下跑出来，桌子底下有火焰。老鼠跑向猫，猫的尾巴被火焰点燃，冒出黑烟。老鼠跑开，猫的尾巴还在冒烟。",
    "18. The Mouse Comes to Dinner_scene056.mp4": "汤姆猫坐在一个燃烧的油灯旁，尾巴被火焰熏黑，他开心地大笑。随后，他注意到坐在餐桌对面的杰瑞猫，杰瑞猫戴着蓝色蝴蝶结，表情傲慢地看着汤姆。",
    "18. The Mouse Comes to Dinner_scene057.mp4": "一只灰色的猫，戴着红色蝴蝶结，眼睛从半闭到睁大，表情从放松到警觉再到愤怒，背景是模糊的棕色树影。",
    "18. The Mouse Comes to Dinner_scene058.mp4": "汤姆和杰瑞在餐桌旁对话，汤姆坐在椅子上，杰瑞坐在对面，杰瑞指责汤姆在煮东西，汤姆则显得惊讶和困惑。",
    "18. The Mouse Comes to Dinner_scene059.mp4": "一只灰色的猫坐在一个燃烧的油灯上，旁边有一个装满冰块的桶。猫看起来很热，它伸出手臂，似乎在试图降温。随后，猫从油灯上摔下来，身体融化成液体，最后消失在画面中，只留下油灯和冰桶。",
    "18. The Mouse Comes to Dinner_scene060.mp4": "天花板上出现一个洞，洞中伸出一个黑色的影子，影子像人形一样倒挂着，随后洞口周围碎屑飞溅，影子逐渐消失。",
    "18. The Mouse Comes to Dinner_scene061.mp4": "一只穿着蓝色领结的黄色猫和一只棕色老鼠在餐桌旁对峙，猫突然跳起追赶老鼠，老鼠逃跑时撞倒了桌子，导致桌上的物品散落。随后，一只黑猫从上方出现，用桌腿砸向装有紫色液体的碗，液体溅出。",
    "18. The Mouse Comes to Dinner_scene062.mp4": "动画片段中，汤姆猫从斜坡上滑下，被红色丝带绑住，表情痛苦。随后，杰瑞老鼠和一只黄色小猫出现在画面中，杰瑞显得兴奋，而黄色小猫则惊讶地看着汤姆。背景中有一个银色茶壶和一个红色瓶子。",
    "18. The Mouse Comes to Dinner_scene063.mp4": "一只小老鼠用刷子在猫的背上涂写“SS. DRIP”，然后得意地跳开。",
    "18. The Mouse Comes to Dinner_scene064.mp4": "一只黄色的小猫站在木制平台上，戴着蓝色蝴蝶结，旁边有一只灰色的猫被吊在斜坡上，身上写着“SS DRIP”。小猫看到一只棕色的小老鼠拿着一瓶酒，便伸手去拿。小猫把酒瓶倒过来，酒洒了出来，溅到了灰色的猫身上。小猫和老鼠一起看着洒出来的酒，小猫显得很开心，而老鼠则显得有些惊讶。",
    "18. The Mouse Comes to Dinner_scene065.mp4": "汤姆猫被绑在滑梯上，滑入一个装满紫色液体的大碗中，溅起水花后消失，最后画面黑屏并显示“The End”。",
    "18. The Mouse Comes to Dinner_scene066.mp4": "视频开始时显示红色背景上的白色文字“The End”，随后文字逐渐淡出并被“An MGM Tom and Jerry Cartoon”字样取代，下方标注“MADE IN HOLLYWOOD, U.S.A.”。整个画面保持静态，无其他动作或场景变化。",
    "18. The Mouse Comes to Dinner_scene067.mp4": "视频开始时显示了MGM的标志和“Tom and Jerry Cartoon”字样，背景为红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑，持续数秒。"
}