{
    "01. Puss Gets the Boot_scene001.mp4": "视频开始时显示一个黑色背景，右下角有数字“0110544170204083”。随后，画面逐渐淡入，出现米高梅（Metro-Goldwyn-Mayer）的经典狮子标志，标志上方有“ARS GRATIA ARTIS”字样，两侧有“TRADE MARK”字样，标志下方是“Metro-Goldwyn-Mayer”的名称。整个画面保持静态，没有其他动作或变化。",
    "01. Puss Gets the Boot_scene002.mp4": "画面展示的是米高梅电影公司的经典标志，一只狮子在圆形框架内咆哮，周围环绕着“ARS GRATIA ARTIS”字样和“TRADE MARK”字样，下方是“Metro Goldwyn Mayer”的名称。狮子的咆哮动作持续进行，表现出力量和威严。背景为黑色，突显标志的视觉效果。",
    "01. Puss Gets the Boot_scene003.mp4": "视频展示了米高梅电影公司的经典片头，包括其标志性的狮子标志和“Metro-Goldwyn-Mayer Presents An MGM Cartoon”的文字，背景为深蓝色，文字为金色，整体风格复古而庄重。",
    "01. Puss Gets the Boot_scene004.mp4": "视频开始显示的是一个动画片的标题画面，标题是“A Rudolf Ising Production”，随后标题变为“Puss Gets the Boot”，并伴有猫的剪影。接着画面转为一只棕色的老鼠在奔跑，它表情紧张，似乎在逃避什么，背景是简单的天空和地面。老鼠在奔跑过程中，表情从紧张逐渐变为惊恐，最后画面中出现了一只猫的阴影，似乎正在追赶老鼠。",
    "01. Puss Gets the Boot_scene005.mp4": "一只灰猫趴在地板上，眼睛盯着前方的小老鼠。小老鼠在猫面前来回跑动，猫则慢慢靠近，最终用爪子抓住了小老鼠。",
    "01. Puss Gets the Boot_scene006.mp4": "一只小老鼠在猫的尾巴后面奔跑，猫突然张开大嘴，小老鼠被吓到并从猫的嘴边跑开。",
    "01. Puss Gets the Boot_scene007.mp4": "一只小老鼠被猫用尾巴卷起，猫得意地看着小老鼠，小老鼠被卷到空中后又掉下来。",
    "01. Puss Gets the Boot_scene008.mp4": "一只小老鼠在墙上奔跑，被一只猫的尾巴扫到，然后被猫抓住，猫张开嘴准备吃掉它，但老鼠逃脱了。",
    "01. Puss Gets the Boot_scene009.mp4": "一只小老鼠在房间里奔跑，一只大猫在后面追赶。老鼠跑到门口的“欢迎”垫子上，猫扑过去试图抓住它，但老鼠逃脱了。猫被激怒，开始在地板上追逐老鼠，最终老鼠跑出了画面。",
    "01. Puss Gets the Boot_scene010.mp4": "一只棕色的小老鼠在红色的地面上奔跑，它表情紧张，眼睛睁大，似乎在逃避什么。背景是简单的白色墙壁。",
    "01. Puss Gets the Boot_scene011.mp4": "一只灰色的猫从墙角探出头来，露出兴奋的表情，随后又迅速缩回墙角。",
    "01. Puss Gets the Boot_scene012.mp4": "一只灰白相间的猫兴奋地伸出爪子，蘸取桌上的墨水瓶中的墨水，墨水溅出。",
    "01. Puss Gets the Boot_scene013.mp4": "一只灰色的猫从墙角探出头，用爪子在墙角挖了一个洞，然后在洞口竖起一个写着“HOME SWEET HOME”的牌子，最后满意地退后离开。",
    "01. Puss Gets the Boot_scene014.mp4": "一只小老鼠在房间里奔跑，经过一个写着“HOME SWEET HOME”的牌子，它在牌子前停下，然后又继续跑动，身后留下一串闪光的轨迹，最后它跑进牌子下的洞里。",
    "01. Puss Gets the Boot_scene015.mp4": "一只灰白相间的猫坐在房间的角落里，它先是抬头微笑，接着张大嘴巴露出牙齿，似乎在开心地笑或叫喊。然后它用前爪抱住自己的身体，身体微微前倾，最后它向后倒下，身体蜷缩成一团。背景中有一张木桌，桌上放着一些物品。",
    "01. Puss Gets the Boot_scene016.mp4": "一只棕色的老鼠从一个标有“HOME”的门洞中探出头来，周围漂浮着彩色的泡泡，老鼠的表情显得有些惊讶和好奇。",
    "01. Puss Gets the Boot_scene017.mp4": "一只灰色的猫在室内地毯上，靠近一个写着“HOME SWEET HOME”的牌子。猫的表情从疲惫、不悦逐渐转变为兴奋和喜悦，它张开嘴，露出牙齿，似乎在开心地叫喊或大笑。猫的身体部分从墙后探出，显示出它正在从藏身之处出来。背景中有一个玻璃鱼缸，环境看起来是家庭室内。",
    "01. Puss Gets the Boot_scene018.mp4": "一只灰白相间的猫用爪子抓鱼缸，试图把里面的金鱼弄出来，结果水溅了出来，猫被水淋湿了。",
    "01. Puss Gets the Boot_scene019.mp4": "一只小老鼠从洞口爬出，被一只大猫用爪子泼水，小老鼠惊慌失措，大猫露出得意的笑容，小老鼠则试图逃跑，但被大猫抓住。",
    "01. Puss Gets the Boot_scene020.mp4": "一只小老鼠在猫的脸上爬行，猫闭上一只眼睛，老鼠爬到猫的鼻子上，猫张开嘴，老鼠被弹飞，猫摔倒在地。",
    "01. Puss Gets the Boot_scene021.mp4": "一只小老鼠在房间里奔跑，一只大灰猫紧追不舍。小老鼠灵活地躲避着猫的追捕，猫则不断扑空，显得非常愤怒和沮丧。最终，猫扑向小老鼠，但小老鼠巧妙地逃脱了。",
    "01. Puss Gets the Boot_scene022.mp4": "一只灰色的猫追逐一只棕色的小老鼠，猫扑向老鼠时撞倒了墙角的花盆，导致花盆和柱子破碎，泥土和碎片四溅，猫被埋在废墟中，头上顶着植物，惊慌失措地喊着“贾斯伯！贾斯伯！”",
    "01. Puss Gets the Boot_scene023.mp4": "一个穿着黄色裙子、白色围裙、红色袜子和蓝色拖鞋的卡通人物，手持扫帚在地板上清扫。画面中出现字幕“你这坏猫咪”。",
    "01. Puss Gets the Boot_scene024.mp4": "一只灰色的猫在房间里，被一堆破碎的陶器和泥土困住，它挣扎着爬出来，随后被一把扫帚击中，倒在地上。",
    "01. Puss Gets the Boot_scene025.mp4": "一只灰猫被主人拎起来，主人指责它破坏了家具，猫显得很委屈。主人警告猫，如果再破坏东西就会被赶出去。镜头切换到柜子上，一只老鼠在烛台上偷看。",
    "01. Puss Gets the Boot_scene026.mp4": "一只棕色的老鼠站在一个木制烛台的顶部，它先是探出头，然后张大嘴巴，似乎在大声说话或喊叫，接着它举起一只前爪，做出强调的手势，最后它又恢复到原来的姿势，继续说话。背景是灰色的墙壁，画面下方有中文字幕。",
    "01. Puss Gets the Boot_scene027.mp4": "一只灰猫在房间里因打碎了柱子而被女主人责骂，它吓得躲起来，然后悄悄地从窗帘后爬出来，小心翼翼地从房间的一角溜走。",
    "01. Puss Gets the Boot_scene028.mp4": "一只灰猫从门后跑出来，撞到一张桌子，然后坐在地上，看起来很痛苦，接着它开始大叫并挥舞着爪子。",
    "01. Puss Gets the Boot_scene029.mp4": "一个蓝色的花瓶从桌子上掉落，砸在一只灰色的猫身上，猫被砸得晕头转向，但很快恢复过来，露出得意的笑容，然后开始生气地盯着花瓶。",
    "01. Puss Gets the Boot_scene030.mp4": "一只棕色的小老鼠坐在一个木制的烛台顶部，它先是开心地大笑，然后用手拍打烛台，接着它从烛台边缘探出头，表情变得惊讶，最后它又坐回烛台顶部，表情变得有些担忧。",
    "01. Puss Gets the Boot_scene031.mp4": "一只灰色的猫躺在地上，表情愤怒，张开嘴巴露出牙齿，似乎在咆哮或叫喊。它的眼睛是黄色的，显得非常凶狠。猫的身体部分被画面截断，但可以看出它正在用力扭动身体，可能是在挣扎或攻击。背景是简单的室内环境，有一面墙和一个电源插座。",
    "01. Puss Gets the Boot_scene032.mp4": "一只棕色的小老鼠站在一个高高的木制烛台顶端，它先是四处张望，然后小心翼翼地沿着烛台向下爬，最终安全地到达了烛台底部，然后它迅速地跑开了。",
    "01. Puss Gets the Boot_scene033.mp4": "一只灰色的猫从椅子后面探出头，露出愤怒的表情，然后慢慢爬过桌子，继续表现出愤怒和不满。",
    "01. Puss Gets the Boot_scene034.mp4": "一只棕色的小老鼠在木制家具上奔跑，表情紧张，似乎在躲避什么。",
    "01. Puss Gets the Boot_scene035.mp4": "一只灰色的猫在桌子上爬行，表情凶狠，随后它坐在桌边，看着桌上的酒瓶和酒杯。镜头转向桌子边缘，一只棕色的小老鼠正紧紧抓住一个高脚杯，试图把它拉下来。",
    "01. Puss Gets the Boot_scene036.mp4": "一只灰白相间的猫坐在沙发上，它先是用爪子挠自己的脸，然后张开嘴，露出牙齿，似乎在打哈欠或叫喊，接着又用爪子捂住脸，最后放下爪子，继续张嘴叫喊。",
    "01. Puss Gets the Boot_scene037.mp4": "一个穿着黄色围裙、红色袜子和蓝色拖鞋的卡通人物，左手拿着一个装满碎肉的蓝色托盘，右手拿着一把扫帚，正在室内行走。画面中出现字幕：“只要这个猫咪再打烂东西一次，它就会被赶出去。”",
    "01. Puss Gets the Boot_scene038.mp4": "一只灰白相间的猫坐在一张木制家具上，它先是张大嘴巴，似乎在说话或叫喊，然后表情变得悲伤，低头垂眼，接着又露出狡黠的笑容，最后躺下，闭上眼睛，似乎在休息或假装睡觉。",
    "01. Puss Gets the Boot_scene039.mp4": "一只小老鼠站在桌子上，手里拿着一个高脚杯。它先是用力拉扯杯子，然后开心地摇晃杯子，最后把杯子放回桌上，兴奋地跳舞庆祝。",
    "01. Puss Gets the Boot_scene040.mp4": "一只灰白相间的猫躺在沙发上，突然张大嘴巴露出牙齿，身体前倾，然后迅速向前扑去，尾巴高高翘起，表情凶猛。",
    "01. Puss Gets the Boot_scene041.mp4": "一只小老鼠站在一个高脚杯旁边，它用爪子抓起杯子，试图用它来逃脱一只大猫的追捕。大猫从后面出现，张大嘴巴，露出尖牙，似乎要抓住小老鼠。小老鼠则用高脚杯作为武器，不断旋转和晃动，试图躲避大猫的攻击。大猫被小老鼠的机智和灵活所困扰，最终只能无奈地看着小老鼠成功逃脱。",
    "01. Puss Gets the Boot_scene042.mp4": "一只灰色的猫趴在桌子上，眼睛半睁，看起来醉醺醺的。它先是侧身躺着，然后慢慢向右移动，最终完全躺平，头枕在前爪上，嘴巴微张，似乎在打盹或醉倒。背景中有一个装满液体的瓶子和几个空酒杯。",
    "01. Puss Gets the Boot_scene043.mp4": "一只棕色的小老鼠站在一个木制家具上，手里拿着一个银色的喇叭。它先是用喇叭吹奏，然后把喇叭举起来，似乎在庆祝或炫耀。接着，它把喇叭扔到一边，开心地跳舞和欢呼，表现出极大的喜悦和兴奋。整个场景充满了欢乐和活力。",
    "01. Puss Gets the Boot_scene044.mp4": "一只灰白相间的猫趴在木制家具上，先是侧身蜷缩，随后慢慢伸展身体，抬起头，眼睛睁大，嘴巴微张，显得警觉或惊讶。",
    "01. Puss Gets the Boot_scene045.mp4": "一只棕色的小老鼠站在一个深色木制家具的边缘，它先是抬起前爪，然后伸出右爪指向画面右侧，表情显得兴奋和得意。背景是灰绿色的墙壁，光线从左侧照射，在墙上投下阴影。",
    "01. Puss Gets the Boot_scene046.mp4": "一只灰白相间的猫躺在沙发上，表情从放松逐渐变为惊恐，最终从沙发边缘摔落，画面聚焦于猫的惊慌表情和摔落瞬间。",
    "01. Puss Gets the Boot_scene047.mp4": "一只灰色的猫从柜子后面爬出来，手里拿着一个玻璃杯，躺在地上，看起来很开心。",
    "01. Puss Gets the Boot_scene048.mp4": "一只棕色的小老鼠在桌子上跳舞，它拿起一个高脚杯，旋转着杯子，然后把杯子扔了出去，接着它继续跳舞。",
    "01. Puss Gets the Boot_scene049.mp4": "一只灰色的猫躺在地上，手里拿着一个酒杯。它喝了一口酒后，开始剧烈地摇晃身体，仿佛醉得不轻。它翻滚、扭动，最后倒在地上，酒杯也掉落在一旁。",
    "01. Puss Gets the Boot_scene050.mp4": "一只灰色的猫在房间里，先是滑行着，然后拿起一个盘子，接着盘子上陆续出现酒杯和酒瓶。最后，猫头上突然出现了一顶装饰着花朵的帽子，它继续端着盘子行走。",
    "01. Puss Gets the Boot_scene051.mp4": "一只棕色的小老鼠站在一个木制家具上，手里拿着两个高脚杯，像乐器一样吹奏。它身体前倾，眼睛紧闭，嘴巴张开，似乎在用力吹奏。高脚杯随着它的动作晃动，杯身呈现出动态的波纹效果。背景是简单的室内环境，有雕刻花纹的木制家具。",
    "01. Puss Gets the Boot_scene052.mp4": "一只戴着花环和帽子的猫坐在地上，面前有一个托盘，上面放着酒瓶和酒杯。猫摘下帽子，露出里面的花环，然后开始甩头，花环散落一地。接着，猫用爪子挠头，看起来很不舒服，最后它张开嘴，似乎在大叫或打喷嚏。",
    "01. Puss Gets the Boot_scene053.mp4": "一只灰色的猫从沙发底下爬出来，它用爪子抓起沙发上的枕头和毯子，然后把它们抱在怀里，看起来非常开心。",
    "01. Puss Gets the Boot_scene054.mp4": "一只棕色的小老鼠在红色的家具上用两个高脚杯当作喇叭吹奏，它一边跑动一边吹奏，随后一只灰白相间的猫从家具后方探出头来，看着小老鼠，小老鼠继续吹奏并靠近猫，猫眯起眼睛，小老鼠则停止吹奏，趴在地上，紧紧抱住其中一个高脚杯，表情显得有些紧张和害怕。",
    "01. Puss Gets the Boot_scene055.mp4": "一只灰白相间的猫趴在桌子上，眼睛黄色，表情狡黠，微微眯眼，嘴角上扬，似乎在偷看或等待什么。",
    "01. Puss Gets the Boot_scene057.mp4": "视频片段展示了一只猫和一只老鼠在家具上的互动。猫从上方探出头，露出微笑的表情，而老鼠则在下方的家具边缘，显得有些紧张。随后，镜头切换到一张床上，床上摆放着各种颜色的枕头和一个高脚杯，杯中似乎装有液体。整个场景充满了卡通风格的温馨和幽默感。",
    "01. Puss Gets the Boot_scene058.mp4": "一只灰白相间的猫躺在沙发上，眼睛半闭，看起来很困倦。一只棕色的小老鼠从沙发后面探出头来，小心翼翼地靠近猫。猫慢慢睁开眼睛，露出黄色的瞳孔，盯着老鼠。老鼠显得非常紧张，四处张望，然后开始在沙发上奔跑，尾巴拖在身后。猫继续躺着，似乎对老鼠的举动无动于衷。老鼠在沙发上来回奔跑，显得非常害怕。猫则保持不动，继续睡觉。",
    "01. Puss Gets the Boot_scene059.mp4": "一只灰色的猫趴在桌子上，眼睛盯着前方的小老鼠。小老鼠在桌子上奔跑，猫伸出爪子试图抓住它，但小老鼠跑得很快，猫只能看着它跑远。",
    "01. Puss Gets the Boot_scene060.mp4": "一只小老鼠在床下奔跑，被一只猫用尾巴卷住，猫试图抓住它，但小老鼠逃脱了，猫则显得非常愤怒和沮丧。",
    "01. Puss Gets the Boot_scene061.mp4": "一只棕色的小老鼠在墙上的装饰性架子上跳跃和攀爬，它先是跳到一个盘子上，然后又从盘子上跳下来，继续在架子上移动。架子上还有其他盘子和一个装饰性的罐子。",
    "01. Puss Gets the Boot_scene062.mp4": "一只灰色的小猫躺在地上，张大嘴巴，看起来非常开心。突然，一个白色的盘子从上方飞下来，砸在它的头上。小猫被吓了一跳，但很快又开始玩弄盘子，用爪子抓着它，把它举起来，然后又放下，反复几次。小猫的表情从惊讶变成了兴奋，它似乎很享受这个过程。整个场景充满了欢乐和活力。",
    "01. Puss Gets the Boot_scene063.mp4": "一只小老鼠在壁炉架上，它先是站在两个盘子之间，然后用爪子推倒了左边的盘子，接着又推倒了右边的盘子，最后它沿着壁炉架跑开了。",
    "01. Puss Gets the Boot_scene064.mp4": "一只棕色的小老鼠在红色地毯上奔跑，它跳过一个装饰有蓝色花纹的白色盘子，继续向前跑。",
    "01. Puss Gets the Boot_scene065.mp4": "一只灰色的猫在房间里奔跑，手里拿着一叠彩色的盘子。它从一个木制家具上跳到一个蓝色的沙发上，盘子在它头顶上晃动。猫的表情紧张，似乎在努力保持平衡，盘子在它头顶上摇晃，最终有一只盘子掉落。",
    "01. Puss Gets the Boot_scene066.mp4": "动画片段展示了一个角落，墙上挂着几个盘子。盘子突然开始旋转并飞离墙面，一个绿色的碗和一个白色的盘子在空中翻转，其他盘子也相继脱落并旋转飞出画面。整个过程充满动感和幽默感。",
    "01. Puss Gets the Boot_scene067.mp4": "一只灰色的小狗在房间角落里，用嘴叼着一叠彩色的盘子，盘子在空中旋转并不断掉落，小狗努力保持平衡，但最终被盘子砸中，显得狼狈不堪。",
    "01. Puss Gets the Boot_scene068.mp4": "一个房间的架子上摆放着各种盘子和一个红色壶，突然所有物品开始飞起来，盘子和壶在空中旋转、翻滚，最终掉落在地上。",
    "01. Puss Gets the Boot_scene069.mp4": "一只灰色的猫正艰难地拖着一叠高高的彩色盘子，它满头大汗，表情痛苦，身体不断摇晃，最终在墙角处几乎摔倒，但仍然努力保持平衡，继续拖着盘子向前走。",
    "01. Puss Gets the Boot_scene071.mp4": "一只灰色的猫正用爪子端着一叠彩色的盘子和杯子，表情痛苦地张大嘴巴，似乎在大声喊叫或呻吟，随后闭上眼睛，露出痛苦的表情。",
    "01. Puss Gets the Boot_scene072.mp4": "一只棕色的小老鼠站在一堆叠放的盘子和杯子上，它先是挥手呼喊“贾斯伯！贾斯伯！”，然后兴奋地跳跃，接着沿着盘子和杯子滑下，一路保持开心的笑容。",
    "01. Puss Gets the Boot_scene073.mp4": "一个穿着黄色裙子、红色上衣和蓝色裤子的角色正在楼梯上奔跑，背景中有木质扶手。画面下方有中文字幕：“你这混蛋，你现在被赶出去了！”",
    "01. Puss Gets the Boot_scene074.mp4": "一只棕色的小老鼠在一堆叠放的彩色盘子上奔跑，它从顶部向下跳跃，最终从盘子堆的底部跳下。",
    "01. Puss Gets the Boot_scene075.mp4": "一只灰色的猫正用爪子托着一叠彩色的盘子和杯子，嘴巴张开，似乎在叫喊或试图咬住什么。一只棕色的小老鼠从上方跳下来，落在猫的头上，然后在猫的头上跑来跑去，最后从猫的头上跳开，飞向空中。猫的表情从惊讶到痛苦，显示出它被小老鼠的举动所困扰。",
    "01. Puss Gets the Boot_scene076.mp4": "一只小老鼠沿着大猫的尾巴向上爬，然后从尾巴尖端滑落，翻滚着飞向空中，最终落在一个家具上。",
    "01. Puss Gets the Boot_scene077.mp4": "一只小老鼠从上方跳入装满牛奶的碗中，溅起大量牛奶，然后在牛奶中游泳玩耍，牛奶不断从碗边溢出。",
    "01. Puss Gets the Boot_scene078.mp4": "一只猫被牛奶溅到，愤怒地抓着一叠碗，随后镜头转向一只站在碗上的老鼠，老鼠得意地拉扯猫的尾巴，猫被激怒后转身准备攻击。",
    "01. Puss Gets the Boot_scene079.mp4": "一个穿着黄色裙子、白色围裙、红色袜子和蓝色鞋子的角色，手持扫帚，正在扫地。角色的腿部和扫帚在画面中反复出现，显示出其清扫的动作。背景是浅色墙壁和深色地板。",
    "01. Puss Gets the Boot_scene080.mp4": "一只小老鼠站在一个碗上，看到猫的尾巴后，它开始拉猫的尾巴，猫被激怒了，它转身扑向小老鼠，同时把碗叠在一起。",
    "01. Puss Gets the Boot_scene081.mp4": "一堆彩色的盘子和杯子在地板上旋转并散落开来，最终破碎成碎片。"
}