{
    "S1950E39 - Mice Follies_scene001.mp4": "视频展示了米高梅动画公司的经典片头，背景为深红色，中央是一个蓝色圆形标志，内有一只咆哮的狮子，下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”。整个画面逐渐从黑暗中亮起，呈现出复古动画的风格。",
    "S1950E39 - Mice Follies_scene002.mp4": "这是一个米高梅动画片的片头，背景为深红色，中央是一个蓝色边框的圆形图案，里面有一只咆哮的狮子。下方写着“A Metro-Goldwyn-Mayer CARTOON”，并注明“COLOR BY TECHNICOLOR”。狮子在图案内不断张嘴咆哮，表情生动。",
    "S1950E39 - Mice Follies_scene003.mp4": "视频展示了米高梅动画公司的标志，随后画面转为黑色，最后出现“Tom and Jerry”的标题，同时显示了汤姆猫和杰瑞鼠的卡通形象。",
    "S1950E39 - Mice Follies_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深绿色，黄色字体写着“TOM and JERRY”，上方是猫汤姆的头部，下方是老鼠杰瑞的头部。随后画面渐变为“MICE FOLLIES”字样，并标注导演为威廉·汉纳和约瑟夫·巴伯拉。",
    "S1950E39 - Mice Follies_scene005.mp4": "这是一个动画片的片头画面，显示了“MICE FOLLIES”字样，由William Hanna和Joseph Barbera执导。背景是夜晚的城市景观，有建筑物和一个剧院招牌。画面中还出现了其他制作人员的姓名，如Kenneth Muse、Ed Barge、Irven Spence、Ray Patterson和Robert Gentle，以及音乐和音效制作人员。整个画面风格复古，具有经典动画片的特色。",
    "S1950E39 - Mice Follies_scene006.mp4": "视频开始显示了动画片《Ice Follies》的制作人员名单，包括动画师、背景设计师和音乐制作人，以及制作公司和版权信息。随后画面切换到一个被水淹没的钢琴，水从钢琴上方不断滴落，形成水花，钢琴周围环境昏暗，背景有窗帘和家具。整个场景营造出一种潮湿、沉闷的氛围。",
    "S1950E39 - Mice Follies_scene007.mp4": "一只棕色的小老鼠站在一个双水龙头的水槽上，它用前爪紧紧握住右侧的水龙头把手，用力地拧动它。随着它的动作，右侧的水龙头水流逐渐变大，水花四溅，水槽中的水面也不断升高并泛起涟漪。背景是绿色瓷砖墙面和一些模糊的棕色橱柜。",
    "S1950E39 - Mice Follies_scene008.mp4": "一只灰色的小老鼠站在一个水龙头上，它用爪子转动水龙头，水开始流出。小老鼠面带微笑，享受着水流。",
    "S1950E39 - Mice Follies_scene009.mp4": "两只老鼠在水槽的水龙头上玩耍，它们同时转动水龙头，水开始流出。随后，它们跳下水槽，水溢出并漫过水槽边缘，流到台面上。",
    "S1950E39 - Mice Follies_scene010.mp4": "一个被水淹没的厨房，水从水龙头流出，水面泛起涟漪，镜头逐渐向前推进。",
    "S1950E39 - Mice Follies_scene011.mp4": "一只小老鼠从冰箱底部的抽屉里探出头来，它用爪子抓住红色的电线，电线被拉长并垂到地面。小老鼠在抽屉边缘来回移动，然后抬头看向冰箱上部打开的冷冻室，里面放着一些食物。",
    "S1950E39 - Mice Follies_scene012.mp4": "一只小老鼠从冰箱左侧爬入，沿着冰箱内部架子向右移动，最终停在冰箱控制面板前，用爪子转动温度旋钮，旋钮从“COLD”位置转到“FREEZE”位置。",
    "S1950E39 - Mice Follies_scene013.mp4": "一只小老鼠站在洗碗机前，洗碗机开始喷水，水流从喷嘴中喷出，逐渐在地面上形成水池。",
    "S1950E39 - Mice Follies_scene014.mp4": "水龙头滴水，水逐渐溢出水槽，形成瀑布状水流。",
    "S1950E39 - Mice Follies_scene015.mp4": "一个绿色的遮阳篷上开始滴落水珠，随后水珠逐渐汇聚成水流，最终形成一道蓝色的瀑布从遮阳篷边缘倾泻而下。",
    "S1950E39 - Mice Follies_scene016.mp4": "视频展示了一个被水淹没的厨房场景。画面开始时，一个水龙头正在滴水，水从龙头流下，形成水流。随着镜头向左移动，可以看到冰箱门打开，内部的物品清晰可见。厨房中的其他物品，如橱柜和台面，也被水淹没，水从这些物体上滴落。整个场景给人一种水灾后的印象，水位较高，淹没了大部分地面和家具。",
    "S1950E39 - Mice Follies_scene017.mp4": "一只棕色的小老鼠从窗户爬出，沿着结冰的边缘滑下，最终落入下方的水池中。",
    "S1950E39 - Mice Follies_scene018.mp4": "一只小老鼠在冰面上滑行，它先是开心地滑行，然后突然摔倒，溅起水花，最后站起来，面带微笑。背景是冰冻的墙壁和冰面，环境显得寒冷。",
    "S1950E39 - Mice Follies_scene019.mp4": "一只棕色的小老鼠站在聚光灯下，背景是黑暗的洞穴环境，墙壁上有水滴痕迹。小老鼠面带微笑，身体微微前倾，似乎在表演或准备做某事。",
    "S1950E39 - Mice Follies_scene020.mp4": "一只小老鼠在架子上小心翼翼地沿着一盘彩色果冻移动，一束手电筒光照射在果冻上，随着老鼠的移动，光束也随之扫过果冻。",
    "S1950E39 - Mice Follies_scene021.mp4": "在黑暗的洞穴中，一束聚光灯照亮了一只棕色的小老鼠。小老鼠站在光圈中央，表情自信，双臂张开，似乎在表演或展示自己。背景是洞穴的岩壁，光线营造出戏剧性的氛围。",
    "S1950E39 - Mice Follies_scene022.mp4": "在黑暗的舞台上，一束聚光灯照亮了一只棕色的小老鼠。它在灯光下欢快地跳舞，动作轻盈而充满活力，时而旋转，时而跳跃，展现出无拘无束的快乐。背景是深色的，有模糊的垂挂物，突显了小老鼠的活泼形象。灯光颜色从红色逐渐变为黄色，营造出温暖而梦幻的氛围。",
    "S1950E39 - Mice Follies_scene023.mp4": "在黑暗的洞穴中，一束聚光灯照亮了地面，一只棕色的小老鼠站在光圈中央。随后，一只灰色的小老鼠从右侧跑入画面，摔倒在地，然后慢慢爬起，与棕色老鼠面对面站立。棕色老鼠伸出前爪，似乎在与灰色老鼠互动，接着两只老鼠开始一起跳舞，棕色老鼠抱着灰色老鼠转圈，然后继续在光圈中旋转和舞动。整个场景充满了欢乐和动感。",
    "S1950E39 - Mice Follies_scene024.mp4": "汤姆猫在沙发上睡觉，被一个飞来的枕头砸醒，他坐起来，眼睛瞪得很大，显得很惊讶。",
    "S1950E39 - Mice Follies_scene025.mp4": "在昏暗的房间里，汤姆猫从左侧走进画面，他站在一扇门前，先是张开双臂，随后抬起右爪准备敲门。",
    "S1950E39 - Mice Follies_scene026.mp4": "门缓缓打开，一只蓝灰色的猫从门后探出头来，眼神警惕地观察四周。门内是一间昏暗的房间，有一把椅子，门外的地面和门框上挂着蓝色的冰凌。",
    "S1950E39 - Mice Follies_scene027.mp4": "两只老鼠在室内追逐奔跑，棕色老鼠被灰色老鼠用尾巴拖拽着跑动，途中经过桌子和椅子，最后棕色老鼠被绊住，灰色老鼠继续向前跑。",
    "S1950E39 - Mice Follies_scene028.mp4": "一只穿着尿布的小老鼠在地板上快速奔跑，随后滑倒并摔倒在地。",
    "S1950E39 - Mice Follies_scene029.mp4": "汤姆猫躲在门后，杰瑞鼠从门后跑过，用尾巴抽了汤姆猫一下，汤姆猫被抽得倒在地上。",
    "S1950E39 - Mice Follies_scene030.mp4": "一只小老鼠在地毯上拖着一根线，线的另一端突然爆炸，老鼠被炸飞后落地，随后坐在地上，表情惊恐。",
    "S1950E39 - Mice Follies_scene031.mp4": "一只猫从门后探出头，注视着一只老鼠。老鼠拿着几根细长的物体，先是靠近猫，然后用物体戳猫的鼻子，猫的表情从愤怒变为惊讶，最后老鼠跑开，猫目送它离开。",
    "S1950E39 - Mice Follies_scene033.mp4": "一只小老鼠拿着一把大剪刀，在巨大的猫爪前灵活地穿梭，用剪刀剪断猫爪上的毛发，猫爪被剪得四处飞散，老鼠在剪刀的带动下快速移动，场面充满动感和幽默。",
    "S1950E39 - Mice Follies_scene034.mp4": "一只蓝色的猫在昏暗的房间里，先是弯腰，然后摔倒在地，四肢伸展，最后蜷缩身体，似乎在睡觉或休息。",
    "S1950E39 - Mice Follies_scene035.mp4": "在昏暗的房间里，两只小老鼠——杰瑞和一只灰色的小老鼠——站在一只大猫的尾巴上。它们开始拉扯猫的尾巴，试图将它拖动。随着它们的拉扯，猫的身体被拖动，最终猫被拖到房间的另一边。当猫被拖到尽头时，它突然醒来，愤怒地瞪着两只小老鼠。",
    "S1950E39 - Mice Follies_scene036.mp4": "一只蓝灰色的猫躺在地上，周围有冰柱。它被桌腿绊倒，摔倒在地，然后滑向楼梯口，最终消失在画面中。",
    "S1950E39 - Mice Follies_scene037.mp4": "动画片段中，汤姆猫躺在地上，随后被各种体育用品砸中，包括滑雪板、网球拍和网球。他挣扎着站起来，发现自己的衣物被弄乱，最终拿起一双溜冰鞋，露出得意的笑容。",
    "S1950E39 - Mice Follies_scene038.mp4": "两只老鼠在室内地板上奔跑，后面跟着一只穿着冰鞋的猫。猫抓住其中一只老鼠的尾巴，试图追捕它们。老鼠们不断躲避，猫则紧追不舍。",
    "S1950E39 - Mice Follies_scene039.mp4": "一只穿着冰鞋的猫正在冰面上滑行，用绳子牵着两只老鼠。猫的表情专注而兴奋，似乎在享受追逐的乐趣。两只老鼠则在猫的牵引下向前滑行，其中一只老鼠显得有些惊慌，另一只则较为镇定。背景是一个昏暗的室内冰场，四周是深色的墙壁和门。",
    "S1950E39 - Mice Follies_scene040.mp4": "在厨房里，一只棕色的老鼠正拉着一只灰色的小老鼠向前跑，背景是橱柜和餐桌。",
    "S1950E39 - Mice Follies_scene041.mp4": "汤姆穿着溜冰鞋在冰面上滑行，他身体前倾，双手握拳，表情专注。随着滑行，他逐渐调整姿势，最终以一种滑水的姿态继续前进，身后溅起水花。背景是室内冰场，有橱柜和窗户。",
    "S1950E39 - Mice Follies_scene042.mp4": "视频开始时，两个小象玩偶在水花中滑行，随后水花消失，它们站在光滑的地面上。这时，汤姆穿着冰鞋滑入画面，做出滑冰动作，然后用冰鞋勾住两个玩偶，将它们举起来。最后，两只老鼠出现，它们看起来很惊讶。",
    "S1950E39 - Mice Follies_scene044.mp4": "在冰冻的房间里，两只老鼠杰瑞和泰菲躲在角落，杰瑞被泰菲推着向前跑。突然，猫汤姆穿着冰鞋从后面追来，他紧追不舍，杰瑞则拼命逃跑。",
    "S1950E39 - Mice Follies_scene045.mp4": "一只小老鼠从门后跑过，随后一只穿着冰鞋的猫从门后滑出，摔倒在冰面上，然后挣扎着站起来继续滑行。",
    "S1950E39 - Mice Follies_scene046.mp4": "一只灰色的小老鼠出现在绿色的桌子上，它先是站在桌面上，然后推动桌子的一块面板，使其倾斜，小老鼠沿着倾斜的面板滑下。",
    "S1950E39 - Mice Follies_scene047.mp4": "一只老鼠从桌子底下跑过，随后一只猫从桌子底下钻出来，叼起桌上的香肠后迅速消失。",
    "S1950E39 - Mice Follies_scene048.mp4": "汤姆穿着冰鞋在室内滑行，身体前倾，双臂张开，表情专注。镜头跟随他滑行，背景逐渐展现室内环境，包括墙壁、窗帘和窗户。",
    "S1950E39 - Mice Follies_scene049.mp4": "一只小老鼠在房间里四处张望，突然，一只穿着冰鞋、拿着铲子的猫从门外闯入，试图用铲子铲住老鼠，但老鼠灵活地躲开了。",
    "S1950E39 - Mice Follies_scene050.mp4": "在冰面上，杰瑞正在滑行，而汤姆穿着冰鞋从后方追赶，身体前倾，双臂伸展，试图抓住杰瑞。",
    "S1950E39 - Mice Follies_scene051.mp4": "一只小老鼠站在冰箱前，用爪子转动冰箱的温度旋钮，从“冷”档位转到了“冷冻”档位。",
    "S1950E39 - Mice Follies_scene052.mp4": "汤姆穿着冰鞋在冰面上滑行，试图抓住杰瑞。他滑倒后头朝下摔进水里，随后挣扎着站起来，继续追赶杰瑞。最终，汤姆滑到一张桌子旁，拿起一个装满水的瓶子，准备泼水。",
    "S1950E39 - Mice Follies_scene053.mp4": "在厨房里，一只小老鼠从角落里探出头，被突然喷出的水流击中，溅起水花。它迅速跳开，躲到架子上。随后，一只穿着冰鞋、拿着喷水瓶的猫出现，继续用水喷射老鼠，老鼠不断躲避并爬上更高的架子。猫显得非常开心，不断喷水，而老鼠则在架子上四处逃窜。",
    "S1950E39 - Mice Follies_scene054.mp4": "一只灰色的小老鼠站在冰箱前，它用前爪转动冰箱的温度调节旋钮，从“FREEZE”位置转到“COLD”位置，然后又转到“QUICK FREEZE”位置，最后停在“DEFROST”位置。冰箱内有绿色玻璃瓶、米色花瓶和蓝色玻璃杯等物品。",
    "S1950E39 - Mice Follies_scene055.mp4": "在厨房里，汤姆穿着冰鞋，手持一个装满水的玻璃杯，正试图将水泼向杰瑞。随着水的泼洒，汤姆的身体逐渐被冻结成冰雕，而水在空中凝结成一条长长的冰柱，延伸到杰瑞所在的架子上。杰瑞站在架子上，看着汤姆被冰冻的滑稽模样，显得既惊讶又得意。整个场景充满了卡通式的幽默和夸张效果。",
    "S1950E39 - Mice Follies_scene056.mp4": "杰瑞站在冰块边缘，面带微笑，然后跳到另一块冰上，继续前行。突然，汤姆被冰冻住，杰瑞跳到汤姆的头上，然后从汤姆头上跳开，安全落地。",
    "S1950E39 - Mice Follies_scene057.mp4": "一只棕色的小老鼠从蓝色的冰滑梯上滑下，滑到一半时，它被甩出滑梯，飞向空中，然后消失在画面左侧。",
    "S1950E39 - Mice Follies_scene058.mp4": "一只棕色的小老鼠从水面上跳入水中，溅起水花，然后在水中游动，最后浮出水面站立。",
    "S1950E39 - Mice Follies_scene059.mp4": "在聚光灯下，一只棕色老鼠站在舞台中央，面带微笑。随后，一只灰色小老鼠从左侧跑入，与棕色老鼠相遇。棕色老鼠伸出手指向灰色小老鼠，两人似乎在进行互动。",
    "S1950E39 - Mice Follies_scene060.mp4": "在黑暗的背景下，一束黄色的光照射在两只老鼠身上，它们正在逃跑。光束中，一只被冰冻的猫从上方俯视着它们，猫的眼睛闪烁着黄色的光芒，表情狰狞。随着老鼠的逃跑，光束逐渐缩小，最终画面变黑，出现“The End”的字样。",
    "S1950E39 - Mice Follies_scene061.mp4": "视频显示了“THE END”的字样，随后逐渐显示出“An MGM Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样。背景为渐变的暖色调。"
}