{
    "S1950E02 - Saturday Evening Puss_scene001.mp4": "画面显示的是米高梅卡通片头，深蓝色背景上呈现米高梅的标志和“CARTOON”字样，下方标注“COLOR BY TECHNICOLOR”。",
    "S1950E02 - Saturday Evening Puss_scene002.mp4": "这是一个米高梅动画片头，背景为深蓝色，中央是一个咆哮的狮子形象，狮子位于一个圆形框架内，框架下方有“A METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”字样，再下方是“COLOR BY TECHNICOLOR”字样。狮子在画面中不断张合嘴巴，表现出咆哮的动作。整个画面风格复古，具有经典动画片头的特征。",
    "S1950E02 - Saturday Evening Puss_scene003.mp4": "视频开始显示了米高梅动画的标志，随后画面转黑，接着出现“Tom and Jerry”的标题，同时展示了猫汤姆和老鼠杰瑞的卡通形象。",
    "S1950E02 - Saturday Evening Puss_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深绿色，金色字体写着“Tom and Jerry”，左侧是杰瑞老鼠，右侧是汤姆猫，两者都面带笑容。随后画面切换，出现“Saturday Evening Puss”字样，以及导演威廉·汉纳和约瑟夫·巴伯拉的名字。",
    "S1950E02 - Saturday Evening Puss_scene005.mp4": "这是一个动画片的片头，背景是棕色条纹，左侧有一个穿着黑色礼服、戴着高帽的猫的剪影，它正在表演魔术，手中拿着一个白色的小老鼠。标题“Saturday Evening Puss”用蓝色字体显示在画面中央，下方是导演的名字“Directed by WILLIAM HANNA and JOSEPH BARBERA”。随后，画面逐渐显示动画制作人员名单，包括动画师、音乐制作人等，最后显示制片人“Fred Quimby”。整个画面风格复古，充满经典动画片的氛围。",
    "S1950E02 - Saturday Evening Puss_scene006.mp4": "视频开头显示“Produced by FRED QUIMBY”的字样，随后画面转为全黑，最后呈现一个夜晚的小镇景象，月光照亮了房屋和街道。",
    "S1950E02 - Saturday Evening Puss_scene007.mp4": "夜晚，月光照耀下的小镇宁静祥和。镜头缓缓推进，聚焦于一栋亮着灯的房子。突然，画面切换到室内，汤姆猫兴奋地在房间里奔跑，表情充满期待和喜悦。",
    "S1950E02 - Saturday Evening Puss_scene008.mp4": "一位穿着蓝色上衣和绿色围裙的女性角色站在梳妆台前，她先是用刷子给手指涂上红色指甲油，然后戴上多个戒指和手镯，接着戴上一条带有红宝石和绿宝石吊坠的项链。最后，项链上的宝石发出光芒，显示出“STOP”和“GO”的字样。",
    "S1950E02 - Saturday Evening Puss_scene009.mp4": "一个穿着蓝色裙子、红色鞋子和绿色围裙的女性角色，站在一个木制柜子旁边。她双手拿着一些物品，然后转身并开始跳舞，舞动着身体和手臂，最后离开画面。",
    "S1950E02 - Saturday Evening Puss_scene010.mp4": "一只蓝猫在房间内靠墙跳跃，随后从画面中消失。",
    "S1950E02 - Saturday Evening Puss_scene011.mp4": "汤姆猫从篮子里爬出来，盖上蓝色毯子后又躺回篮子里。一位穿着紫色衣服、红色高跟鞋、背着绿色包的女士从汤姆猫身边走过，汤姆猫看着她，露出开心的笑容。",
    "S1950E02 - Saturday Evening Puss_scene012.mp4": "一位穿着紫色衣服、红色高跟鞋的女士从门内走出，随后门被关闭。接着，一只名叫汤姆的猫从门后跳出来，兴奋地在房间里跳舞，动作夸张而欢快。",
    "S1950E02 - Saturday Evening Puss_scene013.mp4": "汤姆猫从椅子后面跑出来，站在窗边，张开双臂，看起来非常兴奋，然后他用爪子捂住嘴巴，似乎在笑或者惊讶。",
    "S1950E02 - Saturday Evening Puss_scene014.mp4": "夜晚，一只橙色猫趴在蓝色垃圾桶上，随后坐起，看到另一只黑猫从旁边垃圾桶探出头来。接着，一只灰色小猫也从左侧垃圾桶探出头来，三只猫在月光下对视。",
    "S1950E02 - Saturday Evening Puss_scene015.mp4": "汤姆猫从窗户探出头，兴奋地举着一张写着“O.K. FOR THE PARTY”的纸牌，舌头伸出，表情愉快。",
    "S1950E02 - Saturday Evening Puss_scene016.mp4": "夜晚，三只猫在垃圾桶上玩耍。红猫站在垃圾桶盖上，黑猫从树上跳下，灰猫从垃圾桶里跳出来。红猫和黑猫在空中翻滚，灰猫戴着垃圾桶盖在空中旋转。最后，三只猫都消失了。",
    "S1950E02 - Saturday Evening Puss_scene017.mp4": "汤姆猫在房间里兴奋地拿着一张纸，突然纸张被风吹动，他被吓到，身体僵直，随后倒在地上。",
    "S1950E02 - Saturday Evening Puss_scene018.mp4": "一只橙色的猫戴着厨师帽，站在一台留声机旁，用铲子将一叠黑胶唱片堆放在唱盘上，然后兴奋地挥舞铲子，铲子上出现白色粉末，猫开心地舔着舌头。",
    "S1950E02 - Saturday Evening Puss_scene019.mp4": "一只穿着黑色西装的猫坐在钢琴前，正在弹奏。它专注地看着乐谱，手指在琴键上灵活跳跃。突然，它似乎弹错了音符，表情变得惊讶，然后又恢复镇定，继续弹奏。它不时用爪子调整乐谱，确保演奏准确。整个过程充满了幽默和夸张的表现。",
    "S1950E02 - Saturday Evening Puss_scene020.mp4": "一只戴着蓝色锅盖的猫站在桌子后面，用勺子搅拌着面前一排酒杯中的液体，表情专注而滑稽。",
    "S1950E02 - Saturday Evening Puss_scene021.mp4": "动画片中，汤姆猫从门后冲出，双手各持一叠三明治，兴奋地在房间里奔跑。三明治在空中飞舞，有的掉落地上，汤姆猫表情狂喜，动作夸张，充满喜剧效果。",
    "S1950E02 - Saturday Evening Puss_scene022.mp4": "视频中，穿着厨师服的杰瑞正在用铲子搅拌一个蓝色的物体，突然汤姆从左侧冲入画面，手里拿着一叠三明治和一个派。汤姆兴奋地向杰瑞展示他的食物，杰瑞则用舌头接住汤姆递来的食物，结果食物被杰瑞的舌头拉长，最终杰瑞被食物噎住，汤姆则在一旁大笑。随后，汤姆又冲向杰瑞，试图抢走他的食物，但杰瑞用铲子抵挡，汤姆被击退。最后，杰瑞恢复平静，汤姆则继续大笑。整个场景充满了幽默和夸张的动作。",
    "S1950E02 - Saturday Evening Puss_scene023.mp4": "一只黑猫坐在钢琴前，另一只灰猫拿着一叠煎饼和一个派从旁边飞来。灰猫把派递给黑猫，黑猫张大嘴巴准备吃，但派突然飞起，溅了黑猫一脸酱汁。灰猫开心地跳起来，黑猫则被弄脏了脸，显得很生气。",
    "S1950E02 - Saturday Evening Puss_scene024.mp4": "汤姆戴着锅盖，用勺子搅拌三杯液体。杰瑞突然出现，用一叠面包砸汤姆，汤姆被砸得满脸是血。汤姆用勺子反击，杰瑞被击中后飞出画面。汤姆得意地继续搅拌，杰瑞从地板洞里探出头来。",
    "S1950E02 - Saturday Evening Puss_scene025.mp4": "一只棕色的小老鼠躺在一张小床上，盖着蓝色的被子。它先是皱着眉头，显得有些不安，然后用被子盖住头，接着又掀开被子，露出愤怒的表情。随后，它又用被子盖住头，再掀开，重复几次。最后，它坐起来，尾巴竖起，表情依然愤怒，似乎在生气或感到困扰。房间内有一盏台灯和一些家具，环境昏暗，营造出一种夜晚的氛围。",
    "S1950E02 - Saturday Evening Puss_scene026.mp4": "一只棕色的小老鼠从床上跳下，发现一只大猫的脚，它先是害怕地后退，然后鼓起勇气，爬上了猫的腿。",
    "S1950E02 - Saturday Evening Puss_scene027.mp4": "汤姆猫拿着勺子，舌头伸出来，眼睛眯着，看起来非常饥饿。杰瑞鼠从锅盖上跳出来，站在锅盖上，面对汤姆猫，用手指着汤姆猫，看起来很生气。汤姆猫举起勺子，杰瑞鼠继续指着汤姆猫，看起来很生气。汤姆猫张开嘴，露出牙齿，看起来很生气。杰瑞鼠继续指着汤姆猫，看起来很生气。汤姆猫举起勺子，杰瑞鼠继续指着汤姆猫，看起来很生气。汤姆猫张开嘴，露出牙齿，看起来很生气。杰瑞鼠继续指着汤姆猫，看起来很生气。汤姆猫举起勺子，杰瑞鼠继续指着汤姆猫，看起来很生气。汤姆猫张开嘴，露出牙齿，看起来很生气。杰瑞鼠继续指着汤姆猫，看起来很生气。汤姆猫举起勺子，杰瑞鼠继续指着汤姆猫，看起来很生气。汤姆猫张开嘴，露出牙齿，看起来很生气。杰瑞鼠继续指着汤姆猫，看起来很生气。汤姆猫举起勺子，杰瑞鼠继续指着汤姆猫，看起来很",
    "S1950E02 - Saturday Evening Puss_scene028.mp4": "一只老鼠在酒杯上奔跑，猫用勺子试图打它，老鼠被击中后飞出。",
    "S1950E02 - Saturday Evening Puss_scene029.mp4": "一只老鼠从钢琴上方跳下，被猫抓住并抛向空中，猫露出得意的笑容。",
    "S1950E02 - Saturday Evening Puss_scene030.mp4": "一只穿着厨师服的红色狐狸拿着蓝色的铲子，试图用铲子把一只棕色小老鼠从黑胶唱片上铲起来。小老鼠在唱片上奔跑，狐狸用铲子试图抓住它，但小老鼠灵活地跳到了铲子上，狐狸得意地举起铲子，但最终小老鼠还是从铲子上掉了下来。",
    "S1950E02 - Saturday Evening Puss_scene031.mp4": "一只老鼠从一个金色的圆盘中跳出，随后它愤怒地跑向一台唱机，爬上唱机的唱针臂，用力将唱针臂甩开，然后迅速跑开。这时，一只猫从上方探出头来，惊讶地看着这一切。",
    "S1950E02 - Saturday Evening Puss_scene032.mp4": "一只老鼠站在钢琴上，面对着一个戴着锅盖、拿着勺子的猫。猫用勺子敲击锅盖制造噪音，老鼠被吓到后跳起并用爪子推倒了猫所在的柜子。猫被撞飞，锅盖和勺子飞出去。老鼠趁机跑开，躲进钢琴后面，然后从钢琴的缝隙中爬出来，继续逃跑。",
    "S1950E02 - Saturday Evening Puss_scene033.mp4": "一只黑色的猫正在弹钢琴，它张大嘴巴，舌头伸出来，看起来非常开心。随后，它突然停止弹奏，双手捂住耳朵，表情变得痛苦，似乎被音乐声吓到了。",
    "S1950E02 - Saturday Evening Puss_scene034.mp4": "动画片中的猫角色表情愤怒，双手向前推，周围出现黄色能量波动，随后握拳准备攻击。",
    "S1950E02 - Saturday Evening Puss_scene035.mp4": "一只棕色的小老鼠沿着墙边奔跑，它突然停下，用前爪抓起一个蓝色的物体，然后迅速钻进墙上的洞里，接着从洞里探出头来，最后消失在洞中。",
    "S1950E02 - Saturday Evening Puss_scene036.mp4": "两个猫角色在房间内追逐打闹，其中一个猫角色被另一个猫角色压在地上，随后一个戴着帽子的兔子角色出现并加入追逐。他们一起跑向房间的另一边，最后消失在画面中。",
    "S1950E02 - Saturday Evening Puss_scene037.mp4": "汤姆猫出现在画面中，他正准备用一个绿色的工具去触碰黑胶唱片上的唱针。他表情兴奋，眼睛睁大，嘴巴张开，似乎对即将发生的事情充满期待。他小心翼翼地将工具靠近唱针，然后轻轻按压，唱针随之移动，发出“咔哒”声。汤姆猫的注意力完全集中在唱针上，对接下来可能发生的事情充满期待。",
    "S1950E02 - Saturday Evening Puss_scene038.mp4": "三只猫从柜子后面探出头来，最上面的猫戴着蓝色的帽子，中间的猫戴着红色的帽子，最下面的猫是蓝色的。它们都露出狡黠的表情，似乎在策划什么。",
    "S1950E02 - Saturday Evening Puss_scene039.mp4": "视频中，一只小老鼠从洞里钻出来，跑到墙边的插座旁，试图拔掉插头，结果被电击。随后，一只猫拿着一个蓝色的盘子，盘子上有一些小老鼠的雕塑，猫看着盘子上的小老鼠雕塑，表情显得有些困惑和担忧。",
    "S1950E02 - Saturday Evening Puss_scene040.mp4": "一只棕色的小老鼠在房间里快速奔跑，躲避着三只猫的追捕。三只猫分别是蓝色、红色和黑色，它们紧追不舍，表情凶狠。小老鼠在躲避过程中显得非常紧张和机敏，最终从画面右侧逃出，而三只猫则在后面紧追不舍。",
    "S1950E02 - Saturday Evening Puss_scene041.mp4": "一只老鼠从椅子上跳下，穿过门缝逃跑。门后突然出现三只猫，它们惊讶地盯着老鼠逃跑的方向。",
    "S1950E02 - Saturday Evening Puss_scene042.mp4": "一只小老鼠从窗帘后探出头来，小心翼翼地观察四周。它迅速躲回窗帘后，然后突然从窗帘的缝隙中探出头来，用爪子抓住一个蓝色的锅盖，把锅盖举起来，似乎在准备逃跑或制造混乱。接着，它把锅盖扔了出去，锅盖在空中旋转着飞走，最后消失在画面中。",
    "S1950E02 - Saturday Evening Puss_scene043.mp4": "一只小猫在房间里爬行，它先是趴在地上，然后站起来，用爪子挠了挠头，接着又趴下，尾巴甩动。",
    "S1950E02 - Saturday Evening Puss_scene044.mp4": "一只老鼠从窗帘后探出头，随后一只猫被吸进一个吸尘器。接着，三只猫从不同方向跑进来，似乎在追赶或帮助那只被吸进去的猫。",
    "S1950E02 - Saturday Evening Puss_scene045.mp4": "一只棕色的小老鼠戴着粉色帽子，从房间的一侧快速奔跑，经过蓝色沙发和台灯，跳上一个小桌子，然后奋力跃向窗户，卡在了百叶窗的缝隙中。此时，三只猫和一只戴着蓝色帽子的小狗从房间另一侧冲进来，惊讶地看着被困住的小老鼠。其中一只蓝猫伸手去拉百叶窗的拉绳，试图救出小老鼠。",
    "S1950E02 - Saturday Evening Puss_scene046.mp4": "四只猫聚集在窗户旁，其中一只黑猫正拉扯百叶窗，另外三只猫紧张地注视着窗外。突然，一只小老鼠从百叶窗缝隙中窜出，四只猫惊恐地张大嘴巴，露出惊讶和恐惧的表情。",
    "S1950E02 - Saturday Evening Puss_scene047.mp4": "杰瑞从百叶窗的缝隙中探出头来，然后滑落到窗台上。汤姆从旁边探出头，用爪子抓住百叶窗的拉绳，试图抓住杰瑞。杰瑞被汤姆的突然出现吓到，迅速逃跑。",
    "S1950E02 - Saturday Evening Puss_scene048.mp4": "汤姆猫用绳子绑住杰瑞鼠，将其吊在百叶窗上，然后用力拉扯绳子，试图将杰瑞鼠甩出去。杰瑞鼠在绳子上挣扎，表情痛苦。汤姆猫则露出得意的笑容，享受着胜利的快感。",
    "S1950E02 - Saturday Evening Puss_scene049.mp4": "一只老鼠被弹簧缠绕着，悬挂在百叶窗上，它不断挣扎，试图摆脱束缚。",
    "S1950E02 - Saturday Evening Puss_scene050.mp4": "一只黑猫正在弹钢琴，另一只灰猫拿着一根长棍子站在沙发上，似乎在干扰黑猫弹琴。两只猫都张着嘴，表情夸张，看起来非常投入。",
    "S1950E02 - Saturday Evening Puss_scene051.mp4": "一只穿着红色衣服的猫坐在沙发上，用手指拨动一根弦，似乎在演奏乐器。它旁边站着一只戴着蓝色帽子的小狗，看起来非常开心。猫在演奏时，小狗的帽子被风吹得微微晃动，猫还兴奋地挥舞着手臂，似乎在享受音乐。整个场景充满了欢乐和幽默的氛围。",
    "S1950E02 - Saturday Evening Puss_scene052.mp4": "一只老鼠被绳子吊在百叶窗上，它挣扎着试图逃脱，但最终从画面中消失。",
    "S1950E02 - Saturday Evening Puss_scene053.mp4": "一只被白色线缠绕的老鼠从墙边滑落，停在电话机旁。它小心翼翼地靠近电话，用牙齿咬住电话线，试图拨打电话。在拨号过程中，老鼠显得非常专注和紧张。",
    "S1950E02 - Saturday Evening Puss_scene054.mp4": "一个穿着蓝色衣服、戴着彩色手镯和项链的角色坐在椅子上，手里拿着扑克牌，正在打电话。他拿起电话听筒，听了一会儿后，突然站起身，电话听筒掉在地上，扑克牌也散落一地。",
    "S1950E02 - Saturday Evening Puss_scene055.mp4": "一个穿着蓝色服装、戴着帽子的角色从远处跑来，沿着一条有白色分隔线的道路冲向镜头。角色跑动时扬起尘土，最终镜头聚焦于角色的脸部特写，随后画面被尘土遮挡。道路两侧有围墙、树木和电线杆，天空呈深蓝色。",
    "S1950E02 - Saturday Evening Puss_scene056.mp4": "夜晚的街道上，一个身影从远处跑来，身后扬起尘土，逐渐遮挡了视线。",
    "S1950E02 - Saturday Evening Puss_scene057.mp4": "动画片段中，汤姆猫和两个伙伴在房间里，汤姆拿着一根棍子，另外两个伙伴一个拿着锅盖，一个拿着一个蓝色的物体。他们试图打开一扇门，但门被一位穿着蓝色裙子、戴着彩色手镯和项链的女士挡住。汤姆试图用棍子打开门，但被女士阻止。随后，汤姆被女士的手臂击中，被弹飞到钢琴旁边，最终被女士的手臂拉住并悬挂在门上。",
    "S1950E02 - Saturday Evening Puss_scene058.mp4": "夜晚，一栋房子的屋顶突然被破坏，碎片和烟雾四散。一只黑猫从房子里飞出，在空中翻滚，随后飞过街道和树木。",
    "S1950E02 - Saturday Evening Puss_scene059.mp4": "在夜晚的砖墙旁，一只黑色的猫从空中摔落，撞在墙上并显得惊恐。接着，一只穿着红色衣服的猫从右侧飞来，撞在墙上，然后一只戴着蓝色帽子的兔子从上方飞来，撞在墙上，最后一只黑色的猫从上方飞来，撞在墙上。四只动物叠在一起，形成一个塔状结构，站在墙边。",
    "S1950E02 - Saturday Evening Puss_scene060.mp4": "一位穿着蓝色裙子、红色鞋子、佩戴多彩手镯和项链的女性角色，从画面左侧走向右侧，停在一张木质柜子前。她蹲下身子，伸手从柜子顶部取出一个绿色的瓶子。整个场景发生在一个室内环境中，背景有条纹沙发和粉色墙壁。",
    "S1950E02 - Saturday Evening Puss_scene061.mp4": "一只老鼠在床上醒来，伸了个懒腰，然后盖上被子，躺下准备睡觉。它先是开心地笑着，然后变得紧张，最后戴上一个帽子，闭上眼睛，进入梦乡。画面逐渐变暗，最终黑屏，出现“The End”字样。",
    "S1950E02 - Saturday Evening Puss_scene062.mp4": "视频开始时显示“THE END”字样，随后逐渐过渡到“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面。整个画面背景为红色，文字以蓝色和白色呈现，具有复古卡通风格。",
    "S1950E02 - Saturday Evening Puss_scene063.mp4": "视频展示了MGM出品的《Tom and Jerry》动画片的片头，随后画面转为全黑。"
}