{
    "S1950E41 - Downhearted Duckling_scene002.mp4": "这是一个米高梅卡通片头，背景为深蓝色，中央有一个圆形框，框内是一只咆哮的狮子。狮子上方有文字“A METRO-GOLDWYN-MAYER”，下方是大字“CARTOON”，再下方是“COLOR BY TECHNICOLOR”。狮子在圆形框内不断咆哮，表情凶猛。",
    "S1950E41 - Downhearted Duckling_scene003.mp4": "视频开始显示了米高梅动画的标志，随后画面转黑，接着出现了《猫和老鼠》的标题和角色形象。",
    "S1950E41 - Downhearted Duckling_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深蓝色，左侧是棕色的小老鼠杰瑞，右侧是紫色的猫汤姆，两者都面带笑容。画面中央以黄色字体显示“Tom and Jerry”，随后文字“Downhearted Duckling”和“Directed by William Hanna and Joseph Barbera”逐渐浮现。整体风格卡通、欢快，充满经典动画的趣味感。",
    "S1950E41 - Downhearted Duckling_scene005.mp4": "这是一个动画片的片头，画面中展示的是《Downhearted Duckling》的标题，以及导演William Hanna和Joseph Barbera的名字。随后，画面切换到制作人员名单，包括动画师、背景设计师和音乐作曲家等。最后，显示了制片人Fred Quimby的名字。整个画面背景是蓝色的，前景是绿色的草地和一些小花。",
    "S1950E41 - Downhearted Duckling_scene006.mp4": "一只小黄鸭在草地上，旁边有一本打开的红色书和一块大石头。小黄鸭先是坐在地上打哈欠，然后拿起一个蓝色的放大镜，看着镜子里的自己，接着又打哈欠，最后躺倒在石头旁边睡着了。",
    "S1950E41 - Downhearted Duckling_scene007.mp4": "一只棕色的小老鼠从一扇黄色的拱形门后探出头来，门上方挂着一盏金色的灯笼。老鼠警惕地观察四周，似乎在确认安全后才敢出来。",
    "S1950E41 - Downhearted Duckling_scene008.mp4": "一只黄色的小鸭子趴在草地上，旁边放着一本打开的红色书。一只棕色的小老鼠从右侧出现，它走到小鸭子身边，轻轻拍打小鸭子，然后小鸭子睁开眼睛，小老鼠和小鸭子一起拿起书，开始阅读。背景是绿色的草地、树木和一条小溪。",
    "S1950E41 - Downhearted Duckling_scene009.mp4": "视频展示了一本打开的童话书，书名为《丑小鸭》，书页上有一幅插图，描绘了一只黄色的小鸭子站在池塘边，周围有水草和荷花。书页上的文字讲述了故事的开头：一只母鸭有五只小鸭子，其中一只小鸭子与众不同。背景是绿色的草地，一只手正拿着书。",
    "S1950E41 - Downhearted Duckling_scene011.mp4": "一只棕色的小老鼠从洞口跳出来，迅速跑向桌子，拿起桌上的粉色帽子和白色杯子，然后抱着它们跑出了画面。",
    "S1950E41 - Downhearted Duckling_scene012.mp4": "一只棕色的小老鼠从一个拱形门洞中跑出来，手里拿着一个粉色的帽子和一个白色的纸团。它在地面上奔跑，表情显得非常开心和兴奋。背景是一面绿色的木墙和一个金色的门铃。",
    "S1950E41 - Downhearted Duckling_scene013.mp4": "一只小黄鸭在悬崖边拉扯一把大斧头，随后被一只老鼠救起。老鼠将小黄鸭带回家，为它系上蓝色领结和紫色帽子，两人愉快地互动。",
    "S1950E41 - Downhearted Duckling_scene014.mp4": "一只戴着紫色帽子和蓝色领结的黄色小鸭站在水边，看着自己在水中的倒影。小鸭张开嘴巴，似乎在开心地唱歌或大笑。随后，一只棕色的小老鼠从画面左侧出现，靠近小鸭，也张开嘴巴，似乎在模仿小鸭的动作。小鸭和小老鼠都在水中倒影的映衬下，显得非常快乐和活泼。",
    "S1950E41 - Downhearted Duckling_scene015.mp4": "一只棕色的小老鼠从洞口跑出来，它看到一个蓝色的马桶盖，便好奇地伸手去拉。马桶盖被拉开后，小老鼠被弹了出去，它惊慌失措地在空中翻滚。",
    "S1950E41 - Downhearted Duckling_scene016.mp4": "一只棕色的小老鼠从洞里跑出来，拿着一面镜子，走到一个木凳旁，然后放下镜子，跑开。镜头跟随小老鼠跑向一棵大树，它在树下停下，四处张望，然后跑开。镜头转向树干，一只黄色的小鸟从树后探出头来，它慢慢走出来，向右走。",
    "S1950E41 - Downhearted Duckling_scene017.mp4": "一只黄色的小鸭子在池塘边哭泣，它先是低头看着水面，然后张大嘴巴哭喊，接着用翅膀捂住脸继续哭泣。最后，它抬起头，停止哭泣，看向远方。",
    "S1950E41 - Downhearted Duckling_scene019.mp4": "汤姆猫用叉子叉住一只小黄鸟，准备享用。这时，杰瑞鼠突然跳进汤姆的嘴里，与小黄鸟一起在汤姆的口腔内嬉戏。汤姆被这突如其来的状况弄得措手不及，表情从得意转为惊讶和无奈。最终，杰瑞鼠和小黄鸟一起从汤姆嘴里飞出，汤姆则一脸错愕地看着他们离去。",
    "S1950E41 - Downhearted Duckling_scene020.mp4": "在一条乡间小路上，一只棕色的小老鼠和一只黄色的小鸟从大树洞中跑出来。突然，一只蓝色的猫拿着叉子从树洞后冲出，紧追不舍。猫在追逐过程中表情凶狠，最后被自己的速度带得失去平衡，从画面中飞了出去。",
    "S1950E41 - Downhearted Duckling_scene021.mp4": "一只棕色的小老鼠站在一棵大树的树洞前，它先是好奇地探头张望，随后突然惊慌失措地向后退缩，接着被树洞的边缘绊倒，身体悬空，显得非常害怕和惊慌。背景是绿色的草地和天空中的云朵。",
    "S1950E41 - Downhearted Duckling_scene022.mp4": "一只蓝灰色的猫站在木栅栏旁，手持一把叉子，先是左右晃动身体，然后叉子从右手换到左手，叉子在手中旋转，最后叉子又回到右手，猫站立不动，表情严肃。背景是绿色的树林和草地。",
    "S1950E41 - Downhearted Duckling_scene023.mp4": "在一条林间小路上，一只黄色的小鸟坐在一个打开的三明治盒子里，它看起来非常饥饿。这时，一只蓝色的猫——汤姆，突然从画面左侧跑过来，眼睛盯着小鸟，流着口水，显得非常渴望得到食物。汤姆停下脚步，看着小鸟，似乎在思考如何得到三明治。小鸟突然从三明治盒子里跳出来，把三明治盒子里的食物吃光了，然后消失在画面中。汤姆看着空空如也的三明治盒子，非常失望，他舔了舔嘴唇，然后伸手去拿三明治盒子，但发现里面什么都没有。汤姆看起来非常沮丧，他开始思考如何才能得到食物。",
    "S1950E41 - Downhearted Duckling_scene024.mp4": "汤姆猫拿着一块面包，一只小鸟突然从面包中飞出，汤姆猫被吓了一跳。小鸟飞到树洞里，汤姆猫看着树洞，似乎在思考什么。接着，汤姆猫伸出舌头，试图抓住小鸟，但小鸟却飞到了树洞里，一只老鼠从树洞里探出头来，汤姆猫又伸出舌头，试图抓住老鼠，但老鼠也飞走了。汤姆猫看起来很困惑。",
    "S1950E41 - Downhearted Duckling_scene025.mp4": "一只小老鼠从树洞中跑出，拉着一只小黄鸭在草地上奔跑，随后小老鼠松开小黄鸭，小黄鸭继续向前飞奔，小老鼠则跑回树洞。",
    "S1950E41 - Downhearted Duckling_scene026.mp4": "一只小老鼠拉着一只小黄鸭跑，被一只母鸡发现后，母鸡追着小老鼠跑，最后母鸡用喙啄了小老鼠一下，小老鼠倒在地上，母鸡走了。",
    "S1950E41 - Downhearted Duckling_scene028.mp4": "一只蓝色的猫从绿色的木门后探出头来，然后小心翼翼地走出来，靠近门边的一个棕色袋子，似乎在观察或寻找什么。",
    "S1950E41 - Downhearted Duckling_scene029.mp4": "一只棕色老鼠正在给坐在小凳子上的黄色鸭子做头发造型。鸭子头上插着几个蓝色卷发器，老鼠用绿色梳子梳理鸭子的头发。旁边桌子上放着一罐写着“MUD”的泥巴。背景是木质墙面和架子，架子上放着紫色和绿色的球状物。",
    "S1950E41 - Downhearted Duckling_scene030.mp4": "一只蓝猫悄悄靠近一个装满食物的麻袋，它用爪子抓住麻袋，然后迅速拖走，跑出了画面。",
    "S1950E41 - Downhearted Duckling_scene031.mp4": "一只猫从红色砖房的门后跳出，高举着一个袋子，兴奋地跳跃着。随后，它消失在门后，门被关上，留下门前的奶桶和扫帚。",
    "S1950E41 - Downhearted Duckling_scene032.mp4": "汤姆猫兴奋地举起一个装满东西的袋子，然后把袋子倒进一个蓝色的盆里，盆里出现了一只小青蛙。汤姆猫看到青蛙后表现出惊讶和害怕的表情，随后迅速逃跑。",
    "S1950E41 - Downhearted Duckling_scene033.mp4": "在一间红色墙壁、绿色木门的房间里，汤姆猫从门后突然跳出来，张开双臂，表情夸张地大笑，随后表情转为惊讶和困惑，双手摊开，站在原地。",
    "S1950E41 - Downhearted Duckling_scene034.mp4": "一只穿着绿色上衣、戴着粉色头巾和蓝色卷发器的卡通鸭子正在粉红色的砖墙前跳舞，它左右摆动身体，脚步轻快，表情活泼。",
    "S1950E41 - Downhearted Duckling_scene035.mp4": "一只蓝色的猫站在红色的墙前，表情惊恐，双手张开。突然，它向墙冲去，撞破墙壁，墙上的砖块四散飞溅，露出墙后的景象。猫穿过破洞后消失，留下一个大洞。墙边有一个小角色，它看着墙洞，随后向洞里张望。",
    "S1950E41 - Downhearted Duckling_scene036.mp4": "视频中，一只戴着彩色羽毛头饰、穿着绿色上衣的卡通鸭子站在破损的砖墙前，表情悲伤。随后，场景切换到户外，另一只黄色的卡通鸭子拖着一个带眼睛的白色棺材，沿着小路行走，背景是大树和绿草。",
    "S1950E41 - Downhearted Duckling_scene039.mp4": "两个黄色的小鸭子手牵手走在一条小路上，其中一只小鸭子拿着一把蓝色的伞。他们周围是盛开的花朵，包括蓝色的雏菊和紫色的玫瑰。天空呈现出日落时分的柔和色彩，云朵被染成橙色和粉色。小鸭子们先是背对镜头，然后转身面向彼此，似乎在交谈或互动。最后，画面逐渐变暗，最终显示“THE END”字样。",
    "S1950E41 - Downhearted Duckling_scene040.mp4": "视频展示了“THE END”字样，随后逐渐过渡到“An M-G-M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面，背景为红色，文字为蓝色和白色，具有明显的卡通风格。"
}