{
    "25. Trap Happy_scene001.mp4": "视频开始时显示一个黑色背景，右下角有数字“0110544170204083”。随后，画面逐渐变亮，出现米高梅卡通的标志，标志上方写着“A METRO-GOLDWYN-MAYER”，中间是“CARTOON”，下方是“COLOR BY TECHNICOLOR”。背景为深蓝色，标志颜色为金色和红色。整个画面保持静态，没有其他动作或变化。",
    "25. Trap Happy_scene002.mp4": "这是一个米高梅动画片头，画面中央是一个咆哮的狮子，上方写着“A METRO-GOLDWYN-MAYER”，下方是“CARTOON”和“COLOR BY TECHNICOLOR”的字样，背景为深蓝色。狮子在画面中不断咆哮，嘴巴张合，表情凶猛。",
    "25. Trap Happy_scene003.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面，其中包含角色汤姆和杰瑞的图像。",
    "25. Trap Happy_scene004.mp4": "这是一个《猫和老鼠》动画片的标题画面，画面中展示了主角汤姆和杰瑞的卡通形象，背景为深绿色，文字“Tom and Jerry”以黄色立体字体呈现。随后，画面中出现了“TRAP HAPPY”和“幸福的诱惑”的字样，以及导演威廉·汉纳和约瑟夫·巴伯拉的名字。",
    "25. Trap Happy_scene005.mp4": "视频片段展示了动画片《猫和老鼠》的片头标题画面，包括片名“Trap Happy”、导演William Hanna和Joseph Barbera、动画师Kenneth Muse、Ed Barge和Michael Lah、音乐制作人Scott Bradley，以及制片人Fred Quimby等信息。背景为深绿色，文字以紫色和绿色呈现，最后画面逐渐变黑。",
    "25. Trap Happy_scene006.mp4": "一只老鼠从楼梯上跑下来，一只猫从楼梯上方跳下来追逐它，老鼠跑向桌子，猫也跟着追到桌子旁，猫在楼梯上摔倒，老鼠则安全地跑到了桌子后面。",
    "25. Trap Happy_scene007.mp4": "一只灰色的猫在房间里快速奔跑，经过一张桌子，桌子上放着一部电话和一盏台灯。猫跑过时，电话被它撞倒，随后猫继续向前奔跑，最终消失在画面中。",
    "25. Trap Happy_scene008.mp4": "在一间客厅里，猫汤姆躺在地上，老鼠杰瑞从他面前跑过。杰瑞拿起一个木板，将其拉长并用作武器攻击汤姆。汤姆被击中后翻滚到沙发下。杰瑞继续逃跑，汤姆追上去并用火药筒试图捕捉杰瑞。杰瑞点燃火药筒，导致爆炸，汤姆被炸飞。",
    "25. Trap Happy_scene010.mp4": "一只灰色的猫和一只棕色的老鼠在室内追逐。老鼠拿着一把黄色的扫帚，猫试图抢走扫帚，但老鼠成功地用扫帚击中了猫。猫被击中后倒在地上，老鼠则继续逃跑。",
    "25. Trap Happy_scene011.mp4": "一只棕色的小老鼠在房间角落里，面对着一个黄色的扫帚。扫帚突然从上方落下，小老鼠被吓了一跳，但很快恢复镇定，跳到扫帚上，然后又跳下来，最后站在扫帚旁边，显得很得意。",
    "25. Trap Happy_scene012.mp4": "猫和老鼠在室内进行一场拉锯战，猫用扫帚柄与老鼠争夺扫帚，最终猫被扫帚击中头部，老鼠趁机逃跑。",
    "25. Trap Happy_scene013.mp4": "一只老鼠从洞里跑出来，一只猫从上方扑下来，猫在空中翻滚后摔倒在地。",
    "25. Trap Happy_scene014.mp4": "在木屋内，汤姆猫从门缝中探出头，眼睛瞪大，专注地看着杰瑞鼠。杰瑞鼠站在门口，双臂张开，手指指向汤姆，表情得意。汤姆的鼻子微微颤动，似乎在嗅着杰瑞。整个场景充满紧张和对峙的气氛。",
    "25. Trap Happy_scene015.mp4": "一只灰色的猫在地板上翻滚，然后突然停下，吐着舌头，眼睛瞪大，看起来非常惊讶或困惑。它的前方有一个洞，似乎是从那里发出的声音或动作引起了它的注意。",
    "25. Trap Happy_scene016.mp4": "一只棕色的小老鼠从一个木制的洞口探出头来，它先是挥手打招呼，然后左右张望，显得十分警觉和好奇。",
    "25. Trap Happy_scene017.mp4": "一只灰色的猫蹲在地上，眼睛发绿，伸出舌头，似乎在舔舐或观察什么。它面前有一个小洞，一只棕色的小老鼠从洞里探出头来，表情显得有些得意或挑衅。猫的表情从专注变为愤怒，张开爪子，似乎准备扑向老鼠。整个场景发生在一个室内，背景是粉红色的墙壁和蓝色的地板，右下角可以看到一个木质家具的腿。",
    "25. Trap Happy_scene018.mp4": "一只灰色的猫从楼梯上跳下来，走到桌子旁拿起一本书，开始阅读。它读着读着，表情变得兴奋，最后开心地伸出舌头。",
    "25. Trap Happy_scene019.mp4": "视频展示了一张旧报纸上的广告，广告标题为“AJAX MOUSE EXTERMINATORS”，内容是灭鼠服务，广告图中有一只老鼠被锤子击中，下方写着“ONE CALL... THAT'S ALL”，并附有电话号码。广告周围是其他商业广告。画面下方有中文字幕“AJAX 灭鼠公司...一个电话...帮你全部解决”。",
    "25. Trap Happy_scene020.mp4": "汤姆猫拿起电话，兴奋地与“Ajax灭鼠公司”通话，请求帮助驱赶老鼠。",
    "25. Trap Happy_scene021.mp4": "汤姆猫在楼梯旁的桌子前打电话，兴奋地喊着“有老鼠！”并催促对方“快点过来！”，随后他激动地跳动着，最后将电话听筒放回电话机上，表情变得愤怒。",
    "25. Trap Happy_scene022.mp4": "一只棕色的小老鼠从一个木制的洞穴中探出头来，它四处张望，显得有些紧张和警觉。随后，它小心翼翼地从洞穴中爬出来，完全离开了洞穴。",
    "25. Trap Happy_scene023.mp4": "汤姆猫打开门，迎接一位自称“灭鼠专家”的黑猫。这位黑猫戴着帽子，拿着喷雾器和一个写有“灭鼠专家”的袋子，自信满满地走进来。汤姆猫看起来既惊讶又有点紧张，站在门口看着这位新来的“专家”。黑猫在门口跳舞，显得非常得意，而汤姆猫则一脸困惑。最后，黑猫得意洋洋地走了，汤姆猫独自站在门口，表情复杂。",
    "25. Trap Happy_scene024.mp4": "一只穿着工作服、戴着帽子的黑猫，拿着一个标有“MOUSE EXTERMINATOR”的袋子，从桌子旁走开。它先是整理手套，然后戴上帽子，最后摆出自信的姿势。背景中可以看到一个老鼠的头部从地板下探出。",
    "25. Trap Happy_scene025.mp4": "一只戴着蓝色帽子的黑猫站在一个装满水的鱼缸旁，嘴里叼着一个红色的物体。它用爪子搅动鱼缸里的水，水花四溅。随后，它用爪子拍打水面，水珠溅到它的脸上。接着，它用爪子拉起黄色的窗帘，然后转身离开。",
    "25. Trap Happy_scene026.mp4": "一只黑猫拿着标有“MOUSE EXTERMINATOR”的黄色工具包，从墙洞里探出头来，表情兴奋，似乎在准备捉老鼠。",
    "25. Trap Happy_scene027.mp4": "一只戴着蓝色帽子、叼着雪茄的黑猫坐在船上，手里拿着一个蓝色小盒子和一支画笔。他先是用画笔蘸取颜料，然后在盒子上涂抹，最后满意地展示他的作品。",
    "25. Trap Happy_scene028.mp4": "动画片段中，一只手拿着一个蓝色的六角螺母，另一只手用刷子涂上黄色油漆。油漆涂完后，手拿着一瓶标有“Essence of Cheese”的喷雾瓶，向螺母喷洒，螺母周围冒出黄色的烟雾。画面底部出现中文“芝士香精”。",
    "25. Trap Happy_scene029.mp4": "一只戴着蓝色帽子的黑猫坐在船上，手里拿着一块黄色奶酪和一支红色雪茄。它先是用雪茄点燃奶酪，然后大口吃奶酪，表情非常享受。",
    "25. Trap Happy_scene030.mp4": "一只戴着蓝色帽子的黑猫，正用爪子拿着一个黄色的六角螺母，小心翼翼地靠近一个洞口，然后将螺母放在洞口边缘，接着抬起爪子，似乎在观察或等待什么。",
    "25. Trap Happy_scene031.mp4": "一只棕色的小老鼠在洞穴中发现了一个黄色的六角螺母，它先是好奇地观察，然后小心翼翼地捡起螺母，接着开心地欢呼并跳舞庆祝。",
    "25. Trap Happy_scene032.mp4": "一只戴着蓝色帽子的黑猫，正从一个标有“MOUSE EXTERMINATOR”的黄色工具箱中拿出一个红蓝相间的磁铁。它先是兴奋地张开嘴，然后用爪子拿起磁铁，最后将磁铁靠近嘴边，似乎准备使用它。背景中可以看到一个老鼠的头从墙洞中探出。",
    "25. Trap Happy_scene033.mp4": "一只黑猫拿着一个红蓝相间的磁铁，将磁铁靠近一个洞口，磁铁与洞口接触后产生火花。",
    "25. Trap Happy_scene034.mp4": "一只棕色的小老鼠从木门后探出头，随后迅速向前奔跑，身后拖着火焰般的尾巴，穿过一个拱形门洞。",
    "25. Trap Happy_scene035.mp4": "一只黑猫用磁铁吸引一只老鼠，老鼠被磁铁吸住，黑猫露出得意的笑容。",
    "25. Trap Happy_scene036.mp4": "一只穿着黑色制服、戴着蓝色帽子的猫，手里拿着一个磁铁，磁铁上吸附着一只小老鼠。另一只灰色的猫（汤姆）跑过来，表情兴奋。黑猫将磁铁上的小老鼠取下，然后从旁边的工具箱里拿出一把锤子，准备砸向小老鼠。汤姆紧张地看着这一幕。",
    "25. Trap Happy_scene037.mp4": "汤姆猫张大嘴巴，似乎在大声叫喊，随后闭上眼睛，双手捂住脸，表现出痛苦或沮丧的表情。",
    "25. Trap Happy_scene038.mp4": "一只小老鼠被两只大狗的尾巴夹住，它挣扎着试图逃脱，但被夹得更紧，最后它被夹在中间，动弹不得。",
    "25. Trap Happy_scene039.mp4": "一只黑猫挥舞着斧头，另一只灰猫惊恐地捂住耳朵。黑猫挥斧后，灰猫被吓到，眼睛瞪大，随后被抛向空中，嘴巴张开，表情惊恐。黑猫则低头看着灰猫，表情从凶狠转为惊讶。",
    "25. Trap Happy_scene040.mp4": "一只老鼠从洞口跑出，一只戴着蓝色帽子的黑猫拿着一个蓝色的工具追赶它。黑猫用工具试图抓住老鼠，但工具突然变成了一根黄色的棍子，黑猫被棍子击中，显得非常痛苦。",
    "25. Trap Happy_scene041.mp4": "一只棕色的小老鼠在木制结构的角落里，面对着一个悬挂的机械装置。小老鼠先是好奇地观察，然后用力拉扯一条螺旋状的蓝色带子，带子被拉长并缠绕在机械装置上。接着，小老鼠用尽全力拉扯带子，导致机械装置发出火花并开始旋转，最终带子被卷入装置中。整个过程充满了紧张和动感。",
    "25. Trap Happy_scene042.mp4": "一只戴着蓝色帽子的黑猫正试图用一个蓝色的管子吸走地上的黄色碎屑，但管子突然喷出气体，导致黑猫被吹得翻滚在地。随后，一个巨大的猫形幻影出现，手持标有“GAS”的喷雾罐，似乎在嘲笑黑猫的失败。",
    "25. Trap Happy_scene043.mp4": "两只猫，一只灰色，一只黑色戴蓝色帽子，正合力将一个标有“GAS”的黄色喷雾罐对准地面，喷出绿色烟雾。灰色猫用爪子按住喷雾罐的红色喷嘴，黑色猫则用爪子握着罐身，两人表情专注。背景是室内，地面为蓝色，右侧可见木质家具的一部分。",
    "25. Trap Happy_scene044.mp4": "一个巨大的蓝色和黄色的“GAS”气瓶被几只灰色的手握着，气瓶的尖端喷出绿色的烟雾。一只戴着白色安全帽、穿着橙色工作服、戴着防毒面具的小老鼠从烟雾中跑出来，然后停下来，似乎在观察气瓶。接着，小老鼠继续向前走，远离气瓶。",
    "25. Trap Happy_scene045.mp4": "两只猫正在用一个标有“GAS”的喷雾罐喷射气体，一只小老鼠戴着安全帽和护目镜在它们面前。喷射气体后，两只猫显得非常兴奋，随后其中一只猫被气体熏得倒下，另一只猫则愤怒地指向它。",
    "25. Trap Happy_scene046.mp4": "一只戴着白色帽子、穿着灰色防护服的老鼠从椅子后面跑出来，它用尾巴勾住椅子腿，然后被椅子腿弹起，最后被弹飞出去。",
    "25. Trap Happy_scene047.mp4": "汤姆和杰瑞在室内地板上快速奔跑，汤姆表情紧张，杰瑞紧随其后。",
    "25. Trap Happy_scene048.mp4": "一只小老鼠杰瑞在房间里奔跑，它看到一个熨斗，便用它挡住门口。一只黑猫戴着蓝色帽子，从门后探出头，被熨斗挡住，它试图用爪子抓住熨斗，结果被烫到，痛苦地跳起来。随后，灰猫汤姆出现，咬住黑猫的耳朵，黑猫痛苦地挣扎。",
    "25. Trap Happy_scene049.mp4": "一只棕色的小老鼠从墙洞中跑出，被一只穿着“灭鼠专家”背心的黑猫和灰猫发现。黑猫拿出工具，试图用工具夹住老鼠，但灰猫却在一旁偷看并最终成功抓住了老鼠。",
    "25. Trap Happy_scene050.mp4": "一只小老鼠站在地板上，面对着一只大猫的爪子。大猫用爪子拿着一把锤子，锤子的头部是蓝色的，锤柄是黄色的。小老鼠看到锤子后，用爪子抓住锤柄，试图把锤子拉走。它用力拉扯，锤子被拉得旋转起来，小老鼠被甩到空中，然后落在大猫的爪子上。",
    "25. Trap Happy_scene051.mp4": "一只黑猫戴着蓝色小礼帽，站在墙角，被一只灰猫用锤子砸墙。黑猫被砸得向后飞出，撞在墙上，墙皮碎裂，黑猫摔倒在地，嘴里吐出红色的舌头。",
    "25. Trap Happy_scene052.mp4": "一只老鼠拿着一个巨大的锤子，在洞穴中挥舞，锤子砸在一条由多个白色小动物组成的长链上，老鼠在锤子上跳跃，试图击打链条，但链条不断拉长，老鼠被甩来甩去。",
    "25. Trap Happy_scene053.mp4": "一只戴着蓝色小帽子的黑猫在墙角附近追逐一只小老鼠，它用爪子试图抓住老鼠，但老鼠迅速躲进了一个写着“MOUSE EXTERMINATOR”的黄色盒子中，黑猫被盒子弹开，摔倒在地，显得非常惊讶和困惑。",
    "25. Trap Happy_scene054.mp4": "视频展示了两只卡通风格的手掌，手指逐渐变红并喷出水柱，最终形成云朵和雨滴的效果。",
    "25. Trap Happy_scene055.mp4": "一只戴着帽子的黑猫从一个标有“MOUSE EXTERMINATOR”的箱子中拿出一个红色的锤子，然后与另一只灰猫对峙。灰猫也拿起一个锤子，两只猫互相威胁，黑猫试图用爪子攻击灰猫，但灰猫保持防御姿态。黑猫最终转身离开，灰猫则站在原地。",
    "25. Trap Happy_scene056.mp4": "一只戴着蓝色帽子的黑色猫跑向墙上的黄色开关，用力按压后，开关消失，墙上出现一个洞。猫惊讶地盯着洞，然后小心翼翼地探头查看。",
    "25. Trap Happy_scene057.mp4": "一只棕色的小老鼠站在木制阁楼的角落里，它先是抬头四处张望，然后小心翼翼地向前探头，似乎在观察周围的环境。阁楼内光线昏暗，木板和电线构成了背景。",
    "25. Trap Happy_scene058.mp4": "一只黑猫戴着蓝色帽子，从墙上的小洞中探出头来，突然被什么东西击中，身体向后仰倒，随后墙壁上的洞口冒出大量烟雾和碎片。",
    "25. Trap Happy_scene059.mp4": "汤姆猫拿着锤子砸墙，墙皮碎裂，灰尘飞扬。",
    "25. Trap Happy_scene060.mp4": "动画片段中，墙壁从右向左逐渐破裂，露出黄色的内层结构，碎片四散飞溅，最终画面展示出房间内的一角，包括一张木制桌子和沙发的一部分。",
    "25. Trap Happy_scene061.mp4": "天花板开始破裂，碎片四溅，一盏吊灯随之破碎，灯罩和灯臂散落一地。随后，一个蓝色的钉子从天花板的裂缝中伸出，钉子下方有黑色的线条，像是在向下延伸。天花板继续破裂，碎片不断掉落。",
    "25. Trap Happy_scene062.mp4": "汤姆猫拿着锤子砸墙，墙被砸出一个洞，杰瑞鼠从洞里钻出来。汤姆猫继续砸墙，墙被砸得更破，烟尘弥漫。杰瑞鼠在烟尘中惊慌逃跑。",
    "25. Trap Happy_scene063.mp4": "汤姆用锤子砸地板，杰瑞从洞里钻出来，戴着一顶帽子。杰瑞的帽子被砸得变形，然后变成一个红色的尖顶，接着变成一个飞碟形状的帽子。汤姆看着杰瑞，表情惊讶。最后，画面变暗，汤姆和杰瑞在黑暗中对视。",
    "25. Trap Happy_scene064.mp4": "两只猫坐在地上，一只黑猫戴着蓝色帽子，手里拿着点燃的火柴，另一只灰猫紧紧抱住黑猫。黑猫点燃了地上的炸弹，随后两人惊慌地逃跑。",
    "25. Trap Happy_scene065.mp4": "一只戴着蓝色帽子的黑猫从黄色扶手椅后跳出，与灰猫汤姆相遇。两只猫互相嬉戏，最终并排坐着，用前爪捂住耳朵，面带微笑。",
    "25. Trap Happy_scene066.mp4": "一只老鼠从洞里探出头，看到一个正在燃烧引线的炸弹。它迅速跑向炸弹，用尽全力将炸弹拖走，然后成功摆脱了危险。",
    "25. Trap Happy_scene067.mp4": "两只猫在室内，一只灰猫和一只黑猫，黑猫戴着蓝色帽子。它们先是都用手捂住耳朵，然后黑猫从空中接住一个炸弹，灰猫也拿着一个炸弹。它们互相扔炸弹，最后灰猫扔出炸弹后跑开，黑猫则捂着头坐在地上。",
    "25. Trap Happy_scene068.mp4": "视频中，一只灰色的猫（汤姆）和一只黑色的猫（杰瑞）在室内互动。汤姆一开始拿着一个炸弹，但被一只小老鼠偷走。随后，另一只黑猫出现，也拿着一个炸弹。两只猫开始互相争夺炸弹，过程中炸弹的引线不断闪烁，显得十分紧张。小老鼠在一旁观察，最后它把炸弹拿走，两只猫都表现出惊讶和紧张的表情。整个场景充满喜剧和紧张气氛。",
    "25. Trap Happy_scene069.mp4": "两只猫，一只灰色，一只黑色，都捂着耳朵，表情紧张。黑色猫头上顶着一个正在冒火花的炸弹。随后，两只猫的表情从得意转为惊恐，炸弹突然爆炸，画面转为红色。",
    "25. Trap Happy_scene071.mp4": "视频开始时为纯粉色背景，随后切换到红色模糊画面，最后呈现灰黑色模糊的圆形和不规则形状的物体。整个视频画面模糊，无清晰细节。",
    "25. Trap Happy_scene072.mp4": "一只棕色的小老鼠从房间角落的洞口跑出来，被一只戴着蓝色帽子的黑猫追逐。黑猫扑向洞口，但小老鼠躲进洞里，黑猫扑空后摔倒在地。随后，另一只灰色的猫（汤姆）出现，也试图抓住小老鼠，结果同样扑空摔倒。两只猫都未能抓到小老鼠，小老鼠则在洞口处得意地张嘴大笑。",
    "25. Trap Happy_scene073.mp4": "一只小老鼠站在木板上，面对着两只巨大的猫爪。猫爪逐渐靠近，将小老鼠夹在中间，小老鼠惊恐地张大嘴巴。随后，小老鼠被猫爪夹住，向上弹起，最终悬挂在木板上方。",
    "25. Trap Happy_scene074.mp4": "一只戴着蓝色小礼帽的黑猫趴在地板上，从墙角的洞里探出头来，张开嘴露出牙齿，表情凶狠。它随后慢慢起身，用爪子抓着洞口边缘，身体前倾，似乎在观察洞内情况。",
    "25. Trap Happy_scene075.mp4": "一只灰色的猫汤姆正试图通过墙上的一个洞进入房间，但洞口太小，他只能勉强挤进去。在过程中，他撞到了墙，导致墙壁破裂，露出里面的黄色条纹。汤姆从洞口探出头，表情显得有些困惑和不满，然后他用力地用爪子抓挠墙壁，试图扩大洞口。最终，他成功地将洞口扩大，然后从洞口爬了进去。",
    "25. Trap Happy_scene076.mp4": "一只戴着蓝色帽子的黑猫在房间里，它用爪子抓墙，导致墙皮剥落。随后，它拿起一把扫帚，用力清扫地上的碎屑。",
    "25. Trap Happy_scene077.mp4": "汤姆猫被一根红色的棍子卡住嘴巴，他拼命挣扎，试图把棍子拔出来，但徒劳无功。他最终放弃挣扎，用爪子拍打墙壁，然后得意地笑了。",
    "25. Trap Happy_scene078.mp4": "一只戴着蓝色帽子的黑猫从墙上的破洞中跌落，身体在空中翻滚，最终摔在地板上，周围散落着墙皮碎片。",
    "25. Trap Happy_scene080.mp4": "汤姆猫冲向窗户，撞碎玻璃，随后从窗外探出头来。杰瑞鼠从窗外爬进屋内，汤姆猫持枪瞄准杰瑞鼠，但杰瑞鼠迅速逃跑并躲到窗边。汤姆猫追击杰瑞鼠，杰瑞鼠则灵活地躲避汤姆猫的攻击。",
    "25. Trap Happy_scene081.mp4": "一只戴着帽子、手持猎枪的黑猫在院子里追逐另一只黑猫。它跳过栅栏，连续射击，但目标猫敏捷地躲避。最终，目标猫飞出画面，黑猫在栅栏上保持射击姿势，画面渐暗并显示“THE END”。",
    "25. Trap Happy_scene082.mp4": "视频显示了“THE END”字样，随后逐渐显示出“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题，背景为红色渐变。",
    "25. Trap Happy_scene083.mp4": "视频开始时显示了MGM的“Tom and Jerry Cartoon”标志，背景为红色，文字为蓝色。随后画面转为全黑，持续数秒。"
}