{
    "04. Fraidy Cat_scene001.mp4": "视频开始时显示一个黑色背景，右下角有白色数字“0110544170204083”。随后，画面逐渐变亮，出现一个红色背景，中央是一个蓝色边框的圆形标志，标志内有一只咆哮的狮子。标志下方有文字“A Metro-Goldwyn-Mayer CARTOON COLOR BY TECHNICOLOR”。整个画面保持静态，没有其他动作或变化。",
    "04. Fraidy Cat_scene002.mp4": "这是一个米高梅动画片头，背景为红色，中央是一个蓝色边框的圆形，内有一只咆哮的狮子。下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”。狮子在圆形内不断咆哮，嘴巴张合，表情生动。",
    "04. Fraidy Cat_scene003.mp4": "视频片段展示了两个经典动画片头。首先是米高梅动画公司的标志，背景为红色，中间是咆哮的狮子图案，下方有“CARTOON”和“COLOR BY TECHNICOLOR”字样。接着画面切换到《猫和老鼠》的标志，背景同样是红色，中间是汤姆猫和杰瑞鼠的卡通形象，下方是“TOM and JERRY”的标题。",
    "04. Fraidy Cat_scene004.mp4": "这是一个《猫和老鼠》动画片的开场画面，背景是红色渐变的同心圆，画面中央是猫汤姆和老鼠杰瑞的卡通形象，汤姆张大嘴巴，杰瑞在旁边笑着。下方有黄色的“TOM and JERRY”字样。随后画面出现导演信息和版权信息。",
    "04. Fraidy Cat_scene006.mp4": "一只灰色的猫背对着镜头，坐在地上，尾巴高高翘起，身上披着一条紫色的毯子，毯子的一角垂落在地上。背景是室内环境，有黄色的窗帘和紫色的布幔。",
    "04. Fraidy Cat_scene008.mp4": "一只棕色的小老鼠从墙角探出头来，它先是警惕地观察四周，然后逐渐放松，开始兴奋地跳舞和欢呼，表现出极大的喜悦和兴奋。",
    "04. Fraidy Cat_scene009.mp4": "一只灰色的猫坐在地上，表情从惊讶逐渐变为恐惧，它用前爪捂住嘴巴，眼睛睁得很大，似乎被某事吓到了。背景是室内，有紫色窗帘和黄色墙壁。",
    "04. Fraidy Cat_scene010.mp4": "一只灰色的猫站在一个黄色的圆柱形物体旁，背景是紫色的窗帘。猫的毛发竖起，表情显得害怕和紧张，眼睛睁大，嘴巴微张，似乎在惊恐地注视着什么。画面中出现字幕，描述了“无力的少女吓得头发都竖了起来”和“少女的背脊感觉到一股寒气”，暗示猫正在经历或目睹某种令人恐惧的情境。",
    "04. Fraidy Cat_scene011.mp4": "一只灰色的猫坐在地上，背对着镜头，突然感到一阵寒意，毛发竖起。它转过身，看到地上有一块冰，吓得张大嘴巴，表现出惊恐和紧张。",
    "04. Fraidy Cat_scene012.mp4": "动画片段中，汤姆猫坐在室内，表情从惊讶转为兴奋，胸口出现一颗红心，他不断说着“再近一点”，随后因情绪激动而身体前倾，最终向后仰倒。",
    "04. Fraidy Cat_scene013.mp4": "猫在房间里被一条紫色的毯子缠住，它挣扎着试图摆脱，但毯子越缠越紧，最终猫被甩飞出去，毯子在空中飘荡，房间里弥漫着烟雾。",
    "04. Fraidy Cat_scene014.mp4": "一只棕色的小老鼠站在墙角，它先是开心地笑着，然后开始跳舞，接着又张大嘴巴，似乎在唱歌或喊叫，最后它伸出手指指向某个方向，表情兴奋。",
    "04. Fraidy Cat_scene015.mp4": "动画片段中，一只灰色的猫（汤姆）从一个插满紫色花朵的红色花瓶中探出头来。花瓶位于室内，背景可见吊灯和楼梯。猫的表情从惊讶变为愤怒，似乎在说话或喊叫。画面下方有中文字幕：“来，今天就以这个...”和“'魔女出现的时间'来结束今晚吧。”",
    "04. Fraidy Cat_scene016.mp4": "一只灰色的猫坐在一个红色的花瓶里，花瓶里插着紫色的花。猫张开嘴，似乎在说话，表情从惊讶到疑惑再到平静。字幕显示猫在谈论“魔女出现的时间”和“大家都相信幽灵的存在吧，对吗？”",
    "04. Fraidy Cat_scene017.mp4": "一只棕色的小老鼠在室内角落兴奋地跳舞，它张开嘴巴，挥舞着四肢，显得非常开心。随后，它沿着一个蓝色的家具腿快速跑动，最终消失在家具腿的后面。",
    "04. Fraidy Cat_scene018.mp4": "一只小老鼠在房间里跑动，它看到一个悬挂的圆环，便尝试抓住它。小老鼠先是跳起抓住圆环，然后被吊在空中，它努力挣扎着，最终成功地将圆环拉到地面，并继续向前跑动。",
    "04. Fraidy Cat_scene019.mp4": "一只灰色的小猫正抱着一个插有紫色花朵的红色花瓶，它用力地摇晃花瓶，导致花瓶中的花束被甩出，小猫也因失去平衡而被甩出画面。",
    "04. Fraidy Cat_scene020.mp4": "一只灰色的猫在房间里快速奔跑，经过沙发和台灯，然后躲在一个垃圾桶后面，从垃圾桶后面探出头来，眼睛睁得很大，表情显得非常紧张和警觉。",
    "04. Fraidy Cat_scene021.mp4": "窗帘在风中轻轻摆动，窗外是夜晚的景色。",
    "04. Fraidy Cat_scene022.mp4": "一只棕色的小老鼠在室内快速奔跑，经过蓝色的铁艺栏杆和一个黄色的电插座，最后停在一个水龙头旁边，它先是紧张地四处张望，然后放松下来，开心地笑了。",
    "04. Fraidy Cat_scene023.mp4": "一只灰猫站在暖气片上，表情从专注变为惊讶，随后张大嘴巴似乎在叫喊或惊讶。",
    "04. Fraidy Cat_scene024.mp4": "一只棕色的小老鼠走到一个水龙头前，它用前爪抓住水龙头的把手，用力转动，然后开心地坐在水龙头上，似乎在享受这个过程。",
    "04. Fraidy Cat_scene025.mp4": "一只黑猫趴在一辆车的引擎盖上，它用爪子按压引擎盖上的一个按钮，按钮随即喷出一股水柱和蒸汽，黑猫被喷出的水和蒸汽冲得向后退去。",
    "04. Fraidy Cat_scene026.mp4": "一只灰色的猫被一股强大的水流冲起，它在空中翻滚，溅起大量水花和泡沫，最终被水流冲走，画面只剩下水流和泡沫。",
    "04. Fraidy Cat_scene027.mp4": "一只灰色的猫在房间里奔跑，看起来非常着急。它跑到一扇门前，试图用爪子推开它，但门没有打开。猫的舌头伸出来，显得非常疲惫和沮丧。这时，一只小老鼠从桌子底下跑出来，它小心翼翼地穿过房间，躲过猫的视线，最终躲在了扫帚和簸箕后面。",
    "04. Fraidy Cat_scene028.mp4": "一只灰色的猫坐在房间里，看起来非常害怕。它的眼睛睁得很大，嘴巴张开，似乎在尖叫或惊恐。猫用前爪捂住眼睛，然后放下爪子，露出惊恐的表情。在猫的身后，有一个用白布盖住的物体，看起来像一个幽灵或鬼魂，增加了恐怖的氛围。房间的角落里有一把扫帚，背景是深色的墙壁和门。",
    "04. Fraidy Cat_scene029.mp4": "一只棕色的小老鼠从白色窗帘后探出头来，露出开心的笑容。它悄悄地爬到一个灰色的电器上，用爪子抓住一个白色的旋钮，转动它。在转动过程中，小老鼠显得非常兴奋和得意。",
    "04. Fraidy Cat_scene031.mp4": "一只棕色的小老鼠从窗帘后面探出头来，它兴奋地跳跃着，然后跑向一个桌子，桌子上有一个蓝色的台灯和一个装有水的玻璃瓶。小老鼠爬上瓶子，用尾巴勾住瓶口，然后被瓶中的水喷出，最后被水喷得四处飞溅。",
    "04. Fraidy Cat_scene032.mp4": "一只灰色的猫躺在地毯上，突然被一股水流冲击，水花四溅。猫被冲得坐起，浑身湿透，表情痛苦。它试图甩掉身上的水，但水从它的鼻子和嘴巴里喷出，显得非常狼狈。猫的表情从痛苦转为困惑和无奈，最后它坐直身体，张大嘴巴，似乎在抱怨或惊讶。",
    "04. Fraidy Cat_scene033.mp4": "一只棕色的小老鼠在蓝色的沙发扶手上蹦跳，它用前爪抓住沙发扶手上的一个白色把手，然后用力拉扯，似乎在试图打开或移动它。背景中可以看到白色的窗帘和绿色的扫帚。",
    "04. Fraidy Cat_scene034.mp4": "一只灰色的猫坐在红色地毯上，表情从惊讶逐渐变为恐惧和惊慌，它张大嘴巴，身体颤抖，似乎被某种突如其来的危险吓到了。",
    "04. Fraidy Cat_scene035.mp4": "一个穿着白色鬼魂服装的角色在房间里走动，突然，一只猫从门后跳出来，被鬼魂吓到，猫尖叫着逃跑，但鬼魂继续走动，猫最终被吓得倒在地上。",
    "04. Fraidy Cat_scene037.mp4": "一个蓝色的幽灵猫从地板上伸展身体，逐渐站起，然后向前伸展手臂，似乎在拉扯什么东西。背景中有一个穿着白色长袍的人物和一个木制柜子。",
    "04. Fraidy Cat_scene038.mp4": "一只灰色的猫从门后探出头，随后被一串蓝色的、标有数字的猫影子拖拽着向前移动，最终停留在窗边。",
    "04. Fraidy Cat_scene039.mp4": "汤姆被一个蓝色的幽灵猫追赶，他慌张地逃跑，最终撞到门上。幽灵猫消失后，汤姆坐在地上，表情从惊恐变为得意，然后又变得沮丧，最后他站起来，转身离开。",
    "04. Fraidy Cat_scene040.mp4": "一只小老鼠站在一个蓝色的鞋油瓶上，瓶子被白色的布料遮盖。小老鼠在瓶上四处张望，似乎在寻找什么。",
    "04. Fraidy Cat_scene041.mp4": "一只小老鼠站在吸尘器上，用爪子拨弄吸尘器的开关，随后一只大猫出现，注视着小老鼠，小老鼠继续拨弄开关，大猫则露出微笑。",
    "04. Fraidy Cat_scene043.mp4": "一只棕色的小老鼠从一个蓝色的机器中探出头来，它四处张望，然后用爪子拨弄机器上的一个开关。接着，白色的布帘从机器中滑出，遮住了小老鼠，最后布帘被拉回，露出小老鼠被包裹在布帘里的样子。",
    "04. Fraidy Cat_scene044.mp4": "一只灰色的猫，眼睛是黄色的，表情显得得意洋洋，背景是深绿色。",
    "04. Fraidy Cat_scene045.mp4": "一只小猫从白色布帘后探出头，表情从紧张变为得意，随后用爪子拨弄布帘并做出挑衅手势。",
    "04. Fraidy Cat_scene046.mp4": "动画片中的猫汤姆，表情从得意逐渐转变为狰狞，张开嘴露出尖牙，爪子张开，似乎准备攻击或威胁。背景为深绿色。",
    "04. Fraidy Cat_scene047.mp4": "杰瑞从吸尘器里探出头，被吸进去后，汤姆猫从吸尘器后面出现，露出得意的笑容。",
    "04. Fraidy Cat_scene048.mp4": "一只小老鼠在昏暗的房间里沿着墙边奔跑，经过一把红色扶手椅、一张圆桌和一把绿色扶手椅。",
    "04. Fraidy Cat_scene049.mp4": "一只灰色的猫在房间里奔跑，突然停下，看到一个披着白布的物体，它惊讶地张大嘴巴，然后试图抓住白布，结果发现里面藏着一只老鼠。",
    "04. Fraidy Cat_scene050.mp4": "一只棕色的小老鼠在钢琴上玩耍，它先是张开双臂，然后缩回身体，最后从钢琴上跳了下来。",
    "04. Fraidy Cat_scene051.mp4": "一只小老鼠在钢琴上跳舞，突然一只大猫出现，小老鼠吓得跳下钢琴逃跑。",
    "04. Fraidy Cat_scene052.mp4": "一只小老鼠跳到钢琴的黄铜制踏板上，踏板随之旋转，小老鼠被甩出。随后，一只猫从钢琴上方扑下，抓住踏板并用力踩踏，踏板在猫的踩踏下剧烈旋转。",
    "04. Fraidy Cat_scene053.mp4": "一个穿着白色衣服、脚穿蓝色拖鞋的角色，手持擀面杖，从门后慢慢探出身体，随后小心翼翼地关门并蹑手蹑脚地走开。角色动作缓慢，似乎在模仿小偷的步态。画面中出现字幕：“你这...声音听起来就像小偷，听起来慢悠悠的。”",
    "04. Fraidy Cat_scene054.mp4": "一只棕色的小老鼠在室内地板上奔跑，它跑向一个木制梯子，然后爬上梯子。",
    "04. Fraidy Cat_scene055.mp4": "一只老鼠从糖罐旁边跳到面粉罐上，面粉罐盖子打开，面粉洒出。",
    "04. Fraidy Cat_scene056.mp4": "一只灰色的猫在房间里奔跑，然后停下来看着一个木制的搓衣板，显得很生气。它用爪子拍打地面，然后转身跑开。",
    "04. Fraidy Cat_scene057.mp4": "一个穿着白色睡衣、脚穿蓝色拖鞋的角色，手持擀面杖，在房间里缓慢行走。他一边走一边说话，字幕显示他在警告某人，如果再惹他生气，他就离开。角色的步态沉重，似乎心情不悦，房间内光线昏暗，背景中可以看到家具轮廓。",
    "04. Fraidy Cat_scene058.mp4": "在绿色的昏暗房间里，汤姆猫从墙角探出头，小心翼翼地观察四周。它先是紧张地四处张望，随后突然大笑起来，接着又迅速躲回墙角，继续警惕地观察着。",
    "04. Fraidy Cat_scene059.mp4": "一个白色的幽灵状物体在昏暗的房间里缓慢移动，它从门框后探出，逐渐向前爬行，周围环境阴森，光线昏暗，营造出恐怖氛围。",
    "04. Fraidy Cat_scene060.mp4": "一只灰色的猫悄悄地从墙角探出头，然后迅速爬到桌子底下，躲在桌腿后面，表情得意地露出牙齿，似乎在等待猎物出现。",
    "04. Fraidy Cat_scene061.mp4": "一只灰色的猫从背后抱住一个穿着白色长袍的人，猫张大嘴巴露出牙齿，似乎在大声叫喊或咆哮。",
    "04. Fraidy Cat_scene063.mp4": "视频展示了一个洞口，先是冒出烟雾，随后一只白色小老鼠从洞中探出头来，观察四周。画面最后逐渐变暗，出现“The End”字样。",
    "04. Fraidy Cat_scene064.mp4": "视频展示了“THE END”字样，随后逐渐显现“An MGM Tom and Jerry Cartoon”和“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。",
    "04. Fraidy Cat_scene065.mp4": "视频开始时显示了“An MGM Tom and Jerry Cartoon”标题，背景为红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑，持续数秒。整个视频片段仅包含片头标题和黑屏，没有其他视觉内容。"
}