{
    "E113.Robin.Hoodwinked_scene001.mp4": "画面从全黑开始，逐渐出现米高梅卡通片头标志，标志中央是一只咆哮的狮子，上方写着“A METRO-GOLDWYN-MAYER”，下方是“CARTOON”字样，再下方是“COLOR BY TECHNICOLOR”。背景为深蓝色。",
    "E113.Robin.Hoodwinked_scene002.mp4": "视频展示了米高梅动画公司的标志，背景为深蓝色，中央是一个咆哮的狮子图案，周围环绕着“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样。随后画面转黑，接着出现“TOM and JERRY”的标题画面，左侧是猫汤姆的图案，右侧是老鼠杰瑞的图案，中间是装饰性的标题文字。",
    "E113.Robin.Hoodwinked_scene003.mp4": "视频展示了《猫和老鼠》的标题画面，左侧是猫汤姆，右侧是老鼠杰瑞，中间是标题“TOM and JERRY”。随后，画面中出现了“Robin Hoodwinked”和“CineScope”的字样。",
    "E113.Robin.Hoodwinked_scene004.mp4": "这是一个动画片的片头，标题为“Robin Hoodwinked”，采用CinemaScope格式。片头展示了制作人员名单，包括动画师Kenneth Muse、Carlo Vinci、Lewis Marshall和James Escalante，布局师Dick Bickenbach，背景师Robert Gentle，音乐师Scott Bradley。片尾注明由William Hanna和Joseph Barbera制作和导演。背景为紫色，文字为黄色和蓝色。",
    "E113.Robin.Hoodwinked_scene005.mp4": "视频开始时显示了“Produced and Directed by William Hanna and Joseph Barbera”的字样，随后切换到“Sherwood Forest”的标题，背景是茂密的森林。镜头逐渐向右平移，展示了一棵巨大的树，树干粗壮，树皮粗糙。随着镜头继续移动，可以看到森林深处有一群人影聚集，他们似乎在进行某种活动或集会，背景中树木高大，阳光透过树叶洒下斑驳的光影，营造出一种神秘而宁静的氛围。",
    "E113.Robin.Hoodwinked_scene006.mp4": "视频开始时，画面展示的是两个剪影人物站在森林中，背景是绿色和黄色的色调，营造出一种神秘的氛围。随着镜头逐渐拉近，可以看到一个穿着盔甲的战士和一个戴着帽子的人，他们似乎在交谈或准备进行某种行动。随后，镜头切换到森林的另一部分，画面中出现了两只老鼠，一只灰色，一只棕色，它们都戴着帽子，手里拿着弓箭，正在森林中行走。灰色老鼠看起来有些紧张，而棕色老鼠则显得比较自信。两只老鼠似乎在讨论或计划着什么，可能与前面的剪影人物有关。整个场景充满了冒险和神秘的氛围，暗示着即将发生的故事或事件。",
    "E113.Robin.Hoodwinked_scene008.mp4": "视频展示了一支身穿盔甲、手持长矛的士兵队伍，背景是一座城堡。镜头逐渐向上移动，聚焦于城堡的墙壁。随后，两只穿着绿色帽子、戴着红色羽毛的小老鼠出现在城堡墙上，其中一只老鼠用绳子滑下城墙，另一只老鼠则紧随其后，也滑下城墙。两只老鼠滑下后，画面中只剩下空荡荡的城墙和城堡结构。",
    "E113.Robin.Hoodwinked_scene009.mp4": "一只戴着绿色帽子、红色羽毛的棕色小老鼠正在一根绳子上攀爬，背景是蓝色的墙壁。它爬到绳子的顶端时，另一只灰色的小老鼠从上方跳下来，爬到了棕色小老鼠的头上。两只小老鼠在绳子上对视，然后镜头切换到地面，两只小老鼠站在地上，手里拿着弓箭，似乎在准备进行某种冒险或战斗。",
    "E113.Robin.Hoodwinked_scene010.mp4": "视频展示了一个城堡内部的场景，画面中央是一扇木门，门两侧各有一把椅子。镜头向左移动，聚焦于一个挂在木梁上的金色钥匙，随后一支箭射向钥匙，箭头绑着一根绳子。接着，一只戴着蓝色帽子的灰色猫从右侧探出头来，表情紧张地注视着钥匙和箭。",
    "E113.Robin.Hoodwinked_scene011.mp4": "两只穿着帽子的小老鼠在高处的绳索上行走，一只灰色小老鼠先走，随后棕色小老鼠也踏上绳索，两人在绳索上保持平衡，棕色小老鼠在绳索上走了一段后消失在画面中。",
    "E113.Robin.Hoodwinked_scene012.mp4": "两只穿着帽子的小老鼠在绳子上行走，后面出现猫，猫用钥匙挡住小老鼠，小老鼠被钥匙弹飞。",
    "E113.Robin.Hoodwinked_scene013.mp4": "两只戴着帽子的小老鼠在一根绳子上奔跑，其中一只拿着一把大钥匙。它们跑过时，一只穿着盔甲的猫从侧面出现，猫用绳子将小老鼠们拉住，导致它们从绳子上掉落。",
    "E113.Robin.Hoodwinked_scene014.mp4": "两只戴着绿色帽子、帽子上有红色羽毛的老鼠正在一起拖动一把巨大的黄色钥匙。它们沿着一条深色的地面奔跑，背景是石墙和一个木桶。棕色老鼠握着钥匙的柄，灰色老鼠则在钥匙的另一端拉拽。它们看起来很努力，似乎在完成一项重要的任务。",
    "E113.Robin.Hoodwinked_scene015.mp4": "视频中，戴着蓝色头盔的猫汤姆躲在桌子后面，露出邪恶的笑容。两只小老鼠分别拿着一把黄色的钥匙，从桌子下方爬出来，与汤姆对峙。汤姆被钥匙吸引，试图抢夺钥匙，但被小老鼠们巧妙地用钥匙撬开他的牙齿，导致汤姆的牙齿脱落。小老鼠们用钥匙撬开汤姆的牙齿后，汤姆痛苦地倒在地上，小老鼠们则得意地跑开。汤姆愤怒地追击，但小老鼠们已经逃之夭夭。",
    "E113.Robin.Hoodwinked_scene016.mp4": "两只老鼠，一只棕色，一只灰色，戴着帽子，拿着一把大钥匙，从石阶上跑下来，然后跑到一扇木门前，试图用钥匙开门。",
    "E113.Robin.Hoodwinked_scene017.mp4": "两只穿着帽子的小老鼠正在合力推动一个黄色的木制工具，试图打开一个木箱的锁。它们用力推着工具，最终成功将锁打开，箱子内部的蓝色物体和金色球体随之显现。",
    "E113.Robin.Hoodwinked_scene018.mp4": "汤姆猫手持一把蓝色斧头，正用力地试图劈开一个木箱。斧头的红色手柄紧握在汤姆的手中，他表情专注，眼睛紧盯着斧头与木箱接触的地方。木箱的木质纹理清晰可见，上面有一个金属把手和一个锁扣。斧头劈向木箱时，木屑飞溅，显示出劈砍的力量。背景是木质的墙壁，整体画面呈现出经典的卡通风格。",
    "E113.Robin.Hoodwinked_scene019.mp4": "两只穿着帽子的老鼠在木板下用一把大钥匙玩跷跷板，棕色老鼠被翘起时撞到了一把大镰刀，吓得张大嘴巴尖叫。",
    "E113.Robin.Hoodwinked_scene020.mp4": "一只戴着绿色帽子、红色羽毛的灰色老鼠，正用前爪紧紧抓住一把巨大的黄色钥匙，从画面左侧向右奔跑。突然，一把巨大的蓝色斧头从画面左侧出现，斧头的锋利边缘与老鼠的尾巴相撞，老鼠被击飞出去，最终消失在画面右侧。",
    "E113.Robin.Hoodwinked_scene021.mp4": "汤姆猫戴着蓝色帽子，穿着黄色上衣，手里拿着一把金色钥匙，先是展示钥匙，然后张大嘴巴似乎在喊叫，接着握拳并做出得意的表情。",
    "E113.Robin.Hoodwinked_scene022.mp4": "视频中，一只小老鼠戴着帽子躺在地上，另一只小老鼠跑过来与它互动。随后，一只穿着黄色衣服的猫出现，手持蓝色锤子，用力敲击地面，似乎在挖掘或寻找什么。猫的表情从专注变为兴奋，最终成功敲开地面，露出一个洞。",
    "E113.Robin.Hoodwinked_scene023.mp4": "一只手提起一块蓝色布料，布料下露出两只戴着绿色帽子、长着红色角的卡通老鼠，它们在蓝色的地面上来回走动。",
    "E113.Robin.Hoodwinked_scene024.mp4": "汤姆猫穿着黄色衣服，正在操作一个蓝色的盖子，盖子打开后，他看到几只老鼠从洞里跑出来。汤姆猫露出惊讶的表情，随后盖上盖子，脸上露出得意的笑容。接着，画面变暗，汤姆猫躺在一张红色的躺椅上打盹，打了个大大的哈欠。最后，镜头聚焦在蓝色的盖子上，盖子被打开，露出里面的一条蛇。",
    "E113.Robin.Hoodwinked_scene025.mp4": "视频开始时，镜头聚焦在一个灰色的金属装置上，装置顶部有一个圆形盖子。盖子缓缓打开，露出一只戴着绿色帽子、身穿橙色衣服的小老鼠，它正从装置中探出头来，眼睛睁得大大的，显得十分警觉。随后，镜头切换到一个木制横梁上，两只穿着相同服饰的小老鼠（一只棕色，一只灰色）正小心翼翼地沿着横梁行走，背景是蓝色的拱形结构，营造出一种紧张而神秘的氛围。",
    "E113.Robin.Hoodwinked_scene026.mp4": "两只穿着绿色帽子、红色羽毛装饰的小老鼠站在木板上。灰色小老鼠拿着绳子，兴奋地跳着舞，然后被绳子缠住，最终被棕色小老鼠拉着绳子，从木板上被拉走。棕色小老鼠独自留在木板上，握着绳子，表情从得意变为惊讶。",
    "E113.Robin.Hoodwinked_scene027.mp4": "一只猫躺在地上张大嘴巴，一只戴着绿色帽子的小老鼠从上方跳下，站在猫的嘴上，然后滑进猫的嘴里，最后猫的嘴闭上，老鼠被卡在猫的嘴里。",
    "E113.Robin.Hoodwinked_scene028.mp4": "一只戴着绿色帽子、帽子上有红色羽毛的小老鼠被一根绳子吊在空中，背景是红色的。小老鼠先是左右摇晃，然后看到一把巨大的黄色钥匙从上方出现，它试图抓住绳子，但被钥匙挡住。小老鼠表现出惊讶和困惑的表情，最后它被钥匙压住，显得有些无助。",
    "E113.Robin.Hoodwinked_scene029.mp4": "一只戴着绿色帽子、红色羽毛的棕色老鼠正站在一个深色的平台上，双手紧握一根绳子，身体微微前倾，似乎在用力拉扯或攀爬。老鼠的表情专注而坚定，眼睛时而闭上，时而睁开，显示出它在努力克服某种阻力。背景是蓝色的，带有弧形的纹理，给人一种洞穴或隧道的感觉。老鼠的动作连贯，绳子随着它的动作上下摆动，显示出它在持续用力。",
    "E113.Robin.Hoodwinked_scene030.mp4": "一只戴着绿色帽子和红色围巾的老鼠倒挂在一根绳子上，它正抓着一把巨大的黄色钥匙。老鼠在钥匙上移动，从钥匙的齿部滑到钥匙柄部，然后又滑回齿部。背景是红色的幕布。",
    "E113.Robin.Hoodwinked_scene031.mp4": "一只灰色的猫躺在地上，嘴巴张开，一根绳子从上方垂下，绳子末端挂着一只小老鼠，老鼠嘴里叼着一把金色的钥匙。随着绳子慢慢上升，老鼠和钥匙逐渐离开猫的嘴，猫的嘴巴也随之闭合。",
    "E113.Robin.Hoodwinked_scene032.mp4": "一只戴着绿色帽子、帽子上插着红色羽毛的老鼠，正站在一个深色的表面上，用前爪抓着一根细长的绳子。它先是用爪子紧紧抓住绳子，然后慢慢向下拉，绳子末端在地面上产生了一些白色的痕迹，接着老鼠继续拉绳子，绳子末端在地面上留下了一个黑色的痕迹，最后老鼠松开绳子，绳子垂在地面上。背景是蓝色的墙壁。",
    "E113.Robin.Hoodwinked_scene033.mp4": "一只穿着黄色T恤的灰色猫（汤姆）躺在椅子上打哈欠，随后被一个从上方掉落的钥匙串惊醒，他惊慌地坐起，表情从惊讶变为愤怒，最后又恢复平静。背景是一面砖墙和一张桌子。",
    "E113.Robin.Hoodwinked_scene034.mp4": "一只戴着绿色帽子、红色羽毛的小老鼠在红色背景中与一把巨大的黄色钥匙互动。小老鼠先是坐在钥匙上，然后被钥匙甩来甩去，最后被甩到地面，看起来有些狼狈。整个场景充满卡通风格的夸张和幽默。",
    "E113.Robin.Hoodwinked_scene035.mp4": "汤姆猫坐在一张桌子旁，他拿起一个大木桶，然后将桶举到嘴边，大口大口地喝水，水从他的嘴边流下来。",
    "E113.Robin.Hoodwinked_scene036.mp4": "一只戴着绿色帽子、穿着白色尿布的老鼠，正坐在一把黄色的大钥匙上。它在红色的漩涡中被卷起，随后被甩出画面，钥匙也随水流漂走。",
    "E113.Robin.Hoodwinked_scene037.mp4": "汤姆猫穿着黄色上衣和棕色腰带，坐在红色椅子上，手里拿着一个木制水壶。他先是将水壶举到嘴边，然后放下水壶，靠在椅子上，双脚搭在桌子上，闭上眼睛，张大嘴巴打了个大大的哈欠，显得非常放松和困倦。背景是蓝色的砖墙，整个场景显得宁静而悠闲。",
    "E113.Robin.Hoodwinked_scene038.mp4": "视频展示了一只戴着绿色帽子、穿着白色尿布的老鼠，它从一个红色的洞穴中爬出，手里拿着一把巨大的黄色钥匙。老鼠兴奋地挥舞着钥匙，然后小心翼翼地将其竖立起来，似乎在展示它的发现。整个场景充满卡通风格，色彩鲜艳，老鼠的表情和动作充满了活力和喜悦。",
    "E113.Robin.Hoodwinked_scene039.mp4": "一只小老鼠戴着绿色帽子，拿着一把黄色的大钥匙，从一只张大嘴巴的灰色大猫的嘴里爬出来。小老鼠在猫的嘴里来回移动，猫的表情从惊讶变为愤怒，露出尖锐的牙齿。背景是蓝色的瓷砖墙。",
    "E113.Robin.Hoodwinked_scene040.mp4": "一只戴着绿色帽子、帽上有红色羽毛的灰色老鼠，正拿着一把巨大的黄色钥匙在红色的洞穴内行走。它表情得意，步伐轻快，似乎对这把钥匙充满信心，正朝洞穴深处走去。洞穴顶部有灰色的岩石结构，背景为红色，营造出一种神秘而紧张的氛围。",
    "E113.Robin.Hoodwinked_scene041.mp4": "一只灰猫露出狰狞的笑容，随后一只小老鼠拿着一把大钥匙从它面前飞过，猫张大嘴巴试图咬住钥匙，但最终只咬到一小块纸片。",
    "E113.Robin.Hoodwinked_scene042.mp4": "汤姆穿着黄色上衣，从桌子后方跑出，表情愤怒。他摔倒在桌子上，随后爬起，发现杰瑞正骑在一把大钥匙上，杰瑞戴着绿色帽子，帽子上有一根红色羽毛。汤姆愤怒地盯着杰瑞。",
    "E113.Robin.Hoodwinked_scene043.mp4": "一只戴着绿色帽子、红色羽毛的棕色老鼠，正用一根绳子拉着一个蓝色的带刺球体，在石墙和木制结构之间滑行。老鼠表情专注，身体前倾，尾巴在空中摆动，似乎在进行某种冒险或逃脱。背景是昏暗的石墙和一些尖锐的金属尖刺。",
    "E113.Robin.Hoodwinked_scene044.mp4": "猫汤姆穿着黄色衣服，手里拿着一把大钥匙，钥匙上坐着一只戴着绿色帽子的小老鼠杰瑞。突然，另一只棕色老鼠从上方用弓箭射来，击中了汤姆的头部，汤姆被打得晕头转向。杰瑞趁机从钥匙上跳下，迅速跑开，而汤姆则呆立原地，目送杰瑞逃走。",
    "E113.Robin.Hoodwinked_scene045.mp4": "两只穿着冒险服装的老鼠正在攀爬一座城堡的墙壁。一只棕色的老鼠用绳子吊在墙上，另一只灰色的老鼠则拿着一把大钥匙试图打开一扇门。在攀爬过程中，灰色的老鼠不小心碰到了墙上的武器，导致武器掉落。",
    "E113.Robin.Hoodwinked_scene046.mp4": "一只灰色的猫从窗户后面探出头来，表情惊讶。随后，一个老鼠用绳子吊着一把铲子砸向猫的头部，猫被击中后表情痛苦，铲子卡在它的头上。猫试图摆脱铲子，但铲子仍然卡在它的头上，猫的表情变得愤怒和不满。",
    "E113.Robin.Hoodwinked_scene047.mp4": "在一个石砌的房间内，有一扇木门，门旁挂着铁链和一个木凳。汤姆猫穿着黄色上衣和红色腰带，从门后跑出来，他先是惊讶地张开双臂，然后转身背对镜头，接着又转回来，用前爪拿起一个棕色的望远镜，凑到眼前观察，表情专注。",
    "E113.Robin.Hoodwinked_scene048.mp4": "在深蓝色的夜空中，几支箭矢飞过。一个戴着帽子、穿着长衣的人物从城堡的垛口上跳下，身体在空中翻转，最终倒挂下来。",
    "E113.Robin.Hoodwinked_scene049.mp4": "一个物体落入水中，激起水花并形成涟漪，随后水花逐渐消散，水面恢复平静。",
    "E113.Robin.Hoodwinked_scene050.mp4": "两只戴着绿色帽子、红色羽毛的小老鼠站在高处，面对飞来的箭矢。灰色老鼠挥舞帽子试图躲避，最终被箭射中并飞出画面，棕色老鼠则留在原地，表情惊恐。",
    "E113.Robin.Hoodwinked_scene052.mp4": "视频展示了M·G·M卡通的片头，背景为深蓝色，中央有“M·G·M CARTOON”字样，上方有“an”字样，下方有“made in Hollywood, U·S·A.”字样。随后画面转为全黑。"
}