{
    "17. Mouse Trouble_scene001.mp4": "视频开始时显示一个黑色背景，底部有一串数字“0110544170204083”。随后，画面逐渐淡入，出现米高梅动画公司的标志，标志中央是一只咆哮的狮子，周围环绕着“Metro Goldwyn Mayer”和“CARTOON”字样。狮子咆哮后逐渐安静下来，标志逐渐淡出。最后，画面再次变黑，然后淡入“TOM and JERRY”的标题画面，背景为红色渐变，上方是汤姆猫的头部，下方是杰瑞鼠的形象。",
    "17. Mouse Trouble_scene002.mp4": "视频展示了经典动画《猫和老鼠》的片头，画面中央是猫汤姆和老鼠杰瑞的卡通形象，背景为红色渐变圆形图案，下方有黄色的“TOM and JERRY”字样。随后出现标题“MOUSE TROUBLE”以及导演“WILLIAM HANNA and JOSEPH BARBERA”的名字。",
    "17. Mouse Trouble_scene003.mp4": "视频展示了动画片《Mouse Trouble》的片头，包括标题、导演威廉·汉纳和约瑟夫·巴伯拉的名字，以及动画师、音乐制作人和制片人等制作团队成员的名单。最后，画面逐渐变暗，过渡到下一个场景。",
    "17. Mouse Trouble_scene004.mp4": "一个人将一封信放入红色邮箱，随后一只猫（汤姆）跑来，从邮箱中取出信件，兴奋地抱着信件跑开。",
    "17. Mouse Trouble_scene005.mp4": "一只灰色的猫坐在地上，兴奋地撕开一个包裹，露出里面的一本书。它开心地捧起书，周围散落着撕碎的纸片。背景是室内，有窗帘和花盆。",
    "17. Mouse Trouble_scene006.mp4": "视频展示了一本名为《如何抓老鼠》的书，封面是蓝色的，书名和副标题用黄色背景突出显示。书被一双白色的手拿着，随后翻开了第一页，显示第一章标题“首先——找到老鼠”，并附有英文原文和中文翻译，内容提到老鼠通常藏在地板或储藏室，有时比想象中更近。",
    "17. Mouse Trouble_scene007.mp4": "汤姆猫躺在地上，双手托着下巴，看着面前的书本。杰瑞鼠从书本中爬出来，汤姆猫看到后，表情变得凶狠，准备扑向杰瑞鼠。杰瑞鼠迅速爬到书本的另一边，汤姆猫则趴在书本上，露出得意的笑容。",
    "17. Mouse Trouble_scene008.mp4": "一只小老鼠从一本巨大的书后探出头来，书的后面有一只黑猫，黑猫正用爪子按住书，试图抓住小老鼠。小老鼠看到黑猫后，迅速跑开，黑猫则继续追击。",
    "17. Mouse Trouble_scene009.mp4": "一只老鼠从洞里跑出来，猫拿着书跳过来，猫用书挡住老鼠，然后猫开始看书。",
    "17. Mouse Trouble_scene010.mp4": "视频展示了一只猫（汤姆）设置捕鼠夹的情景。首先，画面显示一本打开的书，书页上写着“CHAPTER II NEXT...Try the simple mouse trap.”，并配有一幅老鼠被夹住的插图。接着，汤姆拿着一根羽毛和一块奶酪，将它们放在捕鼠夹上，试图引诱老鼠。他兴奋地等待，但老鼠并未出现。最后，汤姆蹲在捕鼠夹旁，显得有些失望和焦虑，他四处张望，似乎在寻找老鼠的踪迹。",
    "17. Mouse Trouble_scene011.mp4": "一只老鼠从洞里出来，看到一个捕鼠夹，上面放着一块奶酪。它小心翼翼地靠近，试图吃奶酪，但每次靠近都会触发捕鼠夹。老鼠被夹住后，它挣扎着，最终成功逃脱并跳回洞里。",
    "17. Mouse Trouble_scene012.mp4": "一只灰色的猫从墙后探出头，观察地上的捕鼠器。它小心翼翼地靠近，用爪子拿起捕鼠器，然后突然被夹住，发出痛苦的叫声并被弹飞。",
    "17. Mouse Trouble_scene013.mp4": "一只黑猫在房间里被书本上的陷阱图案吓到，随后画面变黑，接着出现书本的标题“CHAPTER III A Snare Trap never fails..”，配图是一只老鼠被陷阱捕捉。",
    "17. Mouse Trouble_scene014.mp4": "视频开始展示了一本书的页面，标题为“CHAPTER III A Snare Trap never fails..”，并配有插图，描绘了一只老鼠被绳子牵引，靠近一块奶酪。接着，画面切换到一个户外场景，显示一棵树和一个车库，绳子从树上延伸到房屋。随后，镜头进入室内，展示了一只猫（汤姆）正在拉扯绳子，试图获取奶酪。猫表现出兴奋和期待的表情，最终成功拉近了奶酪。",
    "17. Mouse Trouble_scene015.mp4": "一只老鼠从洞里爬出，拖着一块奶酪，经过一个装满奶油的碗，然后跑回洞里。",
    "17. Mouse Trouble_scene016.mp4": "一只灰猫躲在窗帘后面，手里拿着一根黄色的绳子，眼睛盯着前方。它突然从窗帘后跳出来，张大嘴巴，舌头伸出，口水滴落，然后又猛地跳开，消失在画面中。",
    "17. Mouse Trouble_scene017.mp4": "汤姆猫正在吃一碗奶油，杰瑞鼠出现并拉扯绳子，导致汤姆被绊倒，奶油洒了一地。",
    "17. Mouse Trouble_scene018.mp4": "一只黑猫在一根绑在树枝上的绳子上滑行，它试图抓住树枝但失败了，最终被绳子拉得在空中翻滚。",
    "17. Mouse Trouble_scene021.mp4": "一只棕色的小老鼠从墙角的洞里探出头来，小心翼翼地观察四周，然后迅速跑了出来。",
    "17. Mouse Trouble_scene022.mp4": "一只灰色的猫躺在地上，面前放着一本打开的书，它张大嘴巴，似乎在打哈欠或大笑。一只棕色的小老鼠从画面左侧出现，它小心翼翼地靠近猫，猫则继续躺着，没有理会老鼠。随后，猫开始翻动书页，老鼠则继续靠近，猫突然翻身，露出肚子，继续大笑。老鼠则绕着猫跑动，猫则继续躺着，没有理会老鼠。",
    "17. Mouse Trouble_scene023.mp4": "一只猫躺在地上，看着一本打开的书，一只老鼠站在书旁边。猫突然大笑，然后把书合上，抱在怀里。老鼠试图靠近猫，猫转过身，把书放在地上，然后躺下，老鼠爬到猫的背上。猫再次大笑，老鼠则在猫背上开心地跳跃。",
    "17. Mouse Trouble_scene024.mp4": "一只黑猫坐在地上，面前放着一本打开的书，它开心地笑着，眼睛闪烁着兴奋的光芒。突然，一只小老鼠从书页间跳出来，站在书上，与黑猫对视。黑猫的表情从喜悦转为惊讶，接着它迅速合上书本，把书紧紧抱在怀里，脸上露出得意的笑容，似乎在享受这个小小的惊喜。",
    "17. Mouse Trouble_scene025.mp4": "视频中，一只灰色的猫（汤姆）正抱着一只棕色的小老鼠（杰瑞）。汤姆先是露出得意的笑容，随后表情变得严肃，似乎在与小老鼠进行互动。小老鼠则显得有些紧张和不安，它试图挣脱汤姆的怀抱，最终成功逃脱并飞向画面外，而汤姆则表现出惊讶和懊恼的表情。整个场景充满了幽默和紧张的氛围，展现了经典动画中猫鼠之间的追逐和互动。",
    "17. Mouse Trouble_scene026.mp4": "一只小老鼠从窗帘后跑出来，被猫汤姆发现。汤姆抱着一本书，愤怒地追击小老鼠。",
    "17. Mouse Trouble_scene027.mp4": "一只棕色的小老鼠站在房间的角落里，双臂张开，表情紧张，似乎在躲避什么。房间内有一张木质桌子，桌上放着一盏绿色灯罩的台灯，地面铺着红色地毯。",
    "17. Mouse Trouble_scene028.mp4": "汤姆猫在房间里，用前爪抱着一本打开的书，低头专注阅读。背景中有一张小木桌，桌上放着一盆黄色花朵的花瓶，旁边是绿色带花纹的沙发和粉红色窗帘。",
    "17. Mouse Trouble_scene029.mp4": "视频展示了一本打开的书，书页上写着“CHAPTER V A Cornered Mouse NEVER FIGHTS”，下方有中文字幕“第五章 被逼到绝境的老鼠不会斗争”。画面中有一只手握着书的边缘。",
    "17. Mouse Trouble_scene030.mp4": "汤姆猫在阅读一本名为《如何制服一只老鼠》的书时，突然被书中的内容激怒，扔掉了书并冲出房间。随后，一只受伤的猫从门后探出头来，警告汤姆不要相信书中的内容。",
    "17. Mouse Trouble_scene031.mp4": "一只黑猫从门后探出头，表情凶狠，随后画面变黑，接着出现一本书的页面，标题为“CHAPTER VII Be Scientific in your approach..”。",
    "17. Mouse Trouble_scene032.mp4": "视频展示了一本打开的书，书页上写着“CHAPTER VII Be Scientific in your approach..”，随后出现中文翻译“第七章 要接近科学”。接着，画面中出现一只猫，它戴着听诊器，似乎在进行科学实验或检查。",
    "17. Mouse Trouble_scene033.mp4": "汤姆猫戴着听诊器，表情紧张地在地板上爬行，似乎在寻找或监听什么。",
    "17. Mouse Trouble_scene034.mp4": "一只老鼠从洞里探出头，手里拿着一块奶酪。一只猫拿着听诊器从右侧走来，靠近老鼠并用听诊器听老鼠的心跳。老鼠显得很紧张，而猫则显得很专注。",
    "17. Mouse Trouble_scene035.mp4": "汤姆猫戴着听诊器，表情惊讶地看着杰瑞鼠。杰瑞鼠抱着一块奶酪，似乎在和汤姆猫互动。",
    "17. Mouse Trouble_scene036.mp4": "一只老鼠从墙洞中探出头，手里拿着一块奶酪，正与一只猫的爪子进行拉扯。猫的爪子紧紧抓住一个黑色的物体，可能是电话听筒。老鼠表情紧张，似乎在努力挣脱，而猫的爪子则牢牢地控制着这个物体。背景是简单的室内墙壁和地板。",
    "17. Mouse Trouble_scene037.mp4": "一只灰色的猫，戴着听诊器，表情惊讶，嘴巴微张，眼睛睁大，似乎在倾听什么。背景是单一的粉色。",
    "17. Mouse Trouble_scene038.mp4": "一只灰色的猫戴着听诊器，正在给一只躲在洞里的棕色老鼠听诊。猫的表情从惊讶变为愤怒，而老鼠则显得得意和挑衅。猫的听诊器在过程中被老鼠拉扯，猫的表情愈发愤怒。",
    "17. Mouse Trouble_scene039.mp4": "猫拿着听诊器，靠近洞口，听诊器贴在洞口，老鼠在洞里露出头，猫突然扑过去抓住老鼠。",
    "17. Mouse Trouble_scene040.mp4": "汤姆猫用听诊器听杰瑞鼠的心跳，杰瑞鼠被听诊器的耳塞夹住，发出痛苦的叫声，随后被听诊器的喇叭部分吹飞。",
    "17. Mouse Trouble_scene041.mp4": "一只灰色的猫被一根红色的管子缠住，管子连接着它的耳朵和尾巴，猫的表情从痛苦到愤怒再到得意，显示出它在努力挣脱束缚。",
    "17. Mouse Trouble_scene042.mp4": "一只棕色的小老鼠从墙角的洞里探出头来，突然被一只更大的老鼠从后面抓住并拖进洞里。小老鼠挣扎着试图逃脱，但最终被拖进了洞中，只留下洞口空荡荡的。",
    "17. Mouse Trouble_scene043.mp4": "汤姆猫拿着猎枪，瞄准墙上的洞，准备射击。他调整姿势，将枪口对准洞口，然后扣动扳机，枪口喷出火焰，汤姆猫露出得意的笑容。",
    "17. Mouse Trouble_scene044.mp4": "视频中，一只猫被枪指着，头上冒出烟，随后镜头切换到猫在房间内设置捕鼠夹，但老鼠从洞中跑出并触发了捕鼠夹，猫被夹住。",
    "17. Mouse Trouble_scene045.mp4": "汤姆猫从墙上摔下来，撞在地板上，墙皮随之剥落。",
    "17. Mouse Trouble_scene046.mp4": "视频开始时，一只猫从天花板的破洞中倒挂下来，身体不断晃动，随后画面切换到一个房间内，猫戴着红色帽子，手持木锤，正准备击打一只从洞中探出头来的老鼠。猫反复挥动木锤，但每次挥动都未能击中老鼠，老鼠则在洞口处灵活躲避。猫的表情从专注变为愤怒，最终木锤掉落在地上。",
    "17. Mouse Trouble_scene047.mp4": "一只猫拿着锤子，试图砸墙上的洞，但洞里有一只老鼠抓住了锤子柄，猫被老鼠拉得向上，猫的表情从愤怒变为惊讶，最后猫被拉得看不见了。",
    "17. Mouse Trouble_scene048.mp4": "画面中，一只小老鼠正被一个巨大的木锤压住，随后画面变黑，接着出现一本书的标题页，写着“CHAPTER IX SLIP HIM A SURPRISE PACKAGE”。",
    "17. Mouse Trouble_scene049.mp4": "视频开始展示了一本书的章节标题“CHAPTER IX SLIP HIM A SURPRISE PACKAGE”，随后画面切换到一个房间内，一只猫（汤姆）躲在一只装饰有蓝色丝带和蝴蝶结的白色礼物盒后面，猫从盒子里探出头，露出得意的表情，然后又迅速缩回盒子里。",
    "17. Mouse Trouble_scene050.mp4": "杰瑞从洞里探出头，观察四周，然后小心翼翼地走出洞穴，靠近一个大礼盒。它好奇地用爪子触摸礼盒上的蓝色丝带，似乎在思考如何打开它。杰瑞的表情从好奇转变为困惑，最后它用手挠了挠头，显得有些不知所措。",
    "17. Mouse Trouble_scene052.mp4": "一只受伤的猫坐在地上，周围散落着急救用品，它用爪子捂住脸，表情痛苦，随后翻开一本急救手册，似乎在寻找治疗方法。",
    "17. Mouse Trouble_scene053.mp4": "视频开始时，画面展示了一本书的标题页，写着“CHAPTER XII MICE ARE SUCKERS FOR DAMES”，并配有中文翻译“第十二章 老鼠们喜欢女人”。随后，镜头切换到一个场景，一只穿着黄色连衣裙、戴着蓝色蝴蝶结的白色小老鼠站在一个圆形底座上，她面带微笑，似乎在跳舞或表演。她的身后有一个洞口，一只棕色的小老鼠从洞口探出头来，表情显得有些惊讶和好奇。接着，棕色小老鼠完全从洞口出来，与白色小老鼠互动，看起来像是在跳舞或玩耍。两只老鼠的动作充满活力，背景是简单的粉红色墙壁和木质地板，整体氛围轻松愉快。",
    "17. Mouse Trouble_scene054.mp4": "汤姆猫举着一个标有“COZY ARMS”的纸板建筑模型，从模型后探出头，露出狡黠的笑容，随后从模型后方跳起。",
    "17. Mouse Trouble_scene055.mp4": "动画片中的猫汤姆张大嘴巴，露出尖牙，表情愤怒。它的毛发竖起，眼睛瞪大，似乎在咆哮或发怒。背景是室内环境，有门和窗帘。",
    "17. Mouse Trouble_scene056.mp4": "在“Cozy Arms”酒吧的门口，一只穿着黄色连衣裙、头戴蓝色蝴蝶结的白色小老鼠和一只棕色老鼠正在跳舞。棕色老鼠突然从酒吧里冲出来，把白色小老鼠撞倒在地，然后自己也摔倒了，散落的机械零件四散开来。棕色老鼠惊慌失措地站在原地，看着散落一地的零件。",
    "17. Mouse Trouble_scene058.mp4": "汤姆猫拿着一捆红色的鞭炮，准备放在杰瑞鼠的洞口。他小心翼翼地将鞭炮放在洞口，然后点燃引线，准备引爆。",
    "17. Mouse Trouble_scene059.mp4": "动画片中的猫汤姆在一个充满炸药的房间里，他点燃了一根引线，引线逐渐燃烧，汤姆紧张地观察着，最后引线燃尽，发生爆炸。",
    "17. Mouse Trouble_scene061.mp4": "视频展示了一个动画场景，画面中央是一座由书本堆叠而成的奇特建筑，顶部有一个拱形开口。起初，建筑周围烟雾缭绕，随后烟雾逐渐散去，露出建筑的细节。一只棕色的小动物从拱形开口中探出头来，表情显得好奇或警觉。接着，一只橙色的狐狸从右侧飞入画面，掠过建筑，最终落在建筑底部。小动物在拱形开口中注视着狐狸，狐狸似乎在与它互动。画面底部出现中文字幕：“要多点过来见面哦”。整个场景色彩鲜明，充满卡通风格。",
    "17. Mouse Trouble_scene062.mp4": "动画片中的汤姆猫穿着天使装扮，头戴光环，背后长着翅膀，坐在云朵上，手持竖琴，表情悲伤，似乎在唱歌或说话，字幕显示“要多点过来见面哦”和“多点见面...”，随后画面逐渐变暗，最后出现“The End”字样。",
    "17. Mouse Trouble_scene063.mp4": "视频展示了“Tom and Jerry”动画片的片尾画面，背景为红色，中央有“THE END”字样，随后出现“An M.G.M. Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”字样。",
    "17. Mouse Trouble_scene064.mp4": "视频开头显示了MGM的标志和“Tom and Jerry Cartoon”字样，背景为红色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑，持续数秒。"
}