{
    "E108.Mucho.Mouse_scene001.mp4": "视频展示了米高梅动画片的标志，背景为深蓝色，标志中央是米高梅的狮子头像，下方有“CARTOON”字样，以及“COLOR BY TECHNICOLOR”的文字。",
    "E108.Mucho.Mouse_scene002.mp4": "这是一个米高梅动画片头，蓝色背景上显示“METRO-GOLDWYN-MAYER”字样，中间是咆哮的狮子头像，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样。狮子头像在不断咆哮，嘴巴张合，表情生动。",
    "E108.Mucho.Mouse_scene003.mp4": "视频展示了米高梅卡通片头，随后切换到《猫和老鼠》的标题画面，左侧是猫汤姆，右侧是老鼠杰瑞，中间是作品名称。",
    "E108.Mucho.Mouse_scene004.mp4": "视频展示了《猫和老鼠》的标题画面，背景为蓝色，中间是“TOM and JERRY”的标志，两侧分别是汤姆猫和杰瑞鼠的卡通形象。随后画面过渡到带有文字的海报背景。",
    "E108.Mucho.Mouse_scene005.mp4": "视频展示了一面墙上的两张海报。左边的海报是黄色的，上面写着“MUCHO MOUSE IN CINEMASCOPE”，并有卡通猫的形象。右边的海报是关于马德里斗牛场的，描绘了一个斗牛士和一头斗牛。画面中还出现了制作人员的名单，包括动画师、布局师、背景画家和音乐家等。",
    "E108.Mucho.Mouse_scene006.mp4": "视频展示了动画片《猫和老鼠》的片尾字幕，列出了动画师、布局师、背景设计师和音乐制作人的名字，以及制作公司和版权信息。随后，画面切换到制作人和导演威廉·汉纳与约瑟夫·巴伯拉的名字，背景是城市广场的雕塑和建筑。",
    "E108.Mucho.Mouse_scene007.mp4": "视频开头显示“Produced and directed by William Hanna Joseph Barbera”的字样，背景是骑马雕像和城市景观。随后画面转为全黑，最后出现一座城市的远景，有道路、树木和建筑物。",
    "E108.Mucho.Mouse_scene009.mp4": "一只棕色的小老鼠从洞里探出头，然后走出洞外，沿着墙边走动。墙上有“El Magnifico”的字样。",
    "E108.Mucho.Mouse_scene010.mp4": "一只红色的猫坐在地毯上弹奏一把黄色的吉他，一只小老鼠从画面右侧出现，走到猫的脚边，然后拿着一块奶酪从猫的腿下钻过，最后走到猫的吉他旁边。",
    "E108.Mucho.Mouse_scene012.mp4": "一只老鼠拿着一块奶酪在地毯上行走，突然地毯被掀开，老鼠被掀到空中，然后又落回原地。",
    "E108.Mucho.Mouse_scene013.mp4": "一个紫色的地毯上，一条黑色的线条逐渐展开，形成一个模糊的人形轮廓，随后人形轮廓逐渐消失。",
    "E108.Mucho.Mouse_scene014.mp4": "一只小老鼠躲在桌子底下，被一只红色的猫追捕。猫试图抓住老鼠，但老鼠巧妙地躲藏在桌子下面，猫最终被桌子压住，只能露出脚和尾巴，显得非常狼狈。",
    "E108.Mucho.Mouse_scene015.mp4": "一只老鼠站在墙边的洞口旁，洞口上方写着“El Magnifico”。老鼠举起一根细长的棍子，随后被一只红色的猫的手抓住，被拉向空中。老鼠悬挂在棍子上，猫的手从画面中移开，老鼠继续悬挂在空中。",
    "E108.Mucho.Mouse_scene016.mp4": "一只红色的猫从沙发下跳出来，不小心踩到了一把黄色的小提琴，导致小提琴被踩扁。猫被小提琴缠住，看起来很痛苦。一位穿着红黑衣服的女士站在旁边，双手叉腰，看着猫的窘境。",
    "E108.Mucho.Mouse_scene017.mp4": "一只棕色的小老鼠从墙上的洞口探出头来，它先是好奇地观察四周，然后开心地跳进洞里，消失在黑暗中。墙上有“El Magnifico”的字样。",
    "E108.Mucho.Mouse_scene018.mp4": "在一个装饰典雅的客厅里，一只穿着红色衣服的红色猫坐在绿色沙发上，脖子上套着一个黄色的圆形物体，看起来像一个巨大的钥匙。猫的表情从惊讶逐渐转变为愤怒和不满，它不断挥舞双手，似乎在与站在沙发对面、穿着黑色连衣裙和红色外套、双手叉腰的女性角色争论。女性角色表情严肃，似乎在责备或质问猫。背景中可以看到书架、红色的柜子和壁炉，营造出一个室内家居环境。",
    "E108.Mucho.Mouse_scene019.mp4": "一位穿着红色外套和黑色内搭的女性站在书架前，她戴着黄色耳环和项链，表情严肃，双手叉腰，不断左右转动头部观察四周。",
    "E108.Mucho.Mouse_scene020.mp4": "一只红色的猫坐在沙发上，脖子上套着一个黄色的锅，它不断挣扎，试图摆脱这个锅，但无济于事。猫的表情从惊讶到愤怒再到无奈，最后它放弃了挣扎，靠在沙发上，闭上眼睛，似乎在叹气或感到疲惫。",
    "E108.Mucho.Mouse_scene021.mp4": "在客厅里，一只红色的猫坐在沙发上，脖子上套着一个黄色的圆形物体，看起来像是一个乐器的共鸣箱。猫显得非常兴奋和激动，它不断挥舞着双手，嘴巴张开，似乎在大声唱歌或演奏音乐。它的表情非常夸张，眼睛睁得很大，显示出它对音乐的热爱和投入。旁边站着一位穿着红色上衣和黑色裙子的女士，她双手叉腰，表情严肃，似乎对猫的行为感到不满或惊讶。女士的姿势和表情显示出她对猫的音乐表演持批评态度。背景中可以看到书架和一些家具，营造出一个温馨的家庭环境。整个场景充满了幽默和戏剧性，猫的夸张表现与女士的严肃态度形成了鲜明的对比。",
    "E108.Mucho.Mouse_scene022.mp4": "视频展示了一张电报，内容是关于一位来自美国的“奥林匹克、美国和世界冠军捕鼠专家”汤姆（El Magnífico）即将抵达马德里，保证捕捉“老鼠”。电报被一只手拿着，背景为绿色。",
    "E108.Mucho.Mouse_scene023.mp4": "一位女士拿着纸张站在客厅，与沙发上的红色小猫对话。随后，女士走向一扇门，开门后看到门外站着一只灰色大猫，周围摆放着多个奖杯和奖牌。女士惊讶地张开双手，似乎对门外的景象感到震惊。",
    "E108.Mucho.Mouse_scene024.mp4": "动画片中的汤姆猫站在户外，手持一个写有“World Champion TOM”的金色奖杯，脸上带着得意的笑容。他身后挂着一排奖牌和奖杯，展示着他辉煌的战绩。汤姆猫先是挥手致意，然后将奖杯抱在胸前，显得非常自豪。背景是蓝天和绿树，营造出庆祝胜利的氛围。",
    "E108.Mucho.Mouse_scene025.mp4": "一位穿着黑色连衣裙和红色上衣的女士站在房间里，她正看着从门边跳出来的汤姆猫。汤姆猫手里拿着一本书，向女士伸出手，似乎在和她打招呼或进行某种互动。女士一开始有些惊讶，但随后微笑着回应汤姆猫。",
    "E108.Mucho.Mouse_scene026.mp4": "汤姆猫手持一本名为《如何说西班牙语》的橙色书，站在黄色的墙前。他张开双臂，嘴巴张开，似乎在大声朗读或说话，表情生动。随着视频的进行，他不断变换面部表情，从微笑到大笑，最后低头看着书本，似乎在继续阅读或学习。整个画面充满了卡通风格的幽默感。",
    "E108.Mucho.Mouse_scene028.mp4": "一只棕色的小老鼠从一个洞口探出头来，它先是好奇地张望，然后开心地跑进洞里，接着洞口被一个黄色的羽毛扫帚扫过，最后洞口恢复原状。",
    "E108.Mucho.Mouse_scene030.mp4": "汤姆猫用爪子打开一扇绿色的门，门外是庭院景色。他开心地站在门口，然后突然被门反弹回来，撞在门上，表情惊讶。接着他恢复笑容，双手张开，似乎在迎接什么人或事物。最后，门再次打开，汤姆猫又向前扑去，似乎要再次出去。",
    "E108.Mucho.Mouse_scene031.mp4": "画面中，一只小老鼠从门后探出头来，小心翼翼地走到一只大猫的脚边，然后又退回到门后。",
    "E108.Mucho.Mouse_scene032.mp4": "汤姆猫站在门口，手里拿着一个玩具老鼠，他试图用玩具老鼠引诱杰瑞鼠，但不小心被门夹住，摔倒在地。随后，他站起身来，表情愤怒，似乎在思考下一步行动。",
    "E108.Mucho.Mouse_scene033.mp4": "一只灰色的猫和一只棕色的小老鼠在室内追逐。老鼠在窗台上跳舞，猫在下面看着。猫开始跳舞，模仿老鼠的动作，但动作幅度更大。猫跳到窗边，用爪子砸碎了窗户，玻璃碎片四溅。老鼠站在地上，看着破碎的窗户。",
    "E108.Mucho.Mouse_scene034.mp4": "一只灰色的猫坐在喷泉的顶部，喷泉的水从顶部流下，形成水花。猫的表情从平静变为惊讶，然后又恢复平静。背景是一座带有红色瓦片屋顶和阳台的建筑。",
    "E108.Mucho.Mouse_scene035.mp4": "一只灰色的猫从绿色的门后飞速冲出，撞在门上后消失在画面中。",
    "E108.Mucho.Mouse_scene036.mp4": "汤姆跑进房间，看到杰瑞躺在沙发上弹吉他。汤姆生气地靠近，杰瑞则继续弹奏并挥手打招呼，汤姆显得非常恼火。",
    "E108.Mucho.Mouse_scene037.mp4": "一只穿着红色衣服、戴着黑色帽子的老鼠从洞里走出，它在木制地板上跳舞，背景墙上写着“El Magnifico”。",
    "E108.Mucho.Mouse_scene038.mp4": "汤姆猫走向沙发上的杰瑞，杰瑞正在弹吉他。汤姆猫靠近后，杰瑞突然弹奏吉他，发出的音符变成了一条长长的白色光带，将汤姆猫弹飞出去。",
    "E108.Mucho.Mouse_scene039.mp4": "杰瑞穿着斗篷在房间里奔跑，突然被汤姆从后面抓住斗篷，杰瑞奋力挣脱后继续奔跑。",
    "E108.Mucho.Mouse_scene040.mp4": "汤姆猫在房间里追逐一个毛线球，它用爪子抓着毛线，身体被拉长，毛线球在它身后滚动。",
    "E108.Mucho.Mouse_scene041.mp4": "一只戴着墨镜、披着红色斗篷的老鼠在房间里跳舞，它先是旋转，然后被自己的斗篷绊倒，接着又飞了起来继续跳舞。",
    "E108.Mucho.Mouse_scene042.mp4": "一只红色的猫坐在蓝色沙发上，它先是兴奋地挥舞双臂，然后又突然变得紧张，用手捂住嘴巴，似乎在掩饰什么。",
    "E108.Mucho.Mouse_scene043.mp4": "一个蓝色的花瓶放在桌子上，随后被一只猫的脚踢倒，花瓶碎裂，碎片飞溅，猫被玻璃碎片覆盖，躺在地上，表情痛苦。",
    "E108.Mucho.Mouse_scene044.mp4": "一只灰色的猫躺在地上，一只小老鼠拿着红色布料靠近猫，猫的眼睛被布料遮住后，眼睛变成螺旋状，随后猫恢复清醒，露出愤怒的表情。",
    "E108.Mucho.Mouse_scene045.mp4": "一只穿着红色斗篷、戴着黑色头巾的老鼠在房间里奔跑，它从一只躺着的猫的身上跳过，猫的尾巴在地板上拖着。老鼠在猫的背上跳跃，然后继续向前跑。",
    "E108.Mucho.Mouse_scene046.mp4": "猫汤姆躺在地上，老鼠杰瑞从他身上跳过，杰瑞戴着红色的帽子，显得非常得意。",
    "E108.Mucho.Mouse_scene047.mp4": "杰瑞戴着墨镜，披着红色斗篷，站在汤姆的尾巴前，用斗篷缠住汤姆的尾巴，然后迅速跑开。汤姆被激怒，从地上爬起，愤怒地盯着杰瑞逃跑的方向。",
    "E108.Mucho.Mouse_scene048.mp4": "一只戴着墨镜的小老鼠拿着一块红色布料，正在开心地玩耍。突然，一只大猫从上方出现，将布料拉扯过来，小老鼠被吓了一跳，但很快又恢复了笑容，继续玩布料。",
    "E108.Mucho.Mouse_scene049.mp4": "视频中，一只戴着墨镜、披着红色斗篷的老鼠站在木地板上，面对着一只躺在地上的灰色猫。老鼠先是用手指拉扯猫的胡须，然后披上斗篷，摆出英雄姿态。猫被激怒，开始追赶老鼠，老鼠灵活地躲避，并用斗篷缠住猫，最终猫摔倒在地，显得狼狈不堪，而老鼠则得意洋洋地看着猫。",
    "E108.Mucho.Mouse_scene050.mp4": "一只红色的猫坐在蓝色沙发上，兴奋地挥舞着手臂，同时将一盆紫色的花弄散，花瓣四处飞舞。一只小老鼠在地板上行走，似乎对这一切毫不在意。随后，一位穿着紫色外套的女士从门口走进来，她优雅地走过房间，然后消失在画面中。",
    "E108.Mucho.Mouse_scene052.mp4": "一只老鼠推着一个橙子、一个苹果和一根香蕉进入一个洞口，然后消失在洞里。接着画面切换到“THE END”的字样，最后显示“M·G·M CARTOON”和“made in Hollywood, U.S.A.”的字样。"
}