{
    "E75.Johann.Mouse_scene001.mp4": "视频展示了米高梅动画的标志，背景为红色，标志中央是一只咆哮的狮子，下方有“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”的字样。",
    "E75.Johann.Mouse_scene002.mp4": "这是一个米高梅动画片头，背景为红色，中央有一个蓝色边框的圆形，里面是一只咆哮的狮子。下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”。狮子在圆形内不断张合嘴巴，表现出咆哮的动作。",
    "E75.Johann.Mouse_scene003.mp4": "视频开始展示了米高梅动画的标志，随后画面转为黑色，最后出现“TOM and JERRY”的标题画面。",
    "E75.Johann.Mouse_scene007.mp4": "在一个装饰华丽的房间里，汤姆猫从墙角悄悄探出头来，眼睛睁得大大的，似乎在偷偷观察什么。房间内有绿色窗帘、条纹墙纸和古典家具，营造出一种优雅而安静的氛围。",
    "E75.Johann.Mouse_scene008.mp4": "一只灰色的猫在豪华的房间里，它先是趴在地上，然后用前爪挠痒痒，接着又趴下，重复这个动作。",
    "E75.Johann.Mouse_scene010.mp4": "一个穿着蓝色西装的人坐在红色钢琴前弹奏，他的双手在琴键上移动，脚踩在踏板上。背景是带有条纹的墙壁和地板上的花纹地毯。",
    "E75.Johann.Mouse_scene011.mp4": "一只小老鼠在豪华的房间里奔跑，一只灰色的猫紧追不舍。猫在追逐过程中多次撞到家具和墙壁，摔倒在地，显得狼狈不堪。老鼠则灵活地躲避，最终猫在楼梯上滑倒，场面滑稽。",
    "E75.Johann.Mouse_scene012.mp4": "一只小老鼠在豪华的房间里奔跑，躲进墙角的洞里。一只猫从窗外跳进来，砸碎了窗户玻璃，但小老鼠迅速躲进洞里，猫没有抓到它。",
    "E75.Johann.Mouse_scene014.mp4": "视频展示了一本打开的书，书页上有一幅插画，描绘了一条街道，街道上有马车和房屋。镜头逐渐向右移动，聚焦于一栋黄色建筑的窗户，一只灰色的猫从窗户探出头来，静静观望。",
    "E75.Johann.Mouse_scene015.mp4": "一只灰色的猫站在窗边，看着窗外。它转身走向房间里的红色钢琴，伸手取下乐谱，然后开始阅读。",
    "E75.Johann.Mouse_scene016.mp4": "画面中展示了一本名为《如何演奏华尔兹：六个简易课程》的书籍封面，作者是约翰·施特劳斯。封面设计精美，顶部有装饰性花纹和施特劳斯的剪影，底部有音乐符号装饰。书籍被一双戴着白色手套的手持着，背景为棕色。",
    "E75.Johann.Mouse_scene017.mp4": "在一间装饰典雅的房间里，汤姆猫站在一架红色钢琴旁，手里拿着一张纸，似乎在认真阅读。他面带微笑，表情愉悦，随后突然转身跑开，纸张被他带在手中。房间内有绿色窗帘、墙上的金色画框和一架摆放着乐谱的钢琴，整体氛围温馨而充满艺术气息。",
    "E75.Johann.Mouse_scene018.mp4": "在阁楼里，汤姆猫拿着乐谱从绿色门后跑进来，然后坐在钢琴凳上，将乐谱放在钢琴上，准备弹奏。",
    "E75.Johann.Mouse_scene019.mp4": "一本打开的乐谱书，标题为“Lesson I”，显示了四行五线谱，每行都有一个低音谱号，第二行有一个音符。乐谱书放在一个木制支架上，背景是木质地板。",
    "E75.Johann.Mouse_scene020.mp4": "一只灰色的猫坐在钢琴前，专注地看着乐谱，手指轻轻敲击琴键，似乎在练习弹奏。背景是木质的阁楼，光线柔和，营造出温馨的学习氛围。",
    "E75.Johann.Mouse_scene021.mp4": "视频展示了一本打开的乐谱书，标题为“Lesson II”，书页上有五线谱，其中第二行谱上标有两个音符。一只手从左侧进入画面，翻动书页后离开，最终画面定格在乐谱上。",
    "E75.Johann.Mouse_scene022.mp4": "一只灰色的猫坐在钢琴前，正在学习弹奏钢琴。它看着乐谱，用爪子按着琴键，尝试弹奏。它不断翻动乐谱，似乎在寻找正确的音符。最后，它成功地弹奏出了一首曲子，然后高兴地举起乐谱，展示给观众看。",
    "E75.Johann.Mouse_scene023.mp4": "一只灰色的猫坐在一个木制家具后面，它不断挥舞着双手，表情兴奋，似乎在跳舞或庆祝。背景是一个装饰有布幔、椅子和木桶的房间。",
    "E75.Johann.Mouse_scene024.mp4": "汤姆猫坐在钢琴前，先是兴奋地挥舞双手，然后逐渐放松，趴在钢琴凳上，最后开始弹奏钢琴，表情专注而充满激情。",
    "E75.Johann.Mouse_scene025.mp4": "一只小老鼠从墙洞中探出头来，它先是小心翼翼地观察四周，然后开始在房间里四处走动，显得非常好奇和活泼。",
    "E75.Johann.Mouse_scene026.mp4": "汤姆猫坐在一架红色钢琴前，一边弹奏，一边用手指指着乐谱。随后，他拿起一根蓝色的三叉戟，继续弹奏并挥舞着三叉戟，显得非常得意和享受。背景是一间装饰华丽的房间，墙上挂着一幅画。",
    "E75.Johann.Mouse_scene027.mp4": "在豪华的客厅里，一只小老鼠正在地毯上快乐地跳舞。突然，一只手持长矛的猫从左侧出现，准备攻击小老鼠。猫追逐小老鼠，但小老鼠灵活地躲避。猫在追逐过程中滑倒，最终躺在地上，长矛也掉落在地。猫看起来有些沮丧，但仍然保持着警惕，注视着小老鼠。",
    "E75.Johann.Mouse_scene028.mp4": "一只灰色的猫从钢琴前的绿色凳子上弹跳起来，双臂高举，做出夸张的舞蹈动作。",
    "E75.Johann.Mouse_scene030.mp4": "在一个装饰华丽的房间里，一只小老鼠在地毯上欢快地跳舞。随后，镜头转向一只躺在钢琴凳上的猫，它先是悠闲地伸展身体，然后突然变得兴奋，张开双臂，接着抓起小老鼠，表情从惊讶变为得意。",
    "E75.Johann.Mouse_scene031.mp4": "一群穿着厨师服和女仆装的卡通人物站在豪华的室内，他们面带笑容，摆出各种姿势，似乎在庆祝或表演。背景中有装饰画、壁炉和烛台，整体氛围欢快热闹。",
    "E75.Johann.Mouse_scene032.mp4": "在一间装饰典雅的房间里，猫汤姆躺在钢琴凳上，抱着小老鼠杰瑞。汤姆把杰瑞放在地上，然后坐直身子，开始弹钢琴。杰瑞在地板上开心地跳舞，随着音乐节奏摇摆，显得非常快乐。汤姆专注地弹奏，杰瑞则在旁边尽情享受音乐，整个场景充满欢乐和温馨的氛围。",
    "E75.Johann.Mouse_scene033.mp4": "视频展示了一个动画故事书的页面翻动过程。首先，画面呈现一个穿着围裙的男孩站在街道上，抬头看着阳台上的一个女人，背景是欧洲风格的建筑。接着，镜头向下移动，显示了书页上的文字，描述了男孩讲述猫和老鼠跳舞的故事，引起围观人群的惊讶。最后，画面切换到一个广场，人群聚集，男孩在人群中讲述故事，人们表现出惊讶和好奇的表情。整个场景充满了童话般的氛围，色彩丰富，人物生动。",
    "E75.Johann.Mouse_scene034.mp4": "视频展示了一名穿着红色制服、戴着蓝色羽毛帽的卫兵，他站在宫殿外，手扶帽檐，似乎在倾听什么。随后，他迅速跑进宫殿，穿过楼梯，进入一个宽敞的走廊，走廊内有高大的柱子和华丽的吊灯。卫兵继续奔跑，显示出一种急迫或警觉的状态。背景中的宫殿建筑宏伟，细节精致，营造出一种庄严和紧张的氛围。",
    "E75.Johann.Mouse_scene035.mp4": "在一个装饰华丽的房间内，一个穿着红色制服、手持剑的小士兵正在跳舞。房间内有长桌、椅子、吊灯和窗帘，墙壁上挂着画作，整体氛围古典而优雅。",
    "E75.Johann.Mouse_scene036.mp4": "视频展示了一本打开的书，书页上绘有卡通插图。第一幅图中，一位身穿红色军装、头戴高帽的士兵正指着坐在办公桌后的皇帝，皇帝身穿白色礼服，佩戴勋章。背景是装饰华丽的宫殿房间，有窗帘、挂画和吊灯。随后，书页翻转，第二幅图显示士兵手持一张纸，站在一只猫和一只老鼠面前，猫看起来有些惊讶，老鼠则站在猫旁边。画面上方有文字“EMPEROR COULDN'T BELIEVE HIS EARS”和“COMMAND TO PERFORM IN THE PALACE AT ONCE”。整个场景充满卡通风格，色彩鲜艳。",
    "E75.Johann.Mouse_scene037.mp4": "视频片段展示了一本打开的书，书页上绘制着动画场景。首先，画面中出现一个穿着红色制服、戴着高帽的士兵，他手持一张纸，似乎在向一只灰色的猫下达命令。猫旁边还有一只小老鼠。士兵上方的文字写着“COMMAND TO PERFORM IN THE PALACE AT ONCE”，意为“命令立即在宫殿表演”。随后，画面切换到宫殿内部，展示了一个华丽的剧场，观众席上坐满了人，舞台中央有一个穿着红色服装的角色正在表演，周围有士兵列队站立。整个场景充满了古典和戏剧化的氛围。",
    "E75.Johann.Mouse_scene038.mp4": "视频展示了一个华丽的宫殿大厅，中央有一架白色钢琴，周围聚集了大量观众。镜头从左向右平移，逐渐展示大厅的全貌，包括高大的吊灯、装饰精美的墙壁和拱门，以及观众席上穿着色彩斑斓服装的人群。大厅顶部有复杂的壁画和装饰，整体氛围庄重而典雅。",
    "E75.Johann.Mouse_scene039.mp4": "在华丽的宫殿大厅中，汤姆穿着紫色礼服，牵着杰瑞进入。汤姆突然停下，杰瑞则继续前行。随后，画面切换到汤姆在钢琴前演奏，杰瑞站在钢琴上，周围观众围观。汤姆专注地弹奏，杰瑞则在钢琴上跳跃。",
    "E75.Johann.Mouse_scene040.mp4": "一只穿着紫色西装、打着黄色领结的灰色猫坐在钢琴前，用双手在琴键上弹奏。它先是举起右手，然后将双手放在琴键上，随着音乐节奏左右摆动身体，表情专注而享受。背景是简单的棕色墙壁和绿色地板。",
    "E75.Johann.Mouse_scene041.mp4": "在一个华丽的音乐厅里，一只穿着紫色礼服的猫坐在一架装饰精美的白色钢琴前演奏。钢琴上方站着一只穿着绿色衣服的小老鼠，它在猫演奏时兴奋地跳跃和挥手。周围观众席上坐满了穿着正式服装的观众，他们正在欣赏这场表演。猫专注地弹奏着钢琴，而小老鼠则在钢琴上欢快地活动。",
    "E75.Johann.Mouse_scene042.mp4": "一只穿着绿色衣服的小老鼠在钢琴上跳舞，随后一只穿着紫色衣服的猫伸出手抓住了小老鼠。",
    "E75.Johann.Mouse_scene043.mp4": "一只穿着绿色衣服的小老鼠在华丽的室内环境中，与一只巨大的白色手套互动。小老鼠先是用手指触碰手套，然后被手套推动，最后转身跑开。",
    "E75.Johann.Mouse_scene045.mp4": "一只穿着绿色衣服的小老鼠在华丽的宫殿内跑动，它从画面左侧跑到右侧。随后，一只穿着紫色衣服的猫从左侧冲入画面，迅速追击小老鼠，但猫只露出了部分身体，之后消失在画面中。",
    "E75.Johann.Mouse_scene046.mp4": "一只穿着紫色西装的猫在追逐一只穿着绿色衣服的小老鼠。猫在追逐过程中撞到了墙，摔倒在地。老鼠从墙洞里钻出来，猫试图抓住它，但老鼠逃脱了。最后，画面翻页，显示“The End”字样。",
    "E75.Johann.Mouse_scene047.mp4": "这是一个MGM出品的《猫和老鼠》动画片头，背景为红色，中间有蓝色的“Tom and Jerry CARTOON”字样，上方是“An M.G.M.”，下方写着“MADE IN HOLLYWOOD, U.S.A.”。画面逐渐变暗，最后转为全黑。"
}