{
    "S1950E25 - Cruise Cat_scene001.mp4": "视频展示了米高梅动画的标志，背景为深红色，标志中央是一只咆哮的狮子，下方有“A Metro-Goldwyn-Mayer CARTOON”字样，以及“COLOR BY TECHNICOLOR”的文字。",
    "S1950E25 - Cruise Cat_scene002.mp4": "这是一个米高梅动画片头，背景为红色，中央有一个蓝色边框的圆形，里面是一只咆哮的狮子。下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”。狮子在圆形内不断咆哮，表情凶猛。",
    "S1950E25 - Cruise Cat_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现《猫和老鼠》的标题画面。",
    "S1950E25 - Cruise Cat_scene004.mp4": "这是一个《猫和老鼠》动画片的开场画面，展示了主角汤姆猫和杰瑞鼠的卡通形象，背景是红色的同心圆图案，下方有黄色的“TOM and JERRY”字样。画面中还出现了“Cruise Cat”和导演名字“William Hanna and Joseph Barbera”。",
    "S1950E25 - Cruise Cat_scene005.mp4": "这是一个动画片的片头，标题为“Cruise Cat”，由William Hanna和Joseph Barbera执导。画面中展示了一艘航行在海上的轮船，背景是深蓝色的海洋。片头还列出了动画师、音乐制作人和背景设计师的名字，以及制作公司和版权信息。最后，显示了制片人Fred Quimby的名字。整个画面风格复古，色彩鲜明，具有经典动画片的特征。",
    "S1950E25 - Cruise Cat_scene006.mp4": "夜晚的港口，一艘大型轮船停靠在码头旁，远处可见一座大桥横跨水面，天空中有几朵云彩。",
    "S1950E25 - Cruise Cat_scene008.mp4": "一只戴着黄色帽子、背着吉他、穿着蓝色披风的小老鼠在甲板上行走，背景是标有“S.S. ALOHA TO HAWAII”的船体。",
    "S1950E25 - Cruise Cat_scene009.mp4": "这是一张复古风格的宣传册页面，展示的是“S.S. Aloha”邮轮的夏威夷豪华巡航广告。画面中央是一艘大型邮轮在蔚蓝海面上航行，左侧有海鸟飞翔的图案和文字描述，右侧描绘了乘客在甲板上观光和沙滩上活动的场景，整体色调以蓝色和白色为主，营造出宁静奢华的度假氛围。",
    "S1950E25 - Cruise Cat_scene010.mp4": "一只戴着帽子、披着蓝色披风的小老鼠在码头上，披风掉落后，它拿起一把小吉他，边走边弹，走向标有“S.S. ALOHA TO HAWAII”的船舷楼梯，最终走上楼梯消失在画面中。",
    "S1950E25 - Cruise Cat_scene011.mp4": "一只小老鼠从飞机的登机梯上爬行，随后从飞机侧面的窗户跳出去，消失在画面中。",
    "S1950E25 - Cruise Cat_scene012.mp4": "一只戴着黄色帽子的小老鼠从一个大箱子后面跑出来，被一个棕色的球体击中，帽子飞了出去。球体捡起帽子戴在头上，然后愤怒地靠在箱子上。",
    "S1950E25 - Cruise Cat_scene013.mp4": "一只穿着蓝色制服和白色帽子的猫站在船的入口处，挥手致意，然后转身进入船内。镜头切换到一只戴着黄色帽子、手持蓝色鱼叉的小老鼠，它正小心翼翼地沿着一根粗绳子行走，背景是深蓝色的天空。",
    "S1950E25 - Cruise Cat_scene014.mp4": "一只穿着帽子和背心的老鼠沿着一根绳子行走，绳子中间有一个红色的圆盘。老鼠用一把小刀切割圆盘，圆盘被切开后，老鼠从洞中爬过并继续前行。",
    "S1950E25 - Cruise Cat_scene015.mp4": "在船上，穿着水手服的汤姆猫正趴在船舷上，手里抓着一根绳子。杰瑞穿着水手服，拿着一把小刀，从绳子上滑下来，然后跳到船的另一边。汤姆看到后，立刻抓住绳子，身体悬空，试图抓住杰瑞。",
    "S1950E25 - Cruise Cat_scene016.mp4": "一只戴着黄色帽子的老鼠沿着一条黄色的绳子滑行，随后滑入一个烟囱中。接着，它从烟囱里探出头来，然后沿着一根竹竿滑行，最终滑到船的边缘。",
    "S1950E25 - Cruise Cat_scene017.mp4": "汤姆猫从船舱的圆形窗户向外窥视，随后杰瑞鼠用竹竿将窗户推开，自己爬了出来，站在船体上，然后又跳回了窗户里。",
    "S1950E25 - Cruise Cat_scene018.mp4": "一个老鼠从船上垂下的锚链上掉入水中，随后被锚链拉起，最终站在锚上。",
    "S1950E25 - Cruise Cat_scene020.mp4": "在船的甲板上，汤姆穿着水手服，从水中爬出，甩掉身上的水，然后跑出了画面。",
    "S1950E25 - Cruise Cat_scene021.mp4": "在船上，一只老鼠躺在躺椅上读书，猫穿着水手服跑过来，把老鼠抱起来又放下，然后猫惊讶地停在原地。",
    "S1950E25 - Cruise Cat_scene022.mp4": "在游轮甲板上，杰瑞躺在躺椅上悠闲地看书，突然被猫汤姆从背后偷袭，汤姆一把抓住杰瑞，将其高高举起，然后得意洋洋地坐在躺椅上，将杰瑞举在手中。接着，汤姆被躺椅的靠背卡住，身体被卡在躺椅中间，四肢伸展开来，表情惊慌失措。",
    "S1950E25 - Cruise Cat_scene023.mp4": "在船甲板上，一只小老鼠偷走了一块黄油，然后迅速跑开。猫汤姆穿着水手服追赶，但滑倒并踩在黄油上，导致他滑行并失去平衡。他最终站稳，得意地向远处的船员挥手致意，船员则从他身边走过，继续工作。",
    "S1950E25 - Cruise Cat_scene024.mp4": "动画片段中，一只穿着蓝色衣服的猫从船的栏杆上跳下，随后在空中翻滚并消失。接着画面切换到一个游泳池，一只穿着绿色泳裤的老鼠站在跳板上，准备跳水。",
    "S1950E25 - Cruise Cat_scene025.mp4": "在船的甲板上，汤姆猫穿着水手服，从远处慢慢爬行过来，最终停在甲板边缘，探出头来。",
    "S1950E25 - Cruise Cat_scene026.mp4": "在游轮甲板上的游泳池旁，一只穿着绿色泳裤的老鼠站在跳板上，准备跳水。它先做了一个前滚翻，然后跳入水中。接着，一只穿着蓝色泳衣的猫从梯子上爬上来，也站在跳板上，模仿老鼠的动作，但跳板突然断裂，猫被甩了出去，跳板也飞走了。",
    "S1950E25 - Cruise Cat_scene028.mp4": "在船甲板上，穿着水手服的汤姆猫手持拖把追逐一只小老鼠。他奋力追赶，最终将老鼠拖到一根柱子旁。汤姆猫试图抓住老鼠，但老鼠巧妙地躲开。汤姆猫摔倒在地，显得非常沮丧。这时，一位水手走近，用脚踢了汤姆猫一下，然后走开。汤姆猫坐在地上，用手捂住耳朵，似乎在躲避水手的责备。",
    "S1950E25 - Cruise Cat_scene029.mp4": "穿着水手服的汤姆猫站在船舷边，先是敬礼，然后转头看向远方，接着转身并挥手。",
    "S1950E25 - Cruise Cat_scene030.mp4": "在甲板上，杰瑞用一根红色棍子拉着汤姆，汤姆被拖着向前滑行，表情痛苦，嘴巴张开，似乎在喊叫。背景是蓝色的天空和甲板栏杆。",
    "S1950E25 - Cruise Cat_scene031.mp4": "在船上，汤姆穿着水手服，被杰瑞用吉他弦拉下船，掉入水中。汤姆在船壁上抓着不放，最终被水冲走。杰瑞则在甲板上弹吉他，汤姆被水淋湿后躺在地上，杰瑞继续弹奏。",
    "S1950E25 - Cruise Cat_scene032.mp4": "在船的甲板上，一个标有“BOOBY-HATCH”的白色舱门敞开着。一只棕色老鼠从舱门内跑出，随后一只穿着水手服的蓝猫——汤姆，从舱门内冲出，手持红色喷漆罐，向舱门喷洒红色油漆。汤姆被喷漆击中后，从舱门内跌落，坐在甲板上，双手捂住脸，显得非常狼狈。他随后站起来，打开舱门，发现老鼠正躲在舱门内。汤姆试图抓住老鼠，但老鼠敏捷地从舱门内逃出，关上了舱门。汤姆再次尝试打开舱门，但舱门被老鼠从内部锁住，汤姆只能无奈地看着舱门。",
    "S1950E25 - Cruise Cat_scene033.mp4": "视频开始时，一个船上的“BOBBY-HATCH”舱门打开，一个穿着蓝色衣服、戴着皇冠、手持棍子的黑色猫角色从里面出现。随后，场景切换到一个剧院休息室，汤姆和杰瑞正在追逐。汤姆穿着水手服，杰瑞拿着一个小喇叭。他们跑过一个写着“THEATRE LOUNGE MOVIES TO-DAY CARTOON”的标志牌。接着，镜头转向一个电影院，观众们坐在座位上，大屏幕上先显示“TOM and JERRY”的标志，然后切换到“in TEXAS TOM”的标题画面，背景是沙漠和仙人掌。",
    "S1950E25 - Cruise Cat_scene034.mp4": "在室内环境中，穿着蓝色运动服和白色帽子的猫汤姆站在地毯上，旁边有一只拿着黄色小吉他、穿着棕色衣服的小老鼠杰瑞。汤姆先是双手张开，随后做出各种舞蹈动作，包括转圈和摆臂，表情显得非常开心和自信。杰瑞则一直站在原地，看着汤姆跳舞，表情略显惊讶。背景中可以看到一些桌椅和绿色植物，整体氛围轻松愉快。",
    "S1950E25 - Cruise Cat_scene035.mp4": "视频显示了一个动画片头，背景是蓝天和绿色的地面，左侧有一棵仙人掌，天空中有两朵云。画面中央有红色大字“TEXAS TOM”，上方有小字“in”，整个画面呈现出经典的卡通风格。",
    "S1950E25 - Cruise Cat_scene036.mp4": "画面中，一只戴着牛仔帽的黑猫正站在一个红色的桶上，手里拿着一根绳子，似乎在进行某种活动。背景是一栋木制房屋，整体场景显得有些昏暗。",
    "S1950E25 - Cruise Cat_scene037.mp4": "一只戴着黄色牛仔帽、系着红色领结的猫坐在木屋前的台阶上，用绳子玩着一个红色的桶。突然，一只戴着黑色牛仔帽的小老鼠从草地上出现，它看着猫，然后跑开。猫看到老鼠后，开心地大笑，然后继续玩绳子。",
    "S1950E25 - Cruise Cat_scene038.mp4": "一个戴着帽子的小人物在沙漠中奔跑，身后拖着一根长长的绳子，绳子在空中画出多个环形轨迹。背景是白色的建筑物、仙人掌和远处的山脉。",
    "S1950E25 - Cruise Cat_scene039.mp4": "一个戴着黑色帽子的卡通狗在荒野中奔跑，被一根绳子缠住，绳子逐渐拉长，狗被拖拽着在空中翻滚，最终被绳子拉倒在地。背景是山脉和开阔的田野。",
    "S1950E25 - Cruise Cat_scene040.mp4": "一只戴着黄色牛仔帽和红色领巾的猫坐在木屋的台阶上，双手紧握一根绳子，表情专注，似乎在用力拉扯或准备进行某种动作。",
    "S1950E25 - Cruise Cat_scene041.mp4": "一只戴着黑色牛仔帽的小狗从木墙后探出头来，手里拿着一根带蓝色星形尖头的长杆。它被一只红色的牛仔靴绊住，被拖拽着在地上滑行，最后摔倒在地。",
    "S1950E25 - Cruise Cat_scene042.mp4": "一只戴着黑色帽子的棕色小猫从地上爬起，沿着一根绳子滑到一个木制斜坡上，然后被绳子拉向一个仙人掌。小猫坐在仙人掌上，看起来有些惊讶和困惑。",
    "S1950E25 - Cruise Cat_scene043.mp4": "在室内场景中，穿着蓝色水手服的汤姆猫正在开心地跳舞，他张开双臂，摆动身体，脸上带着笑容。旁边的小老鼠杰瑞拿着一把小吉他，站在一旁观看。背景中有植物和家具，环境看起来像是一个温馨的房间。",
    "S1950E25 - Cruise Cat_scene044.mp4": "猫戴着牛仔帽，系着红领巾，手持绳索，做出拉扯的动作。随后，一只穿着牛仔装的小老鼠从右侧跑来，被绳索绊倒，摔倒在猫的腿上。猫低头看着小老鼠，表情从得意转为惊讶。",
    "S1950E25 - Cruise Cat_scene045.mp4": "汤姆戴着牛仔帽，用绳子吊着杰瑞，杰瑞穿着牛仔装，被吊在空中挣扎，汤姆表情狰狞，最终杰瑞挣脱绳子飞走。",
    "S1950E25 - Cruise Cat_scene046.mp4": "一只穿着黄色衬衫和白色围裙的棕色老鼠正在沙漠中奔跑，身后拖着一个黑色的、类似帽子的物体，该物体有红色和蓝色的装饰。背景是木制围栏、仙人掌和远处的山脉。",
    "S1950E25 - Cruise Cat_scene047.mp4": "汤姆猫在木屋前用一根绳子做滑索，他双手紧握绳子，身体悬空，从屋檐滑下，过程中表情专注，最后安全落地。",
    "S1950E25 - Cruise Cat_scene048.mp4": "猫拿着枪对准老鼠，老鼠被枪口顶住，猫咬住子弹，老鼠挣脱后站在猫头上，拿枪对准猫，猫被击中后烟雾弥漫。",
    "S1950E25 - Cruise Cat_scene049.mp4": "在室内场景中，一只穿着蓝色制服和白色帽子的猫（汤姆）站在地毯上，面对着一只拿着小吉他、穿着黄色衣服的小老鼠（杰瑞）。杰瑞正在弹奏吉他，而汤姆则表现出愤怒的表情。随着杰瑞继续弹奏，汤姆突然伸出爪子抓住了杰瑞，将他提在空中。整个场景充满了紧张和对抗的氛围。",
    "S1950E25 - Cruise Cat_scene050.mp4": "汤姆穿着水手服从船舱门中跳出，手里拿着一只小老鼠。他兴奋地挥舞着老鼠，然后开始跳舞，脸上露出得意的笑容。",
    "S1950E25 - Cruise Cat_scene051.mp4": "一艘船在海上航行，一只海鸥飞过，叼起一只拿着小提琴的老鼠，老鼠在空中挣扎，海鸥飞向船，老鼠被扔下，继续在空中飞行。",
    "S1950E25 - Cruise Cat_scene052.mp4": "一只棕色的小老鼠拿着黄色的奶酪，沿着船的桅杆滑下，最后从桅杆上掉落到甲板上。",
    "S1950E25 - Cruise Cat_scene053.mp4": "一只棕色的小动物从空中飞入一个红色喇叭状物体中，随后在喇叭内翻滚并最终消失。背景是蓝天和部分建筑物。",
    "S1950E25 - Cruise Cat_scene054.mp4": "在厨房里，一只小老鼠从天花板上跳下来，偷吃了盘子里的煎饼和香肠，然后迅速逃走。",
    "S1950E25 - Cruise Cat_scene055.mp4": "在厨房里，一只小老鼠躲在一叠煎饼下面，厨师端着盖着盖子的盘子走来。场景切换到餐厅，穿着水手服的汤姆猫站在桌旁，服务员把盖着盖子的盘子放在桌上。汤姆猫兴奋地等待，服务员揭开盖子，露出盘子里的小老鼠和煎饼。汤姆猫看到后，表情从期待变为震惊。",
    "S1950E25 - Cruise Cat_scene056.mp4": "一只老鼠在盘子里弹吉他，旁边堆着煎饼和巧克力。随后画面切换到一个穿着水手服的猫从门后冲进来，撞到墙上，摔倒在地，然后坐起来，透过窗户向外看，接着又站起来，试图从窗户出去。",
    "S1950E25 - Cruise Cat_scene057.mp4": "一个角色在海上驾驶红色冲浪板，快速滑行并激起水花，随后冲浪板翻覆，角色落入水中，画面被水花覆盖。",
    "S1950E25 - Cruise Cat_scene058.mp4": "一只穿着护士服的猫从船舱的圆形窗户向外看，突然海水涌入，猫被淋湿，表情从惊讶变为无奈，最后背对镜头。",
    "S1950E25 - Cruise Cat_scene059.mp4": "一个卡通角色在海面上冲浪，背景是一座大型建筑和山脉。镜头逐渐拉近，最后画面变暗并显示“The End”。",
    "S1950E25 - Cruise Cat_scene060.mp4": "视频显示了“THE END”字样，随后逐渐过渡到“An MGM Tom and Jerry CARTOON”标志，下方标注“MADE IN HOLLYWOOD, U.S.A.”。背景为红色，文字为蓝色和白色，具有复古卡通风格。",
    "S1950E25 - Cruise Cat_scene061.mp4": "视频展示了米高梅动画片《猫和老鼠》的标题画面，背景为深红色，标题文字为蓝色，下方标注“在好莱坞制作”。随后画面转为全黑。"
}