{
    "S1940E46 - Tennis Chumps_scene002.mp4": "这是一个米高梅卡通片头，蓝色背景上显示着“METRO-GOLDWYN-MAYER CARTOON”字样，中间有一个圆形框，框内是一只咆哮的狮子。下方标注“COLOR BY TECHNICOLOR”。狮子在圆形框内不断咆哮，嘴巴张合，表情凶猛。",
    "S1940E46 - Tennis Chumps_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现“Tom and Jerry”的标题画面。",
    "S1940E46 - Tennis Chumps_scene004.mp4": "这是一个《猫和老鼠》动画片的片头，展示了“Tennis Chumps”这一集的标题，以及导演、动画师和音乐制作人的名字。背景是一个网球拍，整体风格复古，充满卡通特色。",
    "S1940E46 - Tennis Chumps_scene005.mp4": "视频开头显示“Produced by FRED QUIMBY”的字样，随后画面转为黑色，最后出现一个写着“CHAMPIONSHIP TENNIS MATCH TO-DAY”的横幅，背景是夜晚的树木。",
    "S1940E46 - Tennis Chumps_scene006.mp4": "视频展示了一个网球锦标赛的场景。一开始，镜头聚焦在悬挂的横幅上，上面写着“CHAMPIONSHIP TENNIS MATCH TO-DAY”。接着，镜头逐渐拉远，展示了一个户外的网球场地，场地周围有观众席和帐篷，天空晴朗，云朵飘浮。最后，镜头切换到一个标有“LOCKERS”的更衣室区域。整个场景充满活力，预示着即将举行的网球比赛。",
    "S1940E46 - Tennis Chumps_scene007.mp4": "视频展示了一个卡通场景，背景是一个标有“LOCKERS”的更衣室。一开始，更衣室的门是关闭的，随后门打开，一只穿着运动装、手持网球拍的猫（汤姆）从里面跑出来。他站在门口，显得自信满满。接着，他换上了一套更华丽的运动服，手里拿着两支网球拍，还叼着一根雪茄，看起来非常得意。他转身离开，但门突然被打开，露出另一个穿着类似服装的猫，手里也拿着网球拍，似乎在模仿或挑衅。整个场景充满了幽默和夸张的卡通风格。",
    "S1940E46 - Tennis Chumps_scene008.mp4": "视频中，一只穿着红色衣服、戴着蓝色帽子的小老鼠从柜子角落跑出来，它在柜子边缘上奔跑，随后被一只戴着蓝色帽子的黑猫从侧面扑住。黑猫将小老鼠按在柜子边缘，小老鼠试图逃跑，但黑猫紧追不舍。小老鼠最终躲进一个装满杂物的绿色大勺子后面，黑猫则继续紧盯着它，准备随时扑过去。",
    "S1940E46 - Tennis Chumps_scene009.mp4": "汤姆穿着黄色短裤和白色遮阳帽，从一个堆满网球拍、网球和桶的储物间跑出来，来到一个网球场。他看到杰瑞正躲在一堆网球拍和桶后面，于是伸手去抓。杰瑞迅速躲开，汤姆抓空后生气地挥舞着网球拍，结果把一堆网球拍和桶打翻在地，网球四处飞散。",
    "S1940E46 - Tennis Chumps_scene010.mp4": "一只穿着红色衣服的小老鼠从网球拍下钻出，抱起一个网球，然后被网球拍击中，滚到球拍上。",
    "S1940E46 - Tennis Chumps_scene011.mp4": "汤姆戴着帽子，手持网球拍，杰瑞在球拍上滚动，汤姆试图用球拍将杰瑞打飞，杰瑞被弹起后在空中翻滚，汤姆则开心地笑着。",
    "S1940E46 - Tennis Chumps_scene012.mp4": "一只穿着红色衣服的老鼠从空中坠落，落在一个喷泉上，被水柱托起，坐在喷泉顶部，水花四溅。",
    "S1940E46 - Tennis Chumps_scene013.mp4": "汤姆猫戴着遮阳帽，手持网球拍，专注地准备击球。",
    "S1940E46 - Tennis Chumps_scene014.mp4": "动画片中的汤姆猫叼着雪茄，手持网球拍，站在网球场上，表情专注。他不断吐出烟圈，烟圈在空中飘散。背景是蓝天和绿色树木，场地周围有粉色围栏。",
    "S1940E46 - Tennis Chumps_scene015.mp4": "汤姆猫戴着遮阳帽，手持网球拍，准备发球。他先将球抛起，然后挥拍击球，球飞向空中。",
    "S1940E46 - Tennis Chumps_scene016.mp4": "汤姆猫在网球场上挥动网球拍，嘴里叼着一瓶酒，用力击打网球。",
    "S1940E46 - Tennis Chumps_scene017.mp4": "汤姆戴着遮阳帽，手持网球拍，兴奋地挥舞着。突然，网球拍被点燃，火焰蔓延。汤姆惊恐地看着火焰，网球拍燃尽后只剩下冒烟的棍子。他慌张地扔掉球拍，转身逃跑，但最终停下，手里拿着网球拍和网球，表情愤怒。",
    "S1940E46 - Tennis Chumps_scene018.mp4": "汤姆猫穿着网球服，戴着遮阳帽，手持网球拍，准备发球。他将网球抛向空中，然后挥拍击球，动作充满力量和专注。",
    "S1940E46 - Tennis Chumps_scene019.mp4": "三颗彗星拖着长长的白色尾巴在蓝色的天空中飞行，背景中有几朵白云缓缓飘过。",
    "S1940E46 - Tennis Chumps_scene020.mp4": "汤姆在网球场上，嘴里叼着一瓶饮料，手持网球拍。他先是挥动球拍，随后球拍突然变成三支，他继续挥舞并高举球拍，最后做出一个挥拍的动作。",
    "S1940E46 - Tennis Chumps_scene021.mp4": "汤姆在网球场上打网球，他挥拍击球，但球却飞向了远处。随后，汤姆被球击中，身体被弹飞出去，撞在了墙上。他躺在地上，显得非常痛苦。接着，汤姆重新站起来，继续打网球，但球再次飞向了远处，他再次被球击中，身体被弹飞出去，撞在了墙上。他躺在地上，显得非常痛苦。最后，汤姆重新站起来，继续打网球，但球再次飞向了远处，他再次被球击中，身体被弹飞出去，撞在了墙上。他躺在地上，显得非常痛苦。",
    "S1940E46 - Tennis Chumps_scene022.mp4": "在网球场上，一只穿着黄色短裤和帽子的猫（汤姆）站在网前，手里拿着网球拍。他先是挥拍击球，然后另一只穿着黑色衣服和白色短裤的猫（杰瑞）从对面跑来，跃起击球，但击球时撞到了网柱，导致网柱倒塌，泥土飞溅。汤姆则在一旁观看并做出反应。",
    "S1940E46 - Tennis Chumps_scene023.mp4": "汤姆猫在网球场上，戴着帽子，拿着网球拍，专注地盯着一个洞，洞里不断喷出橙色的颗粒。他蹲下身，似乎在观察或准备击打。随后，他站起身，挥动球拍，似乎在击打从洞里喷出的物体。背景是绿色的网球场和浅色的墙壁。",
    "S1940E46 - Tennis Chumps_scene024.mp4": "一个卡通角色在网球场上挥动网球拍击球，球拍和球在空中划出夸张的轨迹，背景是蓝天和粉色围墙。",
    "S1940E46 - Tennis Chumps_scene025.mp4": "在网球比赛中，汤姆挥拍击球，但球却飞向了对面的杰瑞。杰瑞被球击中后，被网球拍缠住，汤姆则得意洋洋地继续打球。",
    "S1940E46 - Tennis Chumps_scene026.mp4": "一只穿着运动服的黑猫在网球场上挥拍击球，球被击出后变成了一颗带有光环的行星，随后行星在空中旋转并逐渐变大，最后消失在画面中。",
    "S1940E46 - Tennis Chumps_scene027.mp4": "汤姆在网球场上挥动网球拍击球，但不慎被球网缠住，最终被吊在球网上。",
    "S1940E46 - Tennis Chumps_scene028.mp4": "一只猫被绑在一根蓝色的杆子上，它在网球场上被缠绕着，身体不断旋转，最后停止转动，眼睛睁得很大，表情惊恐。",
    "S1940E46 - Tennis Chumps_scene029.mp4": "一只穿着红色短裤的老鼠在绿色的草地上，它先是站在一个棒球和网球拍旁边，然后开始奔跑，撞到了网球拍上，接着又撞到了一个红色的圆柱形物体，最后它爬起来，抱起一个棒球继续跑。",
    "S1940E46 - Tennis Chumps_scene030.mp4": "在网球场上，汤姆戴着帽子，手持网球拍，准备击球。杰瑞突然出现，手里拿着一个白球，试图靠近汤姆。汤姆迅速伸出爪子，将球打飞，杰瑞被击退，表情惊慌。",
    "S1940E46 - Tennis Chumps_scene031.mp4": "汤姆猫戴着一顶帽子，手里拿着一个白色的球形物体，表情专注。他先是侧身看着物体，然后将物体靠近自己，最后又恢复到原来的姿势。背景是纯蓝色。",
    "S1940E46 - Tennis Chumps_scene032.mp4": "一只穿着红色短裤的棕色老鼠站在绿色草地上的一条白色线上，面带微笑，随后表情变得严肃。",
    "S1940E46 - Tennis Chumps_scene033.mp4": "汤姆猫戴着帽子，手持网球拍，表情从得意转为紧张，似乎在准备或刚刚完成一次网球击球动作。",
    "S1940E46 - Tennis Chumps_scene034.mp4": "动画片中的猫角色，叼着雪茄，手持网球拍，站在网球场上，不断吐出烟圈。",
    "S1940E46 - Tennis Chumps_scene035.mp4": "汤姆猫戴着帽子，手持网球拍和网球，点燃一根火柴，然后用火柴点燃网球，导致网球冒出火花。",
    "S1940E46 - Tennis Chumps_scene036.mp4": "汤姆在网球场上挥舞网球拍，准备击球。他戴着帽子，穿着黄色短裤，表情专注。他先将球抛起，然后用力挥拍击球，球飞向空中，汤姆随后张开双臂庆祝。背景是绿色的网球场和粉色的围栏。",
    "S1940E46 - Tennis Chumps_scene037.mp4": "动画片中的猫角色穿着运动装，手持网球拍和一瓶饮料，在户外打网球。他挥拍击球后，球飞出画面，随后画面出现爆炸效果。接着，猫被烟雾包围，烟雾逐渐散去，他站在原地，身体和衣物被烟熏黑，饮料瓶和球拍冒出烟雾。猫的表情从专注变为惊讶，最后他低头查看自己的状态。",
    "S1940E46 - Tennis Chumps_scene038.mp4": "一只穿着红色裤子的老鼠站在墙顶，用双手推动一个白色的球形物体。它先是用力推球，球体在空中旋转，然后老鼠将球扛在肩上，沿着墙顶向前移动。最后，老鼠失去平衡，从墙顶跳下，球体也随之飞出画面。",
    "S1940E46 - Tennis Chumps_scene039.mp4": "一只穿着裙子的黑色卡通猫站在网球场上，它先是伸出手，然后倒立，接着用脚踢起一个网球，最后将球握在手中，做出准备击球的姿势。",
    "S1940E46 - Tennis Chumps_scene040.mp4": "动画片中的汤姆猫站在网球场上，戴着帽子，手持网球拍，摆出准备击球的姿势。背景是蓝天和带有红白条纹的帐篷。",
    "S1940E46 - Tennis Chumps_scene041.mp4": "一只穿着网球服的黑猫在网球场上挥拍击球，动作夸张有力，展现出充满活力的网球比赛场景。",
    "S1940E46 - Tennis Chumps_scene042.mp4": "汤姆在网球场上挥拍击球，但球拍突然断裂，他因此摔倒在地，衣服也散落开来。",
    "S1940E46 - Tennis Chumps_scene043.mp4": "一只穿着红色短裤的老鼠站在绿色的草地上，旁边放着一把巨大的网球拍。老鼠先是兴奋地挥舞着手臂，然后突然被一个飞来的网球击中，倒在地上。它随后站起来，看起来有些生气和困惑。",
    "S1940E46 - Tennis Chumps_scene044.mp4": "汤姆在网球场上准备发球，他挥动球拍击打网球，随后因用力过猛而向后翻滚。",
    "S1940E46 - Tennis Chumps_scene045.mp4": "一只穿着红色短裤的老鼠站在一个巨大的网球拍旁边，它用网球拍击打网球，结果被网球击中后身体膨胀变胖，然后它开始在草地上滚动，最后滚出了画面。",
    "S1940E46 - Tennis Chumps_scene046.mp4": "在一片绿色的网球场上，汤姆穿着黄色短裤和蓝色帽子，手持网球拍，正准备击打一个红色的小老鼠。小老鼠在球场上滚动，汤姆挥动球拍击打它，小老鼠被击飞到空中。汤姆兴奋地跳跃，似乎对击打成功感到满意。",
    "S1940E46 - Tennis Chumps_scene047.mp4": "在蓝天白云下，一只穿着红色短裤的小老鼠在空中翻滚，随后一只穿着运动装、手持网球拍的黑猫出现，准备击打小老鼠。黑猫挥动球拍，成功将小老鼠击中并夹在球拍网中，小老鼠在球拍网中挣扎。黑猫得意地看着被夹住的小老鼠，表情得意。",
    "S1940E46 - Tennis Chumps_scene048.mp4": "汤姆戴着帽子，手持网球拍，将杰瑞困在球拍网中，随后杰瑞被弹飞出去，汤姆则低头查看球拍。",
    "S1940E46 - Tennis Chumps_scene049.mp4": "在绿色的网球场上，一只小老鼠正在滚动，而猫汤姆戴着牛角帽，手持网球拍追赶并试图击打它。汤姆做出各种夸张的击球动作，但小老鼠始终在滚动，躲避他的攻击。",
    "S1940E46 - Tennis Chumps_scene050.mp4": "一只棕色的小老鼠从空中飞过，它张着嘴，似乎在尖叫。随后，它被一个红色的物体击中，身体迅速变长并拉伸，最终消失在画面中。背景是蓝色的天空和一个白色的网状结构。",
    "S1940E46 - Tennis Chumps_scene051.mp4": "一只黑猫在网球场上挥动网球拍，突然被击中，身体被拉长，最终坐在地上，表情惊讶。",
    "S1940E46 - Tennis Chumps_scene052.mp4": "在一片绿色的网球场上，一只棕色的小老鼠正在快速地奔跑，它戴着红色的帽子，显得非常机灵。突然，一只穿着网球服的黑猫从画面左侧冲出来，手里拿着网球拍，似乎是要追捕这只小老鼠。黑猫摆出挥拍的姿势，准备击打小老鼠，而小老鼠则继续向前奔跑，试图逃离黑猫的追捕。背景是一面粉色的墙和蓝天，整个场景充满了紧张和动感。",
    "S1940E46 - Tennis Chumps_scene053.mp4": "在网球场上，杰瑞穿着红色衣服，手持网球拍，站在网中央，与两侧的两只猫——一只黑猫和一只灰猫——对峙。黑猫和灰猫都手持网球拍，表情凶狠，似乎准备攻击杰瑞。杰瑞在网中央灵活地跳跃和躲避，同时用网球拍击打网球，试图击退两只猫。两只猫则不断挥拍，试图抓住或击中杰瑞。整个场景充满了紧张和幽默的气氛，展现了杰瑞的机智和敏捷，以及两只猫的笨拙和执着。",
    "S1940E46 - Tennis Chumps_scene054.mp4": "两个猫角色在沙滩上进行一场滑稽的打斗。其中一个猫用网球拍打另一个猫，随后被对方抓住并推倒在地。接着，他们互相拉扯，最终一个猫将另一个猫按在地上。整个过程充满夸张的动作和表情，展现了经典的卡通喜剧风格。",
    "S1940E46 - Tennis Chumps_scene055.mp4": "一只穿着红色衣服的兔子在绿色的场地上奔跑，背景是粉色的帐篷和蓝色的天空。",
    "S1940E46 - Tennis Chumps_scene056.mp4": "两只猫在沙滩上打网球，一只猫挥拍击球，另一只猫躺在地上。",
    "S1940E46 - Tennis Chumps_scene057.mp4": "一只穿着红色衣服的老鼠在绿色的网球场上奔跑，它跑过一个巨大的网球拍，然后抓住网球拍的把手，用力挥动，网球拍在空中划出弧线。",
    "S1940E46 - Tennis Chumps_scene058.mp4": "汤姆猫在沙滩上挥动网球拍，做出击球动作，表情专注而兴奋。背景是蓝天和沙滩，画面简洁明快。",
    "S1940E46 - Tennis Chumps_scene059.mp4": "一只小老鼠在网球场上抱着巨大的网球拍奔跑，随后用球拍击打地面，产生黄色的爆炸效果。",
    "S1940E46 - Tennis Chumps_scene060.mp4": "在网球场上，汤姆戴着一顶帽子，从网后探出头来，表情惊讶。另一只猫拿着网球拍，准备击球，但击球时不小心把球拍打到了汤姆的帽子上，导致帽子飞起，汤姆大吃一惊。",
    "S1940E46 - Tennis Chumps_scene061.mp4": "一只穿着红色衣服的老鼠在绿色的网球场上，紧紧抓住一把巨大的黄色网球拍，随着球拍的旋转，老鼠被甩得在空中翻滚，周围出现黄色的动态线条和光芒，表现出高速旋转的效果。",
    "S1940E46 - Tennis Chumps_scene062.mp4": "一只穿着黑色上衣和浅蓝色裤子的卡通猫在绿色网球场上，手持黄色网球拍，做出击球动作，身体向后倾斜，表情兴奋，背景是粉蓝色的墙和绿色的球场。",
    "S1940E46 - Tennis Chumps_scene063.mp4": "一只黑猫从铁丝网后跳出，身体被铁丝网切割成碎片，但依然挥舞着网球拍继续打球。",
    "S1940E46 - Tennis Chumps_scene064.mp4": "一只穿着红色衣服的老鼠在沙滩上挥舞着巨大的网球拍，做出击球动作，背景是蓝天和沙滩。",
    "S1940E46 - Tennis Chumps_scene065.mp4": "一个网球从画面右侧飞来，击中网的顶部，然后弹起，接着又击中网柱，最后从网柱上方飞出。",
    "S1940E46 - Tennis Chumps_scene066.mp4": "一只穿着红色衣服的老鼠在网球场上，它从一个巨大的网球拍后面跑出来，然后快速地向右奔跑，最后消失在画面中。",
    "S1940E46 - Tennis Chumps_scene067.mp4": "在网球场上，杰瑞穿着红色衣服从网柱后探出头，随后迅速躲开飞来的网球。接着，汤姆穿着网球服，挥拍击球，但球却击中了他自己的身体，导致他摔倒在地。汤姆继续挥拍，但球再次击中了他，使他更加狼狈。",
    "S1940E46 - Tennis Chumps_scene068.mp4": "一只穿着红色衣服的老鼠在网球场上挥动巨大的网球拍击打网球，网球被击出后在空中划出轨迹，老鼠则不断调整姿势继续击球。",
    "S1940E46 - Tennis Chumps_scene069.mp4": "两只猫在网球场上打网球，它们挥动球拍击球，球在空中飞来飞去，画面中出现了夸张的黄色爆炸效果。",
    "S1940E46 - Tennis Chumps_scene070.mp4": "一只老鼠在网球场上扛着一把巨大的网球拍，它用力挥动球拍，球拍在空中划出弧线，老鼠被球拍的力道甩得向后飞去，但很快又稳住身体，继续扛着球拍向前走。",
    "S1940E46 - Tennis Chumps_scene071.mp4": "视频展示了一个户外网球场，球场周围有观众席和树木，背景是连绵的山丘。一个白色的网球从画面左侧飞向右侧，逐渐升高并越过网球场上方。整个场景色彩鲜艳，具有卡通风格。",
    "S1940E46 - Tennis Chumps_scene072.mp4": "汤姆在网球场上挥动网球拍，突然被击出的球击中，身体旋转飞起，最终消失在画面中。",
    "S1940E46 - Tennis Chumps_scene073.mp4": "汤姆在网球场上挥动网球拍，突然被击出的球击中，身体失控旋转飞起，最后画面只剩下旋转的线条和球。",
    "S1940E46 - Tennis Chumps_scene074.mp4": "动画片段中，汤姆猫在网球场上奔跑，他戴着绿色帽子和黄色裤子，手持网球拍。镜头跟随他移动，他时而穿着黄色裤子，时而穿着浅蓝色裤子，表情专注，似乎在追逐或准备击球。背景是蓝天和粉色围栏，地面是绿色的网球场。",
    "S1940E46 - Tennis Chumps_scene075.mp4": "一只老鼠在绿色的网球场上，正用力挥动一个巨大的网球拍。它先是专注地准备击球，随后因用力过猛而被击中，身体后仰，表情痛苦。最后，它揉着受伤的鼻子，显得有些狼狈。",
    "S1940E46 - Tennis Chumps_scene077.mp4": "视频中，两只猫在网球场上进行网球比赛。它们穿着运动服，手持网球拍，表情专注。比赛过程中，两只猫激烈对抗，不断移动和挥拍，展现出激烈的竞争。背景是蓝天和绿色的网球场，周围有树木和观众席，营造出户外运动的氛围。比赛场面紧张刺激，两只猫全力以赴，展现了运动的激情和乐趣。",
    "S1940E46 - Tennis Chumps_scene078.mp4": "一只穿着红色泳衣的老鼠在沙滩上奔跑，背景是蓝色的天空和粉色的沙滩。老鼠表情紧张，似乎在逃避什么。随着老鼠的奔跑，画面右侧逐渐出现一个白色的网状结构，可能是沙滩排球网。",
    "S1940E46 - Tennis Chumps_scene079.mp4": "一个自动网球发球机旁，一只穿着红色衣服的老鼠从机器侧面爬上来，机器开始运作，网球从顶部发出，老鼠被网球击中。",
    "S1940E46 - Tennis Chumps_scene080.mp4": "视频中，汤姆猫在跑道上奔跑，他穿着黄色短裤和绿色帽子，表情紧张，似乎在躲避从天空中飞来的白色球体。随后，场景切换，汤姆换上了白色短裤和红色鞋子，继续在跑道上奔跑，但这次他的表情更加惊恐，似乎被球体追击。最后，汤姆被球体击中，画面中出现爆炸效果，他被击飞出去。",
    "S1940E46 - Tennis Chumps_scene081.mp4": "在足球场上，一个穿着黑色和黄色球衣、红色鞋子的卡通角色（汤姆）正在扑救一个飞来的足球。他从网前扑向球，但球从他身边飞过，他被网缠住，身体悬空。背景是绿色的草坪和粉红色的看台，天空是蓝色的。",
    "S1940E46 - Tennis Chumps_scene082.mp4": "动画片中，两个角色乘坐飞行器高速穿越田野，飞行器掠过树木，导致树叶被吹落，随后飞行器消失在画面中。",
    "S1940E46 - Tennis Chumps_scene083.mp4": "两个汤姆猫被蜘蛛网缠住，悬挂在树下，他们试图挣扎逃脱，但动作被蜘蛛网限制，显得滑稽又无奈。",
    "S1940E46 - Tennis Chumps_scene084.mp4": "一只穿着条纹衣服的小老鼠杰瑞，从舞台幕布后跑出来，爬上领奖台，用铅笔在金色的网球锦标赛奖杯上写下“杰瑞·老鼠”的名字。写完后，他站在奖杯旁，兴奋地举起手臂庆祝胜利，最后画面逐渐变暗，出现“The End”字样。",
    "S1940E46 - Tennis Chumps_scene085.mp4": "视频显示了“THE END”字样，随后逐渐出现“An MGM Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色。"
}