{
    "05. Dog Trouble_scene001.mp4": "视频开始时显示一个黑色背景，右下角有数字“0110544170204083”。随后，画面逐渐淡入，出现一个红色背景，中央是一个圆形标志，标志内有一只咆哮的狮子，下方写着“A Metro-Goldwyn-Mayer CARTOON COLOR BY TECHNICOLOR”。这是米高梅动画公司的经典标志。",
    "05. Dog Trouble_scene002.mp4": "这是一个米高梅动画片头，背景为红色，中央有一个蓝色边框的圆形，里面是一只咆哮的狮子。下方有文字“A Metro-Goldwyn-Mayer CARTOON COLOR BY TECHNICOLOR”。狮子在画面中不断张合嘴巴，做出咆哮的动作。",
    "05. Dog Trouble_scene003.mp4": "视频开始时显示了米高梅动画的标志，随后切换到《猫和老鼠》的标题画面，展示了主角汤姆和杰瑞的形象。",
    "05. Dog Trouble_scene004.mp4": "视频展示了经典动画《猫和老鼠》的开场画面，背景为红色渐变圆环，上方是猫汤姆的头部特写，下方是老鼠杰瑞的卡通形象，两者表情生动。画面中央醒目地显示着黄色的“TOM and JERRY”标题。随后，画面中出现“Directed by WILLIAM HANNA and JOSEPH BARBERA”等制作信息，以及版权和审批标识。整个画面风格复古，充满卡通趣味。",
    "05. Dog Trouble_scene005.mp4": "视频开头展示了《猫和老鼠》的片头，包括导演威廉·汉纳和约瑟夫·巴伯拉的名字，以及制片人弗雷德·奎姆比和片名“Dog Trouble”（狗狗骚动）。随后画面转黑，接着出现一个在绿色背景上奔跑的老鼠角色，暗示即将展开的追逐或冒险情节。",
    "05. Dog Trouble_scene006.mp4": "一只棕色的小老鼠在绿色的地毯上奔跑，地毯边缘是紫色的波浪形花边。小老鼠表情紧张，眼睛睁大，嘴巴微张，似乎在躲避什么。它不断向前奔跑，身体前倾，四肢快速摆动，尾巴微微翘起。在奔跑过程中，小老鼠突然停下，身体前倾，眼睛瞪大，嘴巴张开，似乎看到了什么可怕的东西。它随即又继续奔跑，身体前倾，四肢快速摆动，尾巴微微翘起。",
    "05. Dog Trouble_scene007.mp4": "一只灰色的猫正在拉扯桌布，试图抓住桌上的小老鼠。小老鼠在桌布上跳跃躲避，最终跳到桌子上，猫则显得非常沮丧和失望。",
    "05. Dog Trouble_scene008.mp4": "一只灰色的猫从桌子底下爬出来，它先是趴在地上，然后站起来，开心地笑着，看起来非常兴奋和得意。",
    "05. Dog Trouble_scene009.mp4": "一只棕色的小老鼠在华丽的家具上奔跑，突然摔倒，表情痛苦，随后它挣扎着爬起来，继续向前跑。",
    "05. Dog Trouble_scene010.mp4": "猫躲在桌子后面，张大嘴巴，老鼠从桌子另一端跑过来，猫试图抓住老鼠，但老鼠灵活地逃脱，猫的胡须被老鼠拉扯，老鼠继续跑向画面左侧。",
    "05. Dog Trouble_scene011.mp4": "一只小老鼠从墙洞中钻出，沿着墙根快速奔跑，经过一个黄色的开关，然后钻进墙洞。猫从墙洞外悄悄靠近，观察老鼠的动向，然后趴在墙角，等待老鼠出现。老鼠从开关后探出头来，猫立刻扑过去抓老鼠，但老鼠迅速缩回开关后。",
    "05. Dog Trouble_scene012.mp4": "杰瑞从墙洞中钻出，将一个黄色的开关面板推回原位，然后走向地上的捕鼠夹，小心翼翼地靠近并检查，最后决定绕开它。",
    "05. Dog Trouble_scene014.mp4": "汤姆猫在角落里，手里拿着一个捕鼠夹，表情从兴奋到惊讶再到担忧，似乎在观察或思考捕鼠夹的状态。",
    "05. Dog Trouble_scene015.mp4": "一只小老鼠在房间内快速奔跑，经过一张桌子和一盏台灯，然后躲到家具后面。",
    "05. Dog Trouble_scene016.mp4": "一只棕色的小老鼠从房间内跑出，经过一个柜子，来到一扇门前。门打开后，小老鼠看到一只灰色的斗牛犬躺在门廊上睡觉。小老鼠吓得后退，然后转身逃跑，最后从门边消失。斗牛犬一直睡着，没有注意到小老鼠。",
    "05. Dog Trouble_scene017.mp4": "一只黑猫在室内地板上奔跑，表情愤怒，眼睛发亮，嘴巴张开露出牙齿，似乎在追逐或逃跑。它在房间中快速移动，经过家具和门，最终在墙边停下，身体僵硬，眼睛瞪大，显得非常惊恐或疲惫。",
    "05. Dog Trouble_scene018.mp4": "一只黑色的猫和一只灰色的狗在门廊上玩耍，猫试图咬狗的脖子，狗则用爪子抓猫。接着，猫和狗互相追逐，最后狗跑出了画面。随后，一只棕色的小老鼠从门缝中探出头来，小心翼翼地走出来，四处张望。",
    "05. Dog Trouble_scene019.mp4": "一只小老鼠从画面右侧跑入，沿着墙角小心翼翼地向前跑，随后停下，张开嘴露出开心的表情。",
    "05. Dog Trouble_scene020.mp4": "一只灰色的猫和一只灰色的斗牛犬在地板上激烈地追逐和咆哮，猫用爪子抓地，狗张开嘴露出尖牙，两者都表现出愤怒和攻击性的姿态。",
    "05. Dog Trouble_scene021.mp4": "一只灰猫试图爬上一盏落地灯，但被一只狗从下方攻击，猫被逼到灯罩顶部，狗试图抓住它，猫最终被狗拉了下来。",
    "05. Dog Trouble_scene022.mp4": "一只棕色的小老鼠在墙角处兴奋地跳跃和舞动，表情开心，动作活泼。",
    "05. Dog Trouble_scene023.mp4": "一只戴着带刺项圈的灰色斗牛犬在金色的灯柱旁咆哮，随后它突然消失，只留下灯柱和空荡的房间。",
    "05. Dog Trouble_scene024.mp4": "一只棕色的小老鼠在墙角处惊慌失措地跑动，突然一只巨大的灰色斗牛犬从门后冲出，张开大嘴试图咬住它。小老鼠拼命逃跑，途中抓住了一个悬挂的物体，斗牛犬则在地上狂吠追赶，最终小老鼠成功逃脱。",
    "05. Dog Trouble_scene025.mp4": "一只棕色的小老鼠正在一根绳子上攀爬，它紧紧抓住绳子，表情专注。随着它向上爬，绳子的顶端出现了一个灰色的、类似蜂巢的物体，小老鼠继续向上攀爬，最终到达了蜂巢的底部。",
    "05. Dog Trouble_scene026.mp4": "一个木制的钟表，钟面显示时间为十点十分。钟表的顶部有一个小窗户，里面有一只黄色的小鸟。随着钟表的转动，小鸟从窗户中飞出，飞到钟表的右侧。此时，一只灰色的大狗出现在画面中，张开大嘴，露出尖锐的牙齿，似乎要咬住小鸟。狗的脖子上戴着一个带尖刺的红色项圈。随后，小鸟又飞回钟表的窗户中，狗也闭上了嘴巴。这个过程重复了一次。",
    "05. Dog Trouble_scene027.mp4": "一只灰色的猫正挂在一盏紫色灯罩的灯上，它先是用爪子抓着灯罩，然后慢慢向下爬，最终紧紧抱住灯杆，脸上露出得意的笑容。",
    "05. Dog Trouble_scene028.mp4": "一只灰色的猫抓住一个金色的柱子，然后被甩出去。接着，一只灰色的狗出现，也试图抓住柱子。",
    "05. Dog Trouble_scene029.mp4": "一只灰色的猫用爪子抓着一盏紫色灯罩的台灯，身体悬空，嘴巴张开，表情显得惊讶或紧张。背景是浅色的墙壁。",
    "05. Dog Trouble_scene030.mp4": "一只老鼠从钟楼里探出头，然后爬到钟的摆锤上，接着被一只狗从下方扑上来，老鼠惊慌失措地向上爬，最终狗张开大嘴，老鼠被吓得尖叫着向上逃窜。",
    "05. Dog Trouble_scene031.mp4": "一个木制的钟表，钟表上的小鸟突然飞出，一只老鼠被弹出，随后一只大狗出现并吃掉了钟表的一部分，老鼠则沿着墙边奔跑。",
    "05. Dog Trouble_scene032.mp4": "一只棕色的小猫正攀爬在一个木制的钟楼上，钟楼的钟面显示着罗马数字，小猫表情专注，似乎在努力向上爬。背景是淡绿色的墙壁，整体画面充满卡通风格。",
    "05. Dog Trouble_scene033.mp4": "一只灰色的斗牛犬戴着带刺的项圈，对着墙上的两个悬挂的物体狂吠，表情凶狠，不断张合嘴巴，似乎在试图咬或攻击它们。",
    "05. Dog Trouble_scene034.mp4": "一只灰色的猫从紫色灯罩里探出头来，然后爬到灯杆上，用爪子紧紧抓住灯杆，表情显得有些紧张和好奇。",
    "05. Dog Trouble_scene035.mp4": "一只黑猫用爪子抓住一个金色的灯柱，然后试图攀爬，但最终滑落下来。它在灯柱旁挣扎，显得非常狼狈。接着，一只灰色的大狗突然出现，张开大嘴，露出尖牙，向黑猫扑去。黑猫惊慌失措，迅速向后退去，试图躲避狗的攻击。狗继续追赶，黑猫在地板上翻滚，试图逃脱。",
    "05. Dog Trouble_scene036.mp4": "一只棕色的小老鼠坐在一个木制钟的屋顶上，它先是四处张望，然后用前爪捂住脸，接着又放下爪子，看起来有些紧张和不安。它不断调整姿势，最后似乎在思考或感到困惑。背景是简单的绿色墙壁和远处的山丘。",
    "05. Dog Trouble_scene037.mp4": "一只灰色的猫在追逐一只狗，猫在奔跑中被狗追上，猫被狗撞倒后从一个柜子上跳下来，猫坐在地上，看起来很生气，然后猫站起来，继续追赶狗。",
    "05. Dog Trouble_scene038.mp4": "一只棕色的小老鼠站在一个木制钟的屋顶上，它四处张望，表情紧张，似乎在躲避什么。背景是模糊的绿色山丘。",
    "05. Dog Trouble_scene039.mp4": "一只灰白相间的猫坐在房间的地板上，它先是抬头看着天花板，然后突然向后仰倒，接着又迅速站起并向前扑去，最后从画面右侧消失。背景中可以看到一个木制柜子和两根悬挂的羽毛玩具。",
    "05. Dog Trouble_scene040.mp4": "一只小老鼠站在桌子上，用尾巴缠住猫的胡须，猫被拉得东倒西歪，表情痛苦。",
    "05. Dog Trouble_scene041.mp4": "一只灰色的斗牛犬趴在木地板上，先是皱眉，然后张大嘴巴露出牙齿，接着又闭上嘴，表情显得有些委屈或不满。背景中可以看到紫色窗帘和蓝白条纹的家具。",
    "05. Dog Trouble_scene042.mp4": "一只灰色的猫和一只棕色的老鼠在室内发生追逐和拉扯。老鼠用尾巴拉扯猫的胡须，猫则试图抓住老鼠，过程中猫被拉得东倒西歪。最终，老鼠成功逃脱，猫则显得狼狈不堪。",
    "05. Dog Trouble_scene043.mp4": "一只棕色的小老鼠在空中翻滚，四肢张开，表情惊恐。背景是单一的浅绿色。",
    "05. Dog Trouble_scene044.mp4": "一只灰色的猫趴在桌子上，眼睛发光，表情兴奋，它用前爪扒着桌子，身体前倾，似乎在等待或准备做某事。背景是室内环境，有紫色窗帘和楼梯。",
    "05. Dog Trouble_scene045.mp4": "一只大狗张开嘴，一只猫被吊在狗的嘴里，猫试图挣脱，但被狗紧紧咬住。猫在狗嘴里挣扎，狗则张大嘴巴，露出牙齿，显得非常凶猛。猫最终被狗咬住，无法逃脱。",
    "05. Dog Trouble_scene046.mp4": "一只猫和一只老鼠在屋顶上互动。猫先是惊讶地发现老鼠，然后试图抓住它，但老鼠灵活地躲开并反击。猫表现出愤怒和惊讶的表情，而老鼠则显得得意和挑衅。两者在屋顶上进行了一场紧张的追逐和对峙。",
    "05. Dog Trouble_scene047.mp4": "一只灰色的斗牛犬趴在木地板上，它先是张大嘴巴，露出牙齿，然后慢慢闭上嘴，表情变得严肃。背景中可以看到紫色窗帘和蓝白格子的床单。",
    "05. Dog Trouble_scene048.mp4": "一只黑猫和一只小老鼠站在屋顶上，黑猫表情惊讶，小老鼠则显得自信满满。",
    "05. Dog Trouble_scene049.mp4": "一只棕色的小老鼠站在一个物体上，它先是低头看着自己的尾巴，然后抬头四处张望，接着用前爪挠了挠耳朵，最后张开嘴巴似乎在叫喊或表达惊讶。背景是简单的绿色墙面。",
    "05. Dog Trouble_scene050.mp4": "视频展示了一个编织场景，桌面上有一个装满红色毛线的编织篮，篮中插着两根蓝色的编织针，旁边放着一块红色的编织物。背景中可以看到一些模糊的物体，包括一个橙色的物体和紫色的窗帘。整个画面色彩柔和，给人一种温馨宁静的感觉。",
    "05. Dog Trouble_scene051.mp4": "一只棕色的小老鼠站在一个物体上，张开双臂，面带笑容，随后用手指指向一侧。背景为浅绿色，左侧可见部分黑色和白色物体。",
    "05. Dog Trouble_scene052.mp4": "一只灰色的猫和一只棕色的老鼠在木制结构上互动。老鼠先是站在猫的面前，然后爬上猫的耳朵，接着被猫抓住并悬挂在空中。老鼠挣扎着，猫则露出得意的笑容。最后，老鼠从猫的爪子中逃脱，猫则显得有些惊讶和困惑。",
    "05. Dog Trouble_scene053.mp4": "一只灰色的斗牛犬在木地板上，它张开嘴巴，露出牙齿，看起来很凶猛。背景中有紫色窗帘和蓝白条纹的家具。",
    "05. Dog Trouble_scene054.mp4": "一只灰色的猫坐在一个挂在墙上的木制钟上，它张开双臂，露出开心的笑容。随后，猫调整姿势，身体稍微前倾，继续保持着愉悦的表情。接着，一只白色的狗从下方出现，它张大嘴巴，看起来很兴奋或惊讶。猫在钟上保持平衡，狗则在下方晃动，猫继续笑着，似乎对狗的出现感到有趣。",
    "05. Dog Trouble_scene055.mp4": "一只小老鼠从紫色窗帘后探出头来，然后沿着窗帘滑下，最后消失在窗帘后面。",
    "05. Dog Trouble_scene056.mp4": "一只小老鼠从紫色窗帘后探出头来，迅速跳到桌子上的一个装有红色毛线和蓝色针的篮子中，然后消失在毛线里。",
    "05. Dog Trouble_scene057.mp4": "一只小老鼠从装满红色毛线的篮子里探出头来，它兴奋地拉扯着毛线，然后迅速跑开，留下毛线在桌面上。",
    "05. Dog Trouble_scene058.mp4": "一只小老鼠被一根红绳缠住，它拖着红绳在桌面上奔跑，经过一排银质杯子和一个银壶，最后从紫色窗帘后消失。",
    "05. Dog Trouble_scene059.mp4": "视频展示了一只小老鼠在房间内拉扯红色绳子，绳子连接着一个挂在墙上的钟表，钟表上坐着一只猫。猫被绳子拉扯得摇晃，同时一只狗在下方试图拉扯绳子，但未能成功。小老鼠继续拉扯绳子，导致房间内的家具也被绳子缠绕。最终，小老鼠成功将绳子拉紧，钟表上的猫被甩出，而狗则被绳子缠住。",
    "05. Dog Trouble_scene061.mp4": "一只小老鼠正在拉扯一根红色的绳子，绳子连接着一个蓝色的三脚架。小老鼠用力拉扯，绳子绷紧，小老鼠被拉得向后退去，最终撞到了墙角。",
    "05. Dog Trouble_scene062.mp4": "一只戴着红色项圈的灰色斗牛犬坐在地上，抬头看着悬挂的两个黑色物体，表情专注。",
    "05. Dog Trouble_scene063.mp4": "一只小老鼠在木制地板上跳舞，突然一只大狗从画面右侧出现，小老鼠吓了一跳，但很快又开始跳舞。大狗看起来很生气，小老鼠则继续跳舞，大狗最终被逗笑了，也跟着小老鼠一起跳舞。",
    "05. Dog Trouble_scene064.mp4": "一只小老鼠沿着墙角快速奔跑，经过一个紫色的桌腿，然后停下来看着前方。",
    "05. Dog Trouble_scene065.mp4": "一只灰色的斗牛犬在房间里追赶一只棕色的小老鼠，小老鼠在躲避过程中，被各种物品绊倒，包括一个蓝色的装饰物、一个白色的盘子和一个红色的绳子，最终小老鼠被绊倒在地。",
    "05. Dog Trouble_scene066.mp4": "一个穿着黄色衣服、系着白色围裙、脚穿蓝色拖鞋的角色从门后走出，边走边抱怨房间被弄得一团糟，随后愤怒地指责“你这只胖敦敦的狮子狗！”",
    "05. Dog Trouble_scene067.mp4": "一只被红色毛线缠绕的灰色斗牛犬躺在满是碎片的房间里，愤怒地咆哮，用木棍砸碎酒杯，抱怨自己被弄成这样。",
    "05. Dog Trouble_scene069.mp4": "一只棕色的小老鼠在木地板上，床底下，它先是左右张望，然后开心地跳舞，接着又左右张望，最后停下来看着前方。",
    "05. Dog Trouble_scene070.mp4": "猫拿着捕鼠夹，看到老鼠后变得非常愤怒，张大嘴巴咆哮，老鼠吓得逃跑。",
    "05. Dog Trouble_scene071.mp4": "猫追逐老鼠，老鼠逃进房间深处，猫在追逐中撞到墙，画面逐渐变暗，最后出现“The End”字样。",
    "05. Dog Trouble_scene072.mp4": "视频显示了经典的“Tom and Jerry”动画片尾画面，背景为红色，中央有“THE END”字样，随后出现“An M.G.M Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”字样。",
    "05. Dog Trouble_scene073.mp4": "视频开头展示了“An MGM Tom and Jerry Cartoon”标题，背景为深红色，文字为蓝色和黄色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑，持续数秒。"
}