{
    "E102.Down.Beat.Bear_scene001.mp4": "画面从全黑开始，随后出现米高梅卡通的标志，标志中央是一只咆哮的狮子，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”，背景为深蓝色。",
    "E102.Down.Beat.Bear_scene002.mp4": "视频片段展示了两个经典动画片的片头。首先，是米高梅动画片的标志，蓝色背景上有一只咆哮的狮子，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。接着，画面切换到《猫和老鼠》的片头，绿色背景上是猫汤姆和老鼠杰瑞的卡通形象，以及“TOM and JERRY”的黄色字样。最后，画面中出现了“CINEMASCOPE”的字样，暗示影片采用宽银幕格式。",
    "E102.Down.Beat.Bear_scene003.mp4": "这是一个动画片的片头，标题为“Down Beat Bear”，采用CINEMASCOPE格式。片头展示了制作人员名单，包括动画师Kenneth Muse、Ed Barge、Irvin Spence和Lewis Marshall，布局和背景由Dick Bickenbach和Robert Gentle负责，音乐由Scott Bradley创作。最后，片头显示该动画由Joseph Barbera和William Hanna制作和导演。背景为红色，文字为白色和黄色，整体风格复古。",
    "E102.Down.Beat.Bear_scene004.mp4": "视频开头显示了制作人和导演的名字，随后场景切换到一个昏暗的房间，房间内有一把椅子和一本书，背景中有一个拱形门洞和一些机械设备。",
    "E102.Down.Beat.Bear_scene005.mp4": "一只戴着帽子的棕色老鼠从拱形门后走出，手里拿着一个卷纸。它摘下帽子，向观众致意，然后走向房间左侧的一把椅子，最终坐在椅子上。房间内有各种设备和家具，包括一个台灯、一些管道和一个彩色的盒子。",
    "E102.Down.Beat.Bear_scene006.mp4": "视频开始时，一个棕色的老鼠从一个木制收音机的扬声器中探出头来，它看起来非常兴奋和好奇。接着，画面切换到一个房间，老鼠坐在一个舒适的椅子上，手里拿着一张纸，似乎在认真阅读。房间内有一盏台灯，光线柔和，营造出一种温馨的氛围。老鼠的表情专注而满足，偶尔抬头微笑，显示出它对所读内容的兴趣和享受。整个场景充满了宁静和愉悦的感觉。",
    "E102.Down.Beat.Bear_scene007.mp4": "汤姆猫戴着一顶红色帽子，从门口走进房间，把帽子放在壁炉架上，然后走向一把绿色的扶手椅，坐在椅子上，展开卷纸阅读。他读着读着，表情变得严肃，随后用手指着电视机，似乎在对电视里的内容表示不满或惊讶。",
    "E102.Down.Beat.Bear_scene008.mp4": "一只棕色的老鼠坐在一个倾斜的白色滑梯上，滑梯底部有一本打开的书。老鼠表情严肃，目光看向一侧。背景中有一个绿色灯罩的台灯和一些管道设备。",
    "E102.Down.Beat.Bear_scene009.mp4": "视频中，一只老鼠从一个木制柜子的录音机里探出头来，似乎在观察四周。随后，镜头切换到一只猫坐在绿色条纹的椅子上，手里拿着报纸阅读。猫的表情从专注逐渐变为愤怒，接着他的头部被一个圆筒状物体覆盖，看起来像是被什么东西套住了。猫的表情依然愤怒，似乎对这种状况感到不满。",
    "E102.Down.Beat.Bear_scene010.mp4": "一只棕色的老鼠坐在椅子上，手里拿着一张纸阅读。它先是面带微笑，随后表情变得愤怒。房间内有一盏台灯和几本书，天花板上有一些设备。",
    "E102.Down.Beat.Bear_scene011.mp4": "视频中展示了一个木制柜子，柜子上有两个圆形按钮和一个长条形的开关。起初，柜子的开关打开，一只小老鼠从里面探出头来，随后迅速缩回。接着，一只灰色的猫——汤姆，出现在画面中，他用手指指向柜子上的开关，表情从疑惑变为惊讶，似乎在思考或发现了什么。",
    "E102.Down.Beat.Bear_scene012.mp4": "一只棕色的小老鼠坐在一个现代风格的椅子上，手里拿着一张纸，似乎在认真阅读。它的眼睛时而睁大，时而眯起，表情专注而好奇。背景是一个室内环境，左侧有一盏台灯，右侧有一个书架，上面放着几本书。天花板上有复杂的管道和电线，暗示这是一个科技感较强的房间。整个画面色彩柔和，充满卡通风格。",
    "E102.Down.Beat.Bear_scene013.mp4": "汤姆猫站在一台老式收音机前，先是好奇地探头观察，随后伸出爪子似乎想调整或操作收音机。接着，他变得愤怒，用爪子指着收音机，表情变得凶狠，似乎在责备或抗议收音机的某种行为。收音机的屏幕里，一只红色的小老鼠正在里面活动，看起来像是在躲避或玩耍。汤姆猫继续用爪子指着收音机，表情愈发愤怒，似乎在与收音机里的小老鼠进行对抗。",
    "E102.Down.Beat.Bear_scene014.mp4": "动画片中，汤姆猫从柜子后面探出头，伸手拔掉插在墙上的绿色电源线插头，然后将插头扔到椅子旁边，自己也退回到柜子后面。",
    "E102.Down.Beat.Bear_scene015.mp4": "视频开始时，一个木制柜子的顶部有一个类似收音机的装置，装置中间有一个小窗口，窗口内有一只老鼠，它从窗口探出头来，用爪子拨动下方的白色按键。随后，画面突然变黑，接着切换到一个夜晚的场景，一只穿着红色背心、戴着绿色帽子的熊在户外行走。",
    "E102.Down.Beat.Bear_scene016.mp4": "一只戴着绿色帽子、穿着红色背心的棕色老鼠在夜晚的街道上跳舞，它经过一扇蓝色的栅栏门，然后跳过一道绿色的篱笆，继续在草地上跳舞，背景中可以看到几栋亮着灯的房子。",
    "E102.Down.Beat.Bear_scene017.mp4": "夜晚，一只戴着绿色帽子、披着红色斗篷的棕色狗从窗户探出头，看着窗外的月亮。它伸长舌头，兴奋地从窗台上的果盘里拿起一个苹果和一根香蕉，然后开心地吃了起来。",
    "E102.Down.Beat.Bear_scene018.mp4": "汤姆猫坐在绿色条纹的扶手椅上，手里拿着报纸阅读。突然，他被报纸的动静惊动，报纸从他手中飞出，他迅速躲到椅子后面，露出一双警惕的眼睛，似乎在观察报纸的去向。",
    "E102.Down.Beat.Bear_scene019.mp4": "一只戴着绿色帽子、穿着红色衣服的棕色狗站在窗边，左手拿着一个红苹果，右手拿着一根香蕉。它闭着眼睛，享受地吃着香蕉，表情非常满足。背景是夜晚，窗外可以看到一轮明月。",
    "E102.Down.Beat.Bear_scene020.mp4": "汤姆猫从绿色条纹扶手椅后探出头，露出狡黠的笑容并指向一侧，随后起身，用手轻拍扶手椅，然后转身离开。",
    "E102.Down.Beat.Bear_scene021.mp4": "一只戴着绿色帽子的熊站在窗边，手里拿着一个苹果和一根香蕉，正在享受美食。突然，一只戴着白手套的手从窗外伸进来，拿起电话听筒，然后又放回原处。熊继续吃着水果，似乎没有注意到这个动作。",
    "E102.Down.Beat.Bear_scene022.mp4": "汤姆猫坐在绿色条纹扶手椅上，拿起电话听筒，表情从疑惑变为开心，似乎在与人愉快交谈。",
    "E102.Down.Beat.Bear_scene023.mp4": "一只棕色的小老鼠跑向墙上的电源插座，用嘴咬住插头并试图将其拔出。它用力拉扯，插头被拔出后，老鼠松开嘴，站在原地。",
    "E102.Down.Beat.Bear_scene024.mp4": "一只戴着绿色帽子、穿着红色背心的棕色狗站在窗前，手里拿着一个红苹果。它先是闭着眼睛，似乎在享受苹果的香味，然后张开嘴，露出开心的表情，接着又闭上眼睛，享受着苹果的美味。背景是夜晚，窗外可以看到月亮。",
    "E102.Down.Beat.Bear_scene025.mp4": "汤姆猫拿着望远镜，躲在绿色条纹沙发后面偷看，突然一只棕色的手从沙发后面伸出来，汤姆猫被吓了一跳，手从沙发后面抽走后，汤姆猫也消失了。",
    "E102.Down.Beat.Bear_scene026.mp4": "一只穿着红色背心和绿色帽子的棕色狗正在客厅里跳舞，它手里拿着一只灰色的猫。猫被狗拉扯着，表情痛苦，但狗却显得非常开心和自信。他们一起在房间里转圈，背景是蓝色的墙壁、壁炉和绿色的沙发。",
    "E102.Down.Beat.Bear_scene027.mp4": "一只棕色的小老鼠站在一根绿色的电线旁，它先是看向电线，然后抬起右前爪指向电线，脸上露出微笑。",
    "E102.Down.Beat.Bear_scene028.mp4": "一只棕色的狗穿着红色背心和绿色帽子，用绳子绑住一只灰色的猫，拖着它在房间里走动。猫被拖得东倒西歪，表情痛苦，但狗却显得非常得意和快乐。最终，狗把猫拖到一个柜子前，猫被甩在地上，狗则站在一旁，看起来有些惊讶。",
    "E102.Down.Beat.Bear_scene029.mp4": "一只戴着绿色帽子、穿着红色披风的棕色卡通狗，先是举起双手，然后用嘴咬了一口苹果，接着闭上眼睛享受苹果的味道。",
    "E102.Down.Beat.Bear_scene030.mp4": "汤姆猫从椅子后面探出头，看到地上的电话，他爬过去拿起听筒，拨打电话，但似乎没有接通，他显得有些困惑和不耐烦。",
    "E102.Down.Beat.Bear_scene031.mp4": "动画片段中，一只灰色的猫从左侧跳出来，抓住了一只棕色的小老鼠。猫用爪子捏住老鼠，老鼠在猫的爪子中挣扎。猫将老鼠举到面前，老鼠在猫的爪子中继续挣扎。猫把老鼠放回原处，老鼠从柜子的缝隙中滑落。",
    "E102.Down.Beat.Bear_scene032.mp4": "一只棕色的狗戴着绿色帽子和红色背心，用绳子绑住一只灰色的猫，猫被狗拖着在房间里跑动。狗看起来非常开心，而猫则显得不情愿和挣扎。他们从沙发旁跑过，经过壁炉，最后跑向画面左侧的椅子。",
    "E102.Down.Beat.Bear_scene033.mp4": "动画片段中，一只穿着红色斗篷的猫从门后冲出，撞上并撞开一扇黄色的门。随后，门后出现一套挂在衣架上的棕色西装，一只猫的手臂从门缝中伸出，试图抓住门把手。",
    "E102.Down.Beat.Bear_scene034.mp4": "汤姆猫从门后探出身体，表情兴奋，随后站直身体，伸出手指指向一侧，显得得意洋洋。",
    "E102.Down.Beat.Bear_scene035.mp4": "一只小老鼠靠近墙上的电源插座，试图将插头拔出。突然，一只猫拿着剪刀出现，剪断了电线，导致电线脱落。",
    "E102.Down.Beat.Bear_scene036.mp4": "一只灰色的猫从蓝色门后跳出，向右走去。镜头转向一台蓝色的唱片机，一只棕色的小老鼠从唱片机里探出头，看着唱片机上的唱针。",
    "E102.Down.Beat.Bear_scene037.mp4": "动画片中的猫汤姆在室内，先是张开双臂，然后双手叉腰，接着又张开双臂并向前倾身，最后恢复站立姿势。",
    "E102.Down.Beat.Bear_scene038.mp4": "一个穿着红色斗篷、戴着绿色帽子的棕色角色从一扇黄色的门中快速跑出，门后挂着一套深色西装。角色跑出后，门关闭。",
    "E102.Down.Beat.Bear_scene040.mp4": "一只小老鼠在留声机上跳舞，猫突然出现，把唱片拿走，小老鼠被吓到。",
    "E102.Down.Beat.Bear_scene041.mp4": "一只小老鼠跑进房间，跳上钢琴弹奏。猫汤姆看到后，惊讶地张大嘴巴，然后追赶小老鼠。小老鼠跑向房间另一头，猫汤姆追到门口，被一只戴着绿色帽子、穿着红色背心的熊抓住，熊抱着猫汤姆，用一根棍子挥舞着，似乎在指挥或跳舞，同时猫汤姆表情愤怒。",
    "E102.Down.Beat.Bear_scene042.mp4": "一只棕色的小老鼠从空中跳下，落在一把黄色的尤克里里上，然后开始弹奏乐器。",
    "E102.Down.Beat.Bear_scene043.mp4": "一只穿着红色背心、戴着绿色帽子的棕色狗和一只灰色猫在室内跳舞。狗跳得非常开心，而猫则显得有些不情愿和笨拙。随着舞蹈进行，狗突然跳进地板上的一个洞里，帽子也掉落在洞边。猫站在洞边，露出得意的笑容。",
    "E102.Down.Beat.Bear_scene044.mp4": "视频中，一只老鼠正在弹奏一把尤克里里，随后一只猫出现并抢走了乐器。猫开始拉扯乐器，导致乐器被拉长变形。老鼠被拉扯着跑开，最终停在一个收音机旁。猫继续拉扯乐器，但老鼠没有理会。猫最终放弃拉扯，乐器被拉成一条长长的带子。老鼠站在收音机旁，猫则站在一旁看着。",
    "E102.Down.Beat.Bear_scene045.mp4": "汤姆猫正在打电话，突然一只穿着红色披风、戴着绿色帽子的熊从地板洞里跳出来，汤姆吓得跳进洞里逃跑，熊则站在洞边看着汤姆逃跑。",
    "E102.Down.Beat.Bear_scene046.mp4": "汤姆猫从门后跑出来，扑向沙发，结果沙发变成床，一只穿着红色衣服的棕色狗躺在上面。汤姆猫看着狗，然后沙发又变回原样，汤姆猫露出得意的笑容。",
    "E102.Down.Beat.Bear_scene047.mp4": "夜晚，汤姆从房子中冲出，追逐着杰瑞。杰瑞拉着一个紫色的箱子逃跑，汤姆紧追不舍。最终，汤姆抓住了杰瑞和箱子，得意地展示着战利品。",
    "E102.Down.Beat.Bear_scene048.mp4": "汤姆猫在夜晚的户外，一手抓着杰瑞老鼠，另一手提着一个紫色的钟表收音机。他先是得意地展示着收音机，然后高举收音机，兴奋地跳跃起来，显得非常开心和满足。",
    "E102.Down.Beat.Bear_scene049.mp4": "一个紫色的收音机在夜空中飘浮，周围有树枝和树叶。收音机在空中旋转，最终停在树枝上。",
    "E102.Down.Beat.Bear_scene050.mp4": "一个紫色的收音机挂在树枝上，背景是蓝色的天空和一些树叶。收音机在树枝上轻轻晃动，然后逐渐稳定下来。",
    "E102.Down.Beat.Bear_scene051.mp4": "在夜晚的户外，一只灰色的猫（汤姆）用爪子抓着一只棕色的小老鼠（杰瑞）。汤姆先是眯着眼睛，露出得意的笑容，然后张大嘴巴，似乎在大声说话或唱歌。接着，汤姆用爪子捂住自己的嘴，眼睛眯成一条线，显得非常开心和满足。杰瑞则一直被汤姆抓着，表情从愤怒逐渐变为无奈和不耐烦。背景是深蓝色的夜空和远处的绿色草地。",
    "E102.Down.Beat.Bear_scene053.mp4": "这是一个MGM出品的《猫和老鼠》动画片的片头画面，背景为蓝色，上面有金色的文字“An M.G.M. Tom and Jerry CARTOON”，下方写着“MADE IN HOLLYWOOD, U.S.A.”。画面中没有其他动作或变化。"
}