{
    "S1940E38 - Mouse Cleaning_scene001.mp4": "画面显示了米高梅卡通的标志，背景为深蓝色，标志中央是一只狮子的头像，下方有“CARTOON”字样，以及“COLOR BY TECHNICOLOR”的文字。",
    "S1940E38 - Mouse Cleaning_scene002.mp4": "这是一个米高梅动画片头，蓝色背景上有一个咆哮的狮子头像，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。狮子在画面中张开嘴巴，展示出牙齿，随后闭上嘴巴，整个画面保持静态。",
    "S1940E38 - Mouse Cleaning_scene003.mp4": "视频开始时显示了“Metro-Goldwyn-Mayer Cartoon”标志，随后画面转黑，接着出现“Tom and Jerry”的标题画面，其中Tom猫和Jerry鼠的形象出现在标题旁边。",
    "S1940E38 - Mouse Cleaning_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深蓝色，左侧是棕色的小老鼠杰瑞，右侧是灰色的猫汤姆，中间是黄色的“TOM and JERRY”字样。随后，画面中出现了“MOUSE CLEANING”字样，以及“Directed by William Hanna and Joseph Barbera”的导演信息。",
    "S1940E38 - Mouse Cleaning_scene005.mp4": "这是一个动画片的片头，标题为“Mouse Cleaning”，由William Hanna和Joseph Barbera执导。画面中显示了猫和老鼠的剪影，老鼠拿着扫帚，猫被扫帚扫起，背景是渐变的蓝绿色。随后，画面下方出现了制作人员的名单，包括动画师、音乐师等。整个画面风格复古，具有经典卡通片的特征。",
    "S1940E38 - Mouse Cleaning_scene006.mp4": "视频展示了一段动画片的片头字幕，背景为深绿色，上面有金色的文字。字幕列出了动画的制作人员，包括动画师伊文·斯宾塞、肯尼斯·穆斯、埃德·巴奇和雷·帕特森，音乐由斯科特·布拉德利负责。此外，还显示了制片人弗雷德·奎姆比的名字。底部有版权信息，注明由洛威尔公司制作，并有“MPAA”批准标志和“Western Electric Sound System”字样。整个画面保持静态，没有动作或场景变化。",
    "S1940E38 - Mouse Cleaning_scene007.mp4": "一个穿着绿色围裙和红色拖鞋的卡通人物正在厨房里用拖把拖地。",
    "S1940E38 - Mouse Cleaning_scene009.mp4": "一只灰色的猫在追逐一只棕色的小老鼠，猫在追赶过程中滑倒并陷入泥坑，溅起泥水，最终猫被泥水覆盖，老鼠则成功逃脱。",
    "S1940E38 - Mouse Cleaning_scene010.mp4": "一只老鼠从窗外跳进屋内，追逐一只猫。猫被老鼠追得四处逃窜，最终摔倒在地，身上沾满了泥浆。猫在地上挣扎，试图站起来，但泥浆使它无法动弹。",
    "S1940E38 - Mouse Cleaning_scene011.mp4": "视频中，一只灰色的猫（汤姆）在厨房地板上被泥巴弄得满身都是，他试图逃跑但被一个拿着拖把和水桶的女佣追赶。女佣用拖把和水桶试图清理地板上的泥巴，而汤姆则不断挣扎、躲避，并试图用各种方式反击，包括泼水和抢夺拖把。最终，汤姆被拖把拖倒在地，女佣继续用拖把清理地板，而汤姆则躺在地上，显得无助和沮丧。整个场景充满了幽默和混乱。",
    "S1940E38 - Mouse Cleaning_scene012.mp4": "汤姆猫被一根红色的棍子夹住尾巴，躺在地上，表情痛苦。他用双手抓住自己的耳朵，似乎在试图摆脱困境。背景是厨房的地板和橱柜。",
    "S1940E38 - Mouse Cleaning_scene014.mp4": "一只小老鼠躲在扫帚后面，露出头来，表情从好奇变为惊讶。",
    "S1940E38 - Mouse Cleaning_scene016.mp4": "一只灰色的猫汤姆站在窗前，看到窗外飞来一只蓝色的小鸟。汤姆兴奋地伸出手去抓，但小鸟飞走了。汤姆失望地拉起窗帘，发现窗帘上有一只红色的蝴蝶。汤姆又兴奋地伸手去抓，但蝴蝶也飞走了。汤姆坐在地上，张大嘴巴，显得非常惊讶和失望。",
    "S1940E38 - Mouse Cleaning_scene017.mp4": "一只小老鼠站在一个烟灰缸上，用一把大刀挥舞着，似乎在清理烟灰缸里的烟头。它不断挥舞刀子，烟灰和烟头被扫向一旁，动作夸张而富有喜剧效果。背景是一个室内环境，有台灯和一些家具。",
    "S1940E38 - Mouse Cleaning_scene018.mp4": "汤姆猫正在打扫地板上的污渍，他拿着扫帚和簸箕，用力清扫，但污渍却四处飞溅，最终他累得气喘吁吁，扫帚也掉在了地上。",
    "S1940E38 - Mouse Cleaning_scene019.mp4": "一只棕色的小老鼠正用尽全力推动一个巨大的黄色圆盘，圆盘上有一个蓝色的圆形开口。随着小老鼠的推动，圆盘不断旋转，从开口中喷出大量的白色碎屑，碎屑在地面上堆积成一堆。小老鼠表情专注，似乎在努力完成这个任务。背景是橙色的地板和木质家具的底部。",
    "S1940E38 - Mouse Cleaning_scene020.mp4": "汤姆猫在厨房里拿着扫帚和簸箕，表情愤怒。他扔掉工具，拿起一个番茄，做出夸张的踢腿动作，随后用番茄砸向地面，番茄破裂，汁液四溅。",
    "S1940E38 - Mouse Cleaning_scene022.mp4": "一个房间内，突然从墙壁上爆发出红色的液体，像血一样四处飞溅。",
    "S1940E38 - Mouse Cleaning_scene023.mp4": "汤姆猫在房间里摔倒，随后被一个黄色的物体击中，身体被缠住，痛苦地在地上翻滚。",
    "S1940E38 - Mouse Cleaning_scene024.mp4": "在一个房间里，墙上有一大片红色污渍。汤姆猫拿着一块黄色的抹布和一个装有水的桶，他用力地擦拭墙壁上的污渍，水花四溅。汤姆猫在擦拭过程中显得非常努力，他的动作幅度很大，身体前后摆动，试图把污渍擦干净。",
    "S1940E38 - Mouse Cleaning_scene025.mp4": "一只小老鼠站在红色的凳子上，手里拿着一支绿色的画笔，正在给一个装满水的白色桶涂上蓝色的油漆。小老鼠兴奋地挥舞着画笔，桶里的水逐渐被染成了蓝色。",
    "S1940E38 - Mouse Cleaning_scene026.mp4": "汤姆正在用一块黄色的布擦拭墙壁上的红色油漆，然后他换用一块蓝色的布继续擦拭。他看起来很沮丧，最后他发现蓝色的油漆覆盖了红色的油漆，形成了一个巨大的“Z”形图案。汤姆惊恐地盯着这个图案，似乎意识到自己犯了一个错误。",
    "S1940E38 - Mouse Cleaning_scene027.mp4": "杰瑞拿着一支巨大的绿色笔，在黄色窗帘下奔跑。突然，汤姆从窗帘后冲出，张大嘴巴，露出愤怒的表情。汤姆扑向杰瑞，但被杰瑞用笔击中，汤姆摔倒在地，显得非常惊讶和困惑。",
    "S1940E38 - Mouse Cleaning_scene028.mp4": "一只棕色的小老鼠站在黄色窗帘前，手里拿着一支绿色的钢笔。它先是用钢笔在空中比划，然后用笔尖在自己的脸颊上轻轻点了一下，接着又用笔尖在自己的鼻子上点了一下，最后把笔尖放在自己的嘴巴上，似乎在思考或模仿写字的动作。",
    "S1940E38 - Mouse Cleaning_scene029.mp4": "汤姆猫看到杰瑞鼠拿着一支绿色的笔，先是惊讶地张大嘴巴，然后露出愤怒的表情，伸手去抢杰瑞手中的笔。杰瑞鼠则显得有些害怕，试图躲开汤姆的抢夺。",
    "S1940E38 - Mouse Cleaning_scene030.mp4": "汤姆猫拿着一支绿色的笔，对着一个穿着黄色衣服的角色的鼻子喷蓝色的墨水。墨水溅到了黄色衣服上，汤姆猫看起来很惊讶，然后他开始大笑，接着他抓起黄色衣服，似乎想把墨水擦掉，但最终被衣服裹住，从画面中消失。",
    "S1940E38 - Mouse Cleaning_scene031.mp4": "汤姆猫在洗衣房里，不小心把黄色的衣物弄湿，然后他试图用熨斗熨干它，结果被蒸汽喷到，最后衣物滑落，汤姆猫被甩出画面。",
    "S1940E38 - Mouse Cleaning_scene032.mp4": "汤姆猫试图拉开窗帘，但被窗帘缠住，他挣扎着，最终坐在地上，舌头伸出，看起来非常疲惫和沮丧。",
    "S1940E38 - Mouse Cleaning_scene033.mp4": "杰瑞在一根绳子上走，手里拿着一个鸡蛋，头顶上还有几个鸡蛋在空中飘着。汤姆从左侧出现，张大嘴巴，看起来很惊讶。汤姆试图抓住杰瑞，但杰瑞继续走着，汤姆追不上。杰瑞把鸡蛋扔向汤姆，汤姆被鸡蛋击中，表情痛苦。杰瑞继续走，汤姆被击中后倒在地上。",
    "S1940E38 - Mouse Cleaning_scene034.mp4": "在厨房里，汤姆猫被鸡蛋砸中后，惊慌失措地四处躲避，同时不断有鸡蛋从空中掉落，他试图用手接住，但显得手忙脚乱。",
    "S1940E38 - Mouse Cleaning_scene035.mp4": "杰瑞拿着一个派，站在柜子上，汤姆从旁边冲过来，杰瑞把派扔向汤姆，汤姆被派砸中，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中后，汤姆被派砸中",
    "S1940E38 - Mouse Cleaning_scene036.mp4": "一只小老鼠拉着地毯，导致猫摔倒在地。猫在地上滑行，捡起一盒鸡蛋，然后被从天而降的西瓜砸中，变成了一只西瓜猫。",
    "S1940E38 - Mouse Cleaning_scene037.mp4": "一只小老鼠从门后探出头来，然后迅速跑进屋内。这时，一匹戴着黄色帽子、背着棕色袋子、嘴里叼着草的灰色马从门外走进来。马看起来很虚弱，走路摇晃。接着，一只灰色的猫从马的后面出现，它试图抓住马，但马却继续向前走，猫被马甩在后面。",
    "S1940E38 - Mouse Cleaning_scene038.mp4": "一只小老鼠从门外跑进来，被一只灰猫追着跑。灰猫撞到门上，摔倒在地，然后站起来，看起来很生气。他用手摸了摸头，然后慢慢走开。",
    "S1940E38 - Mouse Cleaning_scene039.mp4": "一个黄色的紧急入口盖板被打开，露出后面写着“EMERGENCY ENTRANCE”的标志，一只猫从里面探出头来，表情兴奋。",
    "S1940E38 - Mouse Cleaning_scene040.mp4": "一只灰色的猫躺在地毯上，先是侧身，然后慢慢翻转身体，最终面朝下趴着，看起来很放松。背景是一个温馨的客厅，有粉色的沙发和黄色的窗帘。",
    "S1940E38 - Mouse Cleaning_scene041.mp4": "一只小老鼠拿着一个标有“STAMP”的黄色盒子，走到一只大猫的脚边。小老鼠用盒子在猫的脚上反复摩擦，试图打开盒子。猫的脚很大，脚趾甲是蓝色的，脚掌是白色的。小老鼠看起来很努力，表情专注。",
    "S1940E38 - Mouse Cleaning_scene042.mp4": "一只灰色的猫（汤姆）躺在沙发上，一只棕色的小老鼠（杰瑞）拿着一个黄色的盒子走到猫面前，猫被盒子吸引，老鼠把盒子放在猫的脚边，猫被盒子上的“STAMP”字样吸引，突然跳起来，盒子被老鼠踩在脚下，猫愤怒地追击老鼠，老鼠逃跑，猫追到沙发旁，老鼠被猫抓住，猫用爪子拍打老鼠，老鼠被拍打后，猫突然大叫，老鼠站在猫面前，猫看着老鼠，老鼠用爪子拍打猫的爪子，猫被拍打后，猫突然大叫，老鼠站在猫面前，猫看着老鼠，老鼠用爪子拍打猫的爪子，猫被拍打后，猫突然大叫，老鼠站在猫面前，猫看着老鼠，老鼠用爪子拍打猫的爪子，猫被拍打后，猫突然大叫，老鼠站在猫面前，猫看着老鼠，老鼠用爪子拍打猫的爪子，猫被拍打后，猫突然大叫，老鼠站在猫面前，猫看着老鼠，老鼠用爪子拍打猫的爪子，猫被拍打后，猫突然",
    "S1940E38 - Mouse Cleaning_scene043.mp4": "房间内布满蓝色脚印，一只猫从画框中跳出，落在椅子上。",
    "S1940E38 - Mouse Cleaning_scene044.mp4": "汤姆猫坐在地上，表情痛苦，爪子上沾满蓝色颜料。杰瑞鼠站在他面前，开心地笑着。汤姆猫突然愤怒地扑向杰瑞鼠，抓起他后飞身离开画面。",
    "S1940E38 - Mouse Cleaning_scene045.mp4": "汤姆猫抱着杰瑞鼠，试图用爪子打开墙上的红色盒子，但盒子突然弹开，汤姆被弹飞，随后又重重摔在地上，盒子恢复原状。",
    "S1940E38 - Mouse Cleaning_scene046.mp4": "一只小老鼠从窗户跳进房间，然后跳进一个黄色的水桶里，水桶里有水，小老鼠在桶里晃动，看起来很享受。房间内有一个装满衣物的篮子，墙上有一扇窗户，远处可以看到楼梯。",
    "S1940E38 - Mouse Cleaning_scene047.mp4": "汤姆猫正在努力打扫地板，他一手拿着扫帚，一手拿着拖把，但因为地板上有许多蓝色的脚印，他显得非常吃力和烦躁。他的表情显示出他正在努力克服困难，同时努力保持平衡。背景是一个简单的房间，有一面墙和一个书柜。",
    "S1940E38 - Mouse Cleaning_scene048.mp4": "一只棕色的小老鼠坐在一个黄色的桶里，桶边有红色的把手。小老鼠先是看向画面右侧，然后转头看向画面左侧，接着又转回看向画面右侧。背景是一个室内场景，有石墙、窗户和楼梯，旁边还有一个装满衣物的篮子。",
    "S1940E38 - Mouse Cleaning_scene049.mp4": "一个窗户从关闭状态逐渐打开，随后一个金属窗台被安装在窗框上。",
    "S1940E38 - Mouse Cleaning_scene050.mp4": "一只棕色的小老鼠从画面下方爬上来，沿着窗台边缘小心翼翼地向前走。窗台旁边挂着一根黄色的绳子，旁边还有一个红色坐垫的绿色小凳子。",
    "S1940E38 - Mouse Cleaning_scene051.mp4": "一辆红色的煤车停在斜坡旁，车斗装满了煤块。煤块一颗颗从车斗中掉落，沿着斜坡滚落。",
    "S1940E38 - Mouse Cleaning_scene052.mp4": "一只小老鼠站在窗台边，用绳子拉住一个金属滑梯，试图将滑梯拉下来。它用力拉扯，滑梯逐渐被拉下，小老鼠显得非常兴奋和得意。",
    "S1940E38 - Mouse Cleaning_scene053.mp4": "汤姆猫正在努力打扫房间，他一手拿着拖把，一手拿着抹布，腰间系着一条黄色的绳子，地板上有许多蓝色的脚印。他看起来很吃力，表情显得有些痛苦和无奈。",
    "S1940E38 - Mouse Cleaning_scene054.mp4": "一个穿着黑色斗篷、戴着帽子的角色从树后走出，慢慢向前走动。角色的斗篷下露出红色短裤和黄色鞋子。背景是一个小镇街道，有商店和树木。",
    "S1940E38 - Mouse Cleaning_scene055.mp4": "汤姆猫被绳子绑住，手持拖把和抹布，拖地时滑倒，水桶倾倒，水洒满地面，他狼狈地跑开。",
    "S1940E38 - Mouse Cleaning_scene056.mp4": "汤姆猫在房间里拿着扫帚和拖把，看起来像是在打扫卫生。他不小心被自己的工具绊倒，摔倒在沙发上。随后，他坐在沙发上，看起来有些沮丧或疲惫，然后又恢复了正常状态，表情变得轻松愉快。",
    "S1940E38 - Mouse Cleaning_scene057.mp4": "一只小老鼠正用绳子拉拽一个水槽，试图将其拉出窗外。它先是抓住绳子，然后用力拉拽，水槽被拉出窗外，小老鼠也跟着被拉出窗外，最后它挂在了窗沿上，继续用力拉拽水槽。",
    "S1940E38 - Mouse Cleaning_scene058.mp4": "汤姆猫坐在沙发上，突然从窗户飞进来一堆黑色的物体，将汤姆猫淹没。",
    "S1940E38 - Mouse Cleaning_scene059.mp4": "一个穿着红色衣服、黄色裤子和棕色靴子的卡通人物，手里拿着一个装满物品的袋子，走向一扇蓝色的门。他打开门后，突然被一股黑色的泥浆或碎石涌出，将他完全淹没。他挣扎着试图逃脱，但最终被泥浆完全覆盖，只留下一些身体部位在泥浆表面。背景是户外的阳台，有白色的栏杆和绿色的树木。",
    "S1940E38 - Mouse Cleaning_scene061.mp4": "一只黑白相间的猫在乡间小路上奔跑，它先是撞到树上，然后继续奔跑，表情夸张。它在田野中继续奔跑，背景是绿色的田野和几座房子，最后猫跑向远方，画面逐渐变暗，出现“The End”字样。",
    "S1940E38 - Mouse Cleaning_scene062.mp4": "视频片段展示了“Tom and Jerry”动画片的片尾画面，背景为红色渐变，中央以蓝色字体显示“The End”，随后出现“An M.G.M Tom and Jerry CARTOON”字样，底部标注“MADE IN HOLLYWOOD, U.S.A.”。整个画面风格复古，具有经典动画片的结束标志特征。",
    "S1940E38 - Mouse Cleaning_scene063.mp4": "视频开头显示了“An M-G-M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面，随后画面转为全黑。"
}