{
    "E77.Just.Ducky_scene001.mp4": "画面从全黑开始，随后逐渐出现米高梅卡通的标志，标志上方写着“A METRO-GOLDWYN-MAYER”，中间是“CARTOON”，下方是“COLOR BY TECHNICOLOR”。背景为深蓝色，标志为金色和红色，整体风格复古。",
    "E77.Just.Ducky_scene002.mp4": "这是一个米高梅动画片头，背景为深蓝色，中央有一个圆形标志，里面是一只咆哮的狮子，下方写着“A METRO-GOLDWYN-MAYER CARTOON COLOR BY TECHNICOLOR”。狮子在标志内不断张合嘴巴，表现出咆哮的动作。",
    "E77.Just.Ducky_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现《猫和老鼠》的标题画面，其中汤姆猫和杰瑞鼠的形象清晰可见。",
    "E77.Just.Ducky_scene004.mp4": "视频展示了经典动画《猫和老鼠》的标题画面，背景为深蓝色，左侧是棕色的小老鼠杰瑞，右侧是灰色的猫汤姆，两者都面带笑容。标题文字“Tom and Jerry”以黄色立体字体呈现，随后画面过渡到“Just Ducky”字样，下方标注了制作人威廉·汉纳和约瑟夫·巴伯拉的名字。",
    "E77.Just.Ducky_scene005.mp4": "这是一个动画片《猫和老鼠》的片头画面，标题为“Just Ducky”，由William Hanna和Joseph Barbera执导。画面中显示了动画片的制作团队信息，包括动画师、背景绘制师等。背景是夜晚的湖边景色，有芦苇和几只鸭子的剪影。整个画面色彩丰富，风格经典。",
    "E77.Just.Ducky_scene006.mp4": "视频展示了动画片《Just Ducky》的片头字幕，列出了动画师、背景绘制师和音乐制作人等工作人员的名字，随后出现“Produced by Fred Quimby”的字样。背景是渐变的蓝绿色天空。",
    "E77.Just.Ducky_scene007.mp4": "画面中，一只穿着蓝色围裙的灰色母鸭站在一个装有多个白色鸡蛋的巢穴旁，背景是夜晚的农场景象，远处可见红色的谷仓和树木。母鸭低头注视着巢中的鸡蛋，显得十分专注和温柔。",
    "E77.Just.Ducky_scene009.mp4": "一只穿着蓝色衣服的鹅妈妈带着一群小鸭子来到池塘边，小鸭子们依次跳进水中嬉戏，最后一只小鸭子独自留在岸边。",
    "E77.Just.Ducky_scene011.mp4": "一只母鸭带领着一群小鸭子在宁静的水道中前行，周围是茂密的芦苇和清澈的水面，天空中飘着几朵白云。",
    "E77.Just.Ducky_scene012.mp4": "一只黄色的小鸭子在湖边草地上，它先是坐着，然后张大嘴巴叫喊，接着向后倒下，最终躺在地上闭上眼睛睡觉。",
    "E77.Just.Ducky_scene013.mp4": "一只棕色的小老鼠从一扇蓝色的拱形门后探出头来，门位于红色的墙壁上，门上方挂着一盏灯笼，左侧挂着一条皮带。小老鼠先是小心翼翼地探出头，然后慢慢将整个身体从门后移出，最后完全从门后爬出来，露出整个身体。",
    "E77.Just.Ducky_scene015.mp4": "一只黄色的小鸭子在绿色的草地上行走，它先是靠近一块紫色的大石头，然后继续向前走，途中不断张开嘴巴，似乎在叫喊或表达情绪。背景中有几块岩石和一些植物，环境宁静自然。",
    "E77.Just.Ducky_scene017.mp4": "一只棕色的老鼠从红色建筑的拱形门洞中跑出，手里提着一个白色的袋子，袋子上有一个蓝色的小物件。老鼠表情兴奋，步伐轻快，似乎刚完成某项任务或准备去做某事。背景中有一个悬挂的灯笼和一些绿色的草丛。",
    "E77.Just.Ducky_scene018.mp4": "汤姆猫正在户外用勺子搅拌锅里的东西，突然杰瑞鼠出现并用木板击打汤姆猫，汤姆猫被击中后身体变形，长出了长长的尾巴，表情痛苦。",
    "E77.Just.Ducky_scene019.mp4": "一只棕色的小老鼠和一只黄色的小鸭子在红色谷仓旁玩耍，小鸭子拉着小老鼠跑动，随后小老鼠被小鸭子拽着跑向谷仓角落。这时，一只蓝色的铲子突然从地上弹起，小老鼠被铲子击中，随后变成铲子形状，呆呆地坐在地上。",
    "E77.Just.Ducky_scene020.mp4": "在谷仓内，一只小老鼠和一只小黄鸭一起跑向红色的谷仓门，小黄鸭从门后探出头来，小老鼠则躲在门边。这时，猫汤姆突然出现，迅速扑向小老鼠，但小老鼠敏捷地躲开，汤姆扑空后摔倒在地。",
    "E77.Just.Ducky_scene021.mp4": "一只老鼠从红色门后跑出，被一只蓝猫从门后伸出的手抓住尾巴，猫被拉得身体伸长，最终摔在地上。",
    "E77.Just.Ducky_scene022.mp4": "一只老鼠拉着一只猫在草地上奔跑，猫被拉得越来越快，最终被拖进一个土堆里，只剩下脚在外面，随后脚也缩进了土堆。",
    "E77.Just.Ducky_scene023.mp4": "一只小老鼠从蓝色管道中钻出，拖着一只灰色的猫，猫被拉得像长虫一样，最终被拉到红色谷仓前。",
    "E77.Just.Ducky_scene024.mp4": "一只灰色的猫被拉成一条长蛇状，一只棕色的小老鼠站在它面前，用爪子拨弄猫的尾巴，猫看起来很生气。小老鼠突然跳到墙角，猫继续盯着它。",
    "E77.Just.Ducky_scene025.mp4": "一只小老鼠从草地上跑过，跳入池塘。随后，一只猫从空中跳入池塘，溅起水花。猫站在池塘边，表情愤怒，随后又露出惊讶的表情，似乎被池塘中的水草或水波吓到。",
    "E77.Just.Ducky_scene026.mp4": "一只棕色的小老鼠被一根长棍吊在水面上，它在水中挣扎，嘴巴张开，不断冒出气泡。背景是绿色的水面和水草。",
    "E77.Just.Ducky_scene027.mp4": "汤姆猫在池塘边用树枝钓鱼，他先是兴奋地跳跃，然后蹲下用树枝搅动水面，最后咬住树枝，表情专注。",
    "E77.Just.Ducky_scene028.mp4": "一只棕色的老鼠在水中，用鼻子顶着一根木棍，木棍顶端露出水面。老鼠在水中上下浮动，身体逐渐膨胀，然后又恢复原状，嘴巴张开，似乎在呼吸或发出声音，水面上有气泡冒出。背景是绿色的水面和水草。",
    "E77.Just.Ducky_scene029.mp4": "一只灰色的猫趴在池塘边，用一根棍子搅动水面。突然，一只黄色的小鸭子拿着鱼竿从右侧跑过，猫被惊吓到，身体开始膨胀，然后又迅速缩小，最后变成了一只小猫，趴在水边。",
    "E77.Just.Ducky_scene031.mp4": "汤姆猫站在一只小黄鸭所在的紫色盆子旁，他伸出脚将盆子踢翻，小黄鸭被水溅出，汤姆猫露出得意的笑容。",
    "E77.Just.Ducky_scene032.mp4": "在户外，一只蓝色的猫汤姆发现一个放在石头上的锅正在冒绿色的液体。他跑过来，用红色的勺子搅拌锅里的液体，然后把勺子里的液体泼向一只飞来的黄色小鸟，小鸟被液体淋湿后在勺子上滑动。汤姆得意地看着这一幕。",
    "E77.Just.Ducky_scene033.mp4": "一只棕色的小老鼠在屋顶上奔跑，它跑向一堆红砖，用前爪抓住一块砖头，然后用力将砖头扔向空中。小老鼠被砖头击中后飞了起来，随后在空中翻滚。",
    "E77.Just.Ducky_scene034.mp4": "汤姆猫站在户外，手里拿着一把红色的勺子，勺子上有一只黄色的小鸡。他身后有一个放在石头上的锅，锅里似乎有火在燃烧。随着视频的进行，汤姆猫的身体开始逐渐分解成碎片，最终只剩下他的轮廓，而小鸡从勺子上飞走了。",
    "E77.Just.Ducky_scene035.mp4": "一只棕色的小老鼠从右侧跑入画面，随后一只黄色的小鸭子从左侧跑入画面，两者在画面中各自向右和向左移动，最终小鸭子跑出画面右侧。",
    "E77.Just.Ducky_scene036.mp4": "在谷仓里，汤姆猫从红色门后探出头，看到一个蓝色的牛奶罐，他伸出舌头舔了舔嘴唇，显得很馋。这时，一只小老鼠从罐子后面跑出来，汤姆猫立刻跳起来，踩在罐子上，试图抓住老鼠。但老鼠跑掉了，汤姆猫气得跳起来，最后他从罐子上跳下来，愤怒地转身离开。",
    "E77.Just.Ducky_scene037.mp4": "一只黄色的小鸭子在田野中奔跑，试图逃离一只蓝色的猫的追捕。小鸭子跑过草地，来到一个水边悬崖，不慎跌落水中。猫紧追不舍，也跳入水中，试图抓住小鸭子。水面上泛起波纹，小鸭子在水中挣扎，猫在水中追逐。",
    "E77.Just.Ducky_scene038.mp4": "一只黄色的小鸭子从树根形成的悬崖边缘跳下，随后在草地上行走，镜头跟随它移动，背景是蓝天、草地和水体。",
    "E77.Just.Ducky_scene039.mp4": "汤姆猫在池塘中游泳，他不断扑腾四肢，张大嘴巴，看起来非常惊慌。他时而浮出水面，时而沉入水底，水花四溅。最后，汤姆猫沉入水中，只留下气泡在水面上翻滚。",
    "E77.Just.Ducky_scene040.mp4": "一只黄色的小鸭子在绿色的草地上行走，背景是蓝天白云。小鸭子先是面向镜头，随后转身向右侧行走，过程中不时抬头张望。前景有一些高高的草和棕色的植物。",
    "E77.Just.Ducky_scene041.mp4": "汤姆在池塘里游泳，他奋力划水，但最终沉入水中，只留下水花和气泡。",
    "E77.Just.Ducky_scene042.mp4": "一只黄色的小鸭子在草地上奔跑，它张开嘴巴，似乎在叫喊或唱歌。小鸭子跑过一片草地，经过一些高高的草丛，然后冲向一个悬崖边，最后从悬崖上跳入水中。画面背景是蓝天和白云，远处可以看到一些树木和水体。",
    "E77.Just.Ducky_scene043.mp4": "一只黄色的小鸭子从空中跳入水中，溅起水花，然后在水面上游泳。接着，它潜入水中，拖着一条长长的、类似鱼尾的物体，缓慢地游动，最终被水中的植物部分遮挡。",
    "E77.Just.Ducky_scene045.mp4": "一只穿着蓝色裙子的灰色母鹅在池塘中游泳，身后跟着四只黄色小鸭子。母鹅逐渐游出画面，四只小鸭子继续向前游动。其中一只小鸭子突然翻转身体，露出红色的脚蹼，并开始在水中欢快地扑腾，溅起水花。它开心地挥舞着翅膀，享受在水中的乐趣。另外两只小鸭子则继续向前游动，而最前面的小鸭子则停下来，看着正在玩耍的小鸭子。画面最后以“THE END”字样结束。",
    "E77.Just.Ducky_scene046.mp4": "视频展示了“THE END”字样，随后过渡到“An M-G-M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面，最后画面变黑。"
}