{
    "S1950E13 - His Mouse Friday_scene001.mp4": "画面从全黑开始，随后出现米高梅卡通片头标志，标志下方有“COLOR BY TECHNICOLOR”字样。",
    "S1950E13 - His Mouse Friday_scene002.mp4": "这是一个米高梅动画片头，背景为深蓝色，中央是一个咆哮的狮子头像，周围环绕着“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”的文字。狮子的咆哮动作在画面中不断变化，展现出动画片头的动态效果。",
    "S1950E13 - His Mouse Friday_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现“Tom and Jerry”的标题画面，其中汤姆猫和杰瑞鼠的形象分别位于标题两侧。",
    "S1950E13 - His Mouse Friday_scene004.mp4": "这是一个《猫和老鼠》动画片的片头，展示了该集的标题“His Mouse Friday”，导演为William Hanna和Joseph Barbera，动画师包括Kenneth Muse、Irvin Spence、Ray Patterson和Ed Barge，音乐由Scott Bradley创作。片头还提到由Fred Quimby制作，并展示了版权信息和制作公司标志。背景是一幅热带岛屿的插图，整体风格经典复古。",
    "S1950E13 - His Mouse Friday_scene005.mp4": "视频开始显示“Produced by FRED QUIMBY”的字样，随后画面转为全黑，接着出现深蓝色天空背景，下方是一片深色海洋，海面上漂浮着一个小红点。",
    "S1950E13 - His Mouse Friday_scene007.mp4": "汤姆猫拿着一个红蓝相间的玩具，先是咬住玩具，然后用爪子撕开玩具，从中拉出一根绳子，接着又咬住玩具，最后松开玩具，表情从开心到惊讶再到失望。背景是蓝天白云。",
    "S1950E13 - His Mouse Friday_scene008.mp4": "视频开始时，画面展示了一片宁静的海洋，远处有一座小岛，岛上长着几棵棕榈树，天空中有几朵粉色的云彩。接着，场景切换到一只穿着红色短裤和蓝色鞋子的猫，它正站在一块木筏上，在海面上漂浮。猫的表情显得紧张而兴奋，它先是用一只手遮住眼睛，似乎在观察前方的情况，然后开始在木筏上奔跑，试图保持平衡。随着木筏在波浪中起伏，猫的表情从紧张转为惊恐，它努力抓住木筏边缘，但最终还是被海浪掀翻，木筏翻转，猫被抛入空中，随后画面定格在木筏在海浪中翻滚的瞬间。",
    "S1950E13 - His Mouse Friday_scene009.mp4": "汤姆穿着红色短裤，在热带海滩上空翻滚着向前飞去，最终落在茂密的棕榈树林中。",
    "S1950E13 - His Mouse Friday_scene010.mp4": "在热带丛林中，汤姆穿着红色短裤，从地面快速爬到一棵椰子树上，他伸手去够树顶的椰子，但椰子掉下来砸中了他，他被弹飞了。",
    "S1950E13 - His Mouse Friday_scene011.mp4": "在热带海滩上，汤姆猫从沙子里爬出来，发现了一个保龄球。他兴奋地拿起球，准备投掷，但不小心把球砸在了自己的头上，导致球卡在了头上。汤姆猫惊讶地看着自己，然后试图把球取下来，但球却卡得更紧了。他最终成功地把球取了下来，但球已经变成了一个滑稽的帽子，他戴着它继续在海滩上行走。",
    "S1950E13 - His Mouse Friday_scene012.mp4": "一只乌龟在沙滩上缓慢爬行，突然，汤姆猫从空中跳下，兴奋地追逐乌龟。乌龟迅速缩进壳里，汤姆猫惊讶地停下，然后拿出一瓶盐撒在乌龟壳上。最后，汤姆猫抓起乌龟壳，得意地展示。",
    "S1950E13 - His Mouse Friday_scene013.mp4": "汤姆猫拿着一个绿色的龟壳，先是开心地大笑，然后咬住龟壳，表情变得狰狞，龟壳破裂，碎片飞溅，最后汤姆猫表情惊恐，随后转头看向别处。",
    "S1950E13 - His Mouse Friday_scene014.mp4": "在沙滩上，一只小动物拿着伞行走，身后有一棵椰子树。突然，猫从椰子树后探出头来，露出邪恶的笑容，伸出舌头，似乎在准备捉住小动物。小动物继续向前走，似乎没有察觉到猫的出现。",
    "S1950E13 - His Mouse Friday_scene015.mp4": "一只老鼠在沙滩上撑着伞行走，突然伞下出现了一只鸡腿，接着又变成了一根香肠。老鼠看到后惊讶地停下脚步，随后被香肠吸引，跳了起来，伞也飞了出去。",
    "S1950E13 - His Mouse Friday_scene016.mp4": "一只穿着黄色短裤的棕色老鼠从一个大石头后面跑出来，然后跑到一个放在火上的大煎锅里。老鼠在煎锅里跳来跳去，最后从煎锅边缘跳了出来。",
    "S1950E13 - His Mouse Friday_scene017.mp4": "猫拿着锅铲在火上煎老鼠，老鼠不断从锅里跳出来，猫用刀叉试图抓住老鼠，最后老鼠跳走，猫沮丧地坐在地上。",
    "S1950E13 - His Mouse Friday_scene018.mp4": "在热带丛林中，一只穿着黄色衣服的小老鼠正在奔跑，身后紧跟着一只蓝色的猫，猫的表情凶狠，似乎在追赶小老鼠。小老鼠在棕榈树和灌木丛间穿梭，试图逃脱猫的追捕。",
    "S1950E13 - His Mouse Friday_scene019.mp4": "在热带丛林中的一个村庄里，汤姆穿着红色的服装，正在追赶一只小老鼠。汤姆从远处跑来，经过几座茅草屋，途中撞到了一个木架，然后跳起来继续追赶。最后，汤姆停下脚步，转身面向前方，似乎在思考下一步行动。背景中有茂密的棕榈树和绿色植被，营造出热带风情。",
    "S1950E13 - His Mouse Friday_scene020.mp4": "一只小老鼠出现在一个大鼓上，它兴奋地跳跃并用爪子敲击鼓面，发出响亮的声音。背景是热带丛林和茅草屋，营造出欢快的氛围。",
    "S1950E13 - His Mouse Friday_scene021.mp4": "汤姆穿着红色的裙子在热带村庄里奔跑，突然被一个巨大的图腾吓到，他惊慌失措地躲闪，接着被几支蓝色的箭射中，最后痛苦地倒在地上。",
    "S1950E13 - His Mouse Friday_scene022.mp4": "在热带丛林中，汤姆穿着红色短裤，从画面左侧跑入，不慎被藤蔓绊倒，翻滚着摔进一片绿色的叶子丛中，随后叶子丛微微晃动，似乎有东西在其中藏匿。",
    "S1950E13 - His Mouse Friday_scene023.mp4": "一只穿着黄色短裤的棕色老鼠在两个鼓上跳跃，它从一个鼓跳到另一个鼓，然后跳到旁边的棕榈叶上，最后消失在画面中。背景是热带丛林和茅草屋。",
    "S1950E13 - His Mouse Friday_scene024.mp4": "一只小老鼠从茅草屋旁跑出来，来到一个放在木柴上的大黑陶罐前，它用前爪推着陶罐，似乎想把它移开。",
    "S1950E13 - His Mouse Friday_scene025.mp4": "一只穿着黄色裙子的卡通老鼠站在沙地上，背景是绿色的植物和一个大黑球。老鼠先是双手放在头上，然后放下手，做出一个指向大黑球的动作，接着又将手放回胸前。",
    "S1950E13 - His Mouse Friday_scene026.mp4": "在茂密的丛林中，汤姆猫穿着红色的裤子，从一棵树后探出头来，然后迅速跑开。他跑过一片空地，突然遇到一个手持长矛的小黑人，汤姆猫停下脚步，显得非常紧张和害怕。",
    "S1950E13 - His Mouse Friday_scene027.mp4": "一个穿着黄色草裙、头戴骨头装饰的黑色卡通角色在丛林中挥舞着长矛，表情愤怒，不断做出攻击和防御的动作。背景是茂密的绿色植被和岩石。",
    "S1950E13 - His Mouse Friday_scene028.mp4": "一只蓝色的猫坐在岩石上，身穿红色衣服，双手交叉放在胸前，表情从担忧变为平静，然后又转为沉思。背景是绿色的植物。",
    "S1950E13 - His Mouse Friday_scene029.mp4": "一只穿着黄色草裙、头戴骨头装饰的黑色猴子，手持长矛，在丛林小径上奔跑。它时而停下，用矛尖指向岩石，做出攻击或防御的姿态，表情凶狠，似乎在狩猎或防御。背景是茂密的绿色丛林，环境充满原始野性气息。",
    "S1950E13 - His Mouse Friday_scene030.mp4": "在丛林中，一只穿着红色衣服的猫被一只手持长矛的小黑猫追赶。猫被长矛刺中后倒地，随后被拖行，表情痛苦。小黑猫继续追赶，猫试图挣扎逃脱。",
    "S1950E13 - His Mouse Friday_scene031.mp4": "在热带丛林背景中，汤姆猫穿着红色衣服，坐在一个大黑锅旁，显得有些紧张和不安。旁边站着一个穿着黄色衣服、头戴骨头装饰的小黑猫，手持长矛，似乎在威胁或监视汤姆。汤姆猫表情从紧张逐渐变为愤怒，最后他突然跳起并消失在画面中，大锅随即喷出大量水花，小黑猫则保持原位，继续持矛站立。",
    "S1950E13 - His Mouse Friday_scene032.mp4": "在丛林中，汤姆猫被水淹没在一口大锅里，他挣扎着露出水面，表情惊恐。随后，一个装扮成部落战士的小黑猫拿着刀和食物出现在他面前，汤姆猫看到食物后眼睛发亮，伸手去拿刀，但又因害怕而缩回手，表情紧张。小黑猫则在一旁得意地拿着矛，似乎在威胁汤姆猫。",
    "S1950E13 - His Mouse Friday_scene033.mp4": "汤姆猫坐在一个黑色的锅里，手里拿着一把刀。他先是切了一个土豆，然后切了一个胡萝卜，最后切了一个洋葱。每次切完，他都会把切好的蔬菜放进锅里。背景是绿色的植物。",
    "S1950E13 - His Mouse Friday_scene034.mp4": "一个穿着黄色草裙、头戴骨头装饰的黑色小猴子，手持长矛和火把，站在一个巨大的黑色锅旁边。它先是兴奋地挥舞着长矛，然后用火把点燃了锅下的柴火，火焰迅速蔓延，最终锅底被火包围。小猴子全程表情兴奋，似乎在庆祝或准备某种仪式。背景中有几个陶罐，地面是沙地。",
    "S1950E13 - His Mouse Friday_scene035.mp4": "汤姆猫坐在一个大锅里，用刀切着东西，看起来非常紧张和害怕。他不断出汗，表情焦虑。接着，他用勺子舀起锅里的液体品尝，表情从惊讶变为满意，但随后又变得愤怒。最后，他拿起盐瓶往自己头上撒盐，显得更加困惑和无奈。整个场景背景是热带丛林，有雨水滴落。",
    "S1950E13 - His Mouse Friday_scene036.mp4": "一个穿着黄色裙子、头戴骨头装饰的黑色小老鼠，手持蓝色尖头长矛，在火堆旁跳舞。它先是面向火堆，随后转身背对火堆，继续舞动。火堆由几根木头支撑，火焰熊熊燃烧。地面是沙地，周围散落着一些木头。",
    "S1950E13 - His Mouse Friday_scene037.mp4": "汤姆猫在雨中坐在一个大锅里，手里拿着一个蓝色的调味瓶，表情从放松变为惊讶。背景是茂密的绿色植物和雨水。",
    "S1950E13 - His Mouse Friday_scene038.mp4": "一只戴着骨头帽、手持蓝色长矛的小老鼠在厨房地板上行走，表情严肃。突然，一个穿着厨师服、系着黄色围裙的厨师从左侧进入画面，小老鼠看到后显得非常兴奋，开始跳舞并挥舞长矛。随后，小老鼠停下舞蹈，表情变得严肃，似乎在与厨师对话或对峙。厨师则背对着小老鼠，没有明显反应。整个场景发生在厨房地板上，周围有红色和蓝色的厨具。",
    "S1950E13 - His Mouse Friday_scene040.mp4": "视频展示了一群穿着传统服饰的原住民战士，他们站在丛林中，手持长矛和盾牌。镜头聚焦在中间的战士身上，他戴着白色羽毛头饰，脸上涂有红色颜料，脖子上挂着蓝色和黄色的牙齿状项链。他表情凶狠，眼睛瞪大，嘴巴张开露出牙齿，显得非常威严。随后，他伸出舌头，口水滴落，表情更加夸张和滑稽。背景中可以看到其他战士，他们同样装备齐全，神情严肃。整个场景充满了原始部落的氛围。",
    "S1950E13 - His Mouse Friday_scene042.mp4": "两个穿着黄色衣服的卡通角色在热带沙滩上奔跑，其中一个手持长矛。他们沿着沙滩向前跑，逐渐远离镜头，最终消失在远方。画面最后变黑，出现“The End”字样。",
    "S1950E13 - His Mouse Friday_scene043.mp4": "视频展示了“Tom and Jerry”动画片的片尾画面，背景为红色，中央有“THE END”字样，随后出现“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样。"
}