{
    "E56.Jerry.and.the.Goldfish_scene001.mp4": "视频开始时全黑，随后出现米高梅动画的标志，标志上写着“A METRO-GOLDWYN-MAYER CARTOON COLOR BY TECHNICOLOR”，背景为深蓝色，标志中央有一个圆形图案，图案内有动物形象。",
    "E56.Jerry.and.the.Goldfish_scene002.mp4": "这是一个米高梅动画片头，背景为深蓝色，中央是一个咆哮的狮子形象，狮子位于一个圆形框架内，上方有“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”字样，底部标注“COLOR BY TECHNICOLOR”。狮子的咆哮动作在画面中不断变化，从张嘴到闭嘴，再张开，展现出动态效果。整个画面风格复古，充满经典动画片头的标志性元素。",
    "E56.Jerry.and.the.Goldfish_scene003.mp4": "视频开始显示米高梅动画公司的标志，随后画面转为黑色，最后出现“Tom and Jerry”的标题，伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "E56.Jerry.and.the.Goldfish_scene004.mp4": "这是一个《猫和老鼠》动画片的片头，展示了“Jerry and the Goldfish”这一集的标题和制作人员信息。背景为深绿色，有气泡效果，画面中央是金色的标题文字“JERRY and the GOLDFISH”，下方注明由William Hanna和Joseph Barbera执导。随后，画面显示了动画师、音乐制作人以及制片人Fred Quimby等制作团队成员的名字。整体风格符合经典动画片的开场设计。",
    "E56.Jerry.and.the.Goldfish_scene005.mp4": "视频开始显示制作人Fred Quimby的字样，随后画面转黑，接着出现一个鱼缸，里面有一条金鱼在水底静止不动。背景是夜晚的窗户，窗外有树木和月亮。",
    "E56.Jerry.and.the.Goldfish_scene007.mp4": "视频展示了一条黄色的小金鱼在鱼缸中游动，鱼缸放置在一张木桌上，背景是窗户和绿色植物。随后，镜头跟随一个蓝色的猫（汤姆）快速移动，猫用爪子抓住鱼缸的桌腿，将鱼缸拖行。鱼缸中的水晃动，小金鱼在水中游动，看起来有些惊慌。整个场景发生在一个室内环境中，背景是木质墙面和家具。",
    "E56.Jerry.and.the.Goldfish_scene008.mp4": "汤姆猫拿着一个鱼缸走进厨房，把鱼缸放在炉子上，然后点燃炉火。他看着鱼缸里的金鱼和乌龟在火上挣扎，感到非常开心。接着，他拿出一把刀和一根胡萝卜，准备用胡萝卜喂鱼。",
    "E56.Jerry.and.the.Goldfish_scene009.mp4": "一只黄色的小鱼在水下，看着从上方落下的胡萝卜。它先是惊讶地张大嘴巴，随后露出笑容，最后戴上了一顶胡萝卜帽子，显得非常开心。",
    "E56.Jerry.and.the.Goldfish_scene010.mp4": "汤姆猫正在为金鱼准备食物。他先用刀切洋葱和青菜，然后用勺子搅拌鱼缸里的水，接着把金鱼捞上来，撒上盐，最后又把金鱼放回鱼缸里。",
    "E56.Jerry.and.the.Goldfish_scene011.mp4": "一只棕色的小老鼠从门后探出头，然后快速跑过房间，最后消失在画面中。",
    "E56.Jerry.and.the.Goldfish_scene012.mp4": "汤姆猫在厨房里用勺子搅动鱼缸里的水，杰瑞鼠突然从下方窜出，汤姆被吓到跳进烤箱，烤箱门打开后汤姆被烤得只剩下骨头，最后只剩下两只手和脚从烤箱里伸出来。",
    "E56.Jerry.and.the.Goldfish_scene013.mp4": "在厨房里，一只小老鼠抱着一个装有金鱼的鱼缸跑过，随后一只猫从墙后冲出来追赶，但猫在追赶过程中突然停下，似乎被什么绊住了。",
    "E56.Jerry.and.the.Goldfish_scene014.mp4": "汤姆从厨房门口跳出来，兴奋地挥舞双臂，随后发现地上有一个鱼缸，他一把抓起鱼缸，用力摇晃，水花四溅，最后带着鱼缸跑出了画面。",
    "E56.Jerry.and.the.Goldfish_scene015.mp4": "一只棕色的小老鼠在房间里，它试图抓住一个高处的物体，但失败了。它看起来很沮丧，然后开始在地上奔跑，最后消失在画面中。",
    "E56.Jerry.and.the.Goldfish_scene016.mp4": "一只小老鼠拿着棒球棒从门后跑出，撞倒了躺在地上的猫汤姆，汤姆手中拿着的鱼缸被打翻，水洒了一地，汤姆一脸惊讶。",
    "E56.Jerry.and.the.Goldfish_scene017.mp4": "一只黄色的小狗在水中挣扎，溅起水花，最终爬上一个斜坡。",
    "E56.Jerry.and.the.Goldfish_scene018.mp4": "一只棕色的老鼠从一根棒子上跳下来，然后跑向一个装满水的玻璃杯。它把杯子推到一边，水溅了出来。接着，一只黄色的小鸭子从杯子里跳出来，老鼠抓住了它。最后，老鼠带着鸭子跑开了，而一只猫从画面中出现，似乎在追赶它们。",
    "E56.Jerry.and.the.Goldfish_scene019.mp4": "一只小老鼠拿着一个装有黄色小鸭的玻璃杯，小心翼翼地靠近墙角的洞口。突然，一只蓝灰色的猫从洞口冲出，身体在空中翻滚，最终重重地摔在地上，眼睛瞪得很大，显得非常惊讶和狼狈。小老鼠则站在一旁，似乎对猫的反应感到好奇或得意。",
    "E56.Jerry.and.the.Goldfish_scene020.mp4": "一只小老鼠拿着一个装有黄色小鸭子的玻璃杯，靠近一只躺在地上的灰色大猫。大猫的眼睛睁得很大，显得很惊讶。小老鼠把玻璃杯推到大猫的鼻子前，大猫的鼻子碰到了玻璃杯，导致小鸭子在杯子里晃动。小老鼠把玻璃杯从大猫面前拿开，大猫的眼睛里反射出小鸭子和小老鼠的影像。小老鼠从大猫的耳朵后面钻了进去，大猫的眼睛里看到小老鼠在杯子里晃动。小老鼠从大猫的耳朵后面钻了出来，大猫的眼睛里看到小老鼠在杯子里晃动。小老鼠从大猫的耳朵后面钻了进去，大猫的眼睛里看到小老鼠在杯子里晃动。小老鼠从大猫的耳朵后面钻了出来，大猫的眼睛里看到小老鼠在杯子里晃动。小老鼠从大猫的耳朵后面钻了进去，大猫的眼睛里看到小老鼠在杯子里晃动。小老鼠从大猫的耳朵后面钻了出来，大猫的眼睛里看到小老鼠在杯子里晃动。小老鼠从大猫的耳朵后面钻了进去，大猫的眼睛",
    "E56.Jerry.and.the.Goldfish_scene021.mp4": "汤姆猫躺在地上，突然发现墙角有个洞，他兴奋地扑向洞口，试图抓住洞里的东西，但最终什么也没抓到，只留下一个空洞和一圈圈的尘土。",
    "E56.Jerry.and.the.Goldfish_scene022.mp4": "在昏暗的洞穴中，一只棕色的小老鼠站在一个装有水的玻璃缸旁，缸里有一条黄色的鱼。小老鼠先是好奇地看着鱼，然后伸出手指轻轻触碰鱼的嘴，鱼也回应地张开嘴。接着，小老鼠用前爪抓住玻璃缸，似乎想把鱼拉出来，但鱼在缸里扭动着身体，小老鼠则显得有些吃力。",
    "E56.Jerry.and.the.Goldfish_scene023.mp4": "一只老鼠从墙上的洞里探出头来，先是警惕地观察四周，随后露出开心的笑容。",
    "E56.Jerry.and.the.Goldfish_scene024.mp4": "一个鱼缸放在窗台上，里面有一条鱼在游动，窗外是蓝天和绿叶。",
    "E56.Jerry.and.the.Goldfish_scene025.mp4": "杰瑞从洞里探出头，然后跑出来，手里拿着一个装有金鱼的玻璃杯。它跑过房间，经过一张桌子和窗帘。",
    "E56.Jerry.and.the.Goldfish_scene026.mp4": "杰瑞把一条小鱼从玻璃杯中捞出，小鱼跳到鱼缸外，汤姆从窗帘后出现，用漏勺把小鱼捞起，然后迅速跑开。",
    "E56.Jerry.and.the.Goldfish_scene027.mp4": "汤姆在厨房里试图煎鱼，但鱼被他不小心弄进面粉里，导致鱼变成白色。汤姆开心地摇晃平底锅，但杰瑞出现并抢走了平底锅，汤姆被平底锅砸中，最后汤姆被杰瑞用平底锅击中头部，汤姆痛苦地倒在地上。",
    "E56.Jerry.and.the.Goldfish_scene028.mp4": "视频中，汤姆猫面带得意笑容，杰瑞鼠从左侧出现，抓住汤姆的胡须。汤姆表情瞬间变得痛苦，嘴巴张开，露出牙齿。随后，一只黄色的小鸟从汤姆的嘴里飞出，小鸟在汤姆面前飞舞，汤姆张大嘴巴，表情惊愕。",
    "E56.Jerry.and.the.Goldfish_scene029.mp4": "杰瑞抱着一个装有水的杯子，突然一只黄色小鸟飞入杯中，水花四溅。杰瑞继续拖着杯子逃跑，汤姆猫紧追不舍。汤姆猫在追逐过程中，身体被拉长，最终追上了杰瑞。",
    "E56.Jerry.and.the.Goldfish_scene030.mp4": "一只老鼠拖着一个装有橙色小鱼的杯子从暖气片旁跑过，随后一只黑猫从暖气片后冲出，追逐老鼠，最终撞到暖气片上并被弹飞出去。",
    "E56.Jerry.and.the.Goldfish_scene031.mp4": "一只老鼠推着一个装有小鸡的杯子逃跑，一只猫穿着散热器追赶。",
    "E56.Jerry.and.the.Goldfish_scene032.mp4": "在室内，一只老鼠拖着一个装有黄色物体的碗从洞口跑出，随后一只猫从洞口冲出，被撞倒在地并翻滚，最终变成一条长条形的猫。老鼠再次从洞口跑出，猫从洞口爬出并继续追赶，最后猫在墙上停下，变成一条长条形的猫。",
    "E56.Jerry.and.the.Goldfish_scene033.mp4": "一只老鼠拖着一个装有小鱼的碗，不小心撞到了一个熨斗。随后，一只猫从角落里冲出来，被熨斗弹开，摔倒在地，显得非常痛苦。猫在地上翻滚，然后愤怒地站起来，但最终又摔倒了，消失在画面中。",
    "E56.Jerry.and.the.Goldfish_scene034.mp4": "汤姆猫从壁炉上方探出身体，抓起一把蓝色的左轮手枪，然后迅速转身，瞄准前方并开枪射击。",
    "E56.Jerry.and.the.Goldfish_scene035.mp4": "一只小猫拖着一个装有金鱼的鱼缸在房间里奔跑，鱼缸突然破裂，金鱼被甩出并在空中翻滚，最后落在地上，显得有些沮丧。",
    "E56.Jerry.and.the.Goldfish_scene036.mp4": "一只老鼠从洞里跑出来，手里拿着一个杯子，它先是开心地举着杯子，然后突然杯子破裂，老鼠惊慌失措地跳起来，最后杯子掉在地上，老鼠也惊慌地站在原地。",
    "E56.Jerry.and.the.Goldfish_scene037.mp4": "在壁炉前，汤姆猫正用火钳夹着一个烤架，烤架上有一只黄色的小鸟。汤姆猫兴奋地舔着嘴唇，小鸟则在烤架上惊慌失措。突然，杰瑞鼠从壁炉的左侧出现，它爬到壁炉的砖墙上，然后用尾巴勾住一根黄色的棍子，把汤姆猫的锅子拉了下来。锅子盖住了汤姆猫的头，汤姆猫被锅子盖住后，开始在原地转圈，锅子随着他的转动而旋转。杰瑞鼠则挂在棍子上，看着汤姆猫转圈。",
    "E56.Jerry.and.the.Goldfish_scene038.mp4": "在客厅里，两只小老鼠抱着一个黄色的物体快速跑过，随后一只黑猫从右侧冲进来，追赶它们。黑猫在追逐过程中，用爪子抓住了一块蓝色的布料，试图用它来捕捉老鼠，但最终只拉扯着布料，没有成功抓住老鼠。",
    "E56.Jerry.and.the.Goldfish_scene039.mp4": "在房间内，一条蓝色的地毯蜿蜒在地板上。杰瑞抱着一个黄色的物体，从地毯的一端跑过，随后从地毯的弯曲处跳起，飞向墙角。杰瑞落地后，摔倒在地，然后迅速爬起，继续向前奔跑。",
    "E56.Jerry.and.the.Goldfish_scene040.mp4": "一个黄色的小海豚在房间内飞舞，镜头跟随其移动，展示房间内的橱柜、装饰画和植物等细节。",
    "E56.Jerry.and.the.Goldfish_scene041.mp4": "汤姆猫在厨房里用烤面包机烤面包，突然一只黄色的小鸟从烤面包机里飞出来，汤姆猫被吓了一跳。小鸟飞到汤姆猫的面包上，汤姆猫开心地把面包夹在手里，小鸟也开心地在面包上蹦跳。",
    "E56.Jerry.and.the.Goldfish_scene042.mp4": "一只小老鼠从篮子上跳到椅子上，然后被一只猫用尾巴抓住并拉到椅子上。",
    "E56.Jerry.and.the.Goldfish_scene043.mp4": "汤姆猫在厨房里拿着一片吐司，突然吐司被弹开，他惊慌失措地伸手去抓，最后扑向旁边的烤面包机。",
    "E56.Jerry.and.the.Goldfish_scene044.mp4": "一只黑色的猫从洗衣机里伸出来，然后蜷缩在洗衣机旁边。",
    "E56.Jerry.and.the.Goldfish_scene045.mp4": "一只棕色的兔子正抱着一只黄色的小鸟在室内奔跑，背景是粉色的墙壁和绿色的地板，兔子看起来很紧张，小鸟则显得有些惊慌。镜头跟随兔子移动，同时有阴影从上方掠过。",
    "E56.Jerry.and.the.Goldfish_scene046.mp4": "一个黄色的小鸟从洞口跑出，被一只手持的蓝色锅盖住，小鸟在锅里惊慌失措。",
    "E56.Jerry.and.the.Goldfish_scene047.mp4": "汤姆猫拿着锅和铲子，试图用锅盖盖住洞口，但失败了。他滑倒，撞到蓝色的抽屉柜，然后滑出画面。",
    "E56.Jerry.and.the.Goldfish_scene048.mp4": "一只棕色的老鼠在洞穴中，先是用爪子抓挠洞口，随后被吸入一个蓝色的管道中，管道弯曲后消失在画面中。",
    "E56.Jerry.and.the.Goldfish_scene049.mp4": "视频展示了一个厨房场景，一只老鼠从墙上的插座孔中探出头来。随后，画面切换到一只猫正在厨房里煮东西，他从锅里捞出一只小老鼠，然后用刀切土豆并放入锅中。整个场景充满了卡通风格的幽默和夸张。",
    "E56.Jerry.and.the.Goldfish_scene050.mp4": "一只小老鼠从墙上的插座里拉出一根标有“DYNAMITE”的橙色炸药棒，然后被一只大猫的尾巴扫到地上。小老鼠捡起一根胡萝卜，试图用它来引爆炸药，但被猫的尾巴扫开。接着，小老鼠抱起一只黄色的小鸟，小鸟突然着火，小老鼠抱着燃烧的小鸟逃跑，最终从猫的尾巴下逃走。",
    "E56.Jerry.and.the.Goldfish_scene051.mp4": "汤姆猫在厨房里用刀将一罐标有“DYNAMITE”的炸药倒入锅中，然后盖上锅盖。他兴奋地等待，但随后锅突然爆炸，汤姆被炸飞，锅和灶台被炸得一片狼藉。",
    "E56.Jerry.and.the.Goldfish_scene052.mp4": "汤姆从厨房冲出来，手里拿着一个冒着蒸汽的锅，他被锅的重量拖着跑，锅在地板上滑行，留下一串蒸汽。",
    "E56.Jerry.and.the.Goldfish_scene053.mp4": "汤姆猫在房间里奔跑，突然被一个突然出现的锅砸中，锅冒出烟雾，汤姆猫被吓到并跳起，随后又落地，表情惊恐。",
    "E56.Jerry.and.the.Goldfish_scene054.mp4": "汤姆猫从蓝色的门中跳出，但被门撞到后摔倒在门廊上，表情痛苦。",
    "E56.Jerry.and.the.Goldfish_scene056.mp4": "汤姆猫坐在一扇蓝色门前，双手捂住眼睛，显得非常痛苦。随后，他放下手，露出惊讶的表情，接着用尾巴卷起门把手，得意地笑着。门突然被撞开，房子的墙壁和地板破碎，汤姆猫被抛到空中，最终挂在门上，表情痛苦。",
    "E56.Jerry.and.the.Goldfish_scene057.mp4": "视频展示了一个地球模型在蓝色背景中逐渐缩小并远离镜头，周围有云朵环绕。地球表面呈现蓝色和棕色，显示了美洲大陆。随着镜头拉远，地球逐渐变小，最终几乎消失在视野中，只剩下云朵在蓝色背景中漂浮。",
    "E56.Jerry.and.the.Goldfish_scene058.mp4": "在一个鱼缸里，一条黄色的小鱼正贴着玻璃缸壁，张着嘴似乎在唱歌。突然，一只戴着潜水镜、穿着潜水靴的老鼠从右侧游入鱼缸，它开心地向小鱼打招呼，小鱼也高兴地回应。老鼠和小鱼在鱼缸里愉快地互动，最后它们握手，画面逐渐变暗，最终显示“THE END”。",
    "E56.Jerry.and.the.Goldfish_scene059.mp4": "视频显示了“THE END”的字样，随后逐渐显示出“An M-G-M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色。"
}