{
    "E104.Barbecue.Brawl_scene001.mp4": "视频展示了米高梅动画公司的标志，标志中央是一只咆哮的狮子，周围环绕着“Metro-Goldwyn-Mayer”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样。随后画面转为黑色，接着出现“Tom and Jerry”的标题画面，左侧是猫汤姆，右侧是老鼠杰瑞。",
    "E104.Barbecue.Brawl_scene004.mp4": "一只戴着厨师帽的棕色大狗和一只戴着厨师帽的小狗在户外。大狗拿着一个装满黑色食物的蓝色盘子，走到烧烤架前，将食物倒进烧烤架中。食物开始冒烟，烟雾逐渐变大，最终形成一个巨大的黑色烟云，几乎遮住了大狗的整个身体。大狗看起来非常开心和满足，而小狗则在一旁观看。",
    "E104.Barbecue.Brawl_scene006.mp4": "一只棕色的小老鼠在石板路上奔跑，随后一只灰色的猫从墙后跳出，追赶小老鼠。",
    "E104.Barbecue.Brawl_scene007.mp4": "一只棕色的小老鼠从墙角跑出来，一只灰色的猫从后面追来，猫扑向小老鼠，但被桌子绊倒，摔倒在地。小老鼠跑开，猫躺在地上不动。",
    "E104.Barbecue.Brawl_scene008.mp4": "一只老鼠从画面左侧跑入，跳向一个装满黑色球状物的黄色袋子，然后消失在画面中。随后，一只灰色的猫从画面右侧跳入，试图抓取袋子中的球状物，但球状物被它抓起后飞散开来。猫的表情从兴奋转为困惑。背景是绿色的树林和一条小路，前景有一个烧烤架。",
    "E104.Barbecue.Brawl_scene009.mp4": "一只戴着厨师帽的棕色狗抱着一只小猫从门里跑出来，狗手里拿着一块肉，两人看起来很开心。他们跑过院子，经过一棵结满果实的树。突然，狗失去平衡，摔倒在地，厨师帽和小猫飞了出去。",
    "E104.Barbecue.Brawl_scene010.mp4": "汤姆在户外烧烤时被两只狗打断。大狗戴着厨师帽，拿着锅铲和勺子，小狗狗也戴着厨师帽坐在桌子上。大狗用锅铲把汤姆的头按进锅里，汤姆痛苦地挣扎。大狗把汤姆的头从锅里拿出来，然后把汤姆的头按进锅里，汤姆痛苦地挣扎。大狗把汤姆的头从锅里拿出来，然后把汤姆的头按进锅里，汤姆痛苦地挣扎。大狗把汤姆的头从锅里拿出来，然后把汤姆的头按进锅里，汤姆痛苦地挣扎。大狗把汤姆的头从锅里拿出来，然后把汤姆的头按进锅里，汤姆痛苦地挣扎。大狗把汤姆的头从锅里拿出来，然后把汤姆的头按进锅里，汤姆痛苦地挣扎。大狗把汤姆的头从锅里拿出来，然后把汤姆的头按进锅里，汤姆痛苦地挣扎。大狗把汤姆的头从锅里拿出来，然后把汤姆的头按进锅里，汤姆痛苦地挣扎",
    "E104.Barbecue.Brawl_scene011.mp4": "一只戴着红色项圈的棕色狗正在用蓝色铲子往烧烤架上添加黑色的炭块，炭块落下时冒出火花。狗的表情从专注变为惊讶，似乎对炭块掉落的方式感到意外。背景是绿色的草地。",
    "E104.Barbecue.Brawl_scene012.mp4": "一个黑色物体从绿色椅子下滚落，掉入泳池中，引发水花四溅，随后形成漩涡。",
    "E104.Barbecue.Brawl_scene013.mp4": "一只戴着厨师帽的大狗正在户外的桌子旁，手里拿着蓝色的勺子，似乎在准备食物。它面带微笑，对着坐在桌子另一侧、同样戴着厨师帽的小狗说话，表情生动，动作夸张，显得非常开心和自豪。背景是绿色的树林和一盆紫色花朵的植物，营造出轻松愉快的氛围。",
    "E104.Barbecue.Brawl_scene014.mp4": "一只棕色的小老鼠从游泳池里爬出来，跑过池边。一只灰色的猫从后面追来，试图抓住它。小老鼠用尾巴勾住猫的尾巴，猫被拉得在池边翻滚，最后掉进水里，溅起水花。小老鼠也跳进水里，然后跑开。",
    "E104.Barbecue.Brawl_scene015.mp4": "视频中，一只戴着厨师帽的棕色大狗正在用铲子给一只戴着厨师帽的小狗做食物。大狗看起来很得意，而小狗则专注地看着食物。突然，一只灰色的猫从旁边跳出来，与大狗发生争执。猫试图抢夺铲子，大狗被激怒，用铲子反击。最终，猫成功抢到了铲子，并得意地跑开了，而大狗则被击中，显得很痛苦。背景是一个户外花园，有绿色的树木和花盆。",
    "E104.Barbecue.Brawl_scene016.mp4": "汤姆猫手持蓝色扫帚，在石板路上追逐一个白色的物体，他不断挥动扫帚试图击打该物体，但该物体灵活地躲避，导致汤姆猫在追逐过程中不断摔倒和翻滚。背景是一个有砖砌烤炉和盆栽植物的庭院。",
    "E104.Barbecue.Brawl_scene017.mp4": "一只棕色的狗戴着红色项圈，站在石板路上，背景是绿色的树林。它先是看着前方，然后一个白色的厨师帽从画面左侧飞来，落在它的头上。狗显得很生气，紧握拳头。这时，一只灰色的猫拿着蓝色的苍蝇拍跑过来，狗用苍蝇拍击打猫，猫被击中后向后退去，最后猫跑出了画面，狗则站在原地，握着苍蝇拍，表情愤怒。",
    "E104.Barbecue.Brawl_scene018.mp4": "视频开始时，汤姆猫在池边滑稽地跳舞，随后池水喷涌而出。接着场景切换到一个厨师狗和一只小狗在户外烹饪，厨师狗正在往碗里撒调料，一只小老鼠偷偷靠近并试图偷吃调料。厨师狗察觉后，用叉子和勺子搅拌碗里的绿色蔬菜，过程中蔬菜飞溅，小老鼠被蔬菜击中，厨师狗则开心地继续搅拌。整个场景充满幽默和卡通风格。",
    "E104.Barbecue.Brawl_scene019.mp4": "一只灰色的猫从树上跳下，试图抓住一只棕色的小老鼠。小老鼠在空中翻滚，猫紧追不舍。猫成功抓住了老鼠，但随后被树叶包围，最终松开了老鼠。老鼠继续在空中翻滚，而猫则在空中悬停。",
    "E104.Barbecue.Brawl_scene021.mp4": "一只戴着厨师帽的大狗和一只戴着厨师帽的小狗在户外烧烤。大狗用叉子翻动烤架上的肉，小狗狗坐在旁边看着。背景是绿色的灌木和石板地面。",
    "E104.Barbecue.Brawl_scene022.mp4": "一只戴着厨师帽的大狗正在烧烤架上翻动一块肉，旁边坐着一只同样戴着厨师帽的小狗，它们都在户外的庭院里。大狗看起来非常开心，小狗狗则好奇地注视着大狗的动作。背景中有绿色的植物和花盆。",
    "E104.Barbecue.Brawl_scene023.mp4": "一只戴着黄色帽子的老鼠从红色瓶子中探出头，随后瓶子被一只手握住，老鼠被挤出瓶口。",
    "E104.Barbecue.Brawl_scene024.mp4": "一只戴着厨师帽的大狗正在户外烧烤，它兴奋地往肉上挤番茄酱，旁边的小狗也戴着厨师帽坐在桌边观看。突然，大狗发现番茄酱瓶被小狗狗不小心打翻，番茄酱喷溅出来，大狗惊慌失措地抱起小狗狗，但最终番茄酱瓶被小狗狗弄倒，番茄酱洒了一地，大狗和小狗狗都呆住了。",
    "E104.Barbecue.Brawl_scene025.mp4": "汤姆猫站在树枝上，用尾巴勾住一根绳子，然后顺着绳子滑下，最终消失在画面中。",
    "E104.Barbecue.Brawl_scene026.mp4": "视频展示了一个卡通场景，背景是一个户外的厨房区域，有砖砌的烤炉和一些盆栽植物。画面开始时，一个戴着黄色帽子的红色瓶子出现在前景，随后一只灰色的猫（汤姆）从右侧出现，伸手抓住瓶子，然后迅速跑开。接着，一只棕色的小老鼠从画面左侧跑过，最后消失在画面中。随后，两只穿着厨师帽的狗（杰瑞和他的伙伴）从画面下方出现，它们看起来非常开心，互相亲吻。大狗拿着一个长柄叉子，似乎准备进行某种烹饪活动。整个场景充满了轻松愉快的氛围。",
    "E104.Barbecue.Brawl_scene027.mp4": "一只小老鼠从一个巨大的面包里探出头来，然后迅速跳出来，跑开了。",
    "E104.Barbecue.Brawl_scene028.mp4": "一只大狗穿着厨师帽，抱着一只小狗，手持长柄叉子站在烧烤架旁。一只灰色的猫从右侧跳过来，试图抢夺叉子，但被大狗挡住。大狗和小狗保持姿势，似乎在准备烧烤。背景是户外庭院，有石板路、植物和砖砌烤炉。",
    "E104.Barbecue.Brawl_scene029.mp4": "一只灰色的猫用一根长棍子在树林中荡秋千，它紧紧抓住棍子，身体前后摆动，同时用爪子抱着一块长面包。猫的表情专注而坚定，似乎在努力完成某个任务或逃离某种危险。背景是茂密的绿色树林，树木高大，枝叶繁茂，营造出一种自然、宁静的氛围。",
    "E104.Barbecue.Brawl_scene030.mp4": "两只戴着厨师帽的狗在户外厨房场景中。大狗手持长叉，小狗狗被它抱着。大狗将小狗狗放在地上后，拿起一个蓝色桶戴在头上，又拿起一个锅盖当盾牌，做出战斗姿势。随后，大狗向后倒下，消失在画面中，只留下小狗狗坐在原地。",
    "E104.Barbecue.Brawl_scene031.mp4": "汤姆猫手持长棍和披萨，沿着绳索滑行。随后，杰瑞穿着盔甲，手持长矛和盾牌，从草地上飞驰而过。",
    "E104.Barbecue.Brawl_scene032.mp4": "在后院里，一只戴着蓝色帽子、拿着叉子的狗正在追赶一只被叉子刺中的猫。狗跑过草坪，叉子上还挂着一块面包，面包上冒着热气。猫在狗的追赶下显得狼狈不堪。背景中有木栅栏、树和一把红色的椅子。",
    "E104.Barbecue.Brawl_scene033.mp4": "汤姆猫在户外奔跑，背景是绿色的树木和蓝天。",
    "E104.Barbecue.Brawl_scene034.mp4": "视频开始时，汤姆猫从一个橙色的长椅上跳起，随后落入一个游泳池中。在水中，他先是漂浮着，然后沉入水底，只留下尾巴露出水面。接着，场景切换到一个户外餐桌，两只穿着厨师服装的熊正在享用美食。大熊拿着刀叉，兴奋地庆祝，而小熊则在一旁微笑地看着。他们似乎非常享受这顿饭，气氛欢快。",
    "E104.Barbecue.Brawl_scene035.mp4": "一群蚂蚁在花园里沿着一条蜿蜒的路径爬行，最终聚集在一处，形成一个垂直的队列。",
    "E104.Barbecue.Brawl_scene036.mp4": "一只穿着厨师服的熊正在用刀叉切盘子里的食物，旁边还有一只小熊在观看。镜头逐渐放大，聚焦在熊切食物的动作上。",
    "E104.Barbecue.Brawl_scene037.mp4": "一群蚂蚁在庭院中沿着一条蜿蜒的路径行走，其中一只蚂蚁手持喇叭，似乎在指挥或引导其他蚂蚁。背景中有橙色的椅子和绿色的树木，环境宁静。",
    "E104.Barbecue.Brawl_scene038.mp4": "两只穿着厨师服的熊在户外餐桌旁准备用餐。大熊手持刀叉，兴奋地挥舞着，随后准备切盘中的食物。小熊在一旁观看，表情从开心转为惊讶。餐桌上摆满了食物，包括面包、玉米、番茄和调味瓶。背景是绿色的树林。",
    "E104.Barbecue.Brawl_scene039.mp4": "一群蚂蚁排成一列，沿着一个巨大的物体表面爬行。这个物体看起来像一个带有红色格子的白色帆布或旗帜，固定在橙色的柱子上。蚂蚁们从地面爬到物体表面，然后继续向上攀爬。在画面的上方，一个大狗的头从物体后方探出，眼睛注视着蚂蚁，表情显得有些惊讶或好奇。背景是简单的橙色天空和绿色地面。",
    "E104.Barbecue.Brawl_scene040.mp4": "两只戴着厨师帽的狗在户外用餐，大狗将桌布卷起，把小狗裹在里面，然后抱着它离开。",
    "E104.Barbecue.Brawl_scene041.mp4": "两只戴着厨师帽的棕色小狗，一大一小，一起跑向一张橙色桌子。大狗抱着一个红白格子的网袋，小狗则被大狗抱在怀里。它们一起跳过桌子，来到一个水池边，大狗把网袋放在水池边缘，然后站在水池边，小狗则站在大狗的背上。",
    "E104.Barbecue.Brawl_scene042.mp4": "视频展示了一群蚂蚁在一条橙色的长条形物体上行走。背景是绿色的植物和木质围栏，地面是石板路。蚂蚁们从画面左侧进入，排成一列，向右移动。镜头跟随蚂蚁的移动而向右平移，最终蚂蚁们走出了画面。",
    "E104.Barbecue.Brawl_scene043.mp4": "两只戴着厨师帽的棕色小狗，一只抱着另一只，手里提着一个红白格子的袋子，小心翼翼地走在木板上，然后不慎滑入水中。它们在水中嬉戏，溅起水花，最后平静地浮在水面上。"
}