{
    "S1940E40 - The Little Orphan_scene002.mp4": "视频展示了米高梅动画的标志，一只狮子在红色背景的圆形框架内咆哮，下方有“Metro-Goldwyn-Mayer CARTOON”字样和“Color by Technicolor”的说明。随后画面转黑，接着出现“Tom and Jerry”的标志，显示了猫和老鼠的经典形象。",
    "S1940E40 - The Little Orphan_scene004.mp4": "一只棕色的小老鼠从右侧跑入画面，它在房间中央的圆形地毯上停下，身体前倾，双臂张开，似乎在观察周围的环境。房间内有一扇木门、一个挂着蓝色水壶的架子、一把扫帚和一个绿色的椅子。",
    "S1940E40 - The Little Orphan_scene005.mp4": "夜晚，一只穿着红色衣服的小猫坐在一扇蓝色门前，门后出现了一只橙色大猫，大猫探头张望，随后又缩回门内。",
    "S1940E40 - The Little Orphan_scene006.mp4": "杰瑞从门后探出头来，站在圆形地毯上，先是惊讶地张大嘴巴，随后开心地跳跃起来。",
    "S1940E40 - The Little Orphan_scene007.mp4": "在一间昏暗的房间里，穿着红色小丑服装的杰瑞站在一个黄色的平台上，手里拿着一个黄色的物体，似乎在操作一个蓝色的机械装置。突然，汤姆从左侧冲进来，一把抓住杰瑞，将他从平台上拉了下来。汤姆抱着杰瑞，表情惊讶，而杰瑞则显得有些惊慌。随后，汤姆将杰瑞放在地上，两人对视，汤姆的表情依然惊讶。",
    "S1940E40 - The Little Orphan_scene008.mp4": "在室内，一只棕色老鼠和一只穿着红色帽子的灰色老鼠互动。棕色老鼠先是拉扯灰色老鼠，然后从灰色老鼠手中拿走一张纸，仔细阅读后表情惊讶。灰色老鼠则坐在地上，看起来有些沮丧或困惑。背景中有一张紫色沙发和一盏落地灯。",
    "S1940E40 - The Little Orphan_scene009.mp4": "视频中展示了一张纸条，上面用黑色墨水写着：“这是Nibbles，你同意在感恩节那天作为晚餐的客人。谢谢你们，‘Bide A Wee Mouse Home’。”纸条下方用红色墨水写着：“P.S. 他总是饿。”纸条被两只手拿着。",
    "S1940E40 - The Little Orphan_scene010.mp4": "在室内，一只棕色老鼠拿着纸张，面向一只穿着红色圣诞帽和围巾的灰色老鼠。棕色老鼠似乎在读纸上的内容，而灰色老鼠则低头看着地面，表情显得有些沮丧或不安。背景中有一张紫色沙发和一盏台灯，整体氛围温馨但略带紧张。",
    "S1940E40 - The Little Orphan_scene011.mp4": "一只穿着红色和黄色帽子、围着红色围巾、穿着白色尿布的小猫坐在地上，先是打了个大大的哈欠，然后开始开心地笑，眼泪都笑出来了，最后停止笑并张开双臂。背景中有一张紫色的沙发。",
    "S1940E40 - The Little Orphan_scene012.mp4": "在昏暗的房间里，一只棕色老鼠拿着纸张，面对着一只穿着红色小丑服装的灰色小猫。棕色老鼠先是挠头思考，随后兴奋地指向小猫，接着跳起来扑向小猫，最后小猫独自坐在地上。",
    "S1940E40 - The Little Orphan_scene013.mp4": "杰瑞进入厨房，打开橱柜，发现里面有一罐饼干。他兴奋地拿起饼干罐，但发现里面是空的。他思考了一下，然后决定离开。",
    "S1940E40 - The Little Orphan_scene014.mp4": "在一间昏暗的房间里，一只小老鼠穿着小丑服装，被另一只棕色老鼠追赶。棕色老鼠把小丑服装扔到沙发上，然后抓起小老鼠，将其拖走。随后，画面切换到另一个场景，一只灰色的猫躺在沙发下，面前放着一碗牛奶，而两只老鼠站在猫的旁边，似乎在观察猫的动静。",
    "S1940E40 - The Little Orphan_scene015.mp4": "在厨房的地板上，一只灰色的猫汤姆正躺在一个装满牛奶的黄色碗旁边，看起来非常放松。两只小老鼠杰瑞和米奇躲在桌子底下，杰瑞试图偷喝碗里的牛奶，但米奇阻止了他。杰瑞把米奇推到碗里，米奇在碗里挣扎，汤姆被惊醒，瞪大眼睛看着他们，显得非常惊讶和生气。杰瑞迅速把米奇拉出来，藏在桌子底下，汤姆则继续盯着他们，表情愤怒。",
    "S1940E40 - The Little Orphan_scene016.mp4": "猫汤姆躺在地上，面前放着一个装满食物的碗。他先是用爪子拨弄碗里的食物，然后把碗举起来，试图把食物倒进嘴里，结果食物洒了一地。汤姆看起来很沮丧，最后他把碗放回地上，用爪子捂住脸，似乎在叹气。在画面的左侧，一只小老鼠杰瑞躲在沙发底下，偷偷地看着汤姆的一举一动。",
    "S1940E40 - The Little Orphan_scene017.mp4": "汤姆猫坐在地上，面前放着一个黄色的碗，他闭着眼睛，嘴角上扬，显得非常满足。突然，他的胡须尖端滴下一滴油，油滴落在碗里。接着，杰瑞鼠和另一个小老鼠从柜子后面探出头来，杰瑞拿着一个白色的小球，小老鼠则张大嘴巴，似乎在争抢这个小球。油滴落在小球上，溅起了一点点油花。",
    "S1940E40 - The Little Orphan_scene018.mp4": "两只老鼠在碗边玩耍，一只灰色老鼠被另一只棕色老鼠抓住，随后它们一起躲在碗后，互相依偎并露出开心的表情。",
    "S1940E40 - The Little Orphan_scene019.mp4": "一位穿着黄色围裙的厨师端着一只烤火鸡走向餐桌，将火鸡放在餐桌上。镜头向右移动，展示了摆满食物的餐桌，包括水果、甜点和意大利面。此时，一只老鼠从桌子下探出头来，然后爬上桌子，开始拉扯意大利面。",
    "S1940E40 - The Little Orphan_scene020.mp4": "一只穿着尿布的小老鼠坐在红色地毯上，看着从上方垂下的面条。它伸手抓住面条，开始向上爬，最终挂在了墙上。",
    "S1940E40 - The Little Orphan_scene021.mp4": "一只棕色的小老鼠在桌子上拉扯一根面条，另一只灰色的小老鼠从桌子底下爬上来，也参与了拉扯。两只老鼠争抢面条，最终灰色小老鼠被甩到桌子边缘，棕色小老鼠得意地看着它。",
    "S1940E40 - The Little Orphan_scene022.mp4": "一只小老鼠在餐桌上偷吃派，被另一只老鼠发现并抓住。随后，它被推到一个巧克力甜甜圈上，蜡烛被点燃，融化了巧克力。",
    "S1940E40 - The Little Orphan_scene023.mp4": "一只灰色小老鼠站在一个巧克力甜甜圈上，看着中间的奶油慢慢溢出。它开心地舔着奶油，这时一只棕色小老鼠从奶油中冒出来，被奶油溅到。灰色小老鼠惊慌地跳起来，然后又跑回来，把奶油推到棕色小老鼠身上，棕色小老鼠被奶油淹没。",
    "S1940E40 - The Little Orphan_scene024.mp4": "一只灰色的小老鼠在餐桌上跳跃，试图偷吃一块红色的果冻。它从一把勺子上跳到另一把勺子上，然后跳进果冻里。果冻突然膨胀起来，把小老鼠困在里面。这时，一只棕色的老鼠出现，看到果冻膨胀后惊恐地跳开，然后拿起一把勺子准备攻击果冻。",
    "S1940E40 - The Little Orphan_scene026.mp4": "一只戴着感恩节帽子、手持喇叭的小老鼠在餐桌上跳舞，随后另一只同样戴帽的小老鼠从桌下探出头来，好奇地观察着。",
    "S1940E40 - The Little Orphan_scene027.mp4": "在一张摆满节日食物的桌子上，两只穿着感恩节帽子的老鼠正在玩耍。棕色老鼠拿着一个喇叭，先是吹响，然后丢下喇叭，跳到一堆面包片上，拿起一根橄榄棒敲打，突然帽子被吹飞，他惊慌失措地跳起来。灰色老鼠则在一旁观看，戴着帽子，显得有些惊讶。桌上有装饰成火鸡形状的橄榄、银质餐具和一个装有糕点的盘子。",
    "S1940E40 - The Little Orphan_scene028.mp4": "一只戴着火鸡帽的小老鼠正在努力推动一个大橙子，但橙子太大了，它被橙子压得变形。这时，另一只戴着同样帽子的小老鼠出现，它把第一只小老鼠提起来，然后用一把大刀将它切开，第一只小老鼠被切开后变成了一个小老鼠。",
    "S1940E40 - The Little Orphan_scene029.mp4": "一个橙色的球体在室内地板上快速滚动，从桌子下方滚过，接着滚向一把条纹扶手椅。",
    "S1940E40 - The Little Orphan_scene030.mp4": "一只灰色的猫躺在地板上，旁边有一个空碗。它打了个大大的哈欠，然后突然伸展身体，变得非常长，几乎像一根棍子。接着，它又恢复了正常体型，翻了个身，四肢伸展，看起来非常放松。最后，它突然变得愤怒，快速地跑出了画面。",
    "S1940E40 - The Little Orphan_scene031.mp4": "一只灰色的猫从墙角后探出头来，观察前方的情况。它先是小心翼翼地从墙角后探出半个身子，随后完全露出头部，眼睛瞪得很大，表情显得非常警觉和好奇。猫的耳朵竖起，似乎在仔细聆听周围的动静。背景中可以看到一把红色手柄的扫帚靠在墙边，地板是红色的，墙壁是绿色和黄色相间的。",
    "S1940E40 - The Little Orphan_scene032.mp4": "两只穿着火鸡帽的老鼠在餐桌旁，一只拿着绿色棒棒糖，另一只拿着喇叭。它们在餐桌旁走动，吃着棒棒糖，吹着喇叭，看起来非常开心。",
    "S1940E40 - The Little Orphan_scene033.mp4": "汤姆猫躲在墙角，伸手拿起扫帚，用力挥动后扫帚飞了出去，扫帚在空中划出弧线后落在地上，扫帚上出现了眼睛和嘴巴，仿佛有了生命。镜头跟随扫帚移动，最终扫帚停在一张摆满食物的桌子旁边。",
    "S1940E40 - The Little Orphan_scene034.mp4": "两只戴着火鸡帽的老鼠在桌子上行走，后面突然出现一只戴着火鸡头饰的猫，猫从桌子后面探出头来，露出愤怒的表情。",
    "S1940E40 - The Little Orphan_scene035.mp4": "两只穿着感恩节帽子的老鼠在地板上行走，其中一只老鼠被猫的手指拉住尾巴，被迫向前移动。",
    "S1940E40 - The Little Orphan_scene036.mp4": "汤姆戴着印第安头饰，趴在地上，杰瑞穿着感恩节服装，手持喇叭，朝汤姆吹响喇叭。汤姆被吓了一跳，但很快恢复镇定，继续盯着杰瑞。",
    "S1940E40 - The Little Orphan_scene037.mp4": "一只戴着火鸡帽的老鼠在厨房台面上行走，旁边有一个装着冰块的金属盆，盆里放着一个被绳子绑住的绿色瓶子。老鼠看起来很警觉，四处张望。",
    "S1940E40 - The Little Orphan_scene038.mp4": "在一个室内场景中，一只戴着红色头巾和羽毛装饰的猫（汤姆）正趴在地上，表情凶狠地盯着前方。前方有一只穿着火鸡帽、手持喇叭的小老鼠（杰瑞），它正在吹响喇叭，试图吓唬猫。猫的表情从愤怒逐渐转变为被逗乐，最终猫开始大笑，身体前倾，似乎被老鼠的举动逗得忍俊不禁。背景是绿色墙壁和一个红色的壁炉，地上还有南瓜和金属餐具。整个画面充满了幽默和喜剧气氛。",
    "S1940E40 - The Little Orphan_scene039.mp4": "一只戴着帽子的老鼠试图偷吃桌上的食物，却意外被一瓶香槟瓶口的软木塞钩住，被香槟喷射的液体冲得飞起。",
    "S1940E40 - The Little Orphan_scene040.mp4": "一只戴着羽毛头饰的猫被一只小老鼠用喇叭吹响后，被吓得向后倒下，随后愤怒地站起来并追击老鼠，最后消失在画面中。",
    "S1940E40 - The Little Orphan_scene041.mp4": "杰瑞戴着小帽子在厨房里奔跑，被汤姆从背后追上并抓住。汤姆戴着羽毛头饰，手持刀具，将杰瑞高高举起，表情凶狠，似乎准备攻击。杰瑞则显得惊慌失措，试图逃跑。",
    "S1940E40 - The Little Orphan_scene042.mp4": "一只戴着高帽的老鼠在餐桌上奔跑，它跳到一把叉子上，然后用叉子作为滑板滑行。",
    "S1940E40 - The Little Orphan_scene043.mp4": "一只戴着帽子的老鼠骑着一把叉子，从画面左侧冲向一个红色的果冻蛋糕，然后又迅速从蛋糕上弹射出去，消失在画面右侧。",
    "S1940E40 - The Little Orphan_scene044.mp4": "视频中，一只戴着羽毛头饰的猫手持刀具，表情凶狠，似乎在追赶或攻击一只戴着小帽子的老鼠。老鼠被猫追赶，最终被猫用叉子叉住，猫得意洋洋地展示胜利。整个场景充满了卡通式的夸张和幽默感。",
    "S1940E40 - The Little Orphan_scene045.mp4": "一只戴着小帽子的小老鼠在桌面上奔跑，途中被一把叉子击中，随后被叉子叉起。一只戴着羽毛头饰的猫突然出现，抓起小老鼠并将其捏在手中。",
    "S1940E40 - The Little Orphan_scene046.mp4": "一只戴着帽子的小老鼠骑在一把大勺子上，从一个红色的果冻蛋糕上滑到一个银色烛台的勺子上，然后继续沿着勺子滑行，最后从勺子上滑落。",
    "S1940E40 - The Little Orphan_scene047.mp4": "汤姆戴着印第安头饰，杰瑞戴着帽子拿着大勺子从左侧出现，杰瑞用勺子击打汤姆，汤姆被击中后倒下，杰瑞站在红色柱子上。",
    "S1940E40 - The Little Orphan_scene048.mp4": "汤姆猫戴着红色头巾，身体被拉长，悬挂在空中，表情愤怒，随后消失在画面中。",
    "S1940E40 - The Little Orphan_scene049.mp4": "猫戴着羽毛头饰，从沙发后爬出，偷拿桌上火柴点燃了烤肠，随后被烤肠的火焰烫到，表情痛苦地跳开。",
    "S1940E40 - The Little Orphan_scene050.mp4": "两只穿着火鸡帽的小老鼠在桌面上奔跑，撞到一个盖着白布的物体上，引发火焰，随后它们在火圈中旋转，最后消失。",
    "S1940E40 - The Little Orphan_scene051.mp4": "一只戴着火鸡帽的老鼠抱着一只小老鼠，从一个大黄块上跳过，黄块突然着火并融化，两只老鼠被困在融化的黄块中。",
    "S1940E40 - The Little Orphan_scene052.mp4": "汤姆戴着红色头巾，手持燃烧的火把，试图点燃桌上的瓶子，但火把突然失控，他被火焰烧到并被弹开，表情痛苦。",
    "S1940E40 - The Little Orphan_scene053.mp4": "一只戴着火鸡帽的老鼠从一盘黄油中跳出来，抓住一个盖着盖子的盘子的把手，把盖子掀开，露出一盘烤得金黄的面包。老鼠用尾巴点燃了面包，面包开始燃烧，冒出火焰和烟雾。",
    "S1940E40 - The Little Orphan_scene054.mp4": "汤姆猫戴着印第安风格的羽毛头饰，嘴里叼着一根烟斗，坐在地上，神情放松。他先是伸出舌头，随后将烟斗叼在嘴里，身体后仰，靠在地板上，看起来很惬意。背景中有一个木制柜子和一个蓝色花瓶。",
    "S1940E40 - The Little Orphan_scene055.mp4": "两只戴着火鸡帽的老鼠在餐桌上奔跑，一只灰色，一只棕色，它们从杯子旁跑过，经过高脚杯，然后跑到装有食物的盘子前。",
    "S1940E40 - The Little Orphan_scene056.mp4": "汤姆戴着印第安头饰，用刀划开一个瓶子，然后用瓶子喷出烟雾，最后被烟雾熏得翻滚。",
    "S1940E40 - The Little Orphan_scene057.mp4": "一只戴着感恩节帽子的老鼠试图用刀切一块烤肉，但被烤肉弹开，摔倒在地。",
    "S1940E40 - The Little Orphan_scene058.mp4": "汤姆猫戴着印第安头饰，先是大笑，然后摔倒在地，最后滚出画面。",
    "S1940E40 - The Little Orphan_scene059.mp4": "动画片段中，汤姆猫戴着印第安风格的羽毛头饰，从空中俯冲下来，抓起一只戴着小帽子的老鼠。他兴奋地举起老鼠，脸上露出得意的笑容，背景是一张摆放着火鸡和餐具的餐桌。",
    "S1940E40 - The Little Orphan_scene060.mp4": "一只小老鼠戴着帽子，正试图偷吃桌上的派，但被一把突然出现的刀刺中，吓得滚倒在地。",
    "S1940E40 - The Little Orphan_scene061.mp4": "汤姆戴着羽毛头饰，手里拿着杰瑞，兴奋地大笑。突然，他被黄色液体喷溅，身体旋转飞出，撞到墙上后消失。随后，汤姆重新出现，表情懊恼地趴在桌子上。",
    "S1940E40 - The Little Orphan_scene062.mp4": "一只戴着帽子的小老鼠在桌子上，靠近一只烤火鸡。火鸡腿上插着两根红色的蜡烛，其中一根点燃了。老鼠试图偷吃，但被蜡烛的火焰吓到，它被弹开，蜡烛也熄灭了。",
    "S1940E40 - The Little Orphan_scene063.mp4": "一只戴着羽毛头饰的猫跪在桌子旁，尾巴尖点燃了蜡烛，火势蔓延至猫的身体，猫变成了一只棕色的、毛发焦黑的猫，头顶冒出黑烟，表情惊恐。",
    "S1940E40 - The Little Orphan_scene064.mp4": "一只小老鼠戴着帽子，用绳子拉住一个绿色瓶子的瓶口，瓶子里的黄色液体喷涌而出，溅到旁边的冰桶和桌面上，最终液体流到了桌子的另一侧。",
    "S1940E40 - The Little Orphan_scene065.mp4": "一只棕色的猫在房间里奔跑，嘴里叼着一个绿色的瓶子，瓶子中喷出黄色的液体，液体在空中形成一条长长的轨迹，猫继续向前奔跑，液体轨迹延伸到房间的另一边。",
    "S1940E40 - The Little Orphan_scene066.mp4": "两只穿着感恩节帽子的老鼠在桌子上奔跑，棕色老鼠抓住灰色老鼠，两人一起停下，棕色老鼠抱着灰色老鼠。",
    "S1940E40 - The Little Orphan_scene068.mp4": "一只灰色的老鼠坐在一堆骨头中间，抱着一个白色的蛋，开心地笑着。随后，画面逐渐变暗，最终出现“The End”的字样。",
    "S1940E40 - The Little Orphan_scene069.mp4": "视频开始时显示红色背景上的白色文字“The End”，随后文字逐渐淡出，出现“An M·G·M Tom and Jerry CARTOON”的标志，最后画面变黑。"
}