{
    "E114.Tot.Watchers_scene001.mp4": "画面显示了米高梅卡通的标志，背景为深蓝色，标志中央是米高梅的狮子头像，下方有“CARTOON”字样，以及“COLOR BY TECHNICOLOR”的文字。",
    "E114.Tot.Watchers_scene002.mp4": "视频展示了米高梅动画公司的标志，狮子咆哮，背景为蓝色，下方有“CARTOON”字样和“COLOR BY TECHNICOLOR”字样。随后画面转黑，接着出现《猫和老鼠》的标题画面，左侧是汤姆猫，中间是标题“TOM and JERRY”，右侧是杰瑞鼠。",
    "E114.Tot.Watchers_scene003.mp4": "这是一个《猫和老鼠》动画片的片头，展示了该系列的标题和制作人员名单。画面开始时，显示了“Tom and Jerry”的标志，两侧分别有猫汤姆和老鼠杰瑞的卡通形象。随后，画面切换到紫色背景，显示标题“TOT WATCHERS”和“IN CINEMASCOPE”。接着，屏幕上出现制作人员名单，包括动画师、布局师、背景画家和音乐师等。最后，显示了制片人和导演的名字：Joseph Barbera 和 William Hanna。整个片头以卡通风格呈现，色彩鲜艳，充满活力。",
    "E114.Tot.Watchers_scene004.mp4": "一位穿着紫色外套的女士推着婴儿车，旁边站着一位穿着粉色上衣和深色裙子的金发女孩。女士面带微笑，女孩则双手叉腰，表情略显不满。背景是夜晚的住宅门口，门是蓝色的，旁边有窗户和一些植物。",
    "E114.Tot.Watchers_scene005.mp4": "一位穿着紫色外套、戴着白色手套的女士站在门口，旁边有一辆蓝色婴儿车，车里躺着一个婴儿。她正在和另一位穿着粉色上衣和红色裙子的女士交谈，后者双手叉腰站在一旁。女士一边说话一边做着手势，表情生动。背景是一栋房子的门口，门是蓝色的，旁边有窗户和绿色的植物。",
    "E114.Tot.Watchers_scene006.mp4": "一位穿着紫色衣服、戴着粉色蝴蝶结帽子的女士，正在温柔地抚摸一个坐在蓝色婴儿车里的婴儿。婴儿有着金色的卷发，面带微笑。女士先用手指轻触婴儿的头发，然后用手掌轻轻抚摸婴儿的头顶，婴儿开心地闭上眼睛，享受着母亲的爱抚。女士随后用手指轻触婴儿的鼻子，婴儿转头看向她，露出笑容。最后，女士将手放在婴儿车的边缘，婴儿也转头看向她。",
    "E114.Tot.Watchers_scene007.mp4": "一个金发扎着蓝色蝴蝶结的卡通女性角色，穿着粉色上衣，站在灰色背景前。她面带微笑，眼睛闪烁，表情愉悦，双手叉腰，身体微微摆动，显得自信而活泼。",
    "E114.Tot.Watchers_scene009.mp4": "一个婴儿坐在蓝色的婴儿车里，婴儿车停在房屋门口。一只棕色的小老鼠从门内跑出来，向婴儿车跑去，然后跳到婴儿车里，婴儿车里的婴儿看着它。",
    "E114.Tot.Watchers_scene010.mp4": "动画片段中，汤姆猫试图照顾婴儿，但动作笨拙导致婴儿哭泣。汤姆猫被扫帚扫倒，婴儿被一位女性接住并安抚。",
    "E114.Tot.Watchers_scene011.mp4": "汤姆猫从墙上滑落，摔倒在地，然后躲到墙角偷看。",
    "E114.Tot.Watchers_scene012.mp4": "一个金发女孩穿着粉色上衣和紫色裙子，趴在绿色沙发上打电话。她先是趴在沙发上，随后慢慢躺下，双手放在头后，显得非常放松和愉快。背景是一个室内环境，有蓝色的门和窗户。",
    "E114.Tot.Watchers_scene013.mp4": "视频中，一只小老鼠从蓝色婴儿车的尾部探出头来，然后迅速爬出并逃跑。猫汤姆从画面左侧冲出，抓住了小老鼠。汤姆得意地展示着他的战利品，而一个哭泣的婴儿从画面下方爬过，吸引了汤姆的注意。",
    "E114.Tot.Watchers_scene014.mp4": "一个婴儿在地面上爬行，随后汤姆猫从墙后跳出来，试图吓唬婴儿，但婴儿继续爬行，汤姆猫最终离开。",
    "E114.Tot.Watchers_scene015.mp4": "一只灰色的猫推着蓝色的婴儿车，车里有一个婴儿。猫把婴儿放进车里，然后温柔地抚摸婴儿的头。这时，一个穿着粉色上衣和红色裙子、扎着蓝色蝴蝶结的金发女人拿着扫帚出现，猫被吓到并迅速逃跑，女人则推着婴儿车继续前行。",
    "E114.Tot.Watchers_scene016.mp4": "一只灰色的猫从树后探出头来，它先是惊讶地张大眼睛，然后小心翼翼地从树后走出来。接着，一个金发小女孩从树后出现，她穿着粉色上衣，手里拿着一个玩具，看起来很开心。",
    "E114.Tot.Watchers_scene017.mp4": "一个金发女人在沙发上打电话，她穿着粉色上衣和红色裙子，头发上系着蓝色蝴蝶结。她一开始跪在沙发上，后来躺下，一边打电话一边放松地靠在枕头上，脸上带着微笑。她时而调整姿势，时而用手托着头，显得非常惬意。背景是一个温馨的客厅，有蓝色的门、黄色的窗帘和一盏台灯。",
    "E114.Tot.Watchers_scene018.mp4": "汤姆猫躲在树后，突然从树后伸出爪子抓住了杰瑞鼠。杰瑞鼠被抓住后，汤姆猫得意地舔着舌头，把杰瑞鼠举在空中。",
    "E114.Tot.Watchers_scene019.mp4": "一个穿着尿布、头顶光环的婴儿在草地上爬行，从木栅栏的缝隙中钻过，最终完全消失在画面中。",
    "E114.Tot.Watchers_scene020.mp4": "一个婴儿在草地上爬行，靠近狗屋时被汤姆猫突然扑住，汤姆猫抱着一只狗，愤怒地在草地上奔跑。",
    "E114.Tot.Watchers_scene021.mp4": "一只小老鼠在木制围栏上奔跑，突然从下方爬出一个婴儿，婴儿的尿布喷出一股水流，将小老鼠冲得向后滑行。这时，一只猫从空中跳下，抓住婴儿，然后迅速离开现场，留下小老鼠独自在草地上。",
    "E114.Tot.Watchers_scene022.mp4": "一个女人躺在沙发上打电话，汤姆抱着一个婴儿走进来，女人接过了婴儿，汤姆生气地站在一旁，女人拿起扫帚追打汤姆。",
    "E114.Tot.Watchers_scene023.mp4": "一只灰色的猫从墙后跳出来，惊讶地发现一只小老鼠站在墙角。猫先是张开双臂，表情夸张，随后慢慢站直，眼睛瞪大，嘴巴微张，似乎对老鼠的存在感到震惊和困惑。老鼠则站在原地，看起来毫不畏惧，甚至有些得意。猫随后弯下腰，似乎在观察老鼠，表情从惊讶转为困惑和警惕。",
    "E114.Tot.Watchers_scene024.mp4": "一个婴儿从蓝色的婴儿床里爬出来，爬到沙发上，然后爬到一个穿着紫色衣服的女人身上，最后爬到沙发的另一边。",
    "E114.Tot.Watchers_scene025.mp4": "一只灰色的猫和一只棕色的小老鼠在墙角相遇。猫先是惊讶地张大嘴巴，然后用手捂住嘴，接着又张开双臂，表情变得愤怒，最后又张大嘴巴，似乎在大声喊叫。小老鼠则一直站在原地，表情平静，没有明显的动作变化。",
    "E114.Tot.Watchers_scene026.mp4": "一个婴儿从门后爬出，被起重机的铲斗抓起，然后被倒进一辆红色的卡车里。",
    "E114.Tot.Watchers_scene027.mp4": "一只灰色的猫在街道上奔跑，身后跟着一辆红色的自卸卡车，卡车上坐着一个小孩。猫的表情显得非常紧张和害怕，似乎在逃避什么。背景是住宅区，有树木、房屋和路灯。卡车在行驶过程中，车轮转动，泥土从车厢后部洒落。",
    "E114.Tot.Watchers_scene028.mp4": "一辆红色的自卸卡车正在行驶，车斗里坐着一个穿着白色尿布、头顶有黄色小角的婴儿。卡车在行驶过程中，车斗逐渐抬起，婴儿在车斗里坐着，背景是红色的金属结构和绿色的围栏。",
    "E114.Tot.Watchers_scene029.mp4": "一只猫和一只老鼠在一辆倾倒泥土的卡车旁，猫被泥土埋住后又爬出来，老鼠在一旁看着。随后，一个婴儿从泥土堆上爬下来，猫和老鼠都惊讶地看着婴儿。",
    "E114.Tot.Watchers_scene030.mp4": "一个穿着尿布的婴儿在建筑工地的门口爬行，随后爬出画面。门口挂着“危险！建筑施工中”的警示牌。",
    "E114.Tot.Watchers_scene031.mp4": "一个婴儿爬向一个大管道，然后爬进去。管道被吊起，婴儿消失在管道内。随后，汤姆猫和杰瑞鼠出现在场景中，汤姆猫看起来很惊讶。",
    "E114.Tot.Watchers_scene032.mp4": "一个白色的圆柱形物体被绳子吊在红色的金属框架结构中，随着镜头缓慢向上移动，物体逐渐上升。背景是浅蓝色的天空，远处可见一些房屋轮廓。",
    "E114.Tot.Watchers_scene033.mp4": "汤姆猫在仓库里爬梯子，他一开始在梯子底部，然后开始向上爬，途中他被梯子绊倒，但继续爬，最终爬到了梯子顶部。",
    "E114.Tot.Watchers_scene034.mp4": "汤姆猫在红色的钢梁上行走，突然被一个婴儿从背后推了一把，导致他身体被拉长并悬挂在空中。汤姆猫惊恐地尖叫，试图抓住上方的物体以自救。",
    "E114.Tot.Watchers_scene035.mp4": "一个粉色的小角色在红色的横梁上行走，背景是城市和水域的卡通画面。",
    "E114.Tot.Watchers_scene036.mp4": "汤姆猫从一个管道中滑落，身体在空中翻滚，最终消失在画面中。",
    "E114.Tot.Watchers_scene037.mp4": "一只灰色的猫在高楼之间的红色钢梁上悬吊着，双手紧握钢梁，身体悬空，表情紧张。远处是城市景观和一片水域，背景中可以看到许多建筑物。猫的前方有一只小动物（可能是老鼠）在钢梁上奔跑，猫似乎在追赶它。",
    "E114.Tot.Watchers_scene038.mp4": "视频中，汤姆猫被拉伸成一个“十”字形，一个婴儿在汤姆猫的身上爬行。婴儿爬到汤姆猫的右臂上后，继续向右爬行，最终从画面右侧消失。随后，一只老鼠从画面右侧出现，沿着红色横梁向左跑动，最终从画面左侧消失。整个场景背景为蓝色。",
    "E114.Tot.Watchers_scene039.mp4": "汤姆猫张开双臂和双腿，像在走钢丝，一个婴儿在它左臂上爬行，然后从右臂上跳过，汤姆猫表情紧张。",
    "E114.Tot.Watchers_scene040.mp4": "一个穿着白色尿布、头顶金色光环的婴儿在红色的钢梁上爬行，一只棕色的小老鼠从远处跑来，追着婴儿。婴儿继续向前爬，小老鼠紧随其后，最终小老鼠停在钢梁的尽头，婴儿则继续向前爬行。背景是城市的高楼大厦。",
    "E114.Tot.Watchers_scene041.mp4": "一个穿着尿布、头顶有光环的婴儿在红色的钢梁上爬行，最终爬到钢梁的尽头。",
    "E114.Tot.Watchers_scene042.mp4": "一个婴儿在高处的木板上哭泣，一只老鼠出现并试图拉住婴儿，但婴儿被拉得悬空，老鼠也悬挂在木板边缘。",
    "E114.Tot.Watchers_scene043.mp4": "视频中，一个穿着白色尿布的婴儿被吊在空中，随后被一只灰色的猫用钩子吊起。猫将婴儿抱在怀里，小心翼翼地走动，似乎在安抚哭泣的婴儿。背景是一个简单的工业场景，有红色的柱子和木制地板。",
    "E114.Tot.Watchers_scene044.mp4": "一只棕色的小老鼠，穿着白色斗篷，正在木制地板上快速奔跑。背景是蓝色的墙壁和红色的门框。",
    "E114.Tot.Watchers_scene045.mp4": "汤姆抱着一个婴儿，用尿布包裹婴儿。婴儿被包裹后，汤姆自己也穿上了尿布。汤姆突然开始奔跑，最终跑出了画面。杰瑞站在一旁观看。",
    "E114.Tot.Watchers_scene046.mp4": "一只小老鼠在木制平台上行走，背景是红色的金属结构和蓝色的天空。随后画面变暗，接着切换到一个带有蓝色机械装置的红色金属结构场景。",
    "E114.Tot.Watchers_scene047.mp4": "汤姆抱着一个婴儿，婴儿哭闹着。汤姆把婴儿放在地上，然后拉下一根绳子，婴儿掉进了水里。",
    "E114.Tot.Watchers_scene048.mp4": "一只灰色的小猫从高处坠落，穿过一个由红色和蓝色结构组成的复杂空间，最终安全着陆。",
    "E114.Tot.Watchers_scene050.mp4": "在一座红色金属结构的建筑内，汤姆猫正试图用一根蓝色的杆子抓住杰瑞鼠。杰瑞鼠在地板上快速奔跑，汤姆猫紧追不舍，表情愤怒。背景是浅蓝色的天空和木质地板。",
    "E114.Tot.Watchers_scene051.mp4": "动画片段中，汤姆猫在木制平台上奔跑，杰瑞鼠突然出现并推了他一下，汤姆猫失去平衡跌落。随后，汤姆猫被一个喷射泡沫的机器喷出，泡沫从机器中喷出，覆盖了汤姆猫。",
    "E114.Tot.Watchers_scene052.mp4": "一个婴儿坐在木板上，手里拿着锤子，对着浴缸里的泡沫怪物挥舞。泡沫怪物从水中冒出来，婴儿用锤子敲打它，泡沫怪物被敲打后变得更加生气。",
    "E114.Tot.Watchers_scene053.mp4": "一个婴儿拿着锤子站在木板上，面前是一滩泥浆，泥浆中有一个鬼怪形状。画面切换到一个女孩和警察在室内，警察正在写字，女孩双手合十看着警察。",
    "E114.Tot.Watchers_scene054.mp4": "一个穿着粉色上衣和红色裙子、金色头发扎着蓝色蝴蝶结的女孩正在向一位穿着蓝色制服、戴着警帽的警察解释什么。女孩表情丰富，手势频繁，似乎在努力说明情况，而警察则专注地在本子上记录，偶尔抬头倾听。背景是一个室内环境，有窗户和门，光线柔和。",
    "E114.Tot.Watchers_scene055.mp4": "汤姆抱着一个婴儿从门后走出，杰瑞从门后跑出来，汤姆被吓到，扔掉婴儿，婴儿被一位女士接住。警察出现，抓住汤姆和杰瑞，把他们带走。警察开车离开。",
    "E114.Tot.Watchers_scene056.mp4": "一个交通灯从绿色变为红色，一辆警车驶过路口，警车上有“POLICE DEPT.”字样，车内警察戴着蓝色帽子，警车顶部有一个喇叭。",
    "E114.Tot.Watchers_scene057.mp4": "一辆警车停在路边，车后座上关着汤姆猫和杰瑞鼠，警察在驾驶座上。一个婴儿爬到警车后部，警察和汤姆猫都惊讶地看着婴儿。",
    "E114.Tot.Watchers_scene058.mp4": "一个穿着白色尿布的婴儿在一条有蓝色围栏的小路上爬行，逐渐远离镜头，最终消失在远方。画面最后黑屏并显示“THE END”字样，两侧分别是猫和老鼠的图案。",
    "E114.Tot.Watchers_scene059.mp4": "视频开始时显示了“THE END”的字样，两侧分别有汤姆猫和杰瑞鼠的卡通形象。随后画面切换，显示“an M·G·M CARTOON”字样，下方标注“made in hollywood, U·S·A.”，背景为蓝色。整个画面保持静态，无其他动作或变化。"
}