{
    "23. Springtime for Thomas_scene001.mp4": "视频开始时显示黑色背景，右下角有白色数字“0110544170204083”。随后画面逐渐变亮，出现“METRO-GOLDWYN-MAYER CARTOON”字样，下方标注“COLOR BY TECHNICOLOR”，背景为深蓝色，整体呈现经典动画片头风格。",
    "23. Springtime for Thomas_scene002.mp4": "这是一个米高梅动画片头，背景为深蓝色，中央是一个咆哮的狮子头像，狮子位于一个圆形框架内，框架上方有“METRO-GOLDWYN-MAYER”字样，下方有“CARTOON”字样，再下方是“COLOR BY TECHNICOLOR”字样。狮子在画面中不断咆哮，嘴巴张合，表情生动。右下角有一个数字编码“0110544170204083”。",
    "23. Springtime for Thomas_scene003.mp4": "视频展示了米高梅动画公司的标志，随后画面转为黑色，最后出现“Tom and Jerry”的标题，伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "23. Springtime for Thomas_scene004.mp4": "这是一个《猫和老鼠》动画片的开场画面，画面中展示了主角汤姆和杰瑞的形象，以及动画片的标题。背景是蓝色的，汤姆和杰瑞分别位于标题的两侧，汤姆是一只灰色的猫，杰瑞是一只棕色的老鼠，他们都面带笑容。标题文字是黄色的，随着画面的推进，出现了“Springtime for Thomas”的字样，以及导演的名字。",
    "23. Springtime for Thomas_scene005.mp4": "这是一个动画片的片头，标题为“Springtime for Thomas”，由William Hanna和Joseph Barbera执导。画面中展示了两个被箭射中的红色心形图案，背景是蓝色的，上面有多个心形图案。片头还列出了动画师、音乐作曲家和制片人等制作人员的信息。最后，显示了“Produced by Fred Quimby”的字样。整个画面充满了浪漫和春天的气息。",
    "23. Springtime for Thomas_scene006.mp4": "视频开头显示“Produced by FRED QUIMBY”的字样，背景为深蓝色并点缀着黑色心形图案。随后画面转为全黑，接着出现一个动画场景：一座带有红色屋顶和白色墙壁的房子，门前有石板小路，周围环绕着绿色草坪、树木和盛开的粉色花朵。",
    "23. Springtime for Thomas_scene007.mp4": "视频展示了一个宁静的庭院场景，画面中有一栋白色的房子，房子前有一棵开满粉红色花朵的树。庭院里有绿色的草坪和几块石板路，周围种植着各种花卉。一只蓝色的蝴蝶从画面右侧飞入，飞过庭院，最终停在了树上。随后，镜头逐渐拉近，聚焦于房子和树。整个场景充满了春天的气息，色彩鲜艳，给人一种温馨、宁静的感觉。",
    "23. Springtime for Thomas_scene008.mp4": "一个蓝色的邮箱位于墙边，邮箱上方有蓝白相间的条纹盖子，盖子上有一个黄色的圆形按钮。邮箱周围有盛开的粉色花朵和绿色的叶子。邮箱盖子打开，一只戴着黄色帽子的棕色老鼠从里面探出头来，它看起来非常开心，露出牙齿微笑，然后伸展双臂，做出庆祝的动作，接着它又缩回身体，最后完全消失在邮箱内。",
    "23. Springtime for Thomas_scene009.mp4": "一只老鼠从桌子下的洞里探出头来，表情紧张，似乎在观察周围环境。",
    "23. Springtime for Thomas_scene010.mp4": "一只灰色的猫坐在红色沙发上，背对着镜头，似乎在打盹。一只棕色的小老鼠从右侧跑进来，兴奋地在沙发上跳跃，然后突然被猫的尾巴扫中，飞了出去，消失在画面右侧。猫没有反应，继续保持着原来的姿势。",
    "23. Springtime for Thomas_scene011.mp4": "一只棕色的小老鼠在红色的沙发上快速奔跑，背景从绿色墙壁逐渐变为紫色窗帘，最后停在沙发边缘，表情紧张地望向一侧。",
    "23. Springtime for Thomas_scene013.mp4": "汤姆猫坐在窗边，双手托腮，面带微笑地看着窗外。杰瑞鼠从窗户下方探出头来，向汤姆猫打招呼，汤姆猫开心地回应，随后杰瑞鼠转身跑开。",
    "23. Springtime for Thomas_scene014.mp4": "一只戴着红色太阳镜的白色猫坐在黄色躺椅上，正在阅读一本名为《HAR-PUSS BAZAAR》的书。背景是一个绿意盎然的花园，有黄色遮阳伞、房屋和远处的树木。镜头逐渐推近，聚焦于猫咪和书本。",
    "23. Springtime for Thomas_scene015.mp4": "一只戴着红色太阳镜的白色猫咪，穿着蓝色披风，躺在黄色的躺椅上阅读一本名为“HAR-PUSS BAZAAR”的杂志。背景是户外花园，旁边有一张小桌，桌上放着一杯饮料和一个礼物盒。猫咪不时翻动书页，神情专注。",
    "23. Springtime for Thomas_scene016.mp4": "一只灰色的猫汤姆趴在窗台上，眼睛闪烁着爱意，注视着一只棕色的小老鼠杰瑞。杰瑞站在门口，显得有些紧张。汤姆伸出爪子，轻轻抓住杰瑞，然后亲吻了它。杰瑞被吓了一跳，从汤姆的爪子中滑落，滚到了窗台下方。汤姆显得非常惊讶和失望，他张大嘴巴，举起双手，似乎在表达自己的困惑和沮丧。杰瑞则躺在窗台下，看起来有些无奈。",
    "23. Springtime for Thomas_scene017.mp4": "一只戴着红色太阳镜、系着蓝色蝴蝶结的白色猫咪，悠闲地坐在黄色沙发上，手中拿着一本名为“Hair-Puss Bazaar”的书。她先是阅读，随后摘下太阳镜，露出黄色的眼睛，嘴角带着微笑，似乎在享受阳光和宁静的时光。背景是蓝天和绿色植物，营造出一种轻松惬意的氛围。",
    "23. Springtime for Thomas_scene018.mp4": "一只白猫躺在黄色躺椅上，手里拿着粉色手帕，随后将手帕抛向空中。一只灰猫从右侧跑来，伸手抓住手帕，白猫伸手试图拿回手帕，灰猫则笑着展示手帕。",
    "23. Springtime for Thomas_scene019.mp4": "一只白猫坐在黄色沙发上，戴着蓝色蝴蝶结，手里拿着一块粉色布料。她先是闭着眼睛微笑，然后睁开眼睛，将布料放在手掌上，轻轻吹了一口气，布料变成了一颗红色的心形，随后心形飘向右侧的绿色植物。",
    "23. Springtime for Thomas_scene020.mp4": "一只灰色的猫坐在户外，看着天空中飞过的一颗红色心形物体。心形物体飞近后，猫张开嘴，似乎想接住它，但心形物体却突然变成了一支箭，射入猫的嘴中。猫的表情变得痛苦，它开始流口水，并试图用手抓住那颗心。最终，猫成功地将心形物体从嘴里取出，紧紧抱住它，脸上露出幸福的笑容。",
    "23. Springtime for Thomas_scene021.mp4": "一只灰色的猫仰望天空，表情陶醉。一个小天使从天而降，手持一个装满爱心的锤子，砸向猫的头部。猫的眼睛变成黄色，上面写着“LOVE”，舌头伸出，上面也布满了爱心图案，显得非常痴迷和幸福。",
    "23. Springtime for Thomas_scene022.mp4": "一只棕色的小老鼠站在墙边，表情紧张，似乎在躲避什么。突然，一个绿色的小恶魔从烟雾中出现，站在小老鼠旁边，表情愤怒，似乎在责备或威胁小老鼠。小恶魔用夸张的动作和表情与小老鼠对话，小老鼠则显得有些无奈和害怕。对话内容涉及“那个女人”和“汤姆”，暗示小恶魔在警告小老鼠不要被女人影响与汤姆的友谊。整个场景充满了卡通式的夸张和幽默感。",
    "23. Springtime for Thomas_scene023.mp4": "在户外的阳台上，一只灰猫汤姆坐在黄色沙发上，兴奋地盯着一只白猫。白猫正从一个装满巧克力的盒子里拿出一块巧克力，然后扔向汤姆。汤姆张大嘴巴试图接住，但巧克力飞过他的头顶。汤姆随后做出夸张的反应，先是惊讶地张大嘴巴，然后开始疯狂地摇晃身体，做出各种滑稽的动作，最后他恢复平静，露出得意的笑容。白猫则在一旁看着汤姆的表演，似乎对他的反应感到有趣。",
    "23. Springtime for Thomas_scene025.mp4": "一只黑猫坐在垃圾桶里，手里拿着一封信。它先是好奇地盯着信，然后兴奋地读信，最后开心地大笑并指向远方，似乎收到了什么好消息。",
    "23. Springtime for Thomas_scene026.mp4": "一只黑猫从垃圾桶里拿出一张纸，仔细阅读，纸上写着“致我的梦中情人”。",
    "23. Springtime for Thomas_scene027.mp4": "视频中展示了一张粉色的信纸，上面用黑色墨水写着一封情书。信的内容是：“亲爱的梦中情人——我一直很仰慕你的身材。三点一起喝杯茶吧。深深仰慕你的，托德尔斯。”信纸被一双毛茸茸的手拿着，背景是模糊的绿色墙壁。视频中还配有中文字幕，逐句显示信件内容。",
    "23. Springtime for Thomas_scene028.mp4": "一只黑猫在垃圾箱旁发现了一张纸条，上面写着“仰慕你的，托尔斯”。它兴奋地读着，随后从垃圾箱里掏出一根鱼骨头，开心地跳了起来。",
    "23. Springtime for Thomas_scene029.mp4": "一只黑猫在木箱旁，先是拿着鱼骨，接着用剪刀剪东西，然后用绿色瓶子喷出白色泡沫，最后兴奋地跳舞并扔掉一张纸。",
    "23. Springtime for Thomas_scene030.mp4": "一只黑色的猫从门后跳出，手里拿着一张纸，它看着纸上的内容，然后高兴地跳起来，纸张在空中飘动，猫继续跳跃并跑出画面。",
    "23. Springtime for Thomas_scene031.mp4": "一只棕色老鼠从柱子后面跑出来，它停在柱子前，张开双臂，似乎在欢呼。突然，一个绿色的小恶魔从它头顶冒出，骑在老鼠的头上，老鼠继续保持着张开双臂的姿势。背景是黄色的栏杆和绿色的树木。",
    "23. Springtime for Thomas_scene032.mp4": "在户外的黄色沙发上，一只灰色的猫（汤姆）正与一只穿着蓝色衣服的白色猫（杰瑞）互动，汤姆咬住杰瑞伸出的爪子，表情兴奋。随后，一只黑色的猫从后方出现，靠近汤姆和杰瑞，汤姆继续咬着杰瑞的爪子，而杰瑞则保持放松的姿态。背景中有绿色的草地、围墙和红色的遮阳伞。",
    "23. Springtime for Thomas_scene033.mp4": "画面中，灰色的汤姆猫正与一只黑色的猫和一只白色的猫互动。汤姆猫靠近黑色猫，似乎在争抢或玩耍，而白色猫则坐在一旁，面带微笑，看起来很享受这个场景。背景是户外的草地和一些模糊的建筑物。",
    "23. Springtime for Thomas_scene034.mp4": "在户外的阳台上，三只猫正在互动。一只灰色的猫（汤姆）一开始站在沙发旁，表情愤怒，似乎在与另外两只猫（一只黑猫和一只白猫）争执。黑猫手持一个类似雪茄的物品，显得得意洋洋。白猫则躺在沙发上，神情悠闲。随着情节发展，汤姆逐渐靠近黑猫，黑猫继续吹着雪茄，烟雾缭绕。汤姆的表情从愤怒转为惊讶，最后变得有些无奈和困惑。白猫则一直保持轻松的姿态，偶尔对黑猫微笑。整个场景充满幽默和戏剧性，背景是晴朗的户外环境，有遮阳伞和小桌。",
    "23. Springtime for Thomas_scene035.mp4": "在一片绿草如茵的庭院中，摆放着几件槌球游戏的器材。一只灰猫（汤姆）出现，他拿起槌球棒，准备击打球。然而，他突然发现另外两只猫——一只黑猫和一只白猫——正躺在黄色的躺椅上享受阳光。黑猫嘴里叼着一个瓶子，白猫则戴着蓝色围巾，显得非常悠闲。汤姆愤怒地挥动球棒，却意外地将球棒砸向黑猫，导致黑猫和白猫惊慌失措。黑猫大笑，白猫则露出惊讶的表情。黑猫对白猫说：“等一下，可爱的人儿。”整个场景充满了幽默和戏剧性的张力。",
    "23. Springtime for Thomas_scene036.mp4": "在户外的花园里，三只猫正在享受休闲时光。一只灰色的猫拿着一根黄色的棍子，另一只黑色的猫叼着雪茄，躺在黄色的沙发上。一只白色的猫则躺在沙发上，戴着蓝色的围巾。突然，黑色的猫开始向灰色的猫踢腿，灰色的猫被踢得向后倒去，白色猫也跟着倒下。随后，黑色的猫抓住灰色的猫的尾巴，两人开始拖拽着跑动，白色的猫则在旁边看着。背景中可以看到红色的遮阳伞、绿色的草地和树木。",
    "23. Springtime for Thomas_scene037.mp4": "一只黑猫在游泳池边奔跑，另一只灰猫从后面追来。黑猫试图跳入水中，但灰猫撞到了它，导致黑猫被水花溅湿。黑猫继续奔跑，灰猫消失在画面中。",
    "23. Springtime for Thomas_scene038.mp4": "一只猫从游泳池中冒出头来，浑身湿透，表情愤怒。",
    "23. Springtime for Thomas_scene039.mp4": "一只黑猫躺在黄色沙发上弹奏吉他，旁边坐着一只白猫。黑猫一边弹吉他一边唱歌，歌词是“你真的爱我的话，我也会像你爱我一样地爱你，与你一起一切都有可能”。白猫静静聆听，表情从平静到微笑，最后被黑猫拉住手，显得有些害羞和感动。背景是户外，有树木和石墙。",
    "23. Springtime for Thomas_scene040.mp4": "在户外的草地上，汤姆猫从黄色的长椅后面探出头，表情愤怒，随后站起身，用力推动长椅。长椅上躺着一只黑色的猫。汤姆猫推动长椅时，镜头跟随移动，最终长椅移出画面，露出坐在红色垫子上的白色猫咪，她戴着蓝色蝴蝶结，面带微笑。背景是石墙和绿树。",
    "23. Springtime for Thomas_scene041.mp4": "汤姆拉着一个装有黑猫的黄色带轮子的床，黑猫在床上传奏小提琴，汤姆被拉得越来越远，最后几乎被拉到池边。",
    "23. Springtime for Thomas_scene042.mp4": "一只黑猫从跳板上跳入游泳池，溅起水花后在水中游泳，最后潜入水底。",
    "23. Springtime for Thomas_scene043.mp4": "动画片中，汤姆猫从游泳池里挣扎着爬出来，浑身湿透，表情痛苦，水珠从他身上滴落。",
    "23. Springtime for Thomas_scene044.mp4": "一只黑猫在草地上玩槌球游戏，它拿起球槌，用力挥动，击打球，球飞向球门。",
    "23. Springtime for Thomas_scene045.mp4": "汤姆猫正在喝粉色的饮料，突然一个红白相间的球从天而降，击中了他的脸，导致他表情痛苦并被弹飞。",
    "23. Springtime for Thomas_scene046.mp4": "在一片绿草如茵的庭院中，一只灰色的猫（汤姆）躺在地上，手里拿着一个装满粉色液体的玻璃管，液体不断冒出气泡。突然，一只黑色的猫（杰瑞）拿着一根黄色的槌球棒出现，他先是用棒子轻轻敲击汤姆的玻璃管，导致液体飞溅，然后他用槌球棒击打汤姆手中的球，球滚到了汤姆的脸上。杰瑞显得非常得意，而汤姆则一脸无奈。背景中可以看到一些庭院设施和绿植。",
    "23. Springtime for Thomas_scene048.mp4": "一只被绑住的猫躺在草地上，表情痛苦，身体被绳子紧紧缠绕，背景是树木和围墙。",
    "23. Springtime for Thomas_scene050.mp4": "动画片段中，汤姆猫被绑在烧烤架上，身体被固定在烤架的金属杆上，下方是燃烧的火焰。汤姆猫表情痛苦，张大嘴巴，似乎在尖叫。随后，汤姆猫的表情从痛苦变为惊讶，然后又变为愤怒，眼睛瞪大，嘴巴张开。接着，汤姆猫开始左右摇晃身体，试图挣脱束缚。最后，汤姆猫的表情变得平静，眼睛半闭，似乎在忍受痛苦。背景是一个户外的烧烤架，周围有砖墙和白色的栅栏，远处是绿色的草地和树木。",
    "23. Springtime for Thomas_scene051.mp4": "一只白猫坐在床上，用黄色小花装饰黑猫的头，黑猫开心大笑。镜头下移，床下两只老鼠拿着绳子跑过，一只老鼠挥舞着红球，另一只老鼠紧随其后。",
    "23. Springtime for Thomas_scene052.mp4": "一只棕色老鼠抓住一条金色链条，被吊在半空中。一只绿色的猫手持长剑，试图刺向老鼠，但老鼠巧妙地用链条缠住剑尖，使猫失去平衡。猫最终被甩开，老鼠则得意地悬挂在空中。",
    "23. Springtime for Thomas_scene053.mp4": "视频中，一只白猫和一只黑猫坐在床上，白猫手持花朵，黑猫戴着花环，两人交谈。突然，黑猫被一股力量吹走，白猫惊慌失措。随后，灰猫出现，手持火柴，与黑猫对峙，黑猫愤怒地与灰猫对峙，最后灰猫用旋风将黑猫吹走。",
    "23. Springtime for Thomas_scene054.mp4": "在花园里，汤姆追逐着杰瑞，撞上了雕像，雕像的盘子掉下来砸在杰瑞头上，杰瑞坐在地上，汤姆飞走。",
    "23. Springtime for Thomas_scene055.mp4": "汤姆猫在红色的梯子上攀爬，突然被另一只黑猫从下方拉住，黑猫也奋力向上攀爬，最终汤姆猫被黑猫拉下梯子。",
    "23. Springtime for Thomas_scene056.mp4": "汤姆猫从一个黄色的滑梯上滑下，随后在空中翻转，变成了一只黑色的猫，继续在空中翻转。",
    "23. Springtime for Thomas_scene057.mp4": "汤姆猫从空中跳入游泳池，溅起水花后爬上池边，随后倒挂下去喝水。",
    "23. Springtime for Thomas_scene058.mp4": "一个穿着黑色衣服的卡通角色从空中坠入一个瓷砖池中，池水溅起，角色倒立在池底，身体扭曲，表情夸张。",
    "23. Springtime for Thomas_scene059.mp4": "汤姆猫在花园里追逐一个黄色的物体，它跑过草坪，经过一把遮阳伞，然后撞到一棵树，接着抓住一个黄色的滑梯，用滑梯拖着一盆红花，最后被红花绊倒并飞出去。",
    "23. Springtime for Thomas_scene061.mp4": "一只黑猫从树上摔下来，落在地上，身上沾满了泥土。它挣扎着站起来，发现头上顶着一朵红花，于是用力甩掉花和泥土，最终成功地把花和泥土甩开，站直了身子。",
    "23. Springtime for Thomas_scene062.mp4": "汤姆猫在草地上奔跑，突然被一根绳子绊倒，接着被吊在秋千上荡起，最终飞出画面。",
    "23. Springtime for Thomas_scene063.mp4": "一只灰色的猫正用嘴咬住一个黄色的箱子，箱子挂在两根绳子上，猫在空中被吊着，表情痛苦，嘴巴张开，似乎在大声叫喊。背景是蓝天和一些绿色的树叶。",
    "23. Springtime for Thomas_scene064.mp4": "一只黑猫在户外草地上，兴奋地跳着舞，然后拿起一把吉他，开始弹奏并随着音乐摇摆。背景中有树木、灌木和一把红色遮阳伞。",
    "23. Springtime for Thomas_scene065.mp4": "汤姆猫坐在黄色的秋千上，双手紧握绳索，面带笑容，开心地荡秋千。背景是蓝天和绿树。",
    "23. Springtime for Thomas_scene066.mp4": "一只黑猫在草地上，用脚踢起一个红色枕头，然后用脚踩着枕头，双手举着一把吉他，身体扭动，做出弹奏吉他的动作。背景是绿色的草地和一棵大树。",
    "23. Springtime for Thomas_scene068.mp4": "一只黑猫从树上跳下，手里拿着一把扫帚，落在一个红色的枕头上，然后开心地躺在地上。",
    "23. Springtime for Thomas_scene069.mp4": "一只棕色的小老鼠在有柱子和绿植的庭院中欢快地跳跃奔跑，随后消失在画面右侧。",
    "23. Springtime for Thomas_scene070.mp4": "杰瑞从树下跑过，经过一个柱子，然后撞上了黄色的栅栏。杰瑞被撞得飞了起来，然后摔倒在地。汤姆躺在地上，看起来很痛苦，然后他爬起来，愤怒地朝栅栏跑去，试图抓住杰瑞。",
    "23. Springtime for Thomas_scene071.mp4": "一只灰色的猫被关在笼子里，它愤怒地抓挠笼子，然后转过身来，用爪子拍打自己的胸膛，显得非常生气和沮丧。随后，它又转回身去，继续抓挠笼子，表情愤怒。最后，它停下动作，看起来有些无奈和沮丧。",
    "23. Springtime for Thomas_scene072.mp4": "一只棕色的小老鼠站在地上，先是低头，然后抬头张开双臂，露出开心的表情。",
    "23. Springtime for Thomas_scene073.mp4": "在户外的阳台上，汤姆猫和杰瑞鼠正在互动。汤姆猫一开始摆出夸张的姿势，似乎在和杰瑞鼠玩耍或进行某种表演。杰瑞鼠则显得非常兴奋和开心，伸出手臂与汤姆猫互动。随后，汤姆猫突然做出一个滑稽的摔倒动作，而杰瑞鼠则继续兴奋地跳跃和奔跑。汤姆猫随后站起来，继续追逐杰瑞鼠，但杰瑞鼠迅速跑向远处，最终消失在画面中，只留下汤姆猫独自在阳台上。整个场景充满了欢乐和幽默的氛围。",
    "23. Springtime for Thomas_scene074.mp4": "一只老鼠从柱子后面跑出来，沿着街道奔跑。一只猫从柱子后面跳出来，追赶老鼠。猫在追逐过程中，从街道跑到有栅栏和玫瑰花丛的地方，最后停下来，看着玫瑰花。",
    "23. Springtime for Thomas_scene075.mp4": "一只戴着蓝色蝴蝶结的棕色小猫坐在白色围栏上，另一只棕色小猫站在围栏下，抬头看着她，表情从惊讶变为开心，然后又变回惊讶。背景是绿色的草地和树木，两侧有粉色玫瑰花。",
    "23. Springtime for Thomas_scene076.mp4": "一只戴着蓝色蝴蝶结的卡通老鼠坐在户外，她用嘴唇在手掌上吹出一个红色的小圆点，然后将这个小圆点吹向空中。",
    "23. Springtime for Thomas_scene077.mp4": "一只棕色的小老鼠站在草地上，靠近白色栅栏和绿色植物。它先是抬头看着空中飘落的一片红色叶子，然后用嘴接住叶子，接着开心地跳跃并拍手庆祝。最后，它靠在栅栏上，双手交叉，露出满足的笑容。",
    "23. Springtime for Thomas_scene079.mp4": "视频开始时显示一个红色的心形图案，上面写着“AN M.G.M. TOM and JERRY CARTOON”，随后画面转为全黑，持续一段时间。"
}