{
    "27. Cat Fishin'_scene001.mp4": "视频开始时显示一个黑色背景，右下角有白色数字“0110544170204083”。随后画面逐渐变亮，出现一个蓝色背景，中央是“CARTOON”字样，上方有“A METRO-GOLDWYN-MAYER”字样，下方有“COLOR BY TECHNICOLOR”字样，整体呈现出经典的卡通片头风格。",
    "27. Cat Fishin'_scene002.mp4": "这是一个米高梅动画片头，蓝色背景上有一个咆哮的狮子，狮子下方写着“A METRO-GOLDWYN-MAYER CARTOON”，再下方是“COLOR BY TECHNICOLOR”。狮子在片头中不断咆哮，画面最后逐渐变暗。",
    "27. Cat Fishin'_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头。首先出现的是米高梅卡通的标志，随后画面转黑，接着是“Tom and Jerry”的标题，伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "27. Cat Fishin'_scene004.mp4": "这是一个《猫和老鼠》动画片头，画面中显示了主角汤姆猫和杰瑞鼠的卡通形象，背景为蓝色，文字“Tom and Jerry”以黄色字体呈现。随后画面切换，出现“CAT FISHIN'”字样，背景变为水下场景，有气泡和水波纹，同时显示制作人William Hanna和Joseph Barbera的名字。",
    "27. Cat Fishin'_scene005.mp4": "这是一个动画片《猫和老鼠》的片头画面，标题为“CAT FISHIN'”，由William Hanna和Joseph Barbera执导。画面背景是水下场景，有气泡和水草，左侧有一条黑色的鱼游动，上方有一个鱼钩。画面下方有中文字幕“猫咪钓鱼”。随着画面推进，出现了制作人员名单和版权信息。",
    "27. Cat Fishin'_scene006.mp4": "视频开始展示了一段动画片的片头字幕，包括动画师、音乐制作人和制片人等信息。随后画面逐渐变暗，最后切换到一个宁静的湖边景色，树木环绕，湖面上有一艘小船停靠在码头旁。",
    "27. Cat Fishin'_scene008.mp4": "视频中，一只灰色的猫（汤姆）正试图用工具打开一个红色的箱子，而一只戴着带刺项圈的灰色斗牛犬躺在地上，看起来很生气。猫在努力打开箱子的过程中，斗牛犬不断试图攻击猫，但猫用工具和箱子保护自己。猫最终成功打开了箱子，斗牛犬则被吓退。整个场景发生在户外，背景有砖墙和铁丝网。",
    "27. Cat Fishin'_scene009.mp4": "一只灰色的斗牛犬躺在草地上，戴着红色项圈，正享受着一只大骨头。它先是开心地舔着骨头，然后张大嘴巴，露出牙齿，似乎在享受美味。突然，它被骨头吸引，猛地咬住骨头，但骨头却突然消失，它显得非常惊讶和困惑。",
    "27. Cat Fishin'_scene010.mp4": "汤姆猫拿着钓鱼竿和红色盒子，试图钓住一只灰色的斗牛犬。斗牛犬一开始愤怒地扑向汤姆，但随后变得放松并躺下。汤姆猫爬上砖墙，继续用钓鱼竿逗弄斗牛犬，最终斗牛犬被钓起并被拉走。",
    "27. Cat Fishin'_scene011.mp4": "一只灰色的斗牛犬戴着红色项圈，躺在草地上，被一根绳子牵引着。绳子的末端是一个钩子，钩子在空中晃动，逐渐靠近狗的头部，最终钩住了项圈。狗的表情从放松变为警觉，眼睛睁大，似乎对钩子的靠近感到惊讶或不安。背景是绿色的草地和树木，营造出宁静的户外环境。",
    "27. Cat Fishin'_scene012.mp4": "汤姆拿着钓鱼竿和红色盒子在草地上奔跑，钓线的另一端连接着躺在地上的杰瑞。杰瑞戴着红色帽子，被钓线拉扯着，身体逐渐被拖向画面右侧。背景是绿树成荫的户外场景。",
    "27. Cat Fishin'_scene013.mp4": "汤姆拿着钓鱼竿和红色的工具箱，站在悬崖边钓鱼。他钓到了一只戴着红色头巾的灰色大狗，大狗被钓线拉得悬在半空中，悬在悬崖边缘。",
    "27. Cat Fishin'_scene014.mp4": "汤姆猫在森林里拿着鱼竿和红色箱子钓鱼，突然箱子掉落，他惊慌失措地跳起并张大嘴巴，显得非常惊讶和害怕。",
    "27. Cat Fishin'_scene015.mp4": "在户外的草地上，一只灰色的狗正趴在树桩上，一只黑色的猫从狗的下方出现，猫用爪子抓住狗的脖子，然后用一根树枝挑起狗的下巴，狗被挑起后，猫露出得意的笑容。",
    "27. Cat Fishin'_scene016.mp4": "汤姆猫来到湖边的木码头上，他背着一个红色的工具箱，手持一根钓鱼竿，准备钓鱼。他先是兴奋地跳上码头，然后坐下来打开工具箱，似乎在检查或准备钓鱼的装备。背景是宁静的湖面和远处的树林，营造出一种悠闲的氛围。",
    "27. Cat Fishin'_scene017.mp4": "视频展示了一个卡通场景，其中一只老鼠在钓鱼箱里睡觉，被猫的手轻轻拍醒。醒来后，老鼠迅速穿上衣服，整理装备，准备钓鱼。背景是宁静的湖边景色，钓鱼箱内有各种钓鱼用具。",
    "27. Cat Fishin'_scene018.mp4": "汤姆猫拿着鱼竿钓鱼，钓到了杰瑞鼠。杰瑞鼠被钓线吊在空中，汤姆猫得意地笑着。",
    "27. Cat Fishin'_scene019.mp4": "汤姆猫站在屋顶上，手持钓鱼竿，钓起了一只穿着红色衣服的老鼠杰瑞。汤姆兴奋地将杰瑞拉近，但杰瑞奋力挣扎，汤姆则用力拉扯钓鱼竿，试图将杰瑞拉回。",
    "27. Cat Fishin'_scene020.mp4": "在湖边，一只穿着泳衣的小猫正被一根绳子吊着，从空中缓缓下降，最终落入水中，激起一圈圈涟漪。背景是粉黄色的天空和远处的树木。",
    "27. Cat Fishin'_scene021.mp4": "汤姆猫手持钓鱼竿，专注地钓鱼，鱼线突然绷紧，他用力拉扯，表情从期待变为吃力。",
    "27. Cat Fishin'_scene022.mp4": "汤姆猫从屋顶跳下，用爪子抓住一个红色的箱子，然后用力将箱子打开。",
    "27. Cat Fishin'_scene023.mp4": "一只猫躺在绿色毯子上，面前摆放着钓鱼用具。它先是露出凶狠的表情，随后拿起一个彩色的鱼饵，面露得意之色。背景中可以看到“FLIES”和“LIVE BAIT”的标识。",
    "27. Cat Fishin'_scene024.mp4": "汤姆猫坐在屋顶上，用爪子抓着杰瑞鼠的尾巴，把杰瑞吊在空中。汤姆猫先是愤怒地瞪着杰瑞，随后露出得意的笑容，享受着胜利的喜悦。",
    "27. Cat Fishin'_scene025.mp4": "汤姆猫站在码头上钓鱼，他把杰瑞绑在鱼竿上，然后钓起了一大群鱼，鱼群把杰瑞裹在中间，溅起水花。",
    "27. Cat Fishin'_scene026.mp4": "一只棕色的小老鼠被吊在空中，周围有几条绿色的鱼在追逐它。小老鼠努力抓住绳子，试图逃脱，而鱼则张开大嘴试图咬住它。整个场景充满了紧张和动感。",
    "27. Cat Fishin'_scene027.mp4": "汤姆猫在码头上钓鱼，突然钓到了杰瑞鼠，他兴奋地拉扯鱼竿，杰瑞鼠被拉得在空中飞舞，汤姆猫则显得非常得意和开心。",
    "27. Cat Fishin'_scene028.mp4": "一只鳄鱼从水中突然跃出，张开大嘴，试图捕捉一只正在水面上滑行的老鼠。老鼠敏捷地躲避，鳄鱼在空中翻滚，最终落入水中，老鼠则继续在水面上快速滑行，鳄鱼在后面紧追不舍。",
    "27. Cat Fishin'_scene029.mp4": "一只棕色的小动物被钓线拉起，突然一条巨大的鳄鱼从水中跃出，张开大嘴试图咬住小动物，小动物在空中惊慌失措地挣扎。",
    "27. Cat Fishin'_scene030.mp4": "一只小老鼠骑在一根绳子上，绳子的另一端连接着一个巨大的绿色鲨鱼。鲨鱼张开大嘴，试图咬住小老鼠，但小老鼠灵活地在绳子上奔跑，躲避鲨鱼的攻击。鲨鱼的牙齿咬断了绳子，碎片四散飞溅，小老鼠继续在绳子上奔跑。背景是粉红色和黄色的天空，下方有绿色的树木。",
    "27. Cat Fishin'_scene031.mp4": "汤姆拿着钓鱼竿，钓到一条巨大的鱼，鱼被拉上来后，汤姆发现鱼是绿色的，鱼张开大嘴，露出尖牙，汤姆被鱼吓到，鱼甩动身体，汤姆被甩到一边，鱼游走了，汤姆一脸惊恐。",
    "27. Cat Fishin'_scene032.mp4": "一只绿色的鳄鱼从水中冒出头，站在木制码头上，它先是甩掉身上的水，然后拿起一个蓝色的鱼竿，用力甩出，接着它兴奋地扭动身体，似乎在庆祝。背景是宁静的湖面和远处的树木。",
    "27. Cat Fishin'_scene033.mp4": "汤姆猫在屋顶上被一个飞来的物体击中后摔倒，随后他从烟囱里拿出一个橙色的布偶，用剪刀剪掉布偶的脚，然后将杰瑞老鼠放进布偶里，用线拉扯布偶，使杰瑞在布偶里挣扎。",
    "27. Cat Fishin'_scene034.mp4": "汤姆猫在木制码头上钓鱼，他钓到一只橙色的小老鼠，兴奋地挥舞着鱼竿，将小老鼠高高举起，随后用力拉扯鱼竿，试图将小老鼠拉回岸边。背景是宁静的湖面和绿树成荫的岸边。",
    "27. Cat Fishin'_scene035.mp4": "一只鳄鱼从水中冒出，系上围裙，端着餐盘准备用餐。一只松鼠从天而降，被鳄鱼用叉子叉住，最终被鳄鱼吃掉。",
    "27. Cat Fishin'_scene036.mp4": "一只穿着围裙的鳄鱼用叉子叉住一只老鼠，老鼠被叉子挑起后挣扎，最后被甩到柠檬片上。鳄鱼看着空盘子，老鼠从柠檬片后探出头来，张开双臂。",
    "27. Cat Fishin'_scene037.mp4": "一只穿着围裙的鳄鱼正在吃东西，突然被一只老鼠用柠檬汁喷到脸上，鳄鱼愤怒地追击老鼠，老鼠逃到柠檬片上，鳄鱼最终只能看着老鼠逃走。",
    "27. Cat Fishin'_scene038.mp4": "一只棕色的小动物在水中游泳，突然一条大鱼从水中跳出，张开大嘴向小动物扑去。小动物惊慌失措，拼命挣扎，最终被大鱼吞下。画面中水花四溅，场景紧张刺激。",
    "27. Cat Fishin'_scene039.mp4": "汤姆在码头钓鱼，他用船桨试图钓起水中的杰瑞，结果船桨掉进水里，汤姆也跟着掉进水里。杰瑞从水里冒出来，看到汤姆后，他开心地跑向汤姆，用船桨把汤姆打湿。",
    "27. Cat Fishin'_scene040.mp4": "一只黑色的猫从水中突然冒出，溅起水花，然后爬上木制码头，坐在上面，水珠从它身上滴落。",
    "27. Cat Fishin'_scene041.mp4": "一只老鼠从篮子里探出头，然后拿着一个红绿相间的玩具在木制平台上奔跑。它跑向猫的尾巴，试图抓住它。猫的尾巴被玩具吸引，猫被拉得向下，最终落入水中。水里有一只鳄鱼，它张开大嘴，试图抓住玩具。老鼠在平台上看着这一切。",
    "27. Cat Fishin'_scene042.mp4": "汤姆猫在码头上被一个黄色的桶绊倒，摔倒在水里。他挣扎着爬回码头，但尾巴被水中的鳄鱼咬住。鳄鱼张开大嘴，露出尖牙，紧紧咬住汤姆的尾巴，汤姆惊恐万分。",
    "27. Cat Fishin'_scene043.mp4": "汤姆猫从码头边缘滑落，落入水中，随后溅起水花，最终在码头上惊慌失措地爬起。",
    "27. Cat Fishin'_scene044.mp4": "一只蓝绿色的卡通海豚在粉黄色的天空背景下翻滚跳跃，下方是绿色的树木。海豚表情夸张，似乎在玩耍或表演特技。",
    "27. Cat Fishin'_scene045.mp4": "一只灰色的斗牛犬趴在悬崖边上，用前爪抓着一根细长的树枝，张大嘴巴似乎在打哈欠。突然，一条绿色的鱼从左侧飞来，撞进斗牛犬的嘴里，斗牛犬被吓了一跳，身体向后仰去，但仍然紧紧抓住树枝。鱼在斗牛犬嘴里挣扎，斗牛犬则试图把鱼吐出来，但鱼紧紧咬住斗牛犬的舌头，斗牛犬痛苦地扭动身体，最终鱼从斗牛犬嘴里飞出，斗牛犬也从悬崖边跌落下去。",
    "27. Cat Fishin'_scene046.mp4": "一只绿色的鱼和一只灰色的狗在树下对峙，鱼试图攻击狗，但狗用尾巴挡住鱼的攻击，鱼被击退后消失，狗则继续用尾巴摆动。",
    "27. Cat Fishin'_scene047.mp4": "一只灰色的斗牛犬在户外，它从树桩上跳下，咬住一根树枝，树枝断裂，它摔倒在地。它挣扎着站起来，看起来很生气，然后开始在地上打滚，最后站直身体，愤怒地咆哮。",
    "27. Cat Fishin'_scene048.mp4": "在码头上，汤姆猫看到杰瑞鼠从水中冲上来，杰瑞鼠摔倒在码头上，汤姆猫生气地用木板砸向杰瑞鼠，杰瑞鼠被砸进水中，汤姆猫也跟着跳进水中。",
    "27. Cat Fishin'_scene049.mp4": "在木制码头上，一只小老鼠正在拉着一根钓鱼线，突然一只大猫从天而降，抓住了小老鼠，然后迅速将小老鼠拉向自己，最后大猫带着小老鼠一起冲向画面右侧，消失在视野中。",
    "27. Cat Fishin'_scene050.mp4": "在河边的木制码头上，一只湿漉漉的灰色斗牛犬从水中冒出，表情愤怒。随后，一只拿着钓鱼竿的黑色猫（汤姆）跳上码头，与斗牛犬对峙。汤姆摆出攻击姿势，斗牛犬则愤怒地瞪着汤姆。",
    "27. Cat Fishin'_scene051.mp4": "在湖边的木制码头上，汤姆猫拿着钓鱼竿，怀里抱着杰瑞鼠。突然，一个巨大的灰色怪物从水中冲出，试图攻击汤姆。汤姆惊慌失措，但怪物被水花冲走，汤姆趁机跳入水中，带着杰瑞迅速逃离现场。",
    "27. Cat Fishin'_scene052.mp4": "汤姆猫在河边钓鱼，他用力拉扯鱼竿，但钓到的是一只小老鼠杰瑞，杰瑞紧紧抓着鱼竿不放，汤姆猫显得非常生气和无奈。",
    "27. Cat Fishin'_scene053.mp4": "一条鱼从水中跃起，随后又落回水中，激起水花。",
    "27. Cat Fishin'_scene054.mp4": "一只猫在河边钓鱼，钓到一只老鼠后，老鼠被拉出水面，猫用力拉扯鱼竿，老鼠在空中挣扎，猫的表情从兴奋变为用力，最后猫成功将老鼠拉到岸边。",
    "27. Cat Fishin'_scene055.mp4": "视频开始时，一只棕色的小动物从空中坠入水中，激起水花，随后水面泛起涟漪。镜头向左移动，展示湖边的树木和岩石，接着出现一个木制码头，一只灰色的斗牛犬趴在码头上，表情悠闲。此时，一只小老鼠从水中冒出头来，它在水里游动，然后爬上码头，靠近斗牛犬。斗牛犬保持不动，似乎对小老鼠的出现无动于衷。",
    "27. Cat Fishin'_scene056.mp4": "一只老鼠从水中跳上木板，用绳子缠住一只躺着的猫的腿，然后拉扯绳子，试图逃脱。",
    "27. Cat Fishin'_scene057.mp4": "汤姆猫在河边钓鱼，他用力拉扯鱼竿，表情从专注变为兴奋，最终被鱼线拉得身体后仰，几乎失去平衡。",
    "27. Cat Fishin'_scene058.mp4": "一只灰色的狗躺在木制码头上，突然被水冲走，它在水中挣扎并试图抓住码头，最终被一根绳子拉回码头。",
    "27. Cat Fishin'_scene059.mp4": "汤姆在湖边钓鱼，他用力拉扯鱼竿，结果被鱼线拉入水中，挣扎着爬上岸。",
    "27. Cat Fishin'_scene060.mp4": "一只灰色的狗在木制码头上被一根绳子拉扯，它试图抓住码头边缘，但最终被拉入水中。狗在水中挣扎，木板从它头上掉落，最后狗完全被水淹没，只剩下木板漂浮在水面上。",
    "27. Cat Fishin'_scene061.mp4": "汤姆猫在河边钓鱼，他用力甩动鱼竿，鱼线在空中划出弧线，表情显得非常兴奋和期待。",
    "27. Cat Fishin'_scene062.mp4": "一只灰色的小狗在水中游泳，它游过水草和岩石，最终在两块岩石之间停下，露出水面，表情显得有些疲惫和紧张。",
    "27. Cat Fishin'_scene063.mp4": "一只灰色的狗从两块岩石后面探出头，表情紧张。它突然从岩石后冲出，跃入水中，溅起大片水花，随后消失在水里。",
    "27. Cat Fishin'_scene064.mp4": "汤姆猫在河边钓鱼，他用力拉扯鱼竿，表情兴奋，似乎钓到了大鱼。",
    "27. Cat Fishin'_scene065.mp4": "一只小老鼠背着一个巨大的红色物体，从画面左侧向右侧行走。它的前方出现了一只大猫的尾巴和爪子，小老鼠看到后显得有些紧张，但仍然继续前行。",
    "27. Cat Fishin'_scene066.mp4": "汤姆拿着鱼竿和棒球棒在河边钓鱼，杰瑞拿着棒球棒站在他旁边。汤姆突然用力拉鱼竿，结果被鱼线拖着向水中走去，他一边挣扎一边大笑。",
    "27. Cat Fishin'_scene067.mp4": "在湖边，汤姆拿着一根红色的棍子，奋力拉扯着一根绳子，绳子的另一端连接着一只狗。汤姆在水中挣扎，最终将狗拉到了岸边。狗戴着红色的项圈，看起来很生气。汤姆和狗在岸边对峙，汤姆显得得意洋洋，而狗则怒目圆睁。",
    "27. Cat Fishin'_scene068.mp4": "视频中，汤姆猫和一只戴着红色尖刺项圈的灰色斗牛犬对峙。汤姆猫先是用爪子拨弄斗牛犬头上的红色尖顶帽，然后举起一根红色的棍子，用力敲打斗牛犬的头。斗牛犬被激怒，捂住眼睛，愤怒地向汤姆猫扑去，但汤姆猫敏捷地跳起躲避，斗牛犬扑空后继续追赶。整个场景充满了紧张和喜剧效果。",
    "27. Cat Fishin'_scene069.mp4": "一只棕色的小老鼠坐在树杈上，手持一个红色的钓鱼竿，正在钓鱼。钓鱼竿的末端挂着一个红白相间的浮标，浮标下方连接着鱼钩。小老鼠专注地盯着浮标，似乎在等待鱼儿上钩。背景是淡黄色和粉色的天空，远处有几棵绿色的树木。",
    "27. Cat Fishin'_scene070.mp4": "画面展示了一幅宁静的湖边景色，右侧有一棵大树，远处是树木和湖水。随后，一个红白相间的浮标从空中缓缓落下，悬挂在画面中央。",
    "27. Cat Fishin'_scene071.mp4": "在一片绿意盎然的草地上，一只灰色的大狗和一只黑色的猫正在激烈追逐。大狗张开大嘴，露出尖锐的牙齿，凶猛地追赶着黑猫。黑猫则拼命逃跑，时而躲闪，时而被大狗追上。它们在草地上奔跑，经过树木和花朵，场面紧张刺激。最终，黑猫在躲避过程中撞到了树干，而大狗也紧随其后，两者都在全力奔跑和追逐。",
    "27. Cat Fishin'_scene072.mp4": "动画片段中，汤姆猫在河边钓鱼，突然被一条鳄鱼从水中拖走。汤姆猫惊慌失措，拼命挣扎，但鳄鱼紧紧咬住他，将他拖入水中。画面最后只剩下鳄鱼的背影和模糊的水面。",
    "27. Cat Fishin'_scene073.mp4": "杰瑞站在树上，用一个装置拉住汤姆，使汤姆悬挂在空中。随后，一只大狗出现，张开嘴露出尖牙，似乎要攻击汤姆。汤姆在空中挣扎，表情痛苦，而杰瑞则在树上看着这一切。",
    "27. Cat Fishin'_scene074.mp4": "一只小老鼠站在树杈上，手里拿着一根钓鱼竿，钓鱼竿的鱼线垂向下方。小老鼠表情兴奋，眼睛睁得大大的，嘴巴张开，似乎在期待钓到鱼。它时不时地转动鱼竿上的卷线器，调整鱼线的长度，显得非常专注和期待。背景是淡黄色的天空和一些绿色的树叶，营造出一种宁静的户外氛围。",
    "27. Cat Fishin'_scene075.mp4": "一只灰色的猫被吊在绳子上，一只棕色的小老鼠站在树上拉着绳子。一只灰色的大狗在下方张着嘴咆哮，试图阻止小老鼠。猫在绳子上晃动，表情痛苦。狗不断出现并咆哮，但小老鼠继续拉绳子。",
    "27. Cat Fishin'_scene076.mp4": "动画片《猫和老鼠》的结尾画面，汤姆被杰瑞用绳子吊在树上，杰瑞坐在树枝上，画面随后变黑，最后出现“The End”字样。",
    "27. Cat Fishin'_scene077.mp4": "视频显示了“THE END”的字样，随后逐渐显示出“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色，文字为蓝色和白色。",
    "27. Cat Fishin'_scene078.mp4": "视频显示了“MGM Tom and Jerry Cartoon”标题，表明这是米高梅公司制作的《猫和老鼠》动画片。标题下方标注“MADE IN HOLLYWOOD, U.S.A.”，说明该动画片是在美国好莱坞制作的。随后画面转为全黑，持续一段时间。"
}