{
    "E109.Tom's.Photo.Finish_scene002.mp4": "视频开始时显示了米高梅卡通的标志，背景为深蓝色，标志中央是一只咆哮的狮子，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。随后画面转黑，接着出现《猫和老鼠》的标题画面，左侧是猫汤姆的图案，右侧是老鼠杰瑞的图案，中间是“TOM and JERRY”的字样。",
    "E109.Tom's.Photo.Finish_scene003.mp4": "视频展示了《猫和老鼠》动画片的片头和制作人员名单。首先，屏幕中央显示“TOM and JERRY”的标志，两侧分别有猫汤姆和老鼠杰瑞的卡通形象。接着，画面切换到“TOM'S PHOTO FINISH”标题，背景为黄色，左侧有一个粉红色的摄影机图案。随后，画面显示制作人员名单，包括动画师、布局师、背景绘制师和音乐师等，最后是制片人和导演的名字：Joseph Barbera 和 William Hanna。整个画面风格经典，色彩鲜明，充满卡通特色。",
    "E109.Tom's.Photo.Finish_scene004.mp4": "画面从黑色渐变为一个昏暗的室内场景，可以看到楼梯、窗帘和一个花瓶。",
    "E109.Tom's.Photo.Finish_scene005.mp4": "汤姆猫从楼梯后偷看，然后悄悄走到客厅，发现主人在看报纸，他试图靠近但被主人发现，汤姆猫吓得迅速逃跑。",
    "E109.Tom's.Photo.Finish_scene007.mp4": "动画片中的猫汤姆站在黄色墙壁和木门旁，先是表情惊讶，随后皱眉、咬牙，最后露出得意的笑容。",
    "E109.Tom's.Photo.Finish_scene008.mp4": "一个穿着紫色西装的男人打开冰箱后离开，留下一只灰猫站在冰箱旁。猫先是好奇地观察冰箱，随后突然表现出极度的恐惧，张大嘴巴尖叫，身体后退，最终从冰箱前跑开。",
    "E109.Tom's.Photo.Finish_scene009.mp4": "汤姆猫进入房间，拿起墨水瓶倒出墨水在桌子上，然后用爪子蘸墨水，做出写字的动作，但墨水却溅到了他的爪子上，他惊讶地发现爪子变成了一个橙色的圆形物体，上面有眼睛和嘴巴，看起来像一个卡通角色。汤姆猫被这个变化吓了一跳，然后试图把爪子从桌子上拿开，但爪子似乎被墨水粘住了，他只好用另一只爪子去拉，结果爪子被拉得更远了，汤姆猫看起来非常困惑和无奈。",
    "E109.Tom's.Photo.Finish_scene010.mp4": "汤姆猫在厨房里追逐一个红色的球，他先是跳起来试图抓住球，然后发现球滚到了冰箱旁边，他继续追着球在地上爬行，同时在冰箱和地板上留下了黑色的爪印。",
    "E109.Tom's.Photo.Finish_scene011.mp4": "一只老鼠坐在茶杯里，正在阅读一本书。突然，它听到门外有脚步声，吓得扔下书，迅速跑向门口。",
    "E109.Tom's.Photo.Finish_scene012.mp4": "一只灰色的猫汤姆悄悄接近一只正在睡觉的棕色狗，试图用一个红色的球引诱它。狗没有反应，汤姆感到沮丧，随后他用一个烤鸡来吸引狗的注意。狗仍然不动，汤姆变得愤怒并用爪子拍打狗。突然，一只老鼠杰瑞出现，他拿着一个大喇叭，似乎在播放音乐或噪音。汤姆被吓到，迅速跑开，而杰瑞则继续他的活动，似乎在享受他的音乐。",
    "E109.Tom's.Photo.Finish_scene013.mp4": "一个穿着紫色西装的男人和一个穿着蓝色连衣裙的女人在厨房里，地板上有黑色的爪印。男人兴奋地指着爪印，女人则惊讶地看着。他们一起走向冰箱，女人扶着男人，两人表情惊讶。",
    "E109.Tom's.Photo.Finish_scene014.mp4": "一只棕色的卡通狗躺在绿色的圆形地毯上，戴着红色项圈，闭着眼睛似乎在睡觉。背景中有一张紫色的沙发。画面逐渐被一个圆形的视野框住，仿佛通过望远镜或镜头观察。",
    "E109.Tom's.Photo.Finish_scene015.mp4": "夜晚，一只戴着红色项圈的棕色斗牛犬从空中坠落，落地后迅速起身，表情愤怒，随后开始奔跑。背景是一栋亮着灯的房子和树木。",
    "E109.Tom's.Photo.Finish_scene016.mp4": "一只棕色的狗戴着红色项圈，从房子的窗户外面爬进屋内，它用前爪抓住窗台，身体悬空，专注地向屋内张望。",
    "E109.Tom's.Photo.Finish_scene017.mp4": "在厨房里，汤姆抱着一只烤鸡，杰瑞站在一旁，男人穿着紫色西装，戴着眼镜，他先张开双手，然后摸了摸汤姆的头，汤姆开心地笑着，随后男人又张开双手，汤姆也跟着张开双手，男人又摸了摸汤姆的头，汤姆继续开心地笑着。",
    "E109.Tom's.Photo.Finish_scene018.mp4": "一只戴着红色项圈的棕色斗牛犬正趴在窗户边，先是专注地向外张望，随后转头露出开心的笑容，接着表情变得惊讶。",
    "E109.Tom's.Photo.Finish_scene019.mp4": "一只戴着红色项圈的棕色斗牛犬站在窗边，表情惊讶。随后画面变暗，接着出现一个昏暗的房间，一盏台灯照亮了一个巨大的紫色茶杯和一个小凳子。",
    "E109.Tom's.Photo.Finish_scene020.mp4": "视频展示了一个动画场景，开始时画面中有一个紫色的茶杯和一盏台灯，随后镜头向左移动，出现了一台摄影机和一个标有“DARK ROOM”的蓝色门。门打开后，一只棕色的老鼠从门后探出头来，它拖着一叠厚厚的纸张，然后将纸张从叠中抽出一张，显得非常得意。整个场景充满了卡通风格的幽默感。",
    "E109.Tom's.Photo.Finish_scene021.mp4": "一个手拿着一张画有汤姆猫和杰瑞鼠的卡通画，画中汤姆猫正压在杰瑞鼠身上，杰瑞鼠躺在地毯上，汤姆猫则用爪子按住杰瑞鼠的脚。",
    "E109.Tom's.Photo.Finish_scene022.mp4": "汤姆躺在地上，杰瑞拿着一张白纸走到他面前，汤姆看到后露出惊讶的表情，随后杰瑞把纸拿走，汤姆显得很生气。",
    "E109.Tom's.Photo.Finish_scene023.mp4": "一只小老鼠站在桌子旁，手里拿着一张白纸，试图引起坐在沙发上看报纸的人的注意。小老鼠先是举起白纸，然后试图将白纸塞进报纸的缝隙中，但没有成功。接着，小老鼠跳起来，试图用白纸击打报纸，但仍然没有成功。最后，小老鼠被报纸挡住，只能无奈地跳到一边。",
    "E109.Tom's.Photo.Finish_scene024.mp4": "一只灰色的猫突然冲进房间，撞翻了坐在绿色扶手椅上读报纸的男子。猫把报纸撕得粉碎，然后兴奋地把纸片抛向空中，最后消失在画面左侧。男子先是惊讶，随后露出得意的笑容。",
    "E109.Tom's.Photo.Finish_scene025.mp4": "一位女士坐在紫色扶手椅上，手中拿着毛线针和黄色毛线，正在编织。她身旁的小桌上放着装有毛线球和剪刀的篮子。背景中有一个壁炉，壁炉旁堆放着木柴。女士时而抬头看向壁炉方向，时而低头专注编织，神情愉悦。",
    "E109.Tom's.Photo.Finish_scene026.mp4": "动画片中的汤姆猫站在黄色窗帘旁，表情从惊讶转为愤怒，张开嘴似乎在大声喊叫。背景中有一个橙色的抽屉柜，上面放着一个装有紫色花朵的花盆。",
    "E109.Tom's.Photo.Finish_scene027.mp4": "一只棕色老鼠从窗帘后探出头，手里拿着一张印有猫的图片，然后将图片扔进一个白色的碗里，接着迅速缩回窗帘后。",
    "E109.Tom's.Photo.Finish_scene028.mp4": "一位穿着蓝色连衣裙的女士坐在紫色扶手椅上，手中拿着一件黄色连衣裙。她站起身，将连衣裙挂在壁炉上方的架子上。突然，一只穿着黄色连衣裙的猫从连衣裙里跳出来，张开双臂，露出得意的笑容。女士惊讶地张开双臂，猫则开心地在她面前跳舞。",
    "E109.Tom's.Photo.Finish_scene029.mp4": "汤姆穿着黄色长袍，站在黄色墙壁前，墙上挂着三幅画。他先是挥舞双手，然后用力撕下画框，碎片四溅。接着，他脱下长袍，露出灰色身体，继续撕画。最后，他跑出画面，表情惊恐。",
    "E109.Tom's.Photo.Finish_scene030.mp4": "一只棕色的小老鼠站在红色的家具上，手里拿着一个蓝色的吹风机，正在对着吹风机吹气。背景是黄色的墙壁。",
    "E109.Tom's.Photo.Finish_scene031.mp4": "一个男人坐在椅子上读书，一只猫突然出现，用爪子蒙住男人的眼睛。男人被蒙住眼睛后，猫和他互动，男人显得很开心。最后，男人摘下眼镜，露出惊讶的表情。",
    "E109.Tom's.Photo.Finish_scene032.mp4": "一个男人从门后拉出一只猫，猫被拉得悬空，男人表情严肃地对猫说话。",
    "E109.Tom's.Photo.Finish_scene033.mp4": "一位女士正在厨房里用刀装饰一个巧克力蛋糕，旁边有一只老鼠在偷看。",
    "E109.Tom's.Photo.Finish_scene034.mp4": "一只小老鼠拿着一张有猫的图片，试图把图片贴在蛋糕上，但失败了，然后跑开了。",
    "E109.Tom's.Photo.Finish_scene035.mp4": "一位女士正在切蛋糕，猫突然出现并试图偷吃蛋糕，女士发现后用刀威胁猫，猫被吓到并躲进蛋糕里，女士继续切蛋糕，猫从蛋糕里探出头来，女士惊讶地看着猫。",
    "E109.Tom's.Photo.Finish_scene036.mp4": "一个房间内，物品如盘子、水桶和擀面杖等突然从空中掉落并破碎。随后，汤姆猫从右侧跑入，躲避掉落的物品，最终在房间中央停下，显得有些困惑和惊讶。",
    "E109.Tom's.Photo.Finish_scene038.mp4": "一个男人走进房间，惊讶地发现窗户上有一只猫。猫用爪子抓住窗帘绳，将窗帘拉起，露出窗外的景色。",
    "E109.Tom's.Photo.Finish_scene039.mp4": "一只小老鼠站在桌子上，用爪子翻动一张画有猫和老鼠的纸。它先是用爪子拨弄纸张，然后将纸张完全掀开，露出纸下的另一张画。接着，它用爪子将纸张重新展开，又将纸张掀开，露出纸下的另一张画。最后，它将纸张完全掀开，露出纸下的另一张画，然后用爪子将纸张重新展开。",
    "E109.Tom's.Photo.Finish_scene040.mp4": "一位女士正在厨房里擀面团，突然一只猫从门后跳出来，她惊讶地转头看着猫，猫则开心地跑开。",
    "E109.Tom's.Photo.Finish_scene041.mp4": "一只灰色的猫从画面右侧跳入，惊讶地停下，张大嘴巴，眼睛瞪大，看着前方桌子上的一个装有剪刀和毛线球的篮子。背景是黄色的窗帘。",
    "E109.Tom's.Photo.Finish_scene042.mp4": "一只小老鼠站在壁炉上，用纸飞机当翅膀，做出飞行姿势，随后跳下壁炉。",
    "E109.Tom's.Photo.Finish_scene043.mp4": "汤姆猫看到一个纸飞机飞来，他跳起来用剪刀追击，最终在房间里追逐纸飞机。",
    "E109.Tom's.Photo.Finish_scene045.mp4": "一只棕色的小老鼠拿着一个带有天线的设备，从建筑物的墙边跑过，然后停在绿色灌木丛前，调整设备的方向。",
    "E109.Tom's.Photo.Finish_scene046.mp4": "一只棕色的老鼠扛着一个大型的银色设备，从画面左侧走向右侧。背景是绿色的灌木丛和紫色的天空，旁边有一根白色的柱子。老鼠表情兴奋，步伐轻快，似乎对所携带的设备充满期待。",
    "E109.Tom's.Photo.Finish_scene047.mp4": "夜晚，汤姆从屋顶跳下，滑行在雪地上，表情紧张。镜头切换到室内，汤姆被主人和狗发现。",
    "E109.Tom's.Photo.Finish_scene048.mp4": "一个穿着绿色睡袍的男人和一只戴着红色项圈的狗在室内互动。男人先是抚摸狗的头，然后与狗握手，狗显得非常开心。旁边站着一位穿着蓝色裙子的女士，她双手叉腰，面带微笑地看着他们。背景是木质墙壁和楼梯，整体氛围温馨。",
    "E109.Tom's.Photo.Finish_scene049.mp4": "一只小老鼠从洞里探出头，兴奋地向一只戴着红色项圈的狗展示一张白纸。狗好奇地凑近，接过纸张，表情从疑惑变为惊喜和开心。",
    "E109.Tom's.Photo.Finish_scene050.mp4": "动画片中的猫汤姆正从门框中探出身体，表情紧张，四肢张开，似乎在努力保持平衡或准备逃跑。",
    "E109.Tom's.Photo.Finish_scene051.mp4": "一只大狗拿着一张白纸，兴奋地大笑并挥舞着手臂，旁边一只小老鼠站在洞口处，面带微笑地看着大狗。",
    "E109.Tom's.Photo.Finish_scene052.mp4": "一只大狗拿着纸张，笑着看着一只小老鼠，随后画面变黑，最后出现“THE END”字样，两侧分别是猫和老鼠的图案。",
    "E109.Tom's.Photo.Finish_scene053.mp4": "视频展示了经典的动画片《猫和老鼠》的片尾画面。画面中，左侧是灰色的猫汤姆，中间是“THE END”的字样，右侧是棕色的老鼠杰瑞。随后，画面切换到MGM动画公司的标志，上面写着“an MGM CARTOON”和“made in Hollywood, U.S.A.”，背景为蓝色。",
    "E109.Tom's.Photo.Finish_scene054.mp4": "视频显示了MGM动画的标题画面，背景为深蓝色，上方有“an”字样，中间是“M·G·M CARTOON”大字，下方标注“made in hollywood, U·S·A.”。随后画面逐渐变暗直至全黑。"
}