{
    "30. Dr. Jekyll and Mr. Mouse_scene001.mp4": "视频开始时显示一个黑色背景，右下角有数字“0110544170204083”。随后，画面切换到一个深蓝色背景，中央出现“Metro-Goldwyn-Mayer”标志，下方有“CARTOON”字样，再下方是“COLOR BY TECHNICOLOR”字样。整个画面保持静态，没有其他动作或变化。",
    "30. Dr. Jekyll and Mr. Mouse_scene002.mp4": "视频片段展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面。",
    "30. Dr. Jekyll and Mr. Mouse_scene003.mp4": "这是一个《猫和老鼠》动画片的片头，展示了标题“Dr. Jekyll and Mr. Mouse”，并列出了导演威廉·汉纳和约瑟夫·巴伯拉，以及动画师、音乐制作人和制片人等工作人员的名字。背景中有一个老鼠的剪影，老鼠戴着礼帽，显得很有绅士风度。整个画面风格复古，色彩以深蓝和黄色为主，体现了经典动画的风格。",
    "30. Dr. Jekyll and Mr. Mouse_scene004.mp4": "视频开始时，展示了一幅宁静的乡村黄昏景象，画面中有一座房子和一个铁栅栏门。随着镜头逐渐推进，画面聚焦到房子的窗台上，那里放置着两个空玻璃瓶。一只手进入画面，将这两个空瓶取走，随后又放回了一个装满牛奶的瓶子。接着，另一只手从窗户内伸出，将牛奶瓶拿走，然后窗户被轻轻关上。整个过程在温暖的黄昏光线下进行，营造出一种宁静而温馨的氛围。",
    "30. Dr. Jekyll and Mr. Mouse_scene005.mp4": "汤姆猫从门后探出头，手里拿着一个瓶子和一个黄色的小球。他先是小心翼翼地观察四周，然后突然冲出来，用瓶子敲击门，接着又用小球敲击门，最后迅速跑开。",
    "30. Dr. Jekyll and Mr. Mouse_scene006.mp4": "汤姆猫从窗帘后跳出来，手里拿着一瓶黄色液体。他坐在橙色扶手椅旁，把液体倒进一个红黄相间的碗里，然后舔了舔手指，似乎在享受这个过程。",
    "30. Dr. Jekyll and Mr. Mouse_scene007.mp4": "汤姆猫拿着一个小瓶子，走到一盆植物前，将瓶子中的液体倒入植物的土壤中，然后满意地离开。",
    "30. Dr. Jekyll and Mr. Mouse_scene008.mp4": "一只灰色的猫从沙发上跳下来，走向地上的一个红黄相间的碗，然后趴在地上，伸出舌头舔碗里的东西。",
    "30. Dr. Jekyll and Mr. Mouse_scene009.mp4": "汤姆正在吃一碗食物，杰瑞突然出现并跳进碗里，汤姆被吓了一跳，杰瑞则得意地在碗里玩耍，汤姆愤怒地盯着杰瑞，杰瑞趁机跳出了碗。",
    "30. Dr. Jekyll and Mr. Mouse_scene010.mp4": "一只老鼠从墙洞中跑出，猫迅速追赶。猫在追捕过程中撞到一个红木柜子，柜子被撞开，老鼠从柜子的抽屉中探出头来。",
    "30. Dr. Jekyll and Mr. Mouse_scene011.mp4": "汤姆正在舔食碗里的食物，突然一根面条从碗中伸出，杰瑞出现在汤姆头顶上吃面条，汤姆愤怒地拿起一根棍子，但被杰瑞的恶作剧弄得狼狈不堪，最终汤姆被面条缠住，杰瑞则得意洋洋地跳开。",
    "30. Dr. Jekyll and Mr. Mouse_scene012.mp4": "一只老鼠从门口跑进来，躲进一堆行李箱后面。猫从门口冲进来，试图抓住老鼠，但被行李箱绊倒。猫爬起来，把行李箱一个个拿起，试图把它们堆起来，但最终还是失败了。猫把行李箱扔到一个大箱子上，然后跳上去，但还是被绊倒了。",
    "30. Dr. Jekyll and Mr. Mouse_scene013.mp4": "汤姆从衣柜里冲出来，撞开门，摔倒在地。",
    "30. Dr. Jekyll and Mr. Mouse_scene014.mp4": "汤姆猫在房间里焦急地试图打开一扇门，他用力拉门把手，但门没有打开。他显得非常沮丧和愤怒，随后他开始狂奔，表情越来越夸张，最终他张大嘴巴，眼睛瞪得很大，似乎在发出愤怒的咆哮。他的眼睛逐渐变大，仿佛有无数只眼睛在注视着他，表现出极度的愤怒和无助。",
    "30. Dr. Jekyll and Mr. Mouse_scene015.mp4": "汤姆猫看到一个箱子旁边放着一碗食物，他兴奋地跑过来，试图用脚踢开箱子，但不小心把食物弄洒了，他显得非常生气和沮丧。",
    "30. Dr. Jekyll and Mr. Mouse_scene016.mp4": "一个蓝色的行李箱从楼梯口滚落，撞到墙角，扬起灰尘，随后消失在画面中。",
    "30. Dr. Jekyll and Mr. Mouse_scene017.mp4": "汤姆猫愤怒地扑向地上的碗，结果滑倒并消失在画面中，只留下碗和地板上的痕迹。",
    "30. Dr. Jekyll and Mr. Mouse_scene018.mp4": "汤姆猫拿着一个红色的盘子，用力拉扯红色窗帘，窗帘被拉开后，露出一个保险箱，汤姆猫愤怒地用手指戳保险箱。",
    "30. Dr. Jekyll and Mr. Mouse_scene019.mp4": "汤姆猫试图打开一个保险箱，他先用手指转动密码盘，但没有成功。他生气地用爪子猛力转动密码盘，保险箱终于打开，里面有一叠钞票。汤姆猫兴奋地扑向钞票，但又突然停下来，似乎在思考什么。他再次转动密码盘，保险箱又关上了。汤姆猫显得很沮丧，但他并没有放弃，他再次尝试打开保险箱。",
    "30. Dr. Jekyll and Mr. Mouse_scene020.mp4": "一只老鼠躲在橱柜角落，用吸管从一个红黄相间的碗里吸食液体。",
    "30. Dr. Jekyll and Mr. Mouse_scene021.mp4": "汤姆猫手持一个红色盘子，试图打开一个保险箱。他先是用爪子转动保险箱的旋钮，然后露出得意的笑容。突然，画面变暗，接着切换到几个标有“酸”、“漂白剂”等危险化学品的瓶子。",
    "30. Dr. Jekyll and Mr. Mouse_scene022.mp4": "汤姆猫在厨房里准备毒药，他将液体倒入碗中，接着加入樟脑丸，但混合时发生了剧烈反应，导致汤姆被溅到。他显得非常生气和沮丧，随后又拿起一瓶液体继续添加，但似乎没有成功。",
    "30. Dr. Jekyll and Mr. Mouse_scene023.mp4": "汤姆在厨房里，正把一个罐子倒扣在一个碗上，产生大量白烟。他表情狰狞，似乎在进行某种危险的实验。",
    "30. Dr. Jekyll and Mr. Mouse_scene024.mp4": "汤姆猫在厨房里，将一瓶绿色液体倒入一个红色碗中，旁边摆放着各种化学试剂瓶。汤姆猫的影子投射在墙上，显得格外醒目。",
    "30. Dr. Jekyll and Mr. Mouse_scene025.mp4": "汤姆在厨房里，正小心翼翼地将一个绿色瓶子中的液体倒入一个红色碗中，碗中冒出大量红色烟雾。汤姆的表情紧张，似乎在进行一项危险的实验。周围摆放着一些标有“BUG POWDER”和“AMMONIA”的瓶子。",
    "30. Dr. Jekyll and Mr. Mouse_scene026.mp4": "汤姆猫在厨房里，正准备用勺子搅拌碗里的食物，他的影子在墙上晃动，表情兴奋。",
    "30. Dr. Jekyll and Mr. Mouse_scene027.mp4": "汤姆猫正在用勺子搅拌碗里的食物，突然勺子上的食物掉下来，汤姆猫惊讶地看着勺子，然后发现勺子上有一只小虫子，汤姆猫看着小虫子飞走，然后又飞回来落在碗里。",
    "30. Dr. Jekyll and Mr. Mouse_scene028.mp4": "一只苍蝇停在红黄相间的碗沿上，它突然飞起，撞到墙上，然后掉落在绿色的地面上。",
    "30. Dr. Jekyll and Mr. Mouse_scene029.mp4": "汤姆猫站在厨房的台子前，面前放着一个红色的碗，碗里装着白色的液体。汤姆猫的影子投射在墙上，影子的动作与汤姆猫同步。汤姆猫用爪子搅拌碗里的液体，然后突然将碗倾斜，液体喷溅而出，形成一道高高的水柱。汤姆猫被喷溅的液体弄湿，表情从得意转为惊讶和痛苦。",
    "30. Dr. Jekyll and Mr. Mouse_scene030.mp4": "汤姆猫拿着一个红色的碗，小心翼翼地靠近墙角的一个洞，然后把碗放在洞口，接着他蹲在洞口旁，眼睛盯着洞里，似乎在等待什么。",
    "30. Dr. Jekyll and Mr. Mouse_scene031.mp4": "一只老鼠从洞里探出头，看到一个装满液体的碗，它兴奋地跑过去，试图舔碗里的液体，结果滑倒并溅起液体。它被液体溅到后，愤怒地跳起来，最后摔倒在地。",
    "30. Dr. Jekyll and Mr. Mouse_scene032.mp4": "一只灰色的猫（汤姆）兴奋地扑向一只躺在地上的棕色小老鼠（杰瑞），但小老鼠突然抬起前爪，似乎在挑衅或展示某种动作，让猫的表情从兴奋转为惊讶和困惑。背景中有一个红色的碗和一个洞口，猫和老鼠都在地板上。",
    "30. Dr. Jekyll and Mr. Mouse_scene033.mp4": "一只棕色的小老鼠躺在地上，突然弹跳起来，快速跑向墙上的洞口。它在洞口前加速冲刺，身后留下彩色的爆炸和火花效果，最终消失在洞口。",
    "30. Dr. Jekyll and Mr. Mouse_scene034.mp4": "一只棕色的老鼠从墙洞中滚出，落地后站起，双臂弯曲，展示肌肉，表情凶狠。背景中有一个红色碗和墙洞。",
    "30. Dr. Jekyll and Mr. Mouse_scene035.mp4": "在室内，一只灰色的猫汤姆和一只棕色的老鼠杰瑞正在互动。汤姆坐在地上，表情紧张，似乎在试图抓住杰瑞。杰瑞则站在汤姆面前，看起来很自信，甚至有些挑衅。汤姆突然站起来，伸手去拿一个放在架子上的绿色书本。他把书本拿在手里，然后用力砸向地面，书本被砸得四分五裂，杰瑞被书本砸中，藏在书本碎片中。汤姆看起来很惊讶和困惑，而杰瑞则从书本碎片中探出头来，继续挑衅汤姆。",
    "30. Dr. Jekyll and Mr. Mouse_scene036.mp4": "一只棕色的小老鼠正在撕扯一本绿色封面的书，它先是趴在书上，然后用力撕开书页，接着把书撕成两半，最后把书扔在地上，自己则跑开了。",
    "30. Dr. Jekyll and Mr. Mouse_scene037.mp4": "在一间装饰典雅的房间里，猫汤姆正对着老鼠杰瑞做出夸张的威胁动作。汤姆先是双手捂脸，随后拿起一把金色的长柄工具，似乎想用它来对付杰瑞。杰瑞则站在一旁，表情坚定，毫不畏惧。汤姆挥舞着工具，试图吓唬杰瑞，但杰瑞依然保持镇定，继续面对汤姆。整个场景充满了卡通式的幽默和紧张感。",
    "30. Dr. Jekyll and Mr. Mouse_scene038.mp4": "汤姆猫挥舞着一根黄色的棍子，棍子末端不断延伸出多个黄色的衣架形状，他张大嘴巴，表情显得非常惊讶和紧张。",
    "30. Dr. Jekyll and Mr. Mouse_scene039.mp4": "汤姆猫手持一根黄色的绳子，绳子末端连接着一个弹簧装置。他用力一拉，弹簧装置迅速弹起，将汤姆猫弹向空中。汤姆猫在空中翻滚，最终消失在画面中。杰瑞鼠站在一旁，看着汤姆猫被弹飞，表情惊讶。",
    "30. Dr. Jekyll and Mr. Mouse_scene040.mp4": "汤姆猫试图通过一扇门进入房间，但被杰瑞鼠用陷阱阻止。汤姆猫撞到门上，门被撞开，汤姆猫被弹飞，最终摔倒在地。杰瑞鼠站在一旁，得意地看着汤姆猫。",
    "30. Dr. Jekyll and Mr. Mouse_scene041.mp4": "汤姆猫从一个蓝色的保险柜中探出头来，然后迅速缩回。接着，杰瑞鼠跑进画面，站在保险柜前。",
    "30. Dr. Jekyll and Mr. Mouse_scene042.mp4": "杰瑞用拳头击打保险箱，然后拉扯出被拉长的汤姆，汤姆被拉长后被杰瑞拖着跑，最后杰瑞将汤姆甩出窗外。",
    "30. Dr. Jekyll and Mr. Mouse_scene043.mp4": "一只灰色的猫站在门口，表情凶狠，张开嘴露出牙齿。一只棕色的小老鼠从门后跳出来，抓住猫的脖子，猫的表情从愤怒变为惊讶。老鼠用力拉扯猫的脖子，猫的表情变得痛苦，眼睛瞪大，嘴巴张开。老鼠继续拉扯，猫的头向后仰，表情更加痛苦。老鼠松开猫，猫的表情从痛苦变为惊讶，嘴巴张开，眼睛瞪大。老鼠站在猫的胸前，表情得意。",
    "30. Dr. Jekyll and Mr. Mouse_scene044.mp4": "一只棕色的小老鼠正紧紧抓住一个巨大的猫爪，它表情紧张，似乎在努力不被拽下来。突然，小老鼠被猫爪猛地一扯，身体在空中旋转，周围出现黄色的火花和动态线条，表现出剧烈的运动和冲击力。小老鼠在空中翻滚，表情惊恐，但依然紧紧抓住猫爪，显示出它的顽强和不屈。",
    "30. Dr. Jekyll and Mr. Mouse_scene045.mp4": "动画片段中，一只小老鼠正努力攀爬在一个巨大的灰色物体表面，背景是绿色的墙壁和一根管道。小老鼠表情紧张，四肢紧抓物体，身体微微颤抖，似乎在努力向上爬。随着镜头逐渐拉远，小老鼠继续向上攀爬，最终成功爬到了物体的顶端。",
    "30. Dr. Jekyll and Mr. Mouse_scene046.mp4": "一只灰色的猫坐在门边，一只小老鼠挂在猫的肚子上。老鼠突然被猫甩出，飞出画面。",
    "30. Dr. Jekyll and Mr. Mouse_scene047.mp4": "一只小老鼠从桌子底下跑出来，跳进一个装满液体的碗里。一只猫从后面冲过来，抓住了小老鼠。",
    "30. Dr. Jekyll and Mr. Mouse_scene048.mp4": "猫汤姆用爪子捏住老鼠杰瑞，杰瑞张大嘴巴尖叫，随后被汤姆捏得变形，最后杰瑞被捏扁。",
    "30. Dr. Jekyll and Mr. Mouse_scene049.mp4": "汤姆猫用爪子托着一个橙色的球，球突然变成杰瑞鼠，杰瑞站在汤姆的爪子上，愤怒地挥舞着双臂，汤姆则露出惊讶的表情。",
    "30. Dr. Jekyll and Mr. Mouse_scene050.mp4": "猫和老鼠在室内进行拉扯战，老鼠用尾巴勾住猫的胡须，猫则试图抓住老鼠，双方你来我往，老鼠最终将猫拉倒在地，猫躺在地上，老鼠则站立着，显得得意洋洋。",
    "30. Dr. Jekyll and Mr. Mouse_scene051.mp4": "在一段经典的动画片段中，一只灰色的猫汤姆正躺在地上，用他的胡须勾住一只棕色的小老鼠杰瑞。杰瑞起初显得有些惊讶和紧张，但很快变得自信，开始用胡须拉扯汤姆，试图摆脱他的控制。随着杰瑞的拉扯，汤姆的表情从惊讶变为愤怒，眼睛瞪得更大，显示出他决心要抓住杰瑞。杰瑞则继续努力，最终成功地将汤姆的胡须拉断，使汤姆的胡须散落在地上，而杰瑞则得意地站在汤姆面前，显得非常胜利。整个场景充满了幽默和紧张感，展现了杰瑞的机智和汤姆的笨拙。",
    "30. Dr. Jekyll and Mr. Mouse_scene052.mp4": "一只小老鼠跳进一个碗里，结果被一只猫的脚踩翻了碗，水溅了它一身，小老鼠被水溅到后飞了起来，最后摔在地上。",
    "30. Dr. Jekyll and Mr. Mouse_scene053.mp4": "猫拿着飞盘追赶老鼠，老鼠躲到沙发后面，猫追到沙发后面，老鼠从沙发后面跳出来，猫被飞盘打中，摔倒在地。",
    "30. Dr. Jekyll and Mr. Mouse_scene054.mp4": "视频中，一只小老鼠从墙角跳出来，迅速爬上台面。一只黑猫在台面上趴着，眼睛紧盯着小老鼠。小老鼠爬到一个蓝色电器上，黑猫试图用尾巴去抓它，结果小老鼠被甩到了电器上。电器突然冒出火花，黑猫被电击，尾巴被烧焦，最后黑猫愤怒地拿起一个烤好的华夫饼，表情狰狞。",
    "30. Dr. Jekyll and Mr. Mouse_scene055.mp4": "杰瑞跑向冰箱并跳进去，汤姆随后打开冰箱门，发现杰瑞在里面。汤姆试图抓住杰瑞，但杰瑞用瓶子和盘子砸他，然后迅速从冰箱门弹出。汤姆被砸得晕头转向，而杰瑞则成功逃脱。",
    "30. Dr. Jekyll and Mr. Mouse_scene056.mp4": "一只老鼠在厨房里，先是被一个巨大的冰箱吓到，然后它开始制作一种混合物，将漂白剂、水和樟脑丸混合在一起。在制作过程中，老鼠的动作引发了一系列的混乱和溅射，它的影子在墙上夸张地模仿它的动作。最后，老鼠成功地将混合物倒入碗中，但整个过程充满了滑稽和混乱。",
    "30. Dr. Jekyll and Mr. Mouse_scene057.mp4": "一只小老鼠站在一个装满液体的碗旁边，碗中的液体突然喷发，伴随着彩色的爆炸效果，液体四溅。小老鼠看起来很惊讶，但没有被喷到。背景中有一个写着“BATH SALTS”的箱子和一个棕色瓶子。",
    "30. Dr. Jekyll and Mr. Mouse_scene058.mp4": "一个蓝色的苍蝇落在冰箱顶部，它在冰箱盖上爬行。",
    "30. Dr. Jekyll and Mr. Mouse_scene059.mp4": "一只小老鼠正在用一个绿色的壶往一个红黄相间的碗里倒红色液体，背景墙上投射出壶的影子。",
    "30. Dr. Jekyll and Mr. Mouse_scene060.mp4": "一只小老鼠在厨房里偷吃食物，它用勺子搅拌碗里的食物，同时在墙上投下自己的影子。",
    "30. Dr. Jekyll and Mr. Mouse_scene061.mp4": "在厨房里，汤姆猫从冰箱顶部的纸卷里突然弹出，被各种蔬菜和液体溅到，显得狼狈不堪。他咬住一根青菜，用力甩动，最终从冰箱上飞走，留下一个空荡荡的冰箱。",
    "30. Dr. Jekyll and Mr. Mouse_scene062.mp4": "杰瑞在碗里用勺子搅拌，突然被汤姆从背后偷袭，碗被打翻，杰瑞被水淋湿后狼狈地摔倒在地。",
    "30. Dr. Jekyll and Mr. Mouse_scene063.mp4": "一只灰色的猫拿着一个红黄条纹的碗，正对着一只棕色的小老鼠。猫张大嘴巴，露出牙齿，似乎在威胁或准备攻击老鼠。老鼠则表现出惊恐和害怕，试图逃跑。猫用爪子抓住老鼠的尾巴，老鼠被拖拽着，但仍然挣扎着。猫的表情从愤怒变为得意，似乎对抓住老鼠感到满意。",
    "30. Dr. Jekyll and Mr. Mouse_scene064.mp4": "汤姆猫拿着一个红色的盘子，盘子里装满了液体。他先是得意地笑着，然后突然将盘子倒扣在头上，液体从盘子中倾泻而出，淋湿了他的身体。汤姆猫看起来非常生气和不满，他甩动着湿漉漉的爪子，试图甩掉身上的水。",
    "30. Dr. Jekyll and Mr. Mouse_scene065.mp4": "视频中，一只灰色的猫（汤姆）和一只棕色的小老鼠（杰瑞）在室内对峙。猫的表情凶狠，张开爪子，似乎准备扑向老鼠。老鼠则显得紧张，四肢张开，似乎在躲避猫的攻击。随后，猫突然变得愤怒，周围出现火焰效果，但老鼠依然保持警惕。最后，猫和老鼠都坐下来，猫的表情变得惊讶，老鼠则显得有些得意。整个场景充满了紧张和幽默的氛围。",
    "30. Dr. Jekyll and Mr. Mouse_scene067.mp4": "一只小老鼠拿着一把红色的伞，追逐着一只小黑猫。小老鼠在房间里奔跑，伞在空中飘动，最终小老鼠跑出了房间，画面结束。",
    "30. Dr. Jekyll and Mr. Mouse_scene068.mp4": "视频开始时显示“THE END”字样，背景为红色，文字为蓝色和白色。随后，文字逐渐变化，显示“An MGM Tom and Jerry Cartoon”以及“MADE IN HOLLYWOOD, U.S.A.”。最后，画面逐渐变暗，最终完全变黑。"
}