{
    "E57.Jerry's.Cousin_scene001.mp4": "视频开始时为全黑画面，随后出现米高梅动画公司的标志，标志上写着“A METRO-GOLDWYN-MAYER CARTOON”，下方标注“COLOR BY TECHNICOLOR”。标志背景为深蓝色，整体风格复古。",
    "E57.Jerry's.Cousin_scene002.mp4": "视频展示了米高梅动画片的标志，随后切换到《猫和老鼠》的标题画面。",
    "E57.Jerry's.Cousin_scene003.mp4": "视频片段展示了经典动画《猫和老鼠》的片头，首先出现的是“Tom and Jerry”的标题，接着是该集的标题“Jerry's Cousin”以及导演William Hanna和Joseph Barbera的名字。随后，画面显示了动画师、音乐制作人和制片人等工作人员的名单，最后画面渐暗，转到一个名为“Hogan's Alley”的场景。",
    "E57.Jerry's.Cousin_scene004.mp4": "这是一个动画片头，画面展示了一个名为“HOGAN'S ALLEY”的小巷，巷子两侧是老旧的砖房，有门、窗户和垃圾桶等细节。随后，一个橙色的卡通角色从右侧快速跑过，只露出部分身体。",
    "E57.Jerry's.Cousin_scene006.mp4": "一个穿着黄色衣服、戴着绿色帽子的老鼠从一个标有“Muscles Mouse”的蓝色邮箱中取出一封信。他仔细阅读信件，表情严肃，似乎在思考信中的内容。背景是一堵砖墙和一个洞口，旁边有几只小老鼠的剪影。",
    "E57.Jerry's.Cousin_scene007.mp4": "视频中展示了一张被双手拿着的纸条，纸条上用黑色墨水手写了一封信，信的内容是：“Dear Cousin Muscles, Am having serious trouble with Tom, Need your help at once Jerry”。背景是绿色的，双手穿着黄色的袖子。整个画面保持静止，没有其他动作或变化。",
    "E57.Jerry's.Cousin_scene008.mp4": "一只穿着黄色衣服、戴着绿色帽子的老鼠站在一个写着“Muscles Mouse”的蓝色邮箱旁，手里拿着一张纸。它仔细阅读后，把纸扔在地上，然后跑进墙洞里。接着，它从洞里出来，手里拿着一个红色的盒子，沿着墙边走动，似乎在检查周围环境。",
    "E57.Jerry's.Cousin_scene009.mp4": "一群猫在街道上追逐打闹，其中一只黑猫被围在中间，其他猫从四面八方扑向它，场面混乱而充满动感。",
    "E57.Jerry's.Cousin_scene011.mp4": "一只老鼠躲在木箱后，看着地上的红色鞭炮。鞭炮突然爆炸，老鼠吓得缩回木箱后，画面随之被爆炸的冲击波充满。",
    "E57.Jerry's.Cousin_scene012.mp4": "在一间布满灰尘和杂物的洞穴中，一只老鼠躲在木箱后，观察着周围。地上散落着几枚红色的炸药，其中一枚正在冒火花。突然，另一只穿着黄色衣服、戴着绿色帽子的老鼠从门口走进来，他提着一个红色的手提包，看到炸药后显得非常紧张。他迅速拿起一枚炸药，试图将其移开，但炸药的火花却越来越旺，他显得更加慌张。与此同时，躲在木箱后的老鼠则紧张地注视着这一切，似乎在等待时机。",
    "E57.Jerry's.Cousin_scene013.mp4": "一只小老鼠从洞里爬出来，手里拿着一个正在冒火花的红色火药筒，它小心翼翼地靠近一只正在睡觉的灰色大猫。小老鼠把火药筒放在猫的尾巴上，然后继续向前走，火药筒的火花在猫的毛发上点燃。猫被惊醒，睁开眼睛，看到火药筒还在燃烧，它张大嘴巴，试图咬住火药筒，但小老鼠躲开了。猫的眼睛突然变成两个鼓，然后又恢复正常，它继续盯着小老鼠。小老鼠站在猫面前，猫的眼睛开始闪烁，似乎在思考如何对付小老鼠。",
    "E57.Jerry's.Cousin_scene014.mp4": "在室内，一只灰色的猫（汤姆）和一只穿着黄色衣服戴绿色帽子的小老鼠（杰瑞）互动。汤姆先是躺在地上，然后坐起，用爪子抓住杰瑞，表情凶狠。接着，汤姆又躺下，靠近杰瑞，似乎在与它互动或玩耍。杰瑞始终站在汤姆面前，看起来有些害怕或挑衅。",
    "E57.Jerry's.Cousin_scene015.mp4": "视频中，一只灰色的猫和一只穿着黄色衣服、戴着绿色帽子的小老鼠面对面站立。猫伸出前爪，小老鼠紧紧抓住猫的爪子，两人似乎在进行对话。小老鼠的表情显得有些得意和自信，而猫则显得有些惊讶或困惑。随后，小老鼠突然用力一拉，猫被拽得向后倒去，小老鼠则继续向前奔跑，猫的爪子在空中挥舞，显示出被拉扯的动态效果。整个场景充满了卡通风格的夸张和幽默感。",
    "E57.Jerry's.Cousin_scene016.mp4": "动画片段中，汤姆猫从空中坠落，最终落在一个红色的花瓶上。花瓶放在一张木桌上，背景是带有黄色菱形图案的墙壁。",
    "E57.Jerry's.Cousin_scene017.mp4": "一个穿着黄色衣服、戴着绿色帽子的卡通老鼠站在灰色背景前，表情严肃，身体微微前倾，似乎在思考或准备行动。",
    "E57.Jerry's.Cousin_scene019.mp4": "两只老鼠在饼干盒旁争夺饼干，其中一只老鼠被另一只老鼠推下，随后一只猫出现，用拳头击打其中一只老鼠，导致它被击飞。",
    "E57.Jerry's.Cousin_scene020.mp4": "汤姆穿着红色毛衣，从画面左侧向右侧走动，经过一个木制柜子和窗户，背景是粉红色的墙壁和窗帘。",
    "E57.Jerry's.Cousin_scene021.mp4": "汤姆穿着红色衣服，头上顶着一个黄色的钟，从门后走出。他先是惊讶地抬头看钟，然后被钟砸中，摔倒在地。钟掉落在地上，汤姆躺在地上，看起来很狼狈。",
    "E57.Jerry's.Cousin_scene022.mp4": "视频中，汤姆猫穿着黄色斗篷，用筷子逗弄一只小鸟。随后场景切换到一个标有“TOM”的浴缸，里面有一只老鼠和一只穿着衣服的猫在洗澡。接着，镜头向上移动，展示天花板上的一个洞，汤姆猫从洞中探出头来，表情愤怒。",
    "E57.Jerry's.Cousin_scene023.mp4": "在阁楼里，汤姆猫看到一个黑色保龄球，他兴奋地扑过去，用爪子抓住球，然后高高举起，准备投掷。他将球用力扔向地面，球滚入一个洞中，汤姆猫惊讶地张大嘴巴，眼睛瞪得很大。",
    "E57.Jerry's.Cousin_scene024.mp4": "在一只标有“TOM”的黄色狗盆里，一只穿着黄色衣服和绿色帽子的猫正躺在蓝色的垫子上，开心地笑着，而一只棕色的小老鼠则坐在盆边。猫突然大笑并挥手，小老鼠显得有些惊讶。接着，狗盆突然破裂，猫消失不见，小老鼠惊慌失措地从破裂的盆中跳出来，站在盆边，四处张望，显得非常困惑和害怕。",
    "E57.Jerry's.Cousin_scene025.mp4": "一只灰色的猫从楼梯顶部跑下来，沿着螺旋楼梯快速向下奔跑，最后从楼梯底部消失。",
    "E57.Jerry's.Cousin_scene026.mp4": "一只老鼠坐在一个破洞的月亮形状物体上，它先是坐着，然后跳起来并消失在画面中。",
    "E57.Jerry's.Cousin_scene027.mp4": "一只小老鼠在房间里奔跑，突然被一只大灰猫追上，猫扑向老鼠，老鼠吓得缩成一团。",
    "E57.Jerry's.Cousin_scene028.mp4": "一只穿着黄色衣服、戴着绿色帽子的老鼠从门后探出头，手里举着一个黑色的球。它试图把球推入门内，但球太重，导致它被球砸倒在地。随后，老鼠站起身，继续尝试推动球。",
    "E57.Jerry's.Cousin_scene029.mp4": "猫汤姆追逐老鼠杰瑞，但被杰瑞用尾巴击中后飞出画面，随后画面中出现了一排拟人化的保龄球瓶。",
    "E57.Jerry's.Cousin_scene030.mp4": "一只穿着黄色衣服和绿色帽子的卡通老鼠正在快速奔跑，背景是简单的室内墙壁和地板。",
    "E57.Jerry's.Cousin_scene031.mp4": "一群拟人化的保龄球瓶排列在黄色地毯上，它们张大嘴巴，似乎在惊恐地尖叫。随后，它们被一股力量推倒，倒地时发出声响。紧接着，一只灰色的猫从上方飞身跃下，落地后兴奋地挥舞双臂，最终在地毯上翻滚，留下一串白色轨迹。",
    "E57.Jerry's.Cousin_scene032.mp4": "一只灰色的猫从右侧冲出，张着嘴，挥舞着爪子，似乎在追赶什么。它跑过画面，然后消失在左侧。随后，一只穿着黄色衣服、戴着绿色帽子的小老鼠从右侧出现，它也张着嘴，挥舞着爪子，似乎在逃跑。它跑过画面，然后消失在左侧。",
    "E57.Jerry's.Cousin_scene033.mp4": "猫拿着猎枪瞄准老鼠，老鼠被击中后倒地，随后站起来面对猫。",
    "E57.Jerry's.Cousin_scene034.mp4": "一只穿着黄色衣服和绿色帽子的老鼠，正面对一个蓝色的管道。它先是靠近管道，然后被吸入管道中，身体被拉长并悬在空中。",
    "E57.Jerry's.Cousin_scene035.mp4": "汤姆猫戴着绿色望远镜，手持猎枪，准备射击。杰瑞鼠突然出现，手持大锤，威胁汤姆。汤姆被击中，眼镜变形，表情痛苦。随后，汤姆坐在椅子上，戴着眼镜，打电话求助。",
    "E57.Jerry's.Cousin_scene037.mp4": "一只穿着黄色衣服、戴着绿色帽子的老鼠从帽子中爬出，戴上帽子后，它摆出侦探的姿势，然后开始走路。",
    "E57.Jerry's.Cousin_scene038.mp4": "一只灰色的猫站在墙边，双手交叉抱在胸前，表情显得有些不悦或困惑。随后，它用右手捂住眼睛，似乎在躲避什么或感到沮丧。背景是简单的室内墙壁，颜色柔和。",
    "E57.Jerry's.Cousin_scene039.mp4": "动画片中的猫汤姆在房间里因愤怒而奔跑，随后撞倒家具，被烟雾笼罩，最后停下喘息。",
    "E57.Jerry's.Cousin_scene040.mp4": "一只穿着黄色衣服和绿色帽子的小老鼠在厨房里悄悄地走动，它用扫帚扫地，但被一只巨大的手抓住了扫帚柄，老鼠被拖走了。",
    "E57.Jerry's.Cousin_scene041.mp4": "视频中，汤姆猫一开始在墙边紧张地搓手，随后突然向一侧扑去，接着靠在墙角，表情惊恐。这时，一群老鼠从他身边经过，其中一只小老鼠拿着工具，似乎在进行某种操作，而汤姆猫则继续保持着惊恐的表情，目不转睛地看着它们。",
    "E57.Jerry's.Cousin_scene042.mp4": "视频中，一群猫被一只小老鼠用棍子击打后从门后滚出，小老鼠站在门口，随后一只灰猫从门后爬出，躺在地上，与小老鼠对视。",
    "E57.Jerry's.Cousin_scene043.mp4": "视频中，两只老鼠在室内互动。一只老鼠穿着黄色衣服和绿色帽子，另一只老鼠则没有穿衣服。穿衣服的老鼠递给另一只老鼠一个绿色帽子，然后自己拿起一个红色手提箱，打开后拿出一些物品。随后，穿衣服的老鼠离开，另一只老鼠穿上黄色衣服，戴上绿色帽子，显得非常开心和自豪。",
    "E57.Jerry's.Cousin_scene044.mp4": "一只穿着黄色衣服和绿色帽子的老鼠从画面左侧跑入，站在一块地毯上，先是兴奋地挥舞双臂，随后表情变得严肃，最后转身跑进一个拱形门洞并消失在画面中。",
    "E57.Jerry's.Cousin_scene045.mp4": "一只穿着黄色衣服、戴着绿色帽子的小老鼠从墙洞中走出，沿着墙边行走。突然，一只灰色的猫从右侧冲进来，张开双臂，做出扑击的动作，但随后倒在地上，看起来非常疲惫。小老鼠靠近猫，猫则躺在地上，眼睛半睁，似乎在休息或假装睡着。小老鼠站在猫的面前，似乎在与猫互动。最后，画面逐渐变暗，出现“THE END”的字样。",
    "E57.Jerry's.Cousin_scene046.mp4": "视频显示了“THE END”的字样，随后逐渐显示出“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样，背景为渐变的橙红色。"
}