{
    "E50.Jerry.and.the.Lion_scene001.mp4": "画面从全黑开始，逐渐过渡到一个深蓝色背景，中央出现一个圆形图案，图案内是一个模糊的动物形象。下方有“METRO-GOLDWYN-MAYER”字样，再下方是“CARTOON”字样，最下方是“COLOR BY TECHNICOLOR”字样。整体风格复古，具有经典动画片头的特征。",
    "E50.Jerry.and.the.Lion_scene002.mp4": "这是一个米高梅卡通片头，背景为深蓝色，中央有一个圆形框，框内是一只咆哮的狮子。狮子上方有“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样。狮子在圆形框内不断咆哮，嘴巴张合，表情凶猛。整个画面色彩鲜艳，具有经典卡通风格。",
    "E50.Jerry.and.the.Lion_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头。首先出现的是米高梅卡通的标志，随后画面转为黑色，接着出现“Tom and Jerry”的标题，伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "E50.Jerry.and.the.Lion_scene004.mp4": "这是一个《猫和老鼠》动画片的片头，展示了“Jerry and the Lion”这一集的标题，以及导演威廉·汉纳和约瑟夫·巴伯拉的名字。画面中，一只狮子和一只老鼠在蓝色背景上，狮子显得威严，老鼠则显得机灵。随后，画面切换到制作人员名单，包括动画师、音乐人和制片人弗雷德·奎姆比。整个画面风格复古，充满经典动画的韵味。",
    "E50.Jerry.and.the.Lion_scene005.mp4": "视频开头显示“PRODUCED BY FRED QUIMBY”的字样，随后画面转为黑色，最后出现动画角色汤姆猫坐在红色扶手椅上，伸展身体，背景是昏暗的房间，有一盏台灯和一个收音机。",
    "E50.Jerry.and.the.Lion_scene006.mp4": "一只蓝色的猫坐在红色的沙发上，起初它显得很放松，随后它突然变得警觉并迅速起身，最后它从沙发上跳了起来，离开了画面。",
    "E50.Jerry.and.the.Lion_scene007.mp4": "汤姆从门口冲进来，看到厨房地板上洒了一地的牛奶，他先是惊讶地停住，然后表情变得愤怒，张开双臂，似乎在责怪什么人或事。",
    "E50.Jerry.and.the.Lion_scene008.mp4": "一只小老鼠在冰箱里偷吃食物，它先后拿走了橙子、苹果、黄油、牛奶和鸡蛋，每拿走一样食物，冰箱里的食物就会被它推倒或移开。",
    "E50.Jerry.and.the.Lion_scene009.mp4": "厨房里，一个跷跷板上放满了各种物品，包括牛奶瓶、鸡蛋、苹果、黄油、碗、罐子等。随着跷跷板的摆动，这些物品不断滚动和移动，有的掉落在地，有的滚向另一端。背景中可以看到冰箱、橱柜和一些厨房用具。整个场景充满了动感和趣味性。",
    "E50.Jerry.and.the.Lion_scene010.mp4": "在冰箱里，杰瑞抱着一个大番茄，被汤姆发现。汤姆伸手去抓，杰瑞用番茄砸汤姆，番茄汁溅了汤姆一脸，汤姆被弄得很狼狈，杰瑞趁机逃跑。",
    "E50.Jerry.and.the.Lion_scene012.mp4": "一只棕色的小老鼠站在门边的台阶上，身体前倾，双臂张开，眼睛睁得很大，表情显得紧张或警觉。它先是面向前方，随后慢慢转头向右看去，似乎在观察周围的环境。背景是一扇蓝色的门和一堵有裂缝的墙，整体氛围显得有些昏暗。",
    "E50.Jerry.and.the.Lion_scene013.mp4": "汤姆猫坐在红色沙发上，表情紧张，手放在嘴边，似乎在倾听什么。突然，他惊恐地跳起来，张大嘴巴尖叫，身体前后晃动，表现出极度的惊慌和恐惧。",
    "E50.Jerry.and.the.Lion_scene014.mp4": "汤姆猫在房间里追逐着一个看不见的目标，他撞上窗帘，被甩了出去，最后从窗户飞了出去。",
    "E50.Jerry.and.the.Lion_scene015.mp4": "一个红色沙发在房间里倾斜，汤姆猫从沙发后面冲出来，被沙发甩出去，最终消失在画面中。",
    "E50.Jerry.and.the.Lion_scene016.mp4": "一只棕色的老鼠站在门边，突然被吓到，向右侧飞扑出去，最终消失在画面中。",
    "E50.Jerry.and.the.Lion_scene017.mp4": "动画片《猫和老鼠》中的汤姆从楼梯上滑下来，然后在房间里快速奔跑和翻滚，最后撞到墙上。",
    "E50.Jerry.and.the.Lion_scene018.mp4": "汤姆猫从壁炉上方的猎枪上滑下，猎枪随之掉落，汤姆猫在空中翻滚并消失在画面中。",
    "E50.Jerry.and.the.Lion_scene019.mp4": "一只戴着帽子、手持猎枪的猫从椅子后面滑出，躲进一个箱子中，然后从箱子里探出头来，警惕地观察四周。",
    "E50.Jerry.and.the.Lion_scene020.mp4": "一只棕色的小老鼠从一个蓝色的茶壶里探出头来，然后完全爬出来，张开双臂，看起来非常兴奋和得意。它在茶壶旁边走动，最后停在一个棕色的瓶子和一个木桶旁边，张大嘴巴，似乎在欢呼或喊叫。背景是一个昏暗的房间，有木箱和一些瓶子。",
    "E50.Jerry.and.the.Lion_scene021.mp4": "黑暗中，一双蓝色的眼睛从木箱后窥视，眼神凶狠。木箱内有一只绿色瓶子和一个金属容器。",
    "E50.Jerry.and.the.Lion_scene022.mp4": "在一间昏暗的储藏室里，一只小老鼠从一个大酒桶后面探出头来，四处张望。它小心翼翼地向前走，突然被一只巨大的狮子从上方扑下。狮子趴在地板上，表情凶狠，但随后它慢慢抬起头，眼神变得温柔，似乎在思考什么。",
    "E50.Jerry.and.the.Lion_scene023.mp4": "一只狮子用爪子抓住了一只小老鼠，狮子表情丰富地与老鼠互动，时而张嘴说话，时而做出手势，老鼠则被紧紧握在爪中，表情紧张。",
    "E50.Jerry.and.the.Lion_scene024.mp4": "一只狮子蹲在地上，手里拿着一只小老鼠。狮子把老鼠放在地上，然后做出各种夸张的表情和动作，似乎在与老鼠互动或展示自己的力量。老鼠则站在远处，看起来有些害怕或警惕。背景是一个简陋的房间，有木梁和一些杂物。",
    "E50.Jerry.and.the.Lion_scene025.mp4": "一只卡通狮子在蓝色背景下表现出愤怒和紧张的情绪，它张开嘴巴咆哮，挥舞着爪子，表情激动。",
    "E50.Jerry.and.the.Lion_scene026.mp4": "一只小老鼠站在沙地上，面对着一只巨大的狮子。狮子张开大嘴，露出锋利的牙齿，表情凶猛，似乎在威胁或咆哮。小老鼠则显得非常害怕，身体微微颤抖，试图躲避狮子的威胁。整个场景充满了紧张和危险的气氛。",
    "E50.Jerry.and.the.Lion_scene027.mp4": "一只狮子和一只老鼠在地下室里互动。狮子一开始表现出愤怒和威胁的姿态，张大嘴巴露出牙齿，似乎要攻击老鼠。但随后狮子的表情变得柔和，它伸出爪子，似乎在试图安抚或与老鼠玩耍。老鼠则一直保持警惕，但没有逃跑，似乎在观察狮子的行为。整个场景充满了戏剧性的张力，但最终以一种相对和平的方式结束。",
    "E50.Jerry.and.the.Lion_scene028.mp4": "一只棕色的小老鼠坐在地上，先是抬头望向远方，然后转头看向镜头，表情显得有些担忧和思索。背景是渐变的蓝色和米色。",
    "E50.Jerry.and.the.Lion_scene029.mp4": "一只棕色的小老鼠坐在昏暗的地面上，表情惊恐。随后画面变黑，接着出现一扇半开的窗户，露出楼梯。",
    "E50.Jerry.and.the.Lion_scene030.mp4": "一只猫从门后探出头，看到一只老鼠从门缝中跑出来。猫惊讶地张大嘴巴，老鼠则得意地跑开。猫随后从门后爬出来，追赶老鼠。",
    "E50.Jerry.and.the.Lion_scene032.mp4": "猫戴着帽子，手持猎枪，瞄准地上的老鼠。老鼠从一个大肉块后面探出头，猫用枪指着它。老鼠被吓到，迅速逃跑，猫追了上去，但老鼠在地毯上滑行，猫只能看着它跑远。",
    "E50.Jerry.and.the.Lion_scene033.mp4": "一只棕色的卡通狗从蓝色窗帘后探出头，看到一只手拿着一块大肉。狗先是好奇地嗅闻，然后兴奋地张大嘴巴，咬住肉块，最后满意地缩回窗帘后。",
    "E50.Jerry.and.the.Lion_scene034.mp4": "汤姆戴着探险帽，手持猎枪和肉块，兴奋地追逐杰瑞。杰瑞在地毯上惊慌逃跑，汤姆紧追不舍，表情得意。",
    "E50.Jerry.and.the.Lion_scene035.mp4": "视频中，汤姆戴着一顶带有绿色带子的帽子，手持一个红色喇叭，表情从兴奋到愤怒再到得意，最后拿起一根蓝色棍子，似乎在准备进行某种行动。",
    "E50.Jerry.and.the.Lion_scene036.mp4": "蓝色窗帘在风中轻轻飘动，右侧可见木质百叶窗。",
    "E50.Jerry.and.the.Lion_scene037.mp4": "汤姆猫戴着帽子，手持猎枪，瞄准蓝色窗帘后的目标，表情专注而紧张。他先是调整姿势，然后举枪瞄准，准备射击。",
    "E50.Jerry.and.the.Lion_scene038.mp4": "一只棕色的小老鼠在紫色地毯上惊慌奔跑，它张大嘴巴，表情紧张，似乎在躲避什么。画面右侧可以看到一只大猫的蓝色后腿和白色爪子，暗示猫正在追捕老鼠。老鼠在奔跑过程中，身体时而前倾，时而跳跃，尾巴在身后摆动，显示出它在拼命逃跑。",
    "E50.Jerry.and.the.Lion_scene039.mp4": "汤姆戴着帽子，手持猎枪瞄准，杰瑞突然从旁边窜出，汤姆被惊吓到，猎枪意外走火，汤姆被炸飞，随后重新站稳，继续瞄准。",
    "E50.Jerry.and.the.Lion_scene040.mp4": "一只棕色的小老鼠站在紫色地毯上，面对着一只大猫的脚。小老鼠先是张开双臂，然后抱紧双臂，身体微微颤抖，似乎在害怕或紧张。大猫的脚静止不动，只露出部分蓝色的毛发和白色的爪子。背景是浅灰色的墙壁和白色的踢脚线。",
    "E50.Jerry.and.the.Lion_scene041.mp4": "汤姆戴着一顶草帽，手持猎枪，站在墙边。他先是调整帽子，然后抬头望向远方，表情专注。",
    "E50.Jerry.and.the.Lion_scene043.mp4": "视频中，戴着帽子、手持猎枪的猫从楼梯后偷偷出现，悄悄接近一只小老鼠。猫瞄准老鼠，但此时一只大狮子从灯罩里探出头来，猫被吓了一跳，但迅速恢复镇定，继续瞄准老鼠。整个场景发生在室内，背景有家具和粉色墙壁。",
    "E50.Jerry.and.the.Lion_scene044.mp4": "猫戴着帽子，手持猎枪，对准老鼠。老鼠愤怒地挥舞拳头，猫突然大叫并伸出爪子，将老鼠抓起。",
    "E50.Jerry.and.the.Lion_scene045.mp4": "一只戴着帽子的猫站在灯柱旁，手里拿着一只小老鼠。上方有一只狮子正用爪子抓着灯柱，看着猫和老鼠。狮子表情从好奇变为惊讶，最后似乎被什么东西击中，身体后仰。猫则一直保持着拿着老鼠的姿势，表情从惊讶变为得意。",
    "E50.Jerry.and.the.Lion_scene046.mp4": "汤姆戴着帽子，身体水平地在空中快速飞行，背景是室内环境，有家具和窗帘。",
    "E50.Jerry.and.the.Lion_scene047.mp4": "视频展示了一个卡通场景，一只戴着帽子的猫从壁炉中钻出，周围有砖块掉落。壁炉上方的砖块被破坏，露出黑色的空洞，随后猫从壁炉中爬出，被掉落的砖块包围。背景是木质墙壁和书架，整体风格充满卡通幽默感。",
    "E50.Jerry.and.the.Lion_scene048.mp4": "一只小老鼠从一个装有雨伞的蓝色桶旁边跑过，接着一只狮子出现，它试图从桶里取出雨伞，结果被桶里的水溅到，狼狈地摔倒在地。随后，汤姆猫戴着帽子，拿着猎枪出现，他从桶里取出雨伞并打开，雨伞突然变成一把大伞，将狮子淋湿。狮子被淋湿后愤怒地冲向汤姆，但汤姆已经变成了一滩水，狮子只好放弃。最后，小老鼠从桶里探出头来，看着地上的汤姆和狮子，然后跳出了桶。",
    "E50.Jerry.and.the.Lion_scene050.mp4": "一扇门被推开，门后是书架，随后门被关上。",
    "E50.Jerry.and.the.Lion_scene051.mp4": "一扇门被推开，镜头向内移动，展示了一个房间，房间内有镜子、窗帘和百叶窗。",
    "E50.Jerry.and.the.Lion_scene052.mp4": "汤姆猫被夹在门和墙壁之间，表情痛苦。他挣扎着试图逃脱，最终从门缝中挤出，摔倒在地，显得狼狈不堪。",
    "E50.Jerry.and.the.Lion_scene053.mp4": "一只棕色的小老鼠从门后探出头，小心翼翼地观察四周，然后慢慢走出门，停在门口，警觉地四处张望。",
    "E50.Jerry.and.the.Lion_scene054.mp4": "汤姆猫坐在门前，突然站起来并疯狂地撞向门，导致门后的墙壁破裂，露出外面的景色。",
    "E50.Jerry.and.the.Lion_scene056.mp4": "一只棕色的小老鼠站在木制平台上，背景是深蓝色的海洋和夜空。它手里拿着一块白色的布，先是用布擦拭脸部，然后将布举过头顶，似乎在擦拭或展示它。随后，画面逐渐变暗，最终完全变黑，出现“The End”的字样。",
    "E50.Jerry.and.the.Lion_scene057.mp4": "视频开始时显示“THE END”字样，随后逐渐过渡到“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面。整个画面背景为红色，文字为蓝色，具有复古卡通风格。"
}