{
    "E73.The.Missing.Mouse_scene001.mp4": "画面从全黑开始，逐渐出现米高梅动画公司的标志，标志中有一只咆哮的狮子，下方有文字“A Metro-Goldwyn-Mayer CARTOON COLOR BY TECHNICOLOR”。背景为深红色。",
    "E73.The.Missing.Mouse_scene002.mp4": "这是一个米高梅动画片的片头，背景为红色，中央有一个蓝色的圆形框架，内有一只咆哮的狮子。下方有白色字体“A Metro-Goldwyn-Mayer CARTOON”，以及蓝色字体“COLOR BY TECHNICOLOR”。狮子在框架内不断张合嘴巴，表现出咆哮的动作。",
    "E73.The.Missing.Mouse_scene003.mp4": "视频展示了米高梅动画的片头，随后是《猫和老鼠》的标题画面。",
    "E73.The.Missing.Mouse_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为红色渐变圆形，中央是猫汤姆和老鼠杰瑞的卡通形象，汤姆张嘴大笑，杰瑞则显得调皮。画面下方有黄色的“TOM and JERRY”字样，随后出现标题“The Missing Mouse”以及导演“Directed by WILLIAM HANNA and JOSEPH BARBERA”的字样。",
    "E73.The.Missing.Mouse_scene005.mp4": "这是一个动画片《The Missing Mouse》的片头，展示了导演William Hanna和Joseph Barbera，以及动画师、背景设计师和音乐制作人的名字。片尾显示由Fred Quimby制作。背景是深蓝色，有放大镜和老鼠的图案，以及一些版权和制作信息。",
    "E73.The.Missing.Mouse_scene006.mp4": "画面显示一个卡通老鼠站在冰箱前，冰箱门打开，老鼠似乎在偷看或准备偷取冰箱里的东西。背景较暗，突出了老鼠和冰箱。",
    "E73.The.Missing.Mouse_scene007.mp4": "一只老鼠从冰箱里偷出一块奶酪和一瓶牛奶，然后又偷了一个橙子，结果橙子爆炸了，老鼠被炸飞了，猫在冰箱上看着这一切，笑得非常开心。",
    "E73.The.Missing.Mouse_scene008.mp4": "一只小老鼠抱着一个蓝色的盘子在厨房的架子上奔跑，经过两个红色的罐子。",
    "E73.The.Missing.Mouse_scene009.mp4": "厨房台面上放着两个派，汤姆从下方探出头，双手举起派，露出兴奋的表情。杰瑞从右侧跑来，停在台面上，抬头看着汤姆，似乎在挑衅。汤姆看到杰瑞后，张大嘴巴，显得更加兴奋。",
    "E73.The.Missing.Mouse_scene010.mp4": "汤姆猫在厨房里，双手各举着一个盘子，将紫色的液体倒向地面，液体溅得到处都是，汤姆猫脸上带着开心的笑容。",
    "E73.The.Missing.Mouse_scene011.mp4": "在厨房里，一只小老鼠杰瑞从角落里跑出来，被猫汤姆发现。汤姆拿着一个捕鼠夹，准备捕捉杰瑞。杰瑞看到捕鼠夹后，迅速用尾巴勾住捕鼠夹的弹簧，导致捕鼠夹没有成功夹住它。汤姆被自己的捕鼠夹弄得很尴尬，表情夸张地跳起来，然后捂着肚子大笑。",
    "E73.The.Missing.Mouse_scene012.mp4": "一只老鼠从墙角的洞里钻出来，随后在墙上留下一个破洞，老鼠消失在洞里。",
    "E73.The.Missing.Mouse_scene013.mp4": "一只灰色的猫在黄色墙壁前兴奋地跳舞，它张开嘴巴，挥舞着四肢，表现出极大的喜悦。随后，它转身跑向画面右侧，最终消失在画面中。",
    "E73.The.Missing.Mouse_scene014.mp4": "动画片段中，一个棕色的小老鼠从黄色墙壁上的破洞中摔落，墙壁碎片散落一地，小老鼠摔倒在深色地板上。",
    "E73.The.Missing.Mouse_scene015.mp4": "一个装有白色液体的瓶子放在架子上，瓶子倾倒后液体流出。",
    "E73.The.Missing.Mouse_scene016.mp4": "一只棕色的小老鼠躺在地上，头顶上方的墙壁出现裂缝，牛奶从裂缝中倾泻而下，将小老鼠淋湿。小老鼠挣扎着站起来，浑身湿透，表情愤怒。",
    "E73.The.Missing.Mouse_scene017.mp4": "汤姆猫躺在红色扶手椅上，手里拿着一本漫画书，书页上写着“WOW”。他翻动书页，突然发现书页上画着的自己，表情惊讶。汤姆猫放下书，坐直身体，转向旁边的收音机，眼睛睁大，似乎在听什么。他先是惊讶，然后表情变得困惑，接着又露出一丝得意的微笑。",
    "E73.The.Missing.Mouse_scene018.mp4": "一只白色的小老鼠站在一块白色的布上，背景是黄色的墙壁和棕色的地板。墙壁上有一个破洞，地板上有几块黄色的物体。小老鼠先是抬头看着破洞，然后低头用前爪抓挠自己的脸，接着又抬头看破洞，最后它似乎在思考什么，然后用前爪捂住嘴巴，眼睛睁得很大，显得有些惊讶或困惑。",
    "E73.The.Missing.Mouse_scene019.mp4": "汤姆猫坐在红色扶手椅上，专注地看着旁边的收音机。他先是皱眉思考，随后突然兴奋地跳起来，从椅子上飞身扑向收音机，最后消失在画面中。",
    "E73.The.Missing.Mouse_scene021.mp4": "汤姆猫跑进房间，拿起电话听筒，表情紧张地对着电话说话，似乎在与人激烈争执。",
    "E73.The.Missing.Mouse_scene022.mp4": "一只白色的小老鼠站在桌子边缘，它先是挥手，然后转身，接着从桌子上跳了下去。",
    "E73.The.Missing.Mouse_scene023.mp4": "汤姆猫在房间里接到电话，突然大叫并被吓得飞出去，最后消失在画面中。",
    "E73.The.Missing.Mouse_scene024.mp4": "视频中，一只蓝色的猫（汤姆）躺在地上，旁边有一个紫色的枕头，枕头上有只小白猫。汤姆先是闭着眼睛，似乎在睡觉，随后突然睁开眼睛，表情惊讶，接着猛地跳起，离开了画面。小白猫则一直躺在枕头上，没有动。背景是蓝绿色的墙壁和棕色的地板，还有桌腿的阴影。",
    "E73.The.Missing.Mouse_scene025.mp4": "汤姆猫冲进房间，拿起电话听筒，表情愤怒地对着电话大喊大叫，随后又显得有些困惑和不满。",
    "E73.The.Missing.Mouse_scene026.mp4": "一只白色的小老鼠站在钢琴上，它蹦跳着，然后从钢琴上跳下来，躲进钢琴里。这时，一只蓝色的猫从钢琴后面探出头来，它伸长身体，试图抓住小老鼠。小老鼠从钢琴里跑出来，猫被吓得后退，然后转身跑开。猫跑到桌子旁，拿起电话，对着电话大喊，然后把电话扔到地上，自己也倒在地上。",
    "E73.The.Missing.Mouse_scene027.mp4": "一只白色的小老鼠站在一把红色手柄的蓝色刀片上，位于一个蓝色橱柜的顶部。它先是站立，然后开始跳跃，最后从刀片上跳起并飞向天花板，最终消失在画面中。背景是一个厨房，有棕色的墙和窗户。",
    "E73.The.Missing.Mouse_scene028.mp4": "在蓝色橱柜的角落里，汤姆猫躺在地板上，张大嘴巴，似乎在大笑或大叫。杰瑞鼠在墙角处，先是倒挂，然后翻转身体，最后又倒挂，表情得意。汤姆猫的视线始终盯着杰瑞鼠，杰瑞鼠则在墙上晃动，显得非常调皮。",
    "E73.The.Missing.Mouse_scene029.mp4": "一只白色的小老鼠从蓝色柜子后面爬出来，走到柜子顶部，靠近一个熨斗。它先是好奇地观察熨斗，然后用爪子推动熨斗，导致熨斗翻倒，小老鼠被弹开，最终落在柜子顶部。",
    "E73.The.Missing.Mouse_scene030.mp4": "汤姆躺在地板上，一个熨斗从上方落下，压在他身上，他的身体逐渐被熨斗压扁，最终变成扁平状。",
    "E73.The.Missing.Mouse_scene031.mp4": "一只白色的小老鼠从蓝色橱柜的顶部跳下，消失在红色窗帘后面。",
    "E73.The.Missing.Mouse_scene033.mp4": "在厨房里，一只白老鼠拿着锤子，手里拿着一块饼干，站在一个绿色的饼干盒和一个红色的面包箱旁边。一只蓝猫从左侧出现，伸手去拿锤子，但老鼠迅速逃跑。猫追着老鼠，老鼠在地板上跳来跳去，猫则用爪子捂住眼睛，似乎在假装看不见。老鼠继续逃跑，最后躲进面包箱里，猫则站在原地，看起来很困惑。",
    "E73.The.Missing.Mouse_scene034.mp4": "在厨房里，杰瑞从椅子上跳下来，跑向水槽，不小心把水溅出来。汤姆从水槽后面探出头来，看着杰瑞。杰瑞站在水槽边，被水淋湿了，汤姆则露出愤怒的表情。杰瑞试图逃跑，但汤姆伸出手抓住了他，杰瑞被甩了出去。",
    "E73.The.Missing.Mouse_scene036.mp4": "在浴室里，汤姆猫用爪子抓住杰瑞鼠的尾巴，将他悬挂在镜子前。杰瑞鼠在镜子里的倒影与他互动，做出各种动作。汤姆猫表情愤怒，注视着杰瑞鼠。随后，汤姆猫松开杰瑞鼠，杰瑞鼠从镜子前跳开。",
    "E73.The.Missing.Mouse_scene037.mp4": "一只白色的小老鼠从门上的黄色猫眼孔中探出头来，四处张望。它突然惊慌失措，迅速缩回门内，猫眼孔随之出现裂痕。",
    "E73.The.Missing.Mouse_scene038.mp4": "夜晚，一只白色小老鼠在房子外的墙角处停下，抬头看着墙上的黄色门。突然，一只灰色大猫从门后出现，手里抓着一只棕色小老鼠，大猫晃动着小老鼠，然后转身离开。小老鼠看到后吓得四处逃窜，最终跑出了画面。",
    "E73.The.Missing.Mouse_scene039.mp4": "在夜晚的户外，汤姆猫试图抓住一只挂在电线杆上的棕色小动物，但失败了。随后，汤姆猫跑进屋内，躺在红色扶手椅上，拿起一本漫画书阅读，表情专注。",
    "E73.The.Missing.Mouse_scene040.mp4": "一只小老鼠用锤子砸碎了一个罐子，然后吃掉了里面的花生。这时，一只猫出现了，它拿起锤子追赶小老鼠，但小老鼠巧妙地躲开了。猫最终抓住了小老鼠，但小老鼠趁机逃脱了。",
    "E73.The.Missing.Mouse_scene041.mp4": "在一个房间里，汤姆猫拿着一只小白鼠走向鱼缸，他把小白鼠扔进鱼缸里，水花四溅。随后，汤姆猫又拿出一个搓衣板，把小白鼠放进搓衣板里，再把搓衣板放进鱼缸，继续制造水花。汤姆猫看起来很兴奋，但小白鼠在鱼缸里挣扎。",
    "E73.The.Missing.Mouse_scene042.mp4": "一只棕色的小老鼠站在窗台上，窗外是夜晚的景色，远处有房屋和树木。小老鼠面带微笑，举起一只前爪，似乎在向窗外挥手或打招呼。",
    "E73.The.Missing.Mouse_scene043.mp4": "在房间里，汤姆猫拿着一只小白鼠，表情惊恐。他将小白鼠放在地上，然后走向电话机，似乎在打电话求助或报告情况。整个场景充满了紧张和不安的氛围。",
    "E73.The.Missing.Mouse_scene044.mp4": "画面展示了一个房间的角落，左侧是一把红色的扶手椅，右侧是一个棕色的柜子，柜子上有一个半圆形的仪表盘，仪表盘的指针静止不动。柜子顶部放置着一个棕色的圆柱形物体，可能是收音机或音响设备的一部分。背景是蓝色的墙壁，整体氛围静谧，没有人物或动作出现。",
    "E73.The.Missing.Mouse_scene045.mp4": "在房间里，汤姆猫正在打电话，杰瑞鼠在鱼缸旁边。汤姆猫打电话时表情激动，随后他变得愤怒，抓住杰瑞鼠并将其扔出画面。",
    "E73.The.Missing.Mouse_scene046.mp4": "一只棕色的小老鼠站在窗台上，向外张望。它突然转身，从窗户跳了出去。一只灰色的猫从窗帘后出现，手里抓着一只白色的小老鼠，它得意地炫耀着自己的战利品，并做出夸张的舞蹈动作。突然，猫被一股力量击中，画面切换成色彩斑斓的抽象图案。",
    "E73.The.Missing.Mouse_scene047.mp4": "视频展示了一系列色彩斑斓的抽象图案和烟花效果。画面中出现了多种颜色的墨迹状图形，如红色、黄色、紫色、蓝色等，在不同背景上扩散或组合。同时，也有烟花在夜空中绽放，呈现出明亮的火花和光束。此外，部分画面中还出现了云朵图案，与色彩图形交织在一起，营造出梦幻般的视觉效果。整体风格抽象而富有艺术感。",
    "E73.The.Missing.Mouse_scene049.mp4": "在月夜下的废墟场景中，汤姆猫从岩石后探出头来，表情惊恐，四处张望。背景中有破碎的建筑和一个蓝色的碗及一个仪表盘。随后画面逐渐变暗，最终显示“THE END”字样。",
    "E73.The.Missing.Mouse_scene050.mp4": "视频展示了“THE END”字样，随后出现“An MGM Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”的字样。背景为红色，文字为白色和蓝色。"
}