{
    "15. The Bodyguard_scene001.mp4": "视频开始时显示黑色背景，右下角有数字“0110544170204083”。随后画面逐渐变亮，出现“Metro-Goldwyn-Mayer CARTOON”字样，下方标注“Color by Technicolor”，背景为深色，中央有一个红色圆形图案，内含一只咆哮的狮子形象。",
    "15. The Bodyguard_scene002.mp4": "这是一个米高梅动画片的开场画面，背景为红色，中央有一个圆形框架，里面是一只咆哮的狮子。下方写着“A METRO-GOLDWYN-MAYER CARTOON”和“COLOR BY Technicolor”。狮子在画面中不断张合嘴巴，表现出咆哮的动作。",
    "15. The Bodyguard_scene003.mp4": "视频展示了米高梅动画片《猫和老鼠》的片头，首先出现的是米高梅卡通的标志，随后是《猫和老鼠》的标题和主角汤姆与杰瑞的卡通形象。",
    "15. The Bodyguard_scene004.mp4": "这是一个《猫和老鼠》动画片的开场画面，背景是红色渐变的圆形图案。画面中央是主角汤姆猫和杰瑞鼠的卡通形象，汤姆猫张大嘴巴，杰瑞鼠在旁边笑着。下方是黄色的“TOM and JERRY”字样。随后，画面中出现“THE BODYGUARD”字样，以及“Directed by WILLIAM HANNA and JOSEPH BARBERA”的导演署名。",
    "15. The Bodyguard_scene005.mp4": "视频展示了《The Bodyguard》的片头，包括导演William Hanna和Joseph Barbera、动画师Kenneth Muse、Pete Burness、Ray Patterson和Irven Spence、音乐制作人Scott Bradley，以及制片人Fred Quimby的署名。随后画面转黑，接着出现一个场景，一只小猫在户外奔跑。",
    "15. The Bodyguard_scene006.mp4": "一只小老鼠在花园里奔跑，被一只猫从柱子后面扑出，猫摔倒在地。镜头切换到一个土豆标志，小老鼠从标志后跑出来，拿着标志跑开。",
    "15. The Bodyguard_scene007.mp4": "一只棕色的小老鼠从画面左侧跑来，停在木墙角处，抬头看向墙外，似乎在向某人展示或呼唤。背景中可见一株植物和一个紫色果实的招牌。",
    "15. The Bodyguard_scene008.mp4": "一只灰色的狗被关在一辆标有“DOG CATCHER CITY POUND”的红色卡车的笼子里，它用爪子抓着笼子，大声叫喊，要求被放出来。卡车在行驶中，狗在笼子里挣扎，试图逃脱。",
    "15. The Bodyguard_scene009.mp4": "一只棕色的小老鼠站在墙角，焦急地催促着什么，随后迅速跑开。",
    "15. The Bodyguard_scene010.mp4": "一只灰色的狗被关在一辆标有“DOG CATCHER CITY POUND”的红色卡车的笼子里，狗在笼子里挣扎。一只棕色的小老鼠从车旁跑过，对狗喊话，让狗到围栏上来。狗听从指示，逐渐停止挣扎。",
    "15. The Bodyguard_scene011.mp4": "一只小老鼠在红色卡车的门把手上玩耍，卡车里的斗牛犬透过窗户看着它，显得非常愤怒。小老鼠试图打开卡车门的插销，斗牛犬则不断咆哮并试图阻止它。小老鼠成功地将插销拉开，斗牛犬惊慌失措地向后倒去。",
    "15. The Bodyguard_scene013.mp4": "画面开始时，镜头从一扇黄色的门缓缓向右移动，门逐渐消失在画面中。随后，镜头聚焦于一片模糊的背景，逐渐清晰，展现出一个宁静的乡村场景。画面中央，一只灰色的狗躺在地上，似乎在休息或打盹。狗的周围是几棵树和一座房子，天空中飘着几朵云，整个场景显得非常平静和安详。",
    "15. The Bodyguard_scene015.mp4": "一只小老鼠从砖墙后跑出来，一只大猫从墙后跳出来，手里拿着盘子和餐具，张大嘴巴准备追捕小老鼠。小老鼠被吓到，转身逃跑，大猫则紧追不舍，最终大猫追到小老鼠，小老鼠被大猫抓住。大猫得意洋洋地拿着盘子和餐具，而小老鼠则被吓得四处逃窜。",
    "15. The Bodyguard_scene016.mp4": "一只棕色的小老鼠在砖墙前快速奔跑，它从画面左侧跑向右侧，途中经过一根木柱和一些绿色的藤蔓。小老鼠表情紧张，似乎在逃避什么，奔跑过程中身体前倾，四肢快速摆动，尾巴在身后摆动。背景是浅色的地面和红砖墙，画面整体色调温暖。",
    "15. The Bodyguard_scene017.mp4": "一只猫坐在地上，面前放着一块面包和两颗橄榄。一只老鼠突然从画面左侧跑出来，撞到了面包上，然后被夹在面包里。猫看到后非常惊讶，接着拿起刀叉，准备切开面包，但表情变得兴奋，似乎在享受这个意外的“美食”。",
    "15. The Bodyguard_scene018.mp4": "一只小猫被夹在两片面包中间，面包上放着两颗橄榄和一把刀叉。小猫试图从夹缝中挣脱，但无济于事，最终它闭上眼睛，似乎放弃了挣扎。",
    "15. The Bodyguard_scene019.mp4": "汤姆正在切一块三明治，突然一个大狗冲过来，把汤姆按在墙上，然后问汤姆“你没事吧，小家伙？”",
    "15. The Bodyguard_scene020.mp4": "一只棕色的小老鼠站在一个盘子上，盘子里有一块肉和两颗橄榄。小老鼠抬起一只前爪，似乎在挥手或打招呼，表情显得开心和自信。背景是简单的绿色。",
    "15. The Bodyguard_scene021.mp4": "一只灰色的斗牛犬用爪子抓住一只灰色的猫，威胁它如果它的朋友发生不测，就会撕碎它。猫看起来很害怕，斗牛犬则非常愤怒。",
    "15. The Bodyguard_scene022.mp4": "一只大狗用爪子按住一只小猫，把小猫压扁成一个扁平的形状，然后又慢慢松开，小猫恢复原状。",
    "15. The Bodyguard_scene023.mp4": "一只小老鼠在街边用木板吹口哨，一只大狗在旁边看着并鼓励它。小老鼠成功吹响口哨后，一只猫从邮筒后出现，惊讶地看着小老鼠。",
    "15. The Bodyguard_scene024.mp4": "一只棕色的小老鼠，背着两块木板，在沙滩上奔跑。它表情愤怒，步伐急促，似乎在逃避什么或追赶什么。背景是灰蓝色的天空和浅色的沙滩。",
    "15. The Bodyguard_scene025.mp4": "在邮筒旁，猫汤姆摆出各种夸张的姿势，包括伸展、挥拳、踢腿等，表现出愤怒和威胁的姿态。小老鼠杰瑞则站在一旁，手持木棍，表情坚定，似乎在挑衅或准备反击。整个场景充满了紧张和对峙的氛围。",
    "15. The Bodyguard_scene027.mp4": "汤姆猫靠在邮箱上，杰瑞鼠在旁边。突然，一个巨大的斗牛犬出现，挥拳向汤姆。汤姆被击中后挂在邮箱上，表情痛苦。随后，汤姆恢复镇定，露出得意的笑容，而杰瑞则在一旁兴奋地跳跃。",
    "15. The Bodyguard_scene028.mp4": "一只小老鼠在巨大的斗牛犬面前显得非常渺小，斗牛犬威胁地挥舞着拳头，但小老鼠毫不畏惧，反而自信地对斗牛犬说“无论何时只要叫我就来了，我的朋友。”斗牛犬被小老鼠的胆量所激怒，最终被小老鼠的机智和勇敢所击败。小老鼠成功逃脱，而斗牛犬则被小老鼠的机智和勇敢所击败。",
    "15. The Bodyguard_scene029.mp4": "在一条乡间小路上，汤姆猫手持水管追逐杰瑞鼠。杰瑞鼠灵活地奔跑，汤姆猫紧追不舍。当汤姆猫接近一个红色消防栓时，他试图用水管喷水，但杰瑞鼠巧妙地躲开，继续逃跑。汤姆猫的表情显示出他的愤怒和决心，而杰瑞鼠则显得机智和敏捷。背景是一棵大树和木栅栏，环境宁静，但充满了追逐的紧张感。",
    "15. The Bodyguard_scene030.mp4": "视频中，一只小老鼠从墙角跑出来，被一只大狗抓住。大狗把小老鼠放在自己胸前，小老鼠在大狗胸前挥舞着爪子。这时，一只灰猫拿着水管出现，对着大狗喷水。大狗被水喷得睁大眼睛，小老鼠在大狗胸前继续挥舞爪子。灰猫看到大狗被水喷得睁大眼睛，露出得意的笑容，伸手把小老鼠抱起来，小老鼠在灰猫怀里挣扎。",
    "15. The Bodyguard_scene031.mp4": "汤姆猫拿着水管，试图用它来吓唬或驱赶旁边的大狗。大狗看起来很生气，但没有采取行动。汤姆猫随后推着婴儿车，车里坐着一只小猫，他继续用水管对着大狗。大狗最终被汤姆猫的举动激怒，开始追赶他。汤姆猫成功地逃离了大狗的追捕。",
    "15. The Bodyguard_scene032.mp4": "汤姆猫推着婴儿车在人行道上行走，他一边走一边用烟斗吸烟。突然，他失去平衡，向前摔倒，婴儿车也随之翻倒，汤姆猫被甩了出去。",
    "15. The Bodyguard_scene033.mp4": "汤姆推着婴儿车，车里是杰瑞。汤姆突然抱起杰瑞，婴儿车被遗弃在原地。",
    "15. The Bodyguard_scene035.mp4": "灰色的猫汤姆用爪子抓着一只棕色的小老鼠杰瑞，汤姆表情凶狠，露出牙齿，眼睛闪烁着黄色的光芒，显得非常得意。杰瑞被紧紧抓住，看起来有些惊恐和无助，但仍然保持着镇定。背景是两个大型的金属垃圾桶，汤姆站在垃圾桶之间，显得非常自信和满足。汤姆的嘴角上扬，露出狡猾的笑容，似乎在庆祝自己的胜利。画面下方有中文字幕“现在你在我手上了。”",
    "15. The Bodyguard_scene036.mp4": "一只戴着红色蝴蝶结的白色小猫在户外的草地上行走，背景有树木和模糊的远处景物。小猫从画面左侧向右侧行走，步伐轻盈，尾巴高高翘起，显得活泼可爱。镜头跟随小猫移动，保持其在画面中央。",
    "15. The Bodyguard_scene037.mp4": "汤姆抱着一只小猫站在两个垃圾桶之间，抬头看着上方。一只斗牛犬从垃圾桶后探出头来，用两个垃圾桶盖子夹住汤姆的尾巴，汤姆被夹住后痛苦地挣扎，斗牛犬则得意地看着汤姆。斗牛犬放开了汤姆，汤姆掉落在地，斗牛犬则坐在垃圾桶上，问汤姆：“我做得不错吧，我的朋友？”",
    "15. The Bodyguard_scene038.mp4": "一只小老鼠站在一只大猫的背上，它举起一只手，似乎在向大猫打招呼或示意。随后，小老鼠从大猫身上跳下来，开始在地面上欢快地跳舞。大猫则躺在地上，眼睛睁得大大的，看起来很惊讶或困惑。背景是一个带有红色窗户和链条的建筑物。",
    "15. The Bodyguard_scene039.mp4": "汤姆猫在一家商店外，看到一个泡泡糖机，他试图用各种方法获取里面的泡泡糖。他先是用力摇晃机器，然后用爪子抓取，最后成功地从机器中取出了两颗泡泡糖。他高兴地举起泡泡糖，然后用其中一颗泡泡糖蘸取了旁边的浆糊，看起来非常开心。",
    "15. The Bodyguard_scene040.mp4": "一只棕色的小老鼠在街道上行走，它看起来很兴奋，不断挥舞着双臂，步伐轻快。背景是建筑物的墙角和深色的天空。",
    "15. The Bodyguard_scene041.mp4": "一只灰色的猫躺在地上，手里拿着一个红色的小球，它先是开心地笑着，然后把球放进嘴里，接着又拿出来，反复几次。最后，它闭上眼睛，似乎在享受这一刻的宁静。",
    "15. The Bodyguard_scene042.mp4": "一只棕色的小老鼠站在墙角，张开双臂，开心地大笑，口水从嘴角流下。",
    "15. The Bodyguard_scene043.mp4": "一只黑猫躺在地上，用牙齿拉扯一根细线，表情愉悦。",
    "15. The Bodyguard_scene044.mp4": "一只棕色的老鼠站在一个角落里，它张开嘴巴，露出牙齿，看起来非常兴奋或激动。它的前爪抬起，似乎在挥舞或打招呼。老鼠的表情变化丰富，从开心大笑到张嘴喊叫，再到露出牙齿的兴奋状态，显示出它情绪高涨。背景是深色的墙壁，老鼠站在浅色的地面上。整个画面充满了卡通风格的夸张和活力。",
    "15. The Bodyguard_scene045.mp4": "视频中，一只灰色的猫（汤姆）躺在地上，手里拿着一个黄色的物体，看起来像是一个蛋。它先是大笑，然后伸出手，把蛋递给一只棕色的小老鼠（杰瑞）。杰瑞起初有些犹豫，但最终还是接过了蛋。整个场景发生在室内，背景是一个红色的家具和灰色的墙壁。",
    "15. The Bodyguard_scene046.mp4": "一只棕色的小老鼠站在阴沉的天空下，手里拿着一个黄色的圆形物体。它先是看着物体，然后张开嘴似乎在喊叫，接着将物体扔向天空，同时举起一只手，脸上露出得意的笑容。随后，它继续挥舞着手臂，表情显得非常兴奋和满足。",
    "15. The Bodyguard_scene047.mp4": "一只灰色的猫蹲在地上，面对着一只棕色的小老鼠。猫伸出前爪，似乎在与老鼠互动，表情从疑惑变为微笑，然后又变得严肃。老鼠则站立着，伸出前爪，似乎在回应猫的动作。背景是一个室内环境，有木质的门框和墙壁。",
    "15. The Bodyguard_scene048.mp4": "一只灰色的猫站在窗边，先是张大嘴巴笑着，然后用爪子捂住嘴巴，眼睛眯起，露出得意的笑容。",
    "15. The Bodyguard_scene049.mp4": "一只棕色的小老鼠站在墙角，先是伸出前爪，似乎在打招呼或示意什么，然后它转过身，双手合十放在嘴边，做出吹气的动作，同时眼睛睁得很大，表情显得有些紧张或期待。背景是一面深色的墙壁，地面是浅色的。",
    "15. The Bodyguard_scene050.mp4": "猫汤姆趴在地板上，眼睛盯着小老鼠杰瑞，杰瑞站在汤姆面前，双手合十，似乎在请求汤姆。汤姆坐起身，双手合十，面带微笑，似乎在回应杰瑞。",
    "15. The Bodyguard_scene052.mp4": "一只灰色的猫和一只棕色的小老鼠在沙发上对峙。猫慢慢靠近老鼠，老鼠则表现出挑衅的姿态，最后老鼠突然跳起逃跑，猫愤怒地追了上去。",
    "15. The Bodyguard_scene053.mp4": "一只小老鼠在户外奔跑，途中撞倒了一个蓝色的铁砧，铁砧倒下后，小老鼠被压住，随后一只大猫从铁砧后面出现，将小老鼠压在铁砧下。",
    "15. The Bodyguard_scene055.mp4": "一只灰色的猫被一个蓝色的物体压住，猫在地上挣扎，最终被压成扁平状。一只棕色的小老鼠从旁边跑过，看着被压扁的猫，然后跑开。",
    "15. The Bodyguard_scene056.mp4": "一只棕色的小猫在花园里追逐一个绿色的球，它跑过草坪，跳过长条形的石板，然后在白色围栏边停下，低头嗅着地面，似乎在寻找什么。",
    "15. The Bodyguard_scene057.mp4": "一只棕色的小老鼠从墙上的一个小洞中探出头来，它先是好奇地向外张望，然后小心翼翼地将身体全部探出洞外，最后又缩了回去。",
    "15. The Bodyguard_scene058.mp4": "在花园里，汤姆猫拿着一块木板追赶一只小老鼠。他先是跳起来试图用木板击打老鼠，但没有成功。随后，他落地后又重新调整姿势，准备再次攻击。整个过程中，小老鼠一直向前跑动，而汤姆猫则显得非常兴奋和专注。背景中有花盆和绿色植物，环境宁静。",
    "15. The Bodyguard_scene059.mp4": "一只灰色的斗牛犬从木门后跑出来，沿着石板路向前奔跑，最终消失在画面右侧。",
    "15. The Bodyguard_scene060.mp4": "一只灰色的斗牛犬戴着红色项圈，正对着墙边的一只棕色小老鼠。斗牛犬先是兴奋地跳跃，然后停下，张大嘴巴，露出牙齿，似乎在对小老鼠说话。小老鼠则一直躲在墙后，只露出头部，表情紧张。背景是一堵白色的墙和一些绿色植物。",
    "15. The Bodyguard_scene061.mp4": "一只棕色的小猫从木栅栏的缝隙中探出头来，它先是伸展身体，然后缩回，接着又伸展，如此反复。",
    "15. The Bodyguard_scene062.mp4": "一只灰色的斗牛犬戴着红色项圈，趴在墙边，看着一只棕色的小老鼠。斗牛犬咧嘴笑着，似乎在和小老鼠说话，字幕显示“如果你需要我的话只要吹口哨就行了”。小老鼠则躲在墙后，警惕地看着斗牛犬。斗牛犬慢慢靠近小老鼠，小老鼠则向墙后退去，最后消失在画面中。",
    "15. The Bodyguard_scene063.mp4": "汤姆猫在花园里拿着一块木板，试图用它去追捕一只棕色的小老鼠。汤姆猫表情专注，用力挥动木板，但小老鼠只露出尾巴，迅速逃跑。汤姆猫随后跳起，试图用木板击打小老鼠，但小老鼠依然不见踪影。背景是白色的围栏和一些绿色植物，旁边有一个花盆，里面开着粉红色的花朵。",
    "15. The Bodyguard_scene064.mp4": "一只棕色的小老鼠从门后探出头来，随后门被撞开，露出一个绿色眼睛的怪物。",
    "15. The Bodyguard_scene065.mp4": "一只灰色的斗牛犬趴在门前，一只棕色的小老鼠从门后跳出来，它在斗牛犬面前蹦蹦跳跳，斗牛犬则看着它，表情从惊讶变为困惑。",
    "15. The Bodyguard_scene066.mp4": "一只小老鼠站在一只大狗面前，小老鼠不断挥舞着手臂，似乎在与大狗交流或表演，大狗则保持静止，表情略显困惑或惊讶。",
    "15. The Bodyguard_scene068.mp4": "一只棕色的小老鼠从木栅栏后面跑出来，在水泥地上快速奔跑。",
    "15. The Bodyguard_scene069.mp4": "一只棕色的老鼠从木墙的洞里跑出来，它先是惊慌地四处张望，然后开始吹泡泡糖，泡泡越来越大，最后把老鼠包裹在了泡泡糖里。",
    "15. The Bodyguard_scene070.mp4": "一只灰色的猫从木栅栏后探出头，然后迅速翻滚着跑开，最后在栅栏旁停下并抬头张望。",
    "15. The Bodyguard_scene071.mp4": "一只灰色的猫（汤姆）正在试图翻越一个木制围栏。它先是用爪子抓住围栏顶部，然后用力一跃，但似乎没有成功，身体悬空，表情显得惊讶和困惑。接着，它似乎被什么东西击中，身体变形，表情痛苦，最后它恢复原状，张大嘴巴，看起来非常震惊和不满。",
    "15. The Bodyguard_scene072.mp4": "一只棕色的小猫在木栅栏前奔跑，它撞上了一个透明的大泡泡，泡泡破裂后，小猫被弹飞出去，最终消失在画面中。",
    "15. The Bodyguard_scene073.mp4": "一只黑色的猫在风中奔跑，被风吹得头发和衣服飘动，它撞倒了木栅栏，随后被风吹得飞了起来，最后落在草地上，双手抱头，表情痛苦。",
    "15. The Bodyguard_scene074.mp4": "一只棕色的小老鼠站在木屋前的草地上，双手捂住嘴巴，眼睛睁得大大的，看起来非常惊讶或害怕。它随后跳起来，身体悬在空中，仍然保持着双手捂嘴的姿势。背景是模糊的树木和天空，地面有几处泥泞的痕迹。",
    "15. The Bodyguard_scene075.mp4": "一只灰色的猫在草地上挖洞，然后用石头砸自己，最后躺在地上大笑。",
    "15. The Bodyguard_scene076.mp4": "汤姆猫坐在一个土坑里，手里拿着一支红色铅笔，正在写一份遗嘱。他写的内容是“我，汤姆，将把我的全部财产留给慈善团体汤姆留”。写完后，他显得非常生气和不满，把遗嘱纸扔到地上。",
    "15. The Bodyguard_scene077.mp4": "汤姆躺在墓碑旁，手里拿着一朵黄色的花，脚边放着一份遗嘱。他先是露出痛苦的表情，随后表情逐渐变得平静和满足，最后闭上眼睛，似乎在安详地休息或沉思。",
    "15. The Bodyguard_scene078.mp4": "一只棕色的小老鼠站在户外，背景是木屋和树木。它先是双手合十，表情紧张，随后张大嘴巴，似乎在惊呼或尖叫。地面有几处粉色的污渍。",
    "15. The Bodyguard_scene079.mp4": "汤姆猫躺在草地上，手里拿着一朵黄色的花，旁边有一块墓碑和一张写着“MY”的纸。他先是看着花，然后抬头看向墓碑，表情悲伤。画面下方出现中文字幕“抓狗处”。",
    "15. The Bodyguard_scene080.mp4": "一辆标有“DOG CATCHER”（抓狗处）字样的红色卡车在街道上行驶，背景是树木和房屋。",
    "15. The Bodyguard_scene081.mp4": "一只灰色的斗牛犬被关在红色的笼子里，它透过黄色的栅栏向外看，表情显得有些沮丧和无奈。背景是模糊的户外环境，有树木和房屋。",
    "15. The Bodyguard_scene082.mp4": "一辆标有“DOG CATCHER”的红色卡车在街道上行驶，车后部装有栅栏，里面关着一只狗。一只棕色的小老鼠从右侧跑过，卡车继续前行。随后，一只灰色的猫从右侧冲出，追逐小老鼠，猫在追逐过程中撞上了卡车，导致卡车颠簸。猫继续追赶小老鼠，最终画面通过一个圆形的镜头逐渐变暗，最后显示“The End”。",
    "15. The Bodyguard_scene083.mp4": "视频显示了“THE END”字样，随后逐渐出现“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。",
    "15. The Bodyguard_scene084.mp4": "视频开始时显示了“MGM Tom and Jerry Cartoon”字样，背景为深红色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑，持续数秒。整个片段没有其他视觉内容或动作。"
}