{
    "E69.Fit.to.Be.Tied_scene001.mp4": "视频开始时为全黑画面，随后出现米高梅卡通的标志，标志中有一只咆哮的狮子，下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”。背景为深红色。",
    "E69.Fit.to.Be.Tied_scene002.mp4": "这是一个米高梅动画片头，背景为红色，中央是一个蓝色圆形框，框内是一只咆哮的狮子。下方有文字“A Metro-Goldwyn-Mayer CARTOON”，底部标注“COLOR BY TECHNICOLOR”。狮子在画面中不断张合嘴巴，做出咆哮的动作。",
    "E69.Fit.to.Be.Tied_scene003.mp4": "视频开始时显示了米高梅动画公司的标志，随后画面转黑，最后出现了《猫和老鼠》的标题画面。",
    "E69.Fit.to.Be.Tied_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景是红色渐变的圆形图案，中央是猫汤姆和老鼠杰瑞的卡通形象，汤姆张大嘴巴，杰瑞则显得活泼好动。画面下方是黄色的“TOM and JERRY”字样，随后出现标题“FIT TO BE TIED”以及导演威廉·汉纳和约瑟夫·巴伯拉的名字。整个画面色彩鲜艳，充满动感和幽默感。",
    "E69.Fit.to.Be.Tied_scene005.mp4": "视频片段展示了动画片《Fit to Be Tied》的片头。首先出现的是标题画面，背景为深绿色，标题“FIT TO BE TIED”以橙色大字呈现，上方有一个房子轮廓，下方有一条链子连接着一个狗的轮廓。接着，画面切换到导演信息，显示由William Hanna和Joseph Barbera执导。随后，动画师和音乐制作人的名字依次出现，包括Kenneth Muse、Irven Spence、Ray Patterson、Ed Barge和Scott Bradley。最后，画面显示制片人Fred Quimby的名字，并逐渐淡出至黑色。整个片头以简洁的动画风格呈现，背景音乐和视觉效果营造出经典动画片的氛围。",
    "E69.Fit.to.Be.Tied_scene006.mp4": "一只戴着红色项圈的棕色斗牛犬在人行道上开心地奔跑，背景是黄色的墙壁和绿色的灌木丛。",
    "E69.Fit.to.Be.Tied_scene007.mp4": "一个蓝色陀螺在石板路上，一只戴着红色项圈的棕色狗走近并用脚踩向陀螺，踩踏时地面出现红色闪电效果。",
    "E69.Fit.to.Be.Tied_scene008.mp4": "一只棕色的斗牛犬在户外的水泥地上跳跃，它张大嘴巴，看起来非常兴奋或开心。背景是蓝天、树木和一栋黄色的房子。",
    "E69.Fit.to.Be.Tied_scene009.mp4": "一只老鼠从一个拱形的黄色门后探出头来，然后迅速跑出洞外，消失在画面中。",
    "E69.Fit.to.Be.Tied_scene010.mp4": "一只棕色的斗牛犬躺在草地上，右后腿上钉着一颗蓝色的钉子。它不断挥舞着右前爪，表情痛苦。一只棕色的老鼠从画面右侧跑来，它拿着一把红色的锤子，准备敲击狗腿上的钉子。",
    "E69.Fit.to.Be.Tied_scene011.mp4": "一只老鼠正用双手举着一个红色的锤子，试图将锤子的头部塞进一个巨大的棕色脚趾的缝隙中。锤子的头部已经部分插入脚趾，老鼠的表情显得非常用力，似乎在努力完成这个任务。背景是蓝色的，底部有一条浅色的砖墙边缘。",
    "E69.Fit.to.Be.Tied_scene014.mp4": "一只小老鼠在墙角行走，一只大狗出现并递给小老鼠一个铃铛。小老鼠接过铃铛，大狗开心地摇晃身体，小老鼠则背着铃铛继续前行。",
    "E69.Fit.to.Be.Tied_scene015.mp4": "一只蓝灰色的猫躺在地上，眼睛半闭，似乎在打盹或休息。背景是晴朗的蓝天和远处的房屋与树木。猫的姿势放松，表情慵懒。",
    "E69.Fit.to.Be.Tied_scene016.mp4": "一只棕色的斗牛犬从黄色墙壁后跑出，然后消失在墙后。",
    "E69.Fit.to.Be.Tied_scene017.mp4": "一只老鼠背着铃铛在路上奔跑，被猫发现后，猫用铃铛敲击一个红色杯子，老鼠用拳头击打杯子，猫被击中后倒地。",
    "E69.Fit.to.Be.Tied_scene018.mp4": "一个街边的糖果机前，汤姆猫突然出现，他先是被糖果机的顶部吸引，接着被糖果机的顶部吸住，最后被糖果机的顶部吸住后倒在地上，糖果机的顶部还停留在他的头上。",
    "E69.Fit.to.Be.Tied_scene019.mp4": "视频中展示了一个装满彩色弹珠的扭蛋机，随着弹珠不断掉落，扭蛋机内部逐渐显露出一只灰色的猫的脸，猫的眼睛由彩色弹珠组成，最终弹珠全部掉落，猫的眼睛变成黄色，表情显得惊讶和好奇。",
    "E69.Fit.to.Be.Tied_scene020.mp4": "一个装在玻璃球里的汤姆猫，随后画面变黑，接着出现一扇门。",
    "E69.Fit.to.Be.Tied_scene021.mp4": "汤姆穿着黑色礼服，端着一个装有多个盖碗食物的托盘，从一扇门后走出，小心翼翼地向前走动，经过一扇窗户。",
    "E69.Fit.to.Be.Tied_scene022.mp4": "一只穿着黄色衣服的老鼠在床上伸懒腰，一只穿着黑色西装、戴着白手套的猫端着托盘走进房间，将盘子上的食物一一摆放在桌子上。老鼠看到食物后，兴奋地爬下床，伸手去按床头的铃铛，猫看到后露出得意的笑容。",
    "E69.Fit.to.Be.Tied_scene023.mp4": "一只老鼠坐在沙发上，手里拿着一个铃铛，面前的桌子上放着一块奶酪。它先是摇晃铃铛，然后放下铃铛，拿起奶酪，开心地吃了起来。吃着吃着，奶酪突然变成了一只老鼠的形状，老鼠惊讶地看着自己。",
    "E69.Fit.to.Be.Tied_scene024.mp4": "汤姆猫坐在餐桌前，面前有一个盖着蓝色餐罩的盘子。他先是整理了一下桌上的餐巾，然后拿起报纸阅读。阅读过程中，汤姆的表情从专注逐渐变得兴奋，眼睛睁大，嘴巴张开，似乎看到了什么令人惊喜的内容。背景是蓝色的墙壁和一个烛台，桌上还摆放着其他餐具。",
    "E69.Fit.to.Be.Tied_scene025.mp4": "视频展示了一份报纸的特写，标题为“LEASH LAW PASSED”，副标题是“PUBLIC SAFETY PUTS DOGS ON LEASH”。报纸上有一幅卡通插图，描绘了三只狗被拴着绳子，下方文字写着“It Shouldn't Happen to a Dog...say Dogs”。背景为蓝色。",
    "E69.Fit.to.Be.Tied_scene027.mp4": "视频开始于一个户外场景，一只狗从狗屋里探出头，随后迅速缩回。接着，场景切换到室内，汤姆猫拿着一卷纸走进房间，看到杰瑞鼠在床上拿着铃铛。汤姆猫举起手，似乎在与杰瑞互动，而杰瑞则摇晃铃铛，制造声响。汤姆猫保持微笑，似乎在享受这个场景。",
    "E69.Fit.to.Be.Tied_scene028.mp4": "一只棕色的小老鼠坐在地上，用前爪握着一个黄色的大铃铛。它先是眯着眼睛，然后睁开眼睛，露出微笑，接着又眯起眼睛，最后用力摇晃铃铛，铃铛发出“叮当”声。背景是绿色的地面，上方有一条红色的线条。",
    "E69.Fit.to.Be.Tied_scene029.mp4": "在一间卧室里，汤姆猫手持卷纸，向床上的杰瑞鼠挥手。杰瑞鼠在床上拿着一个铃铛。汤姆猫挥动卷纸后，卷纸展开，杰瑞鼠被惊起。汤姆猫随后端着一个托盘，上面放着四个铃铛，走向杰瑞鼠。",
    "E69.Fit.to.Be.Tied_scene030.mp4": "一只老鼠在四个铃铛前跳跃，用爪子抓住并摇晃铃铛，随后拿起两个铃铛飞走。",
    "E69.Fit.to.Be.Tied_scene031.mp4": "一只小老鼠拿着一个铃铛跑进房间，然后用力摇响铃铛，惊动了正在睡觉的猫。猫被惊醒后，愤怒地追击小老鼠，但小老鼠机智地躲藏起来，猫最终没有抓到它。",
    "E69.Fit.to.Be.Tied_scene032.mp4": "一只老鼠从墙后跑出，拉着一根绳子，绳子另一端系在一只躺着的斗牛犬身上。老鼠试图用绳子套住斗牛犬，但斗牛犬不动。随后，猫汤姆出现，抓住绳子，斗牛犬被拉起来并张开嘴咆哮。汤姆拿出一根水管，将水管放进斗牛犬的嘴里，斗牛犬开始喝水，最终停止了咆哮。",
    "E69.Fit.to.Be.Tied_scene033.mp4": "一只戴着带刺项圈的棕色斗牛犬，先是露出愤怒的表情，张大嘴巴露出牙齿，随后牙齿突然碎裂，最后表情变得惊恐。",
    "E69.Fit.to.Be.Tied_scene035.mp4": "一只棕色的斗牛犬正举着一件黑色的猫皮衣服，突然一只穿着红色衣服的猫从衣服里钻出来，斗牛犬被吓了一跳，随后被猫用尾巴抽打，斗牛犬惊慌失措地向后退去。",
    "E69.Fit.to.Be.Tied_scene036.mp4": "在绿色的草坪上，杰瑞从窗户跳出来，迅速跑过几个障碍物。汤姆拿着槌球棒，先是惊讶地看着杰瑞，然后变得愤怒，挥动球棒试图击打杰瑞，但最终没有击中。",
    "E69.Fit.to.Be.Tied_scene037.mp4": "一只老鼠从左侧跑来，撞倒了右侧的积木塔，导致黄色的铃铛掉落。老鼠被铃铛砸中后倒地，随后铃铛被一只猫的手捡起。",
    "E69.Fit.to.Be.Tied_scene038.mp4": "汤姆猫在户外拿着一个铃铛，然后进入室内，坐在椅子上继续摇铃铛。",
    "E69.Fit.to.Be.Tied_scene039.mp4": "汤姆猫坐在椅子上，手握铃铛，面前的桌子上放着一个托盘，托盘上有盖碗、茶壶和一份报纸。汤姆猫的表情从放松逐渐变得警觉，似乎在等待什么或准备采取行动。",
    "E69.Fit.to.Be.Tied_scene040.mp4": "一只棕色的小老鼠在桌下伸展身体，背景是色彩鲜艳的餐具和器皿。镜头逐渐拉近，聚焦于桌上的物品，小老鼠逐渐淡出画面。",
    "E69.Fit.to.Be.Tied_scene041.mp4": "汤姆猫坐在餐桌前，用铃铛召唤服务员，然后掀开盖子，露出一只鸡腿，他高兴地吃了起来。",
    "E69.Fit.to.Be.Tied_scene042.mp4": "一只小老鼠从桌子底下爬出来，它先是惊慌地四处张望，然后走向一份报纸，用爪子展开报纸并开始阅读。背景中有一个黄色的咖啡壶和一个金色的烛台。",
    "E69.Fit.to.Be.Tied_scene043.mp4": "报纸头条显示“LEASH LAW LIFTED”，副标题为“HAPPY HOUNDS HAIL FREEDOM”，下方还有“NO STRINGS ON DOGS”、“DOGS FREE TO ROAM”和“CITIZENS’ PROTEST FORCES LIFTING OF BAN”等小标题。背景为蓝色。",
    "E69.Fit.to.Be.Tied_scene044.mp4": "一只棕色的小老鼠站在一张白色的桌子上，它正在卷起一张白色的纸。桌子上还有一个黄色的壶放在一个金色的托盘上，背景是蓝色的墙和一个金色的吊灯。小老鼠卷好纸后，把纸卷放在了壶旁边，然后离开了画面。",
    "E69.Fit.to.Be.Tied_scene046.mp4": "视频显示了“THE END”字样，随后逐渐过渡到“An MGM Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。",
    "E69.Fit.to.Be.Tied_scene047.mp4": "视频展示了米高梅动画《猫和老鼠》的片头标志，背景为深红色，标志以蓝色字体呈现，下方标注“在好莱坞，美国制作”。随后画面转为全黑。"
}