{
    "E111.Royal.Cat.Nap_scene001.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面。",
    "E111.Royal.Cat.Nap_scene002.mp4": "视频展示了《猫和老鼠》动画片的片头。首先，画面中出现三个彩色矩形框，中间是“TOM and JERRY”的标题，左侧是猫汤姆的形象，右侧是老鼠杰瑞的形象。随后，标题变为“Royal Cat Nap”，并出现“IN CINEMASCOPE”的字样。接着，画面显示了制作人员名单，包括动画师、布局师、背景师和音乐师等。最后，画面显示了制片人和导演的名字：Joseph Barbera 和 William Hanna。整个片头背景为深紫色，带有纹理效果，营造出一种复古和华丽的氛围。",
    "E111.Royal.Cat.Nap_scene003.mp4": "镜头从一个红色的碗开始，逐渐向右移动，展示了一个华丽的房间。房间里有壁炉、吊灯、两把椅子和一张桌子。镜头继续向右移动，最终聚焦在一张四柱床上，床上躺着一位戴着皇冠、盖着紫色被子的国王，他正在睡觉。",
    "E111.Royal.Cat.Nap_scene004.mp4": "一位戴着皇冠的红发女性角色躺在床上，盖着紫色被子，似乎在睡觉。镜头逐渐向右移动，展示床边的木制床头柜，上面放着一块奶酪、一个绿色杯子和一篮水果，包括葡萄、香蕉和一个红色水果。最后，一只戴着紫色帽子的小老鼠从床头柜右侧爬出，出现在画面中。",
    "E111.Royal.Cat.Nap_scene006.mp4": "一只戴着厨师帽的老鼠悄悄靠近一块奶酪，然后躲进奶酪后面。接着，老鼠从奶酪的孔洞中探出头来，用一根细针在奶酪顶部戳了一个洞，然后从洞里钻出来，手里拿着一个黄色的杯子。老鼠把杯子放在奶酪上，然后用针在奶酪上戳了一个洞，最后从洞里钻出来，手里拿着一个黄色的杯子。",
    "E111.Royal.Cat.Nap_scene007.mp4": "一只穿着蓝色斗篷、戴着黄色帽子的老鼠，手持一把剑，正在试图刺破一串蓝色气球。它连续刺向气球，但气球不断弹开，最终老鼠被气球拉扯着撞向一个绿色的杯子，摔倒在地。",
    "E111.Royal.Cat.Nap_scene008.mp4": "一只戴着紫色帽子的棕色小熊从一块大奶酪中探出头来，手里拿着一根插着黄色小圆饼的棍子，表情专注地盯着前方。背景是紫色的幕布，奶酪放在蓝色的盘子上。",
    "E111.Royal.Cat.Nap_scene009.mp4": "一个戴着皇冠、有着红色长发的卡通角色躺在床上睡觉。一个蓝色的球从上方落下，轻轻触碰角色的鼻子，角色打了个哈欠，随后继续睡觉。角色的脸部逐渐变紫，似乎在做梦。",
    "E111.Royal.Cat.Nap_scene010.mp4": "杰瑞戴着紫色帽子，从一块大奶酪中探出头，手持一把剑，表情自信。随后，他从奶酪中跳出来，挥舞着剑，显得非常兴奋和得意。背景是紫色的幕布，场景看起来像是在舞台上。",
    "E111.Royal.Cat.Nap_scene011.mp4": "一个戴着皇冠的紫色角色躺在床上，一只穿着蓝色围裙和紫色帽子的小老鼠爬到床上，用爪子抓住紫色角色的鼻子，然后把鼻子拉长，紫色角色被逗笑。",
    "E111.Royal.Cat.Nap_scene012.mp4": "一只穿着蓝色围裙、头戴黄色帽子的小老鼠站在一盘葡萄和苹果前，另一只戴着厨师帽、手持黄色铃铛的棕色老鼠跑过来，小老鼠转身逃跑，撞倒了一个绿色杯子，杯子破碎，碎片四溅。",
    "E111.Royal.Cat.Nap_scene013.mp4": "一位戴着皇冠的红发女性角色躺在床上，她先是闭着眼睛，随后突然睁开眼睛，表情显得惊讶或警觉。她穿着白色睡衣，盖着紫色被子，背景是装饰华丽的床头板。",
    "E111.Royal.Cat.Nap_scene014.mp4": "一只小老鼠从破碎的绿色茶壶中探出头来，旁边有一只戴着皇冠、长着长鼻子的国王角色。随后，另一只穿着蓝色围裙、戴着厨师帽的小老鼠拿着一把小刀出现，站在茶壶上，似乎在与茶壶里的老鼠互动。最后，茶壶里的老鼠被吓跑，茶壶里只剩下空荡荡的壶身。背景中有一个装满水果的碗。",
    "E111.Royal.Cat.Nap_scene015.mp4": "一位戴着皇冠、穿着白色睡衣的红发女性角色在床上打哈欠。她用一只手捂住嘴，另一只手伸展，表情显得非常困倦。背景是装饰华丽的卧室，床头有雕刻图案，窗帘是棕色的。整个画面呈现出一种卡通风格，色彩鲜艳。",
    "E111.Royal.Cat.Nap_scene016.mp4": "汤姆穿着红色斗篷和黑色帽子，从门后跑出来，跳过桌子，继续在房间里奔跑。",
    "E111.Royal.Cat.Nap_scene017.mp4": "在一个华丽的宫殿房间里，一位戴着皇冠、穿着白色衣服的红发女人（可能是女王）坐在床上，她正在生气地大声说话，同时嘴里叼着一根胡萝卜。她面前的床上躺着一只穿着红色和黄色衣服、戴着黑色帽子的灰色猫（可能是汤姆），猫看起来很惊讶或害怕，用手捂着耳朵。女王的情绪激动，动作夸张，似乎在责骂或命令猫。猫则显得无助，试图躲避女王的怒火。整个场景充满了戏剧性和幽默感。",
    "E111.Royal.Cat.Nap_scene018.mp4": "动画角色汤姆穿着红色斗篷和黑色帽子，手持黄色权杖，表情自信，背景有白云飘过。",
    "E111.Royal.Cat.Nap_scene019.mp4": "两只老鼠从桌子底下爬出来，趴在桌子上，互相看着对方，然后开心地笑了。",
    "E111.Royal.Cat.Nap_scene021.mp4": "一只穿着蓝色围裙、戴着紫色帽子的小老鼠站在桌子上，手里拿着一块奶酪。突然，一只穿着红色衣服、戴着黑色帽子的猫从画面左侧出现，用一根蓝色的绳子绑住小老鼠的手腕。小老鼠被拉得向后退去，猫则一脸愤怒地看着它。随后，小老鼠跑向桌子另一侧，拿起一个巨大的粉红色水壶，用力推倒了它，然后迅速跑开。",
    "E111.Royal.Cat.Nap_scene022.mp4": "汤姆戴着厨师帽，穿着红色围裙，表情夸张地张大嘴巴，似乎在大声喊叫。杰瑞站在他对面，戴着紫色帽子，穿着蓝色围裙，手里拿着一个黄色的物体，看起来像是在挑衅或与汤姆互动。背景是紫色的窗帘，场景可能是在厨房或舞台。",
    "E111.Royal.Cat.Nap_scene023.mp4": "汤姆穿着厨师服装，躺在地上，用剑挑起一个粉红色的花瓶，花瓶悬在空中。汤姆表情专注，似乎在努力保持平衡，同时观察花瓶的动态。背景是装饰华丽的房间，有金色的门和墙饰。",
    "E111.Royal.Cat.Nap_scene024.mp4": "两只穿着厨师服的老鼠正在搬运一个装满彩色餐具的紫色大盘子。它们从盘子两侧用力推拉，导致盘子在空中晃动，餐具也随之摇摆。背景是带有花纹的墙壁和装饰性的木制边框。",
    "E111.Royal.Cat.Nap_scene025.mp4": "在华丽的宫殿内，穿着红色披风和黑色高帽的汤姆从门后冲出，手持剑和酒杯，表演着杂耍。他用脚尖平衡着多个盘子和杯子，同时挥舞着剑，展示高超的技艺。随着表演进行，他不断调整姿势，保持平衡，最终被一个身穿盔甲的角色打断，汤姆匆忙退场。",
    "E111.Royal.Cat.Nap_scene026.mp4": "视频展示了一个卡通场景，背景是一座城堡和自然风光。一个穿着红色斗篷、戴着白色假发的猫角色，正在路上表演杂耍，手持多个叠放的杯子和盘子。突然，他失去平衡，所有杯子和盘子飞散开来，砸在地上破碎。整个过程充满喜剧效果。",
    "E111.Royal.Cat.Nap_scene027.mp4": "一个卡通风格的城堡坐落在水中央，周围是绿色的草地和树木。城堡有多个尖顶塔楼，上面飘扬着彩色旗帜。一条小路通向城堡的大门。一个黑色的小人从远处跑来，穿过小路，到达城堡门前，然后城堡的大门缓缓打开。",
    "E111.Royal.Cat.Nap_scene028.mp4": "一只小老鼠穿着厨师服，戴着紫色帽子，正用扫帚清扫地上的钉子。它一边扫一边开心地笑着，钉子被扫成一堆。背景是棕色的窗帘和门框。",
    "E111.Royal.Cat.Nap_scene029.mp4": "动画片段中，穿着超级英雄服装的汤姆猫从门后冲出，他戴着黑色帽子，披着红黄相间的斗篷，表情自信。他一边跑一边摆出英雄姿势，手中拿着一把小锤子，周围地板上散落着许多钉子。背景是装饰华丽的室内场景，有金色的椅子和窗帘。",
    "E111.Royal.Cat.Nap_scene030.mp4": "视频展示了一个卡通风格的场景，背景是一座城堡，周围有河流和山脉。画面中，一只穿着红色斗篷、戴着黑色帽子的猫（汤姆）从城堡前跑出来，他摆出各种夸张的姿势，看起来非常自信和得意。随后，他继续向前奔跑，最终消失在画面中。整个场景色彩鲜艳，充满童话氛围。",
    "E111.Royal.Cat.Nap_scene031.mp4": "一座城堡坐落在水边，周围是绿色的田野和山脉。城堡有多个尖顶塔楼，上面飘扬着彩色的旗帜。一条小路通向城堡的大门，一个黑色的小人沿着小路跑向城堡。镜头逐渐拉近，小人跑进城堡。",
    "E111.Royal.Cat.Nap_scene032.mp4": "一个穿着蓝色盔甲的骑士站在门口，地上散落着许多钉子。汤姆穿着红色斗篷和蓝色靴子，从门口爬进来，他小心翼翼地避开地上的钉子，然后站直身体，环顾四周。",
    "E111.Royal.Cat.Nap_scene033.mp4": "杰瑞躲在一块奶酪上，突然奶酪上的洞里冒出一个蜡烛，杰瑞被吓跑。汤姆穿着厨师服，戴着厨师帽，看到奶酪后愤怒地瞪着它，然后被吓了一跳，最后露出得意的笑容。",
    "E111.Royal.Cat.Nap_scene034.mp4": "一个戴着皇冠的红发人物正在床上睡觉，汤姆猫穿着超级英雄服装，戴着黑色帽子，从上方俯视并伸出舌头舔了舔这个人物的脸，然后收回舌头，汤姆猫看起来很得意。",
    "E111.Royal.Cat.Nap_scene035.mp4": "画面中，汤姆猫穿着服务员制服，戴着帽子，手里拿着两个酒瓶塞，站在一张摆有金色盖子的盘子、酒杯和酒瓶的桌子旁。他先是将酒瓶塞放在桌上，然后拿起两个酒瓶塞，仔细端详，表情专注。背景是紫色的帷幕和金色的装饰。",
    "E111.Royal.Cat.Nap_scene036.mp4": "视频中，一个穿着盔甲的蓝色机器人正在房间里跳舞，动作夸张而滑稽。随后，一只穿着红色斗篷、戴着黑色帽子的猫（汤姆）从左侧进入画面，他手持一把剑，面带微笑，似乎在欣赏机器人的舞蹈。机器人继续跳舞，动作幅度很大，而猫则站在一旁，保持着轻松的姿态。整个场景充满了幽默和卡通风格。",
    "E111.Royal.Cat.Nap_scene037.mp4": "汤姆穿着红色背心和黑色帽子，站在一个身穿盔甲的角色旁边。盔甲角色的头盔里有一只戴着粉色帽子的小老鼠。汤姆先是看着盔甲角色，然后伸出手指指向它，接着用手指轻触自己的脸颊，最后又指向盔甲角色。小老鼠在头盔里四处张望。",
    "E111.Royal.Cat.Nap_scene038.mp4": "一个戴着皇冠、红发的卡通人物躺在床上，双眼闭合，似乎在睡觉。她的鼻子和耳朵上各有一个蓝色的物体，可能是玩具或装饰品。她穿着白色的衣服，被子是蓝紫色的，背景是浅蓝色的床单。人物的表情放松，偶尔微微动一下，但整体保持睡眠状态。",
    "E111.Royal.Cat.Nap_scene039.mp4": "一只穿着骑士服装的猫挥剑击打另一只穿着盔甲的猫，盔甲猫被击中后头盔脱落，露出里面的小老鼠，小老鼠被击飞出去。",
    "E111.Royal.Cat.Nap_scene040.mp4": "一个戴着皇冠、鼻子上插着衣夹的红发人物正在睡觉，一只穿着蓝色衣服的小老鼠悄悄爬到他脸上，把衣夹夹在他的鼻子上，然后退到一旁观察。",
    "E111.Royal.Cat.Nap_scene041.mp4": "在华丽的室内场景中，穿着红色披风和黑色帽子的猫（汤姆）手持长剑，与穿着蓝色盔甲、头戴紫色帽子的老鼠（杰瑞）进行剑术对决。杰瑞被剑刺中后飞起，但迅速调整姿势，重新站稳并继续与汤姆对峙。汤姆则表现出专注和自信，剑尖指向杰瑞，准备继续进攻。整个场景充满动感和紧张气氛，展现了经典卡通中的追逐与对抗。",
    "E111.Royal.Cat.Nap_scene042.mp4": "猫穿着斗篷和帽子，手里拿着一个黄色的盘子，盘子上有一只穿着蓝色衣服和紫色帽子的小老鼠。小老鼠坐在盘子上，用手指指向猫。猫的表情从平静变为愤怒。背景是粉色的墙壁和黄色的门框。",
    "E111.Royal.Cat.Nap_scene043.mp4": "视频中，一位戴着皇冠、睡在床上的国王被三个衣夹夹住鼻子，随后他挣扎着将衣夹甩掉，但鼻子上还残留着两个衣夹。接着，一只穿着礼服、戴着帽子的猫（汤姆）出现在床边，开始用小提琴演奏音乐。随着音乐声，国王逐渐放松并睡得更香。汤姆继续演奏，国王则沉浸在音乐中，脸上露出满足的表情。最后，汤姆停止演奏，国王依然在睡梦中。",
    "E111.Royal.Cat.Nap_scene044.mp4": "两个小老鼠穿着蓝色衣服，戴着帽子，从一扇半开的门后跑出来，随后一只穿着红色斗篷、戴着帽子、手持剑的猫从门后冲出来，抓住门把手，准备进入房间。",
    "E111.Royal.Cat.Nap_scene045.mp4": "一只穿着红色斗篷和黑色帽子的猫从门后跑出来，手里拿着一根棍子，表情兴奋，似乎在庆祝或表演。背景是华丽的室内装饰，有金色的门和花纹墙纸。",
    "E111.Royal.Cat.Nap_scene046.mp4": "汤姆穿着红色斗篷和黑色帽子，用钥匙试图打开一扇双开门。他用力转动钥匙，但门没有打开，他显得有些沮丧。",
    "E111.Royal.Cat.Nap_scene047.mp4": "一只穿着红色和黄色服装、戴着黑色帽子的猫，高举着一把金色钥匙，表情兴奋，随后闭上眼睛享受，最后睁开眼睛露出得意的表情。",
    "E111.Royal.Cat.Nap_scene048.mp4": "一只穿着紫色帽子和蓝色披风的小老鼠，正用前爪紧紧抓住一把绿色椅子的腿，从椅子下方悄悄地向前移动。背景是粉色墙壁和木质家具，老鼠小心翼翼地避开椅子腿，似乎在躲避什么或进行某种秘密行动。",
    "E111.Royal.Cat.Nap_scene049.mp4": "一只穿着蓝色衣服、戴着黄色帽子的小老鼠站在一张绿色桌子上，面前是一把弩。小老鼠先是向左走，然后走到门边，用鼻子推了一下门上的钥匙孔，接着转身走向弩，爬上弩的横梁，用力拉紧弩弦，准备发射。",
    "E111.Royal.Cat.Nap_scene050.mp4": "猫穿着红色斗篷和黑色帽子，站在镜子前整理帽子。突然，一支箭从背后射来，插在他斗篷上。猫惊讶地转过身，看到箭后，他迅速拔出箭，然后得意地摆出姿势，仿佛在炫耀自己的英勇。",
    "E111.Royal.Cat.Nap_scene051.mp4": "汤姆穿着红色斗篷和黑色帽子，用尽全力推一扇门，表情显得非常吃力。",
    "E111.Royal.Cat.Nap_scene052.mp4": "一个穿着厨师服装的灰色猫从左侧飞奔而来，伸手去拉一扇橙色的双开门。",
    "E111.Royal.Cat.Nap_scene053.mp4": "汤姆穿着红色斗篷和黑色帽子，用力推着一扇门，门把手是金色的，门是棕色的，背景是粉色的墙壁和金色的装饰。",
    "E111.Royal.Cat.Nap_scene054.mp4": "一个戴着皇冠的红发女人在床上睡觉，汤姆穿着红色斗篷和黑色帽子站在床边，他先是用手捂住嘴，然后张大嘴巴打了个哈欠，女人被惊醒并皱起眉头。",
    "E111.Royal.Cat.Nap_scene055.mp4": "两只老鼠从墙后探出头来，随后完全现身，面带微笑地向前爬行。",
    "E111.Royal.Cat.Nap_scene056.mp4": "在一个华丽的房间内，一只穿着红色披风和黑色帽子的猫站在床边，张大嘴巴似乎在打哈欠。床上躺着一位戴着金色王冠、穿着白色睡衣的胖女人，她突然坐起，愤怒地指着猫，表情激动，似乎在责骂猫。猫被吓到，双手抱胸，显得有些害怕和无奈。整个场景充满喜剧色彩，人物动作夸张，表现出明显的戏剧冲突。",
    "E111.Royal.Cat.Nap_scene057.mp4": "两只穿着蓝色衣服、戴着帽子的小老鼠在墙边爬行，其中一只灰色小老鼠突然从后面扑向另一只棕色小老鼠，将它抱住并拖走，随后灰色小老鼠独自跑开，棕色小老鼠留在原地。",
    "E111.Royal.Cat.Nap_scene059.mp4": "视频中，汤姆穿着国王的服装，正在与躺在床上的国王交谈。随后，汤姆打开门，两个小老鼠从门后偷偷溜进来，汤姆发现后立即拔剑与它们对峙。两只小老鼠也拿出剑与汤姆展开剑斗，场面激烈。",
    "E111.Royal.Cat.Nap_scene060.mp4": "一只穿着蓝色衣服、戴着黄色帽子和紫色羽毛的灰色小老鼠正在挥舞一把剑。它在一条黄色的绳子前不断挥剑，剑与绳子相撞时产生火花和震动效果。小老鼠表情专注，动作灵活，似乎在进行某种剑术练习或表演。背景是单一的棕色地面。",
    "E111.Royal.Cat.Nap_scene061.mp4": "动画片《猫和老鼠》的结尾画面，展示了汤姆猫和杰瑞鼠的卡通形象，中间是“THE END”的字样，背景为蓝色。",
    "E111.Royal.Cat.Nap_scene062.mp4": "视频展示了《猫和老鼠》动画片的片尾画面，画面中央是“THE END”字样，左侧是猫汤姆，右侧是老鼠杰瑞。随后画面过渡到MGM动画公司的标志，显示“an MGM CARTOON”和“made in Hollywood, U.S.A.”字样，最后画面逐渐变黑。"
}