{
    "19. Mouse in Manhattan_scene001.mp4": "视频开始时显示黑色背景和一串数字“0110544170204083”。随后，画面逐渐过渡到一个红色背景，出现“Metro-Goldwyn-Mayer CARTOON”标志，标志上方有一只咆哮的狮子图案，下方标注“COLOR BY TECHNICOLOR”。整个画面保持静态，没有其他动作或变化。",
    "19. Mouse in Manhattan_scene002.mp4": "这是一个米高梅动画片头，红色背景上有一个蓝色边框的圆形图案，里面是一只咆哮的狮子。下方有文字“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”。狮子在图案中不断张合嘴巴，做出咆哮的动作。",
    "19. Mouse in Manhattan_scene003.mp4": "视频展示了米高梅动画的标志，随后切换到《猫和老鼠》的标题画面，其中汤姆猫和杰瑞鼠的形象出现在标志中。",
    "19. Mouse in Manhattan_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景是红色渐变的同心圆，前景是卡通猫汤姆和老鼠杰瑞的形象，汤姆咧嘴大笑，杰瑞则显得调皮活泼，下方有“TOM and JERRY”的黄色字样。随后画面叠加了“MOUSE IN MANHATTAN”和导演信息，显示这是该动画的一个特定集数。",
    "19. Mouse in Manhattan_scene005.mp4": "视频展示了动画片《Tom and Jerry》中的一个片段，标题为“Mouse in Manhattan”。画面首先出现的是动画片的标题和导演信息，随后是动画制作人员名单，包括动画师、音乐指导等。最后，画面显示了制片人Fred Quimby的名字。整个片段以蓝色背景为主，文字以黄色和白色呈现，风格复古，具有经典动画片的特征。",
    "19. Mouse in Manhattan_scene006.mp4": "视频开始于一个夜晚的乡村场景，镜头从一个标有“RFD”的邮箱逐渐拉远，展示了一座被树木环绕、窗户透出温暖灯光的乡村小屋。随后，镜头切换到室内，展示了一只灰色的猫（汤姆）舒适地躺在壁炉前的地毯上，享受着温暖的火光。汤姆的表情显得非常放松和满足，偶尔微微调整姿势，但始终保持着舒适的姿态。整个场景充满了宁静和温馨的氛围，突出了乡村夜晚的宁静与家庭的温暖。",
    "19. Mouse in Manhattan_scene007.mp4": "一只灰色的猫躺在地上，闭着眼睛，看起来很放松。镜头向右移动，展示了一个红色的杯子和一个黑色的装饰物。接着，镜头聚焦到一只戴着帽子、拿着绿色画笔的小老鼠，它正在一张纸上写字。小老鼠看起来很专注，它把纸卷起来，然后展开，似乎在检查自己的作品。",
    "19. Mouse in Manhattan_scene008.mp4": "视频中，一只灰色的猫（汤姆）正躺在地上睡觉，旁边有一只戴着帽子的小老鼠（杰瑞）。杰瑞拿着一张纸，走到猫的面前，把纸放在猫的鼻子前。猫被纸上的字吸引，睁开眼睛，但仍然保持微笑。杰瑞兴奋地在猫身边跳来跳去，似乎在庆祝或分享好消息。猫继续躺着，对杰瑞的行为表现出轻松和愉快的态度。",
    "19. Mouse in Manhattan_scene009.mp4": "视频展示了一封手写的信件，信的内容是杰瑞写给汤姆的告别信，信中表达了杰瑞对乡村生活的厌倦，决定前往百老汇追求都市生活，并以“永别了”作为结尾。信件被一只猫爪握着，背景为紫色的布料。视频中还配有中文字幕，逐句翻译了信件内容。",
    "19. Mouse in Manhattan_scene010.mp4": "视频开始时，一只戴着帽子的老鼠坐在飞机的机翼上，背景是星空和远处的山脉。老鼠看起来很开心，它在机翼上前后移动，似乎在享受飞行。接着，镜头切换到一个火车站的场景，显示“GRAND CENTRAL”的标志，表明老鼠已经到达了中央车站。整个视频的氛围轻松愉快，展现了老鼠从乡村生活到城市生活的转变。",
    "19. Mouse in Manhattan_scene011.mp4": "在火车站台上，杰瑞从一个行李箱后面探出头来，然后迅速跑开。接着，他躲在一辆装有红色大箱子的行李车上，箱子被链条锁住。杰瑞在行李车上得意地笑着，随后从箱子侧面跳了出来，箱子也跟着移动。",
    "19. Mouse in Manhattan_scene012.mp4": "一只戴着帽子的小老鼠在宽敞的车站大厅里奔跑，它摔倒后又站起来，继续向前跑动，途中帽子掉落，它又捡起帽子继续奔跑。",
    "19. Mouse in Manhattan_scene013.mp4": "一只小老鼠出现在擦鞋店的地板上，靠近一瓶鞋油。它被一只正在擦鞋的手抓住，被放入鞋油瓶中，然后被倒出来，掉在鞋油瓶上。",
    "19. Mouse in Manhattan_scene014.mp4": "一个人正在用刷子刷冰鞋，冰鞋上有一只小青蛙。",
    "19. Mouse in Manhattan_scene016.mp4": "一只戴着帽子的老鼠从高跟鞋旁跑过，不慎被高跟鞋绊倒，帽子飞起，它摔倒在地。随后，老鼠爬起来，帽子重新戴好，它站起身，继续向前跑，最终从高跟鞋后方消失。",
    "19. Mouse in Manhattan_scene017.mp4": "一只戴着帽子的小老鼠在一双绿色高跟鞋旁跳舞，它先是靠近鞋子，然后开始跳舞并做出各种动作。接着，它滑倒并从台阶上跳下，最后在台阶下制造了一团水花。",
    "19. Mouse in Manhattan_scene018.mp4": "一只戴着帽子的老鼠在水中划着一个黄色的浮具，镜头逐渐拉近，可以看到它正朝着一个红色的物体靠近。",
    "19. Mouse in Manhattan_scene019.mp4": "在城市街道的背景下，一只戴着帽子的老鼠坐在一个漂浮的物体上，沿着街道边缘的水道前进。街道两旁是高大的建筑物，上面有各种广告牌，包括“LOEWS STATE”、“VAUDEVILLE”和“TOM & JERRY CARTOON”等字样。随着镜头推进，老鼠逐渐靠近一排站在商店橱窗前的女性的脚，她们穿着各种颜色和款式的鞋子。老鼠在水中兴奋地挥舞着双臂，似乎在享受这次冒险。",
    "19. Mouse in Manhattan_scene020.mp4": "视频中，一只戴着帽子的小老鼠在城市街道上冒险。起初，它坐在一个漂浮的物体上，划过水面，经过一座桥下。随后，它从下水道井盖中冒出头，等待红灯变绿灯。当绿灯亮起时，它迅速跑过街道，但被一辆红色卡车撞倒，最终消失在黑暗中。",
    "19. Mouse in Manhattan_scene021.mp4": "一只戴着帽子的小老鼠在街道上奔跑，躲避一辆汽车的车轮。汽车车轮碾过地面，小老鼠被车轮卷起后又弹开，继续向前奔跑。背景是城市街道，有建筑物和停放的汽车。",
    "19. Mouse in Manhattan_scene022.mp4": "一只老鼠从车库跑进豪华的室内，穿过客厅，最后消失在门口。",
    "19. Mouse in Manhattan_scene023.mp4": "一只老鼠站在房间里，头顶上放着一个小帽子。它试图保持平衡，但帽子不断晃动，老鼠的身体也随之晃动，有时甚至被帽子弹起或压扁。老鼠不断调整姿势，但帽子始终不稳定，最终老鼠被帽子弹起并摔倒在地。",
    "19. Mouse in Manhattan_scene024.mp4": "一只戴着帽子的小老鼠从“Starlite Room”门口探出头，然后迅速跑进走廊，穿过装饰华丽的大厅，最后在“Chase Room”门前停下，显得非常紧张和害怕。",
    "19. Mouse in Manhattan_scene025.mp4": "视频展示了一扇标有“Powder Room”（化妆间）字样的白色门，门上有一个黄色把手，门旁有绿色棕榈叶，画面下方有中文“化妆间”字幕。",
    "19. Mouse in Manhattan_scene026.mp4": "一只戴着帽子的老鼠在门边滑行，随后被门夹住并消失在门后。",
    "19. Mouse in Manhattan_scene027.mp4": "视频展示了一个衣帽寄管处的内部场景，上方有红色霓虹灯标示“Check Room”，下方有中文字幕“衣帽寄管处”。镜头缓慢推进，聚焦于寄存柜中的几顶帽子，包括一顶高顶礼帽和一顶圆顶礼帽，背景中还有其他衣物和帽子。整体氛围安静，光线柔和。",
    "19. Mouse in Manhattan_scene028.mp4": "一只戴着帽子的老鼠从高顶礼帽中探出头来，它在帽顶上跳舞，然后从帽顶上跳到帽檐上，接着又从帽檐上跳回帽顶，最后它从帽顶上跳出了帽子。",
    "19. Mouse in Manhattan_scene029.mp4": "一个棕色的小猴子从蓝色条纹窗帘后探出头来，然后倒挂在窗帘上，接着又掉落在绿色的地面上，最后坐了起来。",
    "19. Mouse in Manhattan_scene031.mp4": "一只戴着帽子的老鼠从高楼的红色管道上滑下，管道末端有火焰，老鼠在滑行过程中翻滚并最终悬挂在管道末端。背景是夜晚的城市，高楼林立，灯火通明。",
    "19. Mouse in Manhattan_scene032.mp4": "一只戴着帽子的老鼠正悬挂在一根红色的杆子上，杆子从高楼的顶部延伸下来。老鼠在杆子上小心翼翼地移动，试图保持平衡。背景是夜晚的城市，高楼林立，灯火通明。",
    "19. Mouse in Manhattan_scene033.mp4": "一只戴着帽子的老鼠紧紧抓住一根红色的杆子，从高楼的边缘滑下。随着杆子断裂，老鼠被绳索吊起，随后又坠落，最终安全地挂在了杆子上。背景是夜晚的城市，高楼林立，灯火通明。",
    "19. Mouse in Manhattan_scene034.mp4": "夜晚的城市背景下，一位穿着白色连衣裙、头戴红色心形装饰的卡通女性角色站在露台上，手持一个写着“Class Card”的牌子。她先是双臂张开，随后将牌子举到胸前，似乎在展示或强调这个牌子。画面中还出现了“席次牌”的中文字幕。",
    "19. Mouse in Manhattan_scene035.mp4": "一只小老鼠正攀爬在一个高脚玻璃杯的杯身上，它紧紧抓住杯壁，表情专注而紧张。背景是夜晚的城市天际线，远处高楼林立，灯火辉煌。桌面上还放着两个黑色的调味瓶，整个场景显得既安静又充满紧张感。",
    "19. Mouse in Manhattan_scene036.mp4": "在夜晚的城市背景下，一个穿着白色礼服、头戴红色心形装饰的女孩站在阳台上，手里拿着一个写有“Clact Card”的黄色盒子。一只棕色老鼠从左侧跑来，兴奋地与女孩互动，先是张开双臂，然后戴上一顶小帽子，最后与女孩拥抱并亲吻。整个场景充满浪漫和欢乐的氛围。",
    "19. Mouse in Manhattan_scene037.mp4": "在夜晚的城市天际线下，一只穿着礼服的棕色老鼠与两位穿着白色礼服、头戴红色心形装饰的女鼠在巨大的玻璃花瓶间跳舞。它们围绕着一个标有“Place Card”的黄色卡片，动作欢快而充满活力。背景是星光闪烁的夜空和远处的城市建筑，营造出浪漫而梦幻的氛围。",
    "19. Mouse in Manhattan_scene038.mp4": "在夜晚的城市背景下，两只老鼠在光滑的桌面上滑行，它们手拉手，围绕着一个巨大的肉排和一盆花跳舞。随着镜头移动，它们在桌面上旋转，最终老鼠独自继续滑行，经过一个银色的咖啡壶。整个场景充满欢快和滑稽的氛围。",
    "19. Mouse in Manhattan_scene039.mp4": "一只戴着帽子的老鼠从瓶子里探出头来，瓶子里装满了气泡水。老鼠在瓶子里上下晃动，然后瓶子突然喷出大量气泡和液体。",
    "19. Mouse in Manhattan_scene040.mp4": "在夜晚的城市中，一只小老鼠从高楼顶上被抛下，沿着一条由气泡组成的轨迹缓缓下降，周围是高耸的建筑和闪烁的星星。",
    "19. Mouse in Manhattan_scene041.mp4": "夜晚的城市巷子里，晾衣绳上挂着衣物，其中一双红色袜子突然被气泡托起，向上飘动，随后又缓缓落下，气泡随之散去。",
    "19. Mouse in Manhattan_scene043.mp4": "夜晚的城市街道上，一只小老鼠从建筑物的角落跑出来，沿着人行道快速奔跑。它经过一盏路灯，继续向前跑，最终躲进了一堆倒下的垃圾桶后面。",
    "19. Mouse in Manhattan_scene044.mp4": "一只棕色的小老鼠站在一个大圆筒上，圆筒在街道上滚动。小老鼠在圆筒上保持平衡，随后从圆筒上跳起，飞向空中，落在一个红色的消防栓上。消防栓位于街道旁，背景是建筑物的窗户和墙壁。画面最后显示“珠宝店”字样。",
    "19. Mouse in Manhattan_scene045.mp4": "夜晚，一家珠宝店的橱窗被一个飞驰而过的物体击碎，玻璃碎片四散飞溅。",
    "19. Mouse in Manhattan_scene046.mp4": "画面中展示了一堆珠宝首饰和手袋，包括珍珠项链、手镯、耳环、戒指、手提包等，它们散落在深蓝色的背景上，整体色调偏暗，营造出一种神秘而奢华的氛围。",
    "19. Mouse in Manhattan_scene047.mp4": "在一间充满珠宝的房间里，一只戴着帽子和项链的老鼠从一个紫色的南瓜形状的盒子里探出头来，它环顾四周，然后从盒子里跳出来，消失在画面右侧。",
    "19. Mouse in Manhattan_scene048.mp4": "夜晚，一只老鼠从珠宝店的橱窗里探出头来，它戴着一顶帽子，手里拿着一个物品。随后，一束强光从右侧照射过来，老鼠被惊吓到，向后退缩。",
    "19. Mouse in Manhattan_scene049.mp4": "一只戴着帽子和珍珠项链的老鼠从破碎的窗户中飞出，帽子飞脱，老鼠惊慌失措地在空中翻滚，最终消失在画面中。",
    "19. Mouse in Manhattan_scene050.mp4": "一只戴着帽子和珍珠项链的老鼠在黑暗的房间里奔跑，突然被一束光照射，随后被几只飞来的飞镖击中，最终倒地。",
    "19. Mouse in Manhattan_scene051.mp4": "一只棕色的小老鼠从画面左侧跑入，快速穿过一个地铁入口前的平台，然后跑下台阶，消失在画面下方。地铁入口处有“IRT LINES”和“SUBWAY LINES TO MANHATTAN”的标识。场景在夜晚，光线昏暗，整体色调偏蓝。",
    "19. Mouse in Manhattan_scene052.mp4": "一只小老鼠从地铁站台跑过，被一辆驶来的地铁撞飞，随后被抛出车厢，在夜晚的城市街道上继续奔跑，背景是桥梁和星空。",
    "19. Mouse in Manhattan_scene053.mp4": "夜晚，一只戴着帽子的小老鼠从一座大桥上跑过，然后沿着铁轨奔跑，最后跑向一座亮着灯的农舍。",
    "19. Mouse in Manhattan_scene054.mp4": "汤姆猫正在地板上睡觉，杰瑞鼠突然出现，把汤姆的信撕碎并玩弄他。汤姆醒来后愤怒地抓住杰瑞，但杰瑞迅速逃跑，留下汤姆独自面对满地的纸片。",
    "19. Mouse in Manhattan_scene055.mp4": "一只戴着帽子的老鼠正在用锤子敲钉子，但锤子脱手飞出，老鼠惊慌失措地四处张望，帽子也掉了下来。",
    "19. Mouse in Manhattan_scene056.mp4": "一只戴着帽子的小老鼠从“Home Sweet Home”招牌下的洞口跑出来，四处张望后，小心翼翼地钻进洞里，画面逐渐变暗，最后出现“The End”字样。",
    "19. Mouse in Manhattan_scene057.mp4": "视频开始时显示红色背景上的“The End”字样，随后逐渐出现“An MGM Tom and Jerry Cartoon”和“MADE IN HOLLYWOOD, U.S.A.”的字样，表明这是一个米高梅制作的《猫和老鼠》动画片的结尾画面。",
    "19. Mouse in Manhattan_scene058.mp4": "视频开头显示了MGM的标志和“Tom and Jerry Cartoon”的字样，背景为红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑，持续数秒。"
}