{
    "S1950E46 - Mouse For Sale_scene001.mp4": "画面从全黑开始，随后出现米高梅动画公司的标志，标志上方写着“A METRO-GOLDWYN-MAYER”，中间是大写的“CARTOON”，下方是“COLOR BY TECHNICOLOR”。背景为深蓝色，标志为金色和红色，整体风格复古。",
    "S1950E46 - Mouse For Sale_scene002.mp4": "视频开始展示了一个经典的卡通片头，背景为深蓝色，中央有一个圆形标志，标志内是一只咆哮的狮子，狮子下方写着“A METRO-GOLDWYN-MAYER CARTOON”，下方还标注“COLOR BY TECHNICOLOR”。狮子在标志内不断咆哮和转动头部，随后画面逐渐变暗，最终转为黑色。接着，画面中出现“Tom and Jerry”的标题，左侧是老鼠杰瑞，右侧是猫汤姆，两者面带笑容。",
    "S1950E46 - Mouse For Sale_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深蓝色，左侧是老鼠杰瑞，右侧是猫汤姆，中间是金色的“Tom and Jerry”字样。随后画面逐渐过渡，出现“Directed by WILLIAM HANNA and JOSEPH BARBERA”的字样，背景变为草地和树木，暗示故事即将展开。",
    "S1950E46 - Mouse For Sale_scene004.mp4": "视频展示了一个“MOUSE FOR SALE”（出售老鼠）的标志牌，背景是绿色草地和树木，下方显示导演为William Hanna和Joseph Barbera。随后，画面中出现了动画制作人员名单，包括Kenneth Muse、Ed Barge、Irven Spence、Ray Patterson、Robert Gentle和Scott Bradley等。画面底部还有版权信息和Western Electric Sound System的标志。",
    "S1950E46 - Mouse For Sale_scene006.mp4": "一只手拿着报纸，报纸上有一个醒目的广告，内容是“为白鼠支付大笔金钱”，广告下方写着“宠物店～主街”。背景是报纸上的其他小广告和文字。",
    "S1950E46 - Mouse For Sale_scene007.mp4": "一只蓝色的猫坐在沙发上，手里拿着一份报纸，专注地阅读。它先是抬头微笑，然后低头继续看报，表情显得十分投入和满足。背景是一个温馨的室内环境，有壁炉和柔和的灯光。",
    "S1950E46 - Mouse For Sale_scene008.mp4": "视频中，一只蓝色的猫（汤姆）拿着油漆桶和刷子，小心翼翼地靠近墙角。它先是好奇地探头观察，然后蹲下身子，似乎在准备粉刷墙壁。猫的表情从专注变为得意，显示出它对即将进行的粉刷工作充满期待。房间内有一张桌子和一盏台灯，营造出温馨的家居氛围。",
    "S1950E46 - Mouse For Sale_scene009.mp4": "一只手拿着蓝色螺母，另一只手用刷子涂上黄色油漆，螺母逐渐变成黄色。",
    "S1950E46 - Mouse For Sale_scene010.mp4": "汤姆猫跪在地上，手里拿着一个黄色的物体，将其放在地上后，物体突然爆炸，汤姆猫被吓了一跳。",
    "S1950E46 - Mouse For Sale_scene011.mp4": "一只老鼠在床上睡觉，一个黄色的螺母滚到床上，老鼠醒来后拿起螺母，发现它是一个小铃铛，摇响后老鼠开心地笑了。",
    "S1950E46 - Mouse For Sale_scene012.mp4": "汤姆猫拿着一个磁铁，靠近墙上的洞口，磁铁发出蓝色电火花，吸引出杰瑞鼠。杰瑞鼠被磁铁吸住，挣扎着靠近磁铁，最终被磁铁吸住并拖向汤姆猫。",
    "S1950E46 - Mouse For Sale_scene013.mp4": "视频中，一只老鼠被磁铁吸引，随后被涂上白色油漆。接着，猫汤姆出现，抓起老鼠并跑过街道，经过一家宠物店。汤姆进入宠物店，拿出一叠钱后跑出，兴奋地展示着钱。最后，他回到家，兴奋地在房间里跑动，展示着他的钱。",
    "S1950E46 - Mouse For Sale_scene014.mp4": "汤姆猫从床边探出头，手里拿着一叠绿色钞票，开心地数着钱，然后把钱藏在身后，露出得意的笑容。接着，他用手在床单上轻轻拍打，似乎在确认什么，最后又把钱藏好，露出狡黠的表情。",
    "S1950E46 - Mouse For Sale_scene015.mp4": "一只蓝色的猫从黄色扶手椅后面探出头来，环顾四周后迅速跳下椅子，向房间右侧跑去，消失在画面中。",
    "S1950E46 - Mouse For Sale_scene016.mp4": "一只蓝猫从沙发后面跳出来，然后躺在地上打滚，最后安静地躺着。",
    "S1950E46 - Mouse For Sale_scene017.mp4": "一只蓝色的猫躺在地上，眼睛闭着，似乎在打盹。突然，它的眼睛睁开，露出黄色的瞳孔，脑海中浮现出一个幻想场景：它穿着西装，戴着礼帽，躺在一堆钞票上，周围有三只白猫围绕着它，它还拿着一支烟斗。幻想场景中，钞票从四面八方飞来，猫显得非常开心。幻想结束后，猫恢复了原本的姿势，眼睛慢慢闭上，继续打盹。",
    "S1950E46 - Mouse For Sale_scene018.mp4": "一位穿着粉色裙子的女士走过房间，经过一只躺在地上的蓝色猫。女士离开后，猫先是闭眼休息，然后被另一位穿着蓝色外套的女士用手指责备。猫被责备后，表情变得愤怒，突然站起来，露出凶狠的表情，张开嘴露出牙齿，似乎准备攻击或反击。",
    "S1950E46 - Mouse For Sale_scene019.mp4": "动画片段中，汤姆猫从墙后冲出，试图抓住一把黄色的扶手椅，但椅子突然飞起，将他撞飞。汤姆在空中翻滚后落地，发现地毯被掀开，露出一个洞。他愤怒地拉扯地毯，试图把洞盖住，但最终失败，只能无奈地站在原地。",
    "S1950E46 - Mouse For Sale_scene020.mp4": "一只蓝色的猫从窗外跳进房间，落在窗台上，然后停住，看向窗外。",
    "S1950E46 - Mouse For Sale_scene021.mp4": "一位穿着深蓝色长裙、内衬粉色的女性，手持一叠绿色钞票，从画面右侧走向左侧。她经过一棵树，树干被黑色铁栏杆环绕。背景是浅棕色的墙壁和地面，前景是一道灰色的波纹状围栏。女性在树旁停下，将钞票放入树下的铁栏杆内，随后转身离开画面。",
    "S1950E46 - Mouse For Sale_scene022.mp4": "视频开始时，一双穿着蓝色袖子衣服的手在黑暗中数着一叠绿色钞票，手部动作细致，钞票被一张张翻动。随后画面突然变黑，接着切换到一个昏暗的房间，一只黑色的猫躺在黄色的扶手椅上，眼睛睁得很大，显得警觉或好奇。房间内有一盏台灯，灯光柔和，照亮了猫和椅子的一部分，营造出一种安静而神秘的氛围。",
    "S1950E46 - Mouse For Sale_scene023.mp4": "一只蓝灰色的猫躺在黄色的扶手椅上，表情显得有些不悦或疲惫。它位于一个昏暗的房间里，旁边有一张小桌子，桌上放着一盏蓝色灯罩的台灯和一个装饰性的茶壶。背景是紫色的墙壁，房间角落可见部分家具或装饰物。猫的姿势和表情没有明显变化，整体氛围安静而略带沉闷。",
    "S1950E46 - Mouse For Sale_scene024.mp4": "一位穿着蓝色外套和粉色裙子的女性，手提一个绿色盒子，沿着木栅栏和树旁行走。",
    "S1950E46 - Mouse For Sale_scene025.mp4": "视频中，一只蓝猫躺在黄色的扶手椅上，眼睛半闭，显得非常放松。随后，它突然睁开眼睛，坐直身体，表情变得警觉和紧张。背景是一个室内场景，有一盏台灯和一个装饰性的茶壶放在旁边的桌子上。",
    "S1950E46 - Mouse For Sale_scene026.mp4": "一个人用丝带绑着一个绿色盒子，盒子打开后，一只老鼠从里面跳出来，站在盒子里，猫看到老鼠后非常惊讶，张大嘴巴，似乎要扑过去。",
    "S1950E46 - Mouse For Sale_scene027.mp4": "一只小老鼠在房间里表演杂技，它先是站在一个绿色的箱子上，然后跳到两个黄色的线轴上，接着它又跳到一个黄色的线轴上，最后它把一个橙子放在头顶上，站在一个黄色的线轴上，开心地摇摆着。",
    "S1950E46 - Mouse For Sale_scene028.mp4": "汤姆猫站在桌子旁，表情愤怒，双手握拳，身体前倾，目光盯着桌上的绿色盒子。",
    "S1950E46 - Mouse For Sale_scene029.mp4": "一只手伸向桌上的绿色收音机，轻轻转动旋钮后收回。",
    "S1950E46 - Mouse For Sale_scene030.mp4": "一只白色的小老鼠在桌子上跳舞，突然，一只蓝色的猫从桌子后面探出头来，小老鼠继续跳舞，然后跳到猫的头上，猫慢慢睁开眼睛，举起一把蓝色的锅铲，小老鼠被锅铲打中，飞了起来。",
    "S1950E46 - Mouse For Sale_scene031.mp4": "汤姆猫在桌子上用扫帚追捕杰瑞鼠，杰瑞鼠灵活地躲避并最终被汤姆猫抓住。然而，杰瑞鼠趁汤姆猫不备，用扫帚将汤姆猫扫倒在地，使汤姆猫狼狈不堪。",
    "S1950E46 - Mouse For Sale_scene032.mp4": "汤姆从门里冲出来，被扫帚击中后飞出去，躲到树后观察。",
    "S1950E46 - Mouse For Sale_scene033.mp4": "一只蓝色的猫（汤姆）走到一扇窗户前，用爪子扒拉窗户，试图把红色的窗帘拉开，露出窗户内部的黑暗空间。",
    "S1950E46 - Mouse For Sale_scene034.mp4": "汤姆站在窗前，看着窗台上出现的告示“JERRY THE DANCING MOUSE”。随后，杰瑞从幕后跳出来，开始在窗台上跳舞，动作夸张而欢快。汤姆则在一旁观看，表情从惊讶逐渐变为兴奋，最后双手张开，似乎对杰瑞的表演感到非常享受。",
    "S1950E46 - Mouse For Sale_scene035.mp4": "一只蓝色的猫坐在房子外的草地上，它伸长手臂去够水龙头，然后用双手握住水龙头。",
    "S1950E46 - Mouse For Sale_scene036.mp4": "一只猫从窗户探出头，用喷水枪喷向窗台上的老鼠，老鼠被水喷得四处飞溅。",
    "S1950E46 - Mouse For Sale_scene037.mp4": "一只老鼠从水花中跳出，落在一个绿色的柜子上，水花四溅。老鼠在柜子上站稳后，左右晃动身体，似乎在享受水花带来的清凉，然后转身跑开，留下水渍在柜子上。",
    "S1950E46 - Mouse For Sale_scene038.mp4": "一只老鼠在厨房里奔跑，随后一只猫从空中扑下，抓住了老鼠。猫抱着一个橙色的茶壶，坐在地上，表情显得得意和满足。",
    "S1950E46 - Mouse For Sale_scene039.mp4": "一只棕色老鼠从橙色茶壶中探出头，随后爬出来，走向一个蓝色面粉桶。它跳进面粉桶，面粉扬起，然后一只白色老鼠从桶中跳出来，棕色老鼠消失。白色老鼠站在地上，橙色茶壶再次出现，白色老鼠从壶嘴探出头，然后消失。",
    "S1950E46 - Mouse For Sale_scene040.mp4": "汤姆猫坐在一个橙色的茶壶上，显得非常得意。这时，一个穿着粉色围裙的女人走了进来，似乎在责备汤姆。汤姆显得有些不以为然，甚至举起茶壶，露出里面的杰瑞鼠。随后，一个拿着红色棍子的人出现，汤姆被吓得吐舌头，但很快又恢复了自信，试图用尾巴挡住棍子。最终，汤姆被棍子击中，而杰瑞则在一旁开心地笑着。",
    "S1950E46 - Mouse For Sale_scene041.mp4": "一只蓝色的猫从墙后跑出来，手里拿着一个紫色的物体，看起来像是一个网球拍。它跑过房间，表情专注，似乎在准备打网球。",
    "S1950E46 - Mouse For Sale_scene042.mp4": "一只白色的小老鼠从墙角后探出头，小心翼翼地向前走。突然，一只拿着紫色雨伞的蓝猫从右侧冲出来，张开嘴露出尖牙，准备追捕小老鼠。小老鼠吓得后退，而猫则紧追不舍。",
    "S1950E46 - Mouse For Sale_scene043.mp4": "猫拿着一把紫色的伞，试图用伞尖戳向老鼠，但老鼠敏捷地躲开了。猫的表情从愤怒转为惊讶，最终显得有些得意。老鼠则在角落里来回躲闪，显得机智而灵活。",
    "S1950E46 - Mouse For Sale_scene045.mp4": "一只猫用雨伞追赶一只老鼠，老鼠被击中后飞出，躲到桌子底下。",
    "S1950E46 - Mouse For Sale_scene046.mp4": "一只老鼠从门后跑出，被猫汤姆追捕。汤姆用爪子抓门，试图抓住老鼠，但被一位拿着扫帚的女士用扫帚柄打了一下，导致汤姆的头被扫帚柄卡住。汤姆挣扎着，最终成功摆脱扫帚柄，但老鼠已经逃走了。汤姆愤怒地指着门后，发现一只小老鼠在门后跳舞，汤姆显得非常惊讶和愤怒。",
    "S1950E46 - Mouse For Sale_scene047.mp4": "汤姆猫在房间里拿着扫帚，先是得意洋洋地展示，然后突然开始用扫帚快速奔跑，撞破墙壁，最后撞到一个机器上。",
    "S1950E46 - Mouse For Sale_scene048.mp4": "汤姆猫从门后跳出，手持扫帚，做出夸张的飞行动作，随后躲进车库门口偷看。",
    "S1950E46 - Mouse For Sale_scene049.mp4": "一只白色的小老鼠从门后探出头，看到一瓶鞋油后，兴奋地扑向它，用前爪抱住鞋油瓶，开心地摇晃着，似乎对这瓶鞋油非常满意。",
    "S1950E46 - Mouse For Sale_scene051.mp4": "一只白色的小老鼠在墙角附近奔跑，它停下来，抬头看向墙角上方。",
    "S1950E46 - Mouse For Sale_scene052.mp4": "一只白猫站在门口，看到一只小老鼠后，兴奋地跳起来抓它。小老鼠被抓住后，白猫得意地抱着它。",
    "S1950E46 - Mouse For Sale_scene053.mp4": "一只白猫用爪子抓着一只小白鼠，表情从凶狠变为温柔，然后亲吻小白鼠，最后露出满意的微笑。",
    "S1950E46 - Mouse For Sale_scene054.mp4": "一只白色的猫抱着一只小白鼠，表情开心。一位穿着粉色裙子和围裙的女士从右侧走来，伸手抚摸猫的头，猫的表情变得紧张。女士离开后，猫又恢复了开心的表情。随后，猫突然将小白鼠扔在地上，自己则开始疯狂地跳舞，表情夸张，动作滑稽。最后，画面变暗，出现“The End”字样。",
    "S1950E46 - Mouse For Sale_scene055.mp4": "视频开始时显示“THE END”字样，随后过渡到“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面，背景为红色，文字为蓝色和白色。整个画面保持静态，没有其他动作或场景变化。"
}