{
    "S1950E53 - The Egg And Jerry_scene001.mp4": "视频展示了米高梅动画公司的标志，标志上方写着“A METRO-GOLDWYN-MAYER”，中间是一个咆哮的狮子图案，下方是“CARTOON”字样，底部标注“COLOR BY TECHNICOLOR”。背景为深蓝色。",
    "S1950E53 - The Egg And Jerry_scene002.mp4": "这是一个米高梅动画片头，背景为深蓝色，中央是一个咆哮的狮子图案，上方写着“A METRO-GOLDWYN-MAYER”，下方是大字“CARTOON”，底部标注“COLOR BY TECHNICOLOR”。狮子在画面中逐渐清晰并咆哮。",
    "S1950E53 - The Egg And Jerry_scene003.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面，其中猫和老鼠的卡通形象出现在绿色背景上。",
    "S1950E53 - The Egg And Jerry_scene004.mp4": "视频展示了《猫和老鼠》动画片的片头和制作人员名单。一开始是绿色背景上“TOM and JERRY”的标题，接着画面切换到棕色背景，显示了该集的标题“THE EGG AND JERRY”以及“IN CINEMASCOPE”的字样。随后，画面中出现了一只刚孵化的小鸟站在蛋壳旁。接着，屏幕上显示了制作人员名单，包括动画师、布局师、背景画家、音乐家等。最后，画面展示了该动画片的制作人和导演——威廉·汉纳和约瑟夫·巴伯拉。整个视频片段是《猫和老鼠》动画片的片头和制作人员名单展示。",
    "S1950E53 - The Egg And Jerry_scene005.mp4": "视频开始显示了制作人和导演的名字，随后切换到一个卡通风格的庭院场景。画面中有一棵大树，树上有一个鸟巢，鸟巢里有一只红色的小鸟。背景是粉红色的天空，庭院里有绿色的草地、灌木丛和一个木栅栏。右侧可以看到一栋房子的一部分，房子的窗户是粉红色的。镜头逐渐拉近，聚焦在鸟巢和小鸟上，小鸟在巢中轻微移动。整个场景色彩鲜艳，充满童趣。",
    "S1950E53 - The Egg And Jerry_scene007.mp4": "画面展示了一棵树的枝叶在粉色背景下的摇曳，树叶颜色为绿色和黄绿色，树枝为深色，一个白色的圆形物体在树叶间若隐若现。镜头从上至下移动，逐渐聚焦于树叶的细节。",
    "S1950E53 - The Egg And Jerry_scene008.mp4": "视频展示了一个蜘蛛网，网中央有一颗白色球体。镜头向下移动，球体从网中掉落，最终落在花丛中，其中一朵黄色郁金香的花苞打开，球体落入其中。背景是粉红色天空和木栅栏，周围有绿色植物和花朵。",
    "S1950E53 - The Egg And Jerry_scene009.mp4": "一个白色的蛋从黄色郁金香花苞中滚落，穿过绿色草地，最终滚入一个红色狗屋的门口。",
    "S1950E53 - The Egg And Jerry_scene010.mp4": "一个白色球体滚入房间，停在床边，接着滚到床上，最终停在一只正在睡觉的棕色老鼠的鼻子上。老鼠没有醒来，球体停留在它的鼻子上。房间内有餐桌、椅子、花瓶和闹钟。",
    "S1950E53 - The Egg And Jerry_scene012.mp4": "一只啄木鸟在房间里用喙啄红木柜子，啄出一堆谷物。随后，一只老鼠从右侧冲进来，撞到啄木鸟，啄木鸟被撞飞，老鼠则继续向前跑。",
    "S1950E53 - The Egg And Jerry_scene013.mp4": "啄木鸟伍迪从灯罩里探出头，灯罩突然倾倒，洒出谷物。老鼠杰瑞从左侧飞入，扑向谷物，结果被灯罩盖住，随后它挣扎着爬起来，灯罩仍压在它头上。",
    "S1950E53 - The Egg And Jerry_scene015.mp4": "一只棕色的老鼠抱着一个红色的小鸟从红色的小屋中跑出来，它兴奋地跳跃着，然后跳到一根树枝上，继续抱着小鸟在树枝上跑动。",
    "S1950E53 - The Egg And Jerry_scene017.mp4": "一只棕色的小老鼠杰瑞站在一扇紫色的门前，门边有一只红色的小鸟。杰瑞跑向小鸟，抓住它并把它塞进门缝里。他用力推门，试图把小鸟关在里面。门被推开后，小鸟从门缝里探出头来，杰瑞惊讶地看着它。随后，杰瑞用爪子在门上划了一下，门上出现了一个洞，小鸟从洞里钻出来，杰瑞惊讶地看着它。",
    "S1950E53 - The Egg And Jerry_scene018.mp4": "在红色小屋前，一只棕色猫从门内走出，手里拿着一只红色小鸟。猫把小鸟放在地上，然后用手指指向远方，似乎在对小鸟说话或下达指令。小鸟站在草地上，抬头看着猫。背景是绿色的草地和一些花朵。",
    "S1950E53 - The Egg And Jerry_scene019.mp4": "视频中，一只红色的小鸟站在绿色的草地上，旁边有一把蓝色的铲子和一只棕色的大熊的脚。小鸟看起来有些紧张或害怕，它四处张望，然后向铲子靠近，似乎在啄铲子上的泥土。背景是红色的围栏，整体画面色彩鲜艳，充满卡通风格。",
    "S1950E53 - The Egg And Jerry_scene020.mp4": "视频展示了一个卡通场景，画面中有一只猫坐在户外的躺椅上，手里拿着一本名为《Saturday Evening Puss》的杂志，另一只手拿着一杯饮料。猫看起来很放松，享受着悠闲的时光。背景是一个绿色的草坪，旁边有一棵树和一个白色的栅栏，远处可以看到一栋房子的一部分。画面中还出现了一个小角色，似乎在草坪上行走。整个场景色彩鲜艳，充满了轻松愉快的氛围。",
    "S1950E53 - The Egg And Jerry_scene021.mp4": "一只红色头冠的小鸟站在绿色草地上，面对着一个橙色的锯子。小鸟好奇地靠近锯子，用喙轻轻触碰锯齿，然后后退一步，似乎对锯子的锋利感到惊讶。",
    "S1950E53 - The Egg And Jerry_scene022.mp4": "汤姆猫坐在躺椅上，手里拿着一杯黄色液体，先是喝了一口，然后突然表现出愤怒的表情，接着将杯中的液体全部倒在地上。",
    "S1950E53 - The Egg And Jerry_scene023.mp4": "一只啄木鸟站在草地上，突然被从上方喷洒下来的黄色液体淋湿。它先是被冲击得向后倒退，随后站稳并甩动身体试图抖落身上的液体。接着，它用喙啄向旁边的一根橙色木桩，木桩上散落出一些木屑，啄木鸟随后飞离。",
    "S1950E53 - The Egg And Jerry_scene024.mp4": "汤姆猫坐在沙滩椅上，喝着饮料，突然表情惊恐，身体被弹出椅子，眼睛瞪大，嘴巴张开，显得非常震惊。",
    "S1950E53 - The Egg And Jerry_scene025.mp4": "红色小鸟在草地上奔跑，突然被灰色猫从空中扑下，猫落地后翻滚，最终消失在画面中。",
    "S1950E53 - The Egg And Jerry_scene026.mp4": "红色啄木鸟在绿色背景上快速旋转，翅膀张开，脚部有旋转的动态效果，背景有模糊的光斑和色彩变化。",
    "S1950E53 - The Egg And Jerry_scene027.mp4": "一只棕色的小老鼠从红色的拱形门洞中探出头来，门洞周围有绿色的草地和彩色的花朵。小老鼠表情好奇，身体前倾，似乎正准备向外张望或行动。",
    "S1950E53 - The Egg And Jerry_scene028.mp4": "在一片绿色的草地上，一只小老鼠杰瑞正在奔跑，突然一只灰色的猫汤姆从空中扑下来，试图抓住它。杰瑞迅速躲开，用一根橙色的长杆将汤姆绊倒。汤姆摔倒在地，表情痛苦。杰瑞则站在长杆上，得意地看着汤姆。汤姆挣扎着爬起来，拿起长杆，试图反击，但杰瑞巧妙地躲开了他的攻击。汤姆被长杆绊倒，再次摔倒在地。杰瑞则继续在长杆上跳跃，显得非常开心。汤姆愤怒地追着杰瑞，但杰瑞总是能够巧妙地避开他的攻击。最后，汤姆被长杆绊倒，再次摔倒在地，而杰瑞则继续在长杆上跳跃，显得非常开心。",
    "S1950E53 - The Egg And Jerry_scene029.mp4": "一只棕色的小老鼠被夹在一把橙色长柄的灰色耙子上，耙子在草地上移动。一只红黑相间的小鸟从右侧飞来，啄向耙子上的老鼠，然后飞向耙子的橙色手柄，啄出一串黄色的颗粒物，随后飞走。",
    "S1950E53 - The Egg And Jerry_scene030.mp4": "汤姆猫手持一根橙色棍子，在绿色草地上奔跑，背景是房屋和树木。",
    "S1950E53 - The Egg And Jerry_scene031.mp4": "动画片《猫和老鼠》中的汤姆猫，戴着黄色帽子和红色领结，手持一根橙色棍子，从邮箱旁跑过，然后做出各种夸张的姿势和动作，包括旋转和跳跃，背景是绿色的草地、白色栅栏和几栋房子。",
    "S1950E53 - The Egg And Jerry_scene032.mp4": "一只棕色的老鼠拉着一只红色的鸟在草地上奔跑，随后鸟被一根巨大的铅笔击中，铅笔断裂后鸟落地，老鼠和鸟都惊讶地看着铅笔。",
    "S1950E53 - The Egg And Jerry_scene033.mp4": "一只灰色的猫在草地上追逐一只红色的小鸟，小鸟飞到树后，猫也跟着跑过去，猫试图抓住小鸟但没有成功。猫在树旁停下，显得非常沮丧和愤怒，然后开始跳舞，表情从愤怒变为得意，最后又变回沮丧。",
    "S1950E53 - The Egg And Jerry_scene034.mp4": "汤姆猫从树后跳出来，拿起一个黄色的水桶，将水倒在自己头上。他甩了甩头，然后张开双臂，肚子开始膨胀，最后从肚子里喷出水来。",
    "S1950E53 - The Egg And Jerry_scene035.mp4": "一只棕色的小老鼠在绿色的草地上奔跑，突然被一只大猫的尾巴扫到，它抓住尾巴不放，被甩了起来，然后又掉下来，继续抓住尾巴。",
    "S1950E53 - The Egg And Jerry_scene036.mp4": "汤姆猫张大嘴巴，露出牙齿，表情狰狞。一只红色的小鸟从他嘴里飞出，汤姆猫看起来非常惊讶和愤怒。",
    "S1950E53 - The Egg And Jerry_scene037.mp4": "一只棕色的小老鼠在草地上奔跑，突然被一把插在树桩上的斧头击中，飞了起来，然后躺在树桩上。这时，一只灰色的大猫汤姆出现在画面中，看到小老鼠后显得非常惊讶和兴奋。",
    "S1950E53 - The Egg And Jerry_scene038.mp4": "动画片段中，汤姆猫手持斧头，表情愤怒，一只啄木鸟在它头上飞来飞去，时而停在汤姆头上，时而飞走。汤姆猫不断挥舞斧头，试图驱赶啄木鸟，但啄木鸟总能巧妙地避开。背景是蓝色的天空，画面简洁明快。",
    "S1950E53 - The Egg And Jerry_scene039.mp4": "汤姆猫站在一个黄色的圆盘上，手里拿着一把斧头，一只小鸟停在他的头上。汤姆挥舞斧头，小鸟被吓飞。汤姆放下斧头，握拳庆祝，然后伸手拿起圆盘上的一个棕色物体，将其举过头顶，接着又放回原处。圆盘上还躺着一只棕色的小老鼠。",
    "S1950E53 - The Egg And Jerry_scene040.mp4": "汤姆猫伸出爪子，一只小红鸟从杯子里飞出来，汤姆猫用爪子接住杯子，小红鸟在杯子里啄着，汤姆猫看着小红鸟。",
    "S1950E53 - The Egg And Jerry_scene041.mp4": "汤姆猫拿着一个红色的物体，兴奋地跳跃起来，随后飞出画面，留下桌上的泰迪熊和一个碗。",
    "S1950E53 - The Egg And Jerry_scene042.mp4": "汤姆猫在花园里追逐一只小鸟，他试图用绳子抓住小鸟，但小鸟被绑在了树桩上。汤姆猫愤怒地跳起来，然后跑开。",
    "S1950E53 - The Egg And Jerry_scene043.mp4": "啄木鸟用喙敲击树干上的木桶，木桶被敲击后飞出，啄木鸟被绳子拉住，悬挂在树干上，随后它张开嘴巴，似乎在喊叫。",
    "S1950E53 - The Egg And Jerry_scene044.mp4": "汤姆猫用斧头砍向杰瑞鼠，杰瑞鼠被砍成两半，汤姆猫开心地笑着。",
    "S1950E53 - The Egg And Jerry_scene045.mp4": "一只红色的小鸟被一根绳子绑在树上，它用力挣扎，最终挣脱了绳子。小鸟落地后，捡起一支铅笔，在一张纸上开始画画。",
    "S1950E53 - The Egg And Jerry_scene046.mp4": "画面中，一只猫坐在树桩上，头戴红色帽子，手持工具，似乎在进行某种活动。前景中，一只手握着一支大铅笔，笔尖指向猫的方向。背景是绿色的草地、白色围栏和一栋房子，整体画面呈现出卡通风格。",
    "S1950E53 - The Egg And Jerry_scene047.mp4": "一只啄木鸟坐在一片大叶子上，手里拿着一支铅笔，正在纸上画画。背景是森林，有树木和一朵黄色的花。啄木鸟先是低头画画，然后抬头看向树干，接着又低头继续画画。",
    "S1950E53 - The Egg And Jerry_scene048.mp4": "啄木鸟伍迪用爪子紧握一支大铅笔，用力向上推，铅笔顶端的橡皮擦部分抵在电线杆上，背景是蓝天和绿色的灌木。",
    "S1950E53 - The Egg And Jerry_scene049.mp4": "啄木鸟伍迪在森林里用铅笔在纸上写字。",
    "S1950E53 - The Egg And Jerry_scene050.mp4": "一个手握铅笔在纸上画图，图中有一只猫、一根标有“30”的杆子和一个点X，铅笔在纸上画出弧线并标注Y，然后在下方写下比例公式“X:30 = 30:Y”。",
    "S1950E53 - The Egg And Jerry_scene051.mp4": "一只啄木鸟拿着铅笔在树干上画了一个“X”，然后用喙啄树干，树干被啄开，啄木鸟被弹飞出去，树干裂开，露出黄色的内部，啄木鸟落在地上，树干裂开的口子越来越大。",
    "S1950E53 - The Egg And Jerry_scene052.mp4": "一个木制电线杆在风中逐渐倾斜，最终倒下，电线随之散落。背景是蓝天和绿色的草地。",
    "S1950E53 - The Egg And Jerry_scene053.mp4": "汤姆猫手持斧头，准备攻击站在树桩上的杰瑞鼠。突然，一根巨大的木头从天而降，砸在汤姆头上，将他击倒在地。木头滚落，汤姆被压在树桩下，痛苦地呻吟。",
    "S1950E53 - The Egg And Jerry_scene054.mp4": "一只棕色的小老鼠从树后跑出，来到一个巨大的黄色圆木前。一只红色的小鸟从树后飞出，落在小老鼠身边。小老鼠抱起小鸟，小鸟被抱起时张开翅膀。随后，一只体型更大的红头鸟从树上飞下来，站在小老鼠面前，张开翅膀，表情愤怒。"
}