{
    "28. Part Time Pal_scene001.mp4": "视频开始时显示一个黑色背景，右下角有白色数字“0110544170204083”。随后画面逐渐变暗，出现“CARTOON”字样，下方有“COLOR BY TECHNICOLOR”字样，上方有“METRO-GOLDWYN-MAYER”字样。",
    "28. Part Time Pal_scene002.mp4": "这是一个米高梅动画片头，蓝色背景上有一个咆哮的狮子形象，下方有“CARTOON”字样和“COLOR BY TECHNICOLOR”的文字。",
    "28. Part Time Pal_scene003.mp4": "视频开始显示了米高梅卡通的标志，随后画面转黑，接着出现“Tom and Jerry”的标题，同时伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "28. Part Time Pal_scene004.mp4": "这是一个《Tom and Jerry》动画片的片头，展示了标题“PART TIME PAL”，导演William Hanna和Joseph Barbera，动画师Michael Lah、Kenneth Muse和Ed Barge，音乐由Scott Bradley创作，制片人Fred Quimby。背景是夜晚的城市景象，有路灯和建筑物的剪影。画面底部有版权信息和制作公司标志。",
    "28. Part Time Pal_scene005.mp4": "画面中，一只黑色的猫坐在地上，抬头看着一位穿着蓝色衣服、拿着扫帚的女性。女性似乎在对猫说话，画面下方有中文字幕“托马斯先生”。背景是一个室内环境，可以看到冰箱等家具。",
    "28. Part Time Pal_scene007.mp4": "一只小老鼠从墙角的洞里探出头，警惕地观察四周，随后迅速跑出洞外。",
    "28. Part Time Pal_scene008.mp4": "一只老鼠从画面左侧跑入，它跑到一个地板上的方形盖子前，用爪子掀开盖子，露出下面的洞。老鼠把盖子拖到一边，然后站在盖子上，看着洞，似乎在思考下一步行动。",
    "28. Part Time Pal_scene009.mp4": "在厨房里，汤姆猫拿着扫帚和簸箕，被杰瑞鼠追赶。汤姆猫慌张地逃跑，杰瑞鼠紧随其后。汤姆猫不小心踩到地板上的洞，掉进了洞里。杰瑞鼠站在洞边，看着汤姆猫掉下去，然后开始得意地跳舞。汤姆猫在洞里挣扎，杰瑞鼠继续跳舞，最后汤姆猫从洞里爬出来，杰瑞鼠则跑开了。",
    "28. Part Time Pal_scene010.mp4": "一只橙色的小老鼠快速跑向冰箱，用爪子抓住冰箱门把手，用力拉开冰箱门，露出里面装满食物的冰箱内部。",
    "28. Part Time Pal_scene011.mp4": "在冰箱里，杰瑞偷吃玉米，被汤姆发现并抢走玉米，杰瑞愤怒地倒立、翻滚，最终躺在盘子上。",
    "28. Part Time Pal_scene012.mp4": "汤姆猫在冰箱前，手里拿着玉米，看到杰瑞鼠在冰箱里，愤怒地挥拳攻击，最后被杰瑞鼠击中并飞出画面。",
    "28. Part Time Pal_scene013.mp4": "一只棕色的小老鼠在房间内奔跑，经过一把扫帚和两个玻璃瓶。",
    "28. Part Time Pal_scene014.mp4": "一只小老鼠在房间里推倒了一排玻璃瓶，然后迅速逃跑。猫汤姆追了上去，结果在逃跑过程中被玻璃瓶绊倒，摔倒在地，狼狈不堪。",
    "28. Part Time Pal_scene015.mp4": "猫从楼梯上摔下，撞到一个标有“CIDER XXX”的苹果酒桶上，导致苹果酒喷溅。随后，一只老鼠从旁边的箱子上探出头来。",
    "28. Part Time Pal_scene016.mp4": "一只棕色的小老鼠站在木制平台上，旁边有一个标有“CIDER XXX”的木桶。小老鼠先是警惕地环顾四周，然后小心翼翼地向木桶靠近，似乎在寻找什么或准备做某事。背景是深蓝色的天空和一些红色的物体，可能是船的一部分。",
    "28. Part Time Pal_scene017.mp4": "一个木桶上，黄色液体溅起，一只灰色的猫从液体中冒出来，它先是惊讶，然后露出得意的笑容，最后爬出桶外，表情变得狡黠。",
    "28. Part Time Pal_scene018.mp4": "在一间仓库里，猫汤姆趴在一个标有“CIDER XXX”的木桶上，眼睛盯着老鼠杰瑞。杰瑞站在一堆箱子上，看起来很紧张。汤姆开始在桶上做出各种夸张的动作，包括伸展、翻滚和跳跃。他跳到旁边的红色箱子上，然后继续在箱子和桶之间跳跃，最后站在一堆箱子上，伸出手去抓杰瑞。杰瑞则一直躲在箱子后面，看起来很害怕。整个场景充满了紧张和幽默的气氛。",
    "28. Part Time Pal_scene019.mp4": "猫和老鼠在木箱上互动，猫试图抓住老鼠，老鼠则灵活躲避。",
    "28. Part Time Pal_scene020.mp4": "在一间厨房里，汤姆猫正被杰瑞鼠用尾巴缠住，被迫拖着他在房间里奔跑。汤姆猫试图挣脱，但杰瑞鼠紧紧抓住他的尾巴不放。他们跑过楼梯、橱柜和冰箱，汤姆猫在冰箱前停下，试图打开冰箱门，但杰瑞鼠依然紧跟着他。汤姆猫最终打开冰箱，里面装满了食物和饮料，他看起来非常惊讶和失望。",
    "28. Part Time Pal_scene021.mp4": "汤姆猫打开冰箱，伸手拿取一个装饰有樱桃的黄色果冻蛋糕。他将蛋糕从冰箱中取出，双手捧着，脸上露出满意的笑容。随后，他轻轻晃动蛋糕，果冻从顶部的樱桃处缓缓滴落，汤姆猫开心地看着这一幕。",
    "28. Part Time Pal_scene022.mp4": "汤姆猫拿着一个装饰着樱桃的黄色蛋糕，向杰瑞鼠伸出手，试图邀请它分享。杰瑞鼠站在一旁，表情警惕，似乎对汤姆的举动感到怀疑。背景是一个厨房，冰箱里放着各种食物。汤姆猫的表情从期待变为惊讶，最后又恢复期待，而杰瑞鼠始终保持着警惕和不信任的姿态。",
    "28. Part Time Pal_scene023.mp4": "汤姆猫从冰箱里拿出一盘果冻，杰瑞鼠站在旁边。汤姆猫试图把果冻递给杰瑞鼠，但果冻突然爆炸，汤姆猫被溅到。他愤怒地转身，伸手去拿冰箱里的两瓶绿色饮料，准备报复。",
    "28. Part Time Pal_scene024.mp4": "汤姆猫在冰箱前拿着两瓶绿色的饮料，他开心地喝着，结果饮料突然喷出来，弄得到处都是泡沫，他被泡沫覆盖，看起来像一个白胡子老人。随后，他甩掉泡沫，露出得意的笑容，最后他盯着冰箱里的烤鸡，露出贪婪的表情。",
    "28. Part Time Pal_scene025.mp4": "汤姆猫在冰箱里看到一只烤鸡，兴奋地搓手，然后伸手去拿旁边的奶油瓶。",
    "28. Part Time Pal_scene026.mp4": "汤姆猫站在打开的冰箱前，手里拿着一瓶牛奶和一只烤鸡。他先是用牛奶瓶轻轻拍打烤鸡，然后又用牛奶瓶对着烤鸡喷洒，最后将烤鸡举到嘴边，似乎准备享用。整个过程中，汤姆猫的表情从得意到兴奋，显得非常满足。冰箱内摆放着各种食物，包括水果、蔬菜和奶制品。",
    "28. Part Time Pal_scene027.mp4": "汤姆猫在厨房里拿着一瓶牛奶和一只烤鸡，他先是把烤鸡套在头上，然后又把它拿下来，接着他把烤鸡放在地上，打开冰箱门，看到杰瑞鼠从冰箱里跑出来。汤姆猫试图用牛奶瓶引诱杰瑞鼠，但杰瑞鼠却把牛奶瓶拿走了。汤姆猫感到非常生气，他踩在烤鸡上，试图抓住杰瑞鼠，但杰瑞鼠成功地逃走了。",
    "28. Part Time Pal_scene028.mp4": "汤姆猫在冰箱前，伸手去拿架子上的番茄，接着他伸手去拿架子上的番茄酱，然后他伸手去拿架子上的牛奶，最后他伸手去拿架子上的鸡蛋，结果导致所有物品都掉下来，牛奶和番茄酱洒了一地。",
    "28. Part Time Pal_scene029.mp4": "一个穿着红色花袍、黄色拖鞋的角色从楼梯上方的门中走出，站在楼梯上，向下张望并发出疑问，随后开始下楼。",
    "28. Part Time Pal_scene030.mp4": "在厨房里，汤姆猫拿着杰瑞鼠，杰瑞鼠跳进派里，汤姆猫看着杰瑞鼠在派里跳舞，然后汤姆猫倒立在派上，杰瑞鼠把派里的奶油涂在汤姆猫的头上，汤姆猫吃掉奶油，杰瑞鼠开心地笑着。",
    "28. Part Time Pal_scene031.mp4": "一只小老鼠站在一个被弄脏的冰箱前，看起来很生气，它在喊“托马斯！托马斯！”，并威胁说“如果你搞脏冰箱的话”。",
    "28. Part Time Pal_scene032.mp4": "视频中，一只老鼠在房间里奔跑并威胁要剥掉某人的皮。随后，一只猫出现并抓住了老鼠。接着，一位穿着红色衣服的女性角色进入房间，发现冰箱被弄得一团糟，她威胁要给造成混乱的人一巴掌。猫躲在门后，试图向女性角色解释情况，但老鼠从门后跑出来，猫随即用火柴点燃了什么东西。整个场景充满了紧张和幽默的气氛。",
    "28. Part Time Pal_scene033.mp4": "汤姆猫拿着点燃的火柴，靠近一个穿着圣诞老人服装的角色的脚。他点燃了另一根火柴，然后杰瑞老鼠突然出现，被火焰吓到并跳开。汤姆猫看着杰瑞，似乎在计划如何对付它。",
    "28. Part Time Pal_scene034.mp4": "汤姆猫叼着一只老鼠，悄悄从门后探出头，然后迅速缩回。随后，穿着红色睡袍的杰瑞太太走近，疑惑地问道：“是你吗，汤姆？”",
    "28. Part Time Pal_scene035.mp4": "一只灰色的猫（汤姆）躲在门后，一只棕色的小老鼠（杰瑞）站在门外，用前爪抓着猫的下巴，猫的表情显得无奈和疲惫。背景是一个室内走廊，墙壁是粉黄色，地板是蓝绿色瓷砖。画面下方出现中文字幕：“早上要完全除掉那脾气不好的家伙”。",
    "28. Part Time Pal_scene036.mp4": "一个穿着红色衣服的女人走过门口，汤姆猫从门后探出头来，露出得意的笑容。他伸出手，做出夸张的姿势，然后转身走向房间。突然，一只小猫从门后出现，汤姆猫被吓了一跳，转身逃跑，但不小心踩到了地上的一滩液体，滑倒并翻滚起来。",
    "28. Part Time Pal_scene037.mp4": "汤姆猫试图偷冰箱里的食物，结果被冰箱里的水喷了一身，他痛苦地坐在地上，用手擦眼睛，表情痛苦。",
    "28. Part Time Pal_scene038.mp4": "视频展示了一个混乱的厨房场景，黄色橱柜上和地板上溅满了黄色和红色的油漆，一个红色的椅子倒在地上，周围散落着破碎的杯子和油漆桶。墙壁和门上也有油漆污渍，整个场景显得非常凌乱。",
    "28. Part Time Pal_scene039.mp4": "汤姆猫坐在地上，看起来很沮丧，他用手捂住脸，然后放下手，露出痛苦的表情，接着他转过身去，似乎在躲避什么。背景是一个打开的冰箱，里面有一些食物和容器。",
    "28. Part Time Pal_scene040.mp4": "在厨房里，杰瑞拿着一个鸡腿，得意洋洋地走着，而汤姆则坐在地上，双手交叉，表情愤怒。杰瑞把鸡腿举起来，似乎在炫耀，然后突然扔掉鸡腿，汤姆迅速扑过去试图抓住它，但杰瑞灵活地躲开了。汤姆愤怒地追着杰瑞，杰瑞则在汤姆面前跳舞，逗得汤姆更加生气。最后，汤姆扑向杰瑞，但杰瑞巧妙地躲开，汤姆摔倒在地，显得非常狼狈。",
    "28. Part Time Pal_scene041.mp4": "在粉色的客厅里，一只灰色的猫从右侧快速跑过，追逐着一只棕色的小老鼠。猫在追逐过程中翻滚、跳跃，最终撞到右侧的家具上，然后消失在画面中。小老鼠则一直跑向画面左侧，最后也消失在画面中。",
    "28. Part Time Pal_scene042.mp4": "在浴室里，杰瑞跑进浴室，站在写有“BATH”的垫子上。汤姆突然从门外冲进来，一把抓住杰瑞，将他甩向挂在墙上的毛巾。杰瑞被毛巾裹住，悬在空中。",
    "28. Part Time Pal_scene043.mp4": "汤姆猫在浴室里躺在垫子上，突然被水龙头喷出的水冲得翻滚起来，最后摔在地上。",
    "28. Part Time Pal_scene044.mp4": "一个厨房架子上放着一瓶标有“BAT RUM”的液体，旁边是其他物品。瓶子突然倾斜，液体流出，然后瓶子掉落消失。",
    "28. Part Time Pal_scene045.mp4": "汤姆猫躺在地上，一个番茄酱瓶从上方掉落并砸在他的头上，他睁开眼睛，表情显得有些惊讶和困惑。",
    "28. Part Time Pal_scene046.mp4": "一只灰色的猫躺在地上，嘴里叼着一个装有黄色液体的瓶子，瓶子上贴有“BAY RUM”的标签。猫的眼睛半睁，显得醉醺醺的，四肢放松，脚趾微微弯曲。背景是粉红色的瓷砖墙和浅蓝色的地面。",
    "28. Part Time Pal_scene047.mp4": "汤姆猫的眼睛特写，眼睛里有“FULL”字样，表情专注地看着前方。",
    "28. Part Time Pal_scene048.mp4": "在浴室里，汤姆猫喝下了一瓶“NEW AVA”后，变得非常虚弱，躺在地上。杰瑞鼠站在他面前，好奇地看着他。汤姆猫慢慢坐起来，舌头伸出来，看起来很不舒服。他试图用手擦掉脸上的液体，但无济于事。他开始向杰瑞鼠展示他的“新能力”，并试图拉住杰瑞鼠的手。杰瑞鼠看起来很害怕，但还是被汤姆猫抓住了。汤姆猫抱着杰瑞鼠，慢慢走向浴室的镜子，然后走进了另一个房间。",
    "28. Part Time Pal_scene049.mp4": "在餐桌旁，汤姆猫用纸巾给杰瑞老鼠戴上厨师帽，然后做出夸张的手势和表情。杰瑞老鼠坐在书上，先是惊讶，然后露出得意的笑容。汤姆猫随后离开画面，杰瑞老鼠独自坐在书上，张开双臂，显得非常开心。",
    "28. Part Time Pal_scene050.mp4": "汤姆猫坐在餐桌前，披上桌布假装成幽灵，然后拿起刀叉，做出各种夸张的表情和动作，似乎在等待食物。他用刀叉敲击桌面，表现出饥饿和期待，最后用刀叉指向一个蓝色的盖子，似乎在等待揭开盖子的美食。",
    "28. Part Time Pal_scene051.mp4": "一个红色的卡通角色躺在床上，盖着蓝色的被子，房间内光线昏暗，窗帘半开，床边有一双拖鞋和一个地毯，墙上挂着一个铃铛。角色在睡觉，画面静止不动。",
    "28. Part Time Pal_scene052.mp4": "汤姆猫坐在餐桌前，手里拿着刀叉，表情得意。杰瑞鼠突然从桌子下钻出，抢走刀叉并试图掀开桌上的蓝色盖子，汤姆猫则显得惊讶和愤怒。",
    "28. Part Time Pal_scene053.mp4": "一只穿着围裙的猫坐在椅子上，面前有一只小老鼠。猫用爪子抓老鼠，老鼠则试图逃跑并反击。猫最终将老鼠抓起，然后又放下，最后猫起身离开，老鼠留在原地。",
    "28. Part Time Pal_scene054.mp4": "视频中，汤姆猫从楼梯旁的地毯上走来，他先是用爪子摸了摸自己的脸，然后又摸了摸自己的耳朵，接着他拿起一把红色的雨伞，用伞尖轻轻敲击楼梯扶手，发出“叮叮当当”的声音。这时，杰瑞老鼠从楼梯下方爬上来，他看到汤姆猫后，立刻跑向汤姆猫，用爪子拍打汤姆猫的腿，汤姆猫则用爪子拍打杰瑞老鼠，两人在楼梯旁嬉戏打闹。最后，汤姆猫用爪子将杰瑞老鼠推到了楼梯下方，自己则转身走开了。",
    "28. Part Time Pal_scene055.mp4": "一只灰色的猫从楼梯上跑下来，来到一扇门前。它先是用爪子挠门，然后用头撞门，最后用脚踢门，试图把门打开。门被踢开后，猫探头看了看门外的情况。",
    "28. Part Time Pal_scene056.mp4": "在卧室里，汤姆猫从床上醒来，伸了个懒腰，然后走向床边的桌子，拿起一个黄色的水壶，装满水后，他开始用它做各种滑稽的动作，同时嘴里说着“第一是为了钱，第二是为了表演”。",
    "28. Part Time Pal_scene057.mp4": "一只小老鼠站在一扇半开的门前，紧张地观察着。它先是做准备动作，然后开始奔跑，但被突然出现的椅子和碗砸中，显得非常惊慌。最终，它迅速逃离现场。",
    "28. Part Time Pal_scene058.mp4": "猫汤姆被女仆用扫帚追赶，他头戴花瓶逃跑，花瓶被扫帚击碎。汤姆继续逃跑，女仆追到楼梯口，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆追到楼梯口后，汤姆从楼梯上跑下，女仆",
    "28. Part Time Pal_scene059.mp4": "一个房间内一片狼藉，门被撞开，家具散落，物品破碎。一只小老鼠从楼梯上跳下，迅速跑向门口，似乎在躲避什么。",
    "28. Part Time Pal_scene060.mp4": "在巨大的月亮背景下，两个剪影角色——一个手持扫帚的巫婆和一个较小的动物角色——在地面上奔跑。巫婆挥舞着扫帚，似乎在追赶或与小动物互动。随着镜头推进，他们穿过树木和灌木丛，背景逐渐变暗，最终画面转为黑色，显示“THE END”字样。",
    "28. Part Time Pal_scene061.mp4": "视频开始时显示了“The End”的字样，背景为红色，文字为蓝色，随后逐渐出现“An M.G.M Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样。之后画面逐渐变暗，最终完全变为黑色。"
}