{
    "S1950E49 - Smarty Cat_scene001.mp4": "画面从全黑逐渐过渡到一个深蓝色背景，中央出现一个圆形标志，标志上方有文字“A METRO-GOLDWYN-MAYER”，下方是醒目的黄色大字“CARTOON”，再下方是红色小字“COLOR BY TECHNICOLOR”。整体呈现出经典动画片头的风格。",
    "S1950E49 - Smarty Cat_scene002.mp4": "视频展示了米高梅动画片头，蓝色背景上有一个圆形框架，框架内是一只咆哮的狮子，下方有“A METRO-GOLDWYN-MAYER CARTOON”字样，以及“COLOR BY TECHNICOLOR”的标注。狮子在框架内不断张合嘴巴，做出咆哮的动作。",
    "S1950E49 - Smarty Cat_scene003.mp4": "视频展示了米高梅动画的标志，随后出现“Tom and Jerry”的标题，背景为深蓝色，Tom和Jerry的卡通形象分别位于标题两侧。",
    "S1950E49 - Smarty Cat_scene004.mp4": "视频展示了经典动画《猫和老鼠》的标题画面，背景为蓝色，左侧是老鼠杰瑞，右侧是猫汤姆，中间有“Tom and Jerry”的字样。随后画面中出现“SMARTY CAT directed by WILLIAM HANNA and JOSEPH BARBERA”的字样。",
    "S1950E49 - Smarty Cat_scene005.mp4": "这是一个动画片的片头，标题为《Smarty Cat》，由威廉·汉纳和约瑟夫·巴伯拉执导。画面左侧有一个老式电影放映机，右侧是一个白色矩形框，框内用红色字体写着片名，下方用蓝色字体写着导演的名字。背景是蓝色的。",
    "S1950E49 - Smarty Cat_scene006.mp4": "视频展示了动画片《Smarty Cat》的片尾制作人员名单。名单中列出了动画师、布局师、背景设计师和音乐制作人等工作人员的名字。随后，画面过渡到由Fred Quimby制作的字样。整个画面背景为浅色，文字以蓝色和红色呈现，风格简洁复古。",
    "S1950E49 - Smarty Cat_scene007.mp4": "夜晚，三只猫从石墙后探出头来，偷偷观察前方。",
    "S1950E49 - Smarty Cat_scene008.mp4": "夜晚，汤姆猫从窗户探出头，手里举着一块写着“Nobody Home”的牌子。",
    "S1950E49 - Smarty Cat_scene009.mp4": "三只猫在夜晚悄悄地从石墙后探出头来，随后一起跑动，其中一只黑猫提着一个绿色的桶。它们跑过一个狗窝，狗窝里有一只狗正在睡觉。三只猫继续向前跑动。",
    "S1950E49 - Smarty Cat_scene010.mp4": "汤姆猫站在门口，兴奋地打开门，迎接从门外闯入的三只猫。其中一只黑猫手持绿色箱子，一只橙猫和一只粉猫则合力扛着一根蓝色管子。三只猫表情欢快，似乎带着礼物或道具进入房间，与汤姆猫互动，场面充满欢乐和期待。",
    "S1950E49 - Smarty Cat_scene011.mp4": "一只棕色的小老鼠从楼梯下的洞里探出头来，然后小心翼翼地爬出来，沿着楼梯柱子底部慢慢移动。",
    "S1950E49 - Smarty Cat_scene012.mp4": "在客厅里，三只猫坐在沙发上，其中一只黑猫正在操作一台老式电影放映机，另外两只猫（一只蓝色，一只橙色）和一只小猫在旁边观看。黑猫兴奋地操作放映机，其他猫则表现出期待和兴奋的神情，随后黑猫似乎在与它们互动，它们都显得非常开心。",
    "S1950E49 - Smarty Cat_scene013.mp4": "一只小老鼠坐在绿色沙发上，被一只蓝猫从后面伸手抓住尾巴提起来，小老鼠悬在空中，表情惊恐。",
    "S1950E49 - Smarty Cat_scene014.mp4": "夜晚，一只小老鼠从一座房子的门中跑出，它在雪地上奔跑，镜头跟随它移动，最终它跑出了画面。",
    "S1950E49 - Smarty Cat_scene015.mp4": "一只灰色的斗牛犬趴在水边，戴着红色项圈，眼睛半闭，似乎在打盹。一只棕色的小老鼠从画面右侧跑过，斗牛犬被惊醒，抬起一只前爪，随后又恢复原状继续打盹。背景是夜晚的湖面和远处的树木。",
    "S1950E49 - Smarty Cat_scene016.mp4": "一只灰色的狗在水中，它的鼻子上有一只小老鼠。狗闭着眼睛，似乎在睡觉或休息，而老鼠则在狗的鼻尖上，看起来很平静。背景是蓝色的水。",
    "S1950E49 - Smarty Cat_scene017.mp4": "视频片段展示了经典动画《猫和老鼠》中的一个场景。一开始，三只猫坐在沙发上，其中一只猫正在操作一台老式电影放映机，放映机投射出一束光，屏幕上显示“TOM the TERRIFIC CAT”和“PART ONE LOVER BOY!”。随后，场景切换到夜晚，一只名叫“KILLER”的狗在狗窝里睡觉，而汤姆猫则在狗窝上方的墙上偷偷观察，露出狡黠的笑容。整个画面充满了经典动画的幽默和紧张气氛。",
    "S1950E49 - Smarty Cat_scene018.mp4": "夜晚，一座房子在星空下静谧地矗立，窗户透出温暖的灯光，一只猫在窗内悠闲地坐着。镜头逐渐拉近，聚焦于窗户和猫的身影。",
    "S1950E49 - Smarty Cat_scene019.mp4": "夜晚，一扇窗户内，一个女孩的剪影正在用小刷子清洁窗户，窗外是深蓝色的夜空。",
    "S1950E49 - Smarty Cat_scene020.mp4": "夜晚，汤姆猫趴在墙头，先是张大嘴巴，然后转头看向一侧，接着又转回正面，再次张大嘴巴。",
    "S1950E49 - Smarty Cat_scene021.mp4": "夜晚，一只猫从窗户探出头，随后又缩回屋内。镜头转向另一扇窗户，一只戴着红色蝴蝶结的猫从窗台上探出头，凝视着远方。",
    "S1950E49 - Smarty Cat_scene022.mp4": "一只黑猫穿着黑色西装，站在一台老式电影放映机旁，放映机正投射出一束光。黑猫面带微笑，先是用手指向放映机投射的方向，然后又转头看向镜头，表情自信而得意。",
    "S1950E49 - Smarty Cat_scene023.mp4": "夜晚，汤姆从墙后跳出，发现地上有红砖，他捡起一块举在手中。这时，一只斗牛犬从远处跑来，停下后与汤姆对视，随后斗牛犬愤怒地冲向汤姆，但汤姆迅速躲到墙后。",
    "S1950E49 - Smarty Cat_scene024.mp4": "夜晚，汤姆猫手持红砖，站在墙边，准备攻击趴在墙头的杰瑞鼠。杰瑞鼠看到汤姆猫后，表情愤怒，准备反击。汤姆猫突然将红砖扔向杰瑞鼠，杰瑞鼠被击中后倒地，汤姆猫趁机逃跑。",
    "S1950E49 - Smarty Cat_scene025.mp4": "一只棕色的小老鼠从沙发靠背上探出头，然后跳到沙发扶手上，开心地挥舞着双臂。",
    "S1950E49 - Smarty Cat_scene026.mp4": "在夜晚的户外，一只黑猫汤姆追逐着一只白猫，白猫站在阳台上。汤姆试图抓住白猫，但白猫巧妙地躲避。随后，一只大狗出现，汤姆和白猫都惊讶地看着它。大狗靠近阳台，白猫显得害怕，而汤姆则表现出愤怒和威胁的姿态。最终，汤姆和大狗在阳台上对峙，汤姆似乎准备攻击大狗。",
    "S1950E49 - Smarty Cat_scene028.mp4": "一只黑猫站在一台放映机旁，放映机正投射出一束光。黑猫先是微笑，然后用手抚摸自己的脸，接着做出夸张的表情，最后指向一侧。",
    "S1950E49 - Smarty Cat_scene029.mp4": "一只小老鼠坐在绿色沙发上，被一只蓝猫用爪子抓住尾巴悬在空中。小老鼠表情惊恐，蓝猫则露出得意的笑容。",
    "S1950E49 - Smarty Cat_scene030.mp4": "夜晚，一只小老鼠从一座房子的门口跑出来，沿着一条小路奔跑，镜头跟随老鼠移动，最终老鼠跑出了画面。",
    "S1950E49 - Smarty Cat_scene031.mp4": "一只紫色的斗牛犬趴在冰面上，眼睛半闭，似乎在打盹。一只棕色的小老鼠从冰面跳过，斗牛犬被惊醒，眼睛睁大，嘴巴张开，显得很惊讶。",
    "S1950E49 - Smarty Cat_scene032.mp4": "一只灰色的狗闭着眼睛，似乎在睡觉。突然，它的右眼睁开，可以看到一只小老鼠在眼内偷看。狗的表情从放松变为惊讶。",
    "S1950E49 - Smarty Cat_scene033.mp4": "一只黑猫站在一台老式电影放映机旁，面带微笑，随后启动放映机，投射出一束光。光束扫过屏幕，显示出绿色背景的标题：“PART TWO THE DUMB DOG”。接着画面转暗，最后呈现一个透过铁丝网看到的湖边景色。",
    "S1950E49 - Smarty Cat_scene035.mp4": "视频中，汤姆猫试图用工具打开栅栏，但被一只戴着带刺项圈的斗牛犬挡住。汤姆猫用工具敲击斗牛犬的项圈，斗牛犬痛苦地叫喊并试图攻击汤姆猫。汤姆猫继续尝试打开栅栏，斗牛犬则不断试图阻止他。最终，汤姆猫成功打开栅栏，但斗牛犬仍然躺在地上，显得非常痛苦。",
    "S1950E49 - Smarty Cat_scene036.mp4": "一只灰色的斗牛犬躺在地上，戴着红色项圈，正在咬着一个大骨头。它张开嘴，露出牙齿，舌头伸出，看起来非常享受。背景是铁丝网和砖墙，地面是草地。",
    "S1950E49 - Smarty Cat_scene037.mp4": "在户外的草地上，汤姆猫拿着钓鱼竿和红色盒子，旁边有一只戴着红色项圈的灰色斗牛犬。汤姆猫试图用钓鱼竿钓住斗牛犬，斗牛犬则不断躲避和攻击汤姆猫。汤姆猫被斗牛犬推倒在地，随后爬起来继续钓鱼。斗牛犬最终被汤姆猫的钓鱼竿吸引，靠近并试图咬住钓鱼竿，但汤姆猫巧妙地躲开了。最后，汤姆猫挂在铁丝网上，斗牛犬则趴在草地上，看着汤姆猫。",
    "S1950E49 - Smarty Cat_scene038.mp4": "在昏暗的房间里，三只猫坐在沙发上，一只黑猫站在一台放映机旁，放映机投射出光束。黑猫兴奋地挥舞着手臂，似乎在介绍或展示什么，其他两只猫则专注地看着前方。随着黑猫的动作，旁边的橙色猫和蓝色猫的表情也发生了变化，从开心到惊讶。整个场景充满欢乐和期待的氛围。",
    "S1950E49 - Smarty Cat_scene039.mp4": "一只棕色的小老鼠从门上的金色猫眼孔中探出头，好奇地向外张望。",
    "S1950E49 - Smarty Cat_scene040.mp4": "四只猫在观看电影，其中一只黑猫被投影机的光束吸引，跃起并被光束击中，随后被弹飞出去。",
    "S1950E49 - Smarty Cat_scene041.mp4": "一只老鼠从门下钻出，一只黑猫从门内跳出追赶，黑猫在空中翻滚后摔倒在地，躺在地上看着窗外的月亮。",
    "S1950E49 - Smarty Cat_scene042.mp4": "在夜晚的池塘中，一只小老鼠正在水中游泳，突然一只大狗从水边探出头来，看着小老鼠。",
    "S1950E49 - Smarty Cat_scene043.mp4": "夜晚，星空下，一座房子坐落在山坡上，周围环绕着树木。房子的门从黄色变为蓝色，随后出现一道闪电，门又恢复为黄色。",
    "S1950E49 - Smarty Cat_scene044.mp4": "一只灰色的狗躺在水边，戴着红色项圈，旁边有一个装着骨头的碗。一只棕色的小老鼠从远处跑来，靠近狗，然后跳到狗的背上，接着又跳到狗的尾巴上，最后跳到狗的后面，跑出了画面。狗始终躺着不动，似乎在睡觉。背景是夜晚的湖边，有树木和远处的山丘。",
    "S1950E49 - Smarty Cat_scene045.mp4": "夜晚，一只紫色的狗趴在窗户下，一只小老鼠从它身后跑过，抓住它的尾巴，狗被拉得悬在半空中，狗挣扎着，但老鼠紧紧抓住不放。",
    "S1950E49 - Smarty Cat_scene046.mp4": "视频开始时，一个绿色的屏幕显示着“PART THREE NEW LEASH ON LIFE”的字样。随后，画面逐渐变暗，最终切换到一份报纸的特写，标题为“LEASH LAW PASSED”，副标题为“PUBLIC SAFETY PUTS DOGS ON LEASH”。",
    "S1950E49 - Smarty Cat_scene047.mp4": "视频展示了一份报纸的特写，标题为“LEASH LAW PASSED”，副标题是“PUBLIC SAFETY PUTS DOGS ON LEASH”。报纸上有一幅插图，描绘了三只狗被拴着，下方的文字写着“It Shouldn't Happen to a Dog... say Dogs”。背景为蓝色。",
    "S1950E49 - Smarty Cat_scene049.mp4": "一只紫色的狗从狗屋里探出头，用绳子拉扯，随后狗屋被拉扯得变形，狗被甩出狗屋，绳子缠绕在狗屋门口。",
    "S1950E49 - Smarty Cat_scene051.mp4": "夜晚，一扇门突然被打破，汤姆猫从门内冲出，被各种物品砸中。随后，其他几只猫和一只狗也从门内冲出，纷纷跑向门外。",
    "S1950E49 - Smarty Cat_scene052.mp4": "视频开始时，一只小老鼠站在窗台上，推着一个黑色的相机。随着镜头推进，相机的镜头逐渐放大，画面中出现了一只猫和一只狗在草地上追逐。猫追着狗跑，最终狗跑出了画面。接着，画面中出现了“THE END”的字样，随后画面切换到“Metro-Goldwyn-Mayer CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样，最后画面变黑。",
    "S1950E49 - Smarty Cat_scene053.mp4": "这是一个米高梅动画片的片头，蓝色背景上显示“A Metro-Goldwyn-Mayer CARTOON MADE IN HOLLYWOOD, U.S.A.”字样，随后画面逐渐变暗至全黑。"
}