{
    "E54.Cue.Ball.Cat_scene001.mp4": "画面从全黑开始，随后出现米高梅卡通的标志，标志上方写着“A METRO-GOLDWYN-MAYER”，中间是“CARTOON”，下方是“COLOR BY TECHNICOLOR”。背景为深蓝色，标志为金色和蓝色。",
    "E54.Cue.Ball.Cat_scene002.mp4": "这是一个米高梅动画片头，背景为深蓝色，中央有一个圆形框，框内是一只咆哮的狮子。狮子上方写着“A METRO-GOLDWYN-MAYER”，下方是大字“CARTOON”，再下方是“COLOR BY TECHNICOLOR”。狮子在圆形框内不断咆哮，嘴巴张合，表情凶猛。",
    "E54.Cue.Ball.Cat_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现“Tom and Jerry”的标题画面，其中Tom猫和Jerry鼠的形象分别位于标题两侧。",
    "E54.Cue.Ball.Cat_scene004.mp4": "这是一个《猫和老鼠》动画片的片头，标题为“Cue Ball Cat”，由威廉·汉纳和约瑟夫·巴伯拉执导。画面中展示了动画师、音乐作曲家和制片人的名字，背景是绿色的台球桌，上面摆放着一个三角形的台球架，里面装满了彩色的台球。整个画面充满了经典卡通风格的幽默感和活力。",
    "E54.Cue.Ball.Cat_scene005.mp4": "视频开头显示“Produced by FRED QUIMBY”的字样，随后画面转为全黑，接着出现一个昏暗的台球桌场景，台球桌周围环境较暗，只能隐约看到台球桌和部分台球。",
    "E54.Cue.Ball.Cat_scene006.mp4": "镜头从前景的台球桌和台球开始，逐渐向右平移，展示了一排排空无一人的台球桌。天花板上悬挂着装饰性的灯饰，房间内光线昏暗，仅有一束聚光灯照亮了远处的台球桌。整个场景显得安静而空旷。",
    "E54.Cue.Ball.Cat_scene008.mp4": "视频中，一只棕色的小老鼠正在床上睡觉，被子是紫色的，床头柜上有一盏台灯。突然，一个标有数字“10”的蓝色台球从上方滚落，砸在老鼠身上，老鼠被惊醒并被弹起，最终被台球压在床头。",
    "E54.Cue.Ball.Cat_scene009.mp4": "一只棕色的小老鼠骑在一个标有数字10的蓝白相间的台球上，在一个弯曲的管道中滚动前进。管道内部呈金属质感，背景为黑色。小老鼠紧抓台球，表情专注，随着台球滚动，镜头跟随其移动，最终小老鼠从管道出口滑出，台球滚落。",
    "E54.Cue.Ball.Cat_scene010.mp4": "视频展示了一只老鼠在台球桌的球架中，被多个台球挤压和推挤。起初，老鼠被一个蓝白相间的台球和一个绿色的9号球挤压，随后被一个橙色的1号球推挤。老鼠从球架中探出头来，表情从惊讶变为愤怒，然后开始挣扎并试图逃脱。最终，老鼠成功从球架中爬出来，表情变得得意和满足。",
    "E54.Cue.Ball.Cat_scene011.mp4": "一只棕色的小老鼠从木制架子的左侧跑入画面，它快速地向右移动，最终钻进架子右侧的一个圆形洞口，随后消失在画面中。",
    "E54.Cue.Ball.Cat_scene012.mp4": "视频展示了一只老鼠从台球桌的洞中爬出，然后在桌上奔跑。当它靠近洞口时，一只拿着球杆的猫出现并试图用球杆击打它，但猫没有击中老鼠，反而自己被击中，显得非常惊讶。",
    "E54.Cue.Ball.Cat_scene013.mp4": "一只棕色的小老鼠在绿色的台球桌上奔跑，它跳过一个红色的球袋，然后跳到一个白色的台球上，坐在上面并随着球滚动。",
    "E54.Cue.Ball.Cat_scene014.mp4": "一只老鼠骑在台球上，沿着球杆滑行，最终从球杆上滑落。",
    "E54.Cue.Ball.Cat_scene015.mp4": "一只小老鼠在一根横杆上奔跑，突然停下来，回头看向一只从后面靠近的猫。猫露出狡黠的笑容，似乎在策划捉住老鼠。老鼠看起来很紧张，而猫则显得非常自信和得意。",
    "E54.Cue.Ball.Cat_scene016.mp4": "一只棕色的小老鼠骑在一根火柴上，火柴快速移动，老鼠被甩出后在绿色桌面上滑行，最终消失在画面中。",
    "E54.Cue.Ball.Cat_scene017.mp4": "汤姆猫在台球桌上挥杆击球，球杆击中球后，杰瑞鼠被球击中并被球撞飞，杰瑞鼠被多个台球连续撞击，最终被撞飞出画面。",
    "E54.Cue.Ball.Cat_scene018.mp4": "台球桌上，多个彩色台球从右侧滚入左侧的球袋，球袋口有火花特效，最终只剩一个黄球，随后黄球也落入袋中，台球桌恢复空无一物。",
    "E54.Cue.Ball.Cat_scene019.mp4": "一只棕色的老鼠在绿色台球桌上奔跑，它从画面右侧向左侧移动，经过一排彩色的台球，包括黄色、红色、橙白相间、蓝色和绿色的球。老鼠表情专注，似乎在躲避或追逐这些球。背景是紫色渐变的天空。",
    "E54.Cue.Ball.Cat_scene020.mp4": "汤姆猫在台球桌上用球杆击打台球，杰瑞鼠在球上跳跃，汤姆猫试图击打台球但杰瑞鼠干扰了他，最终杰瑞鼠被击落。",
    "E54.Cue.Ball.Cat_scene021.mp4": "汤姆猫手持一根棍子，杰瑞鼠坐在棍子顶端。汤姆猫用另一只手拿起一个蓝色小帽子，轻轻戴在杰瑞鼠头上，然后满意地看着杰瑞鼠。背景是渐变的蓝紫色天空。",
    "E54.Cue.Ball.Cat_scene022.mp4": "汤姆猫手持球杆，准备击打台球。杰瑞鼠戴着蓝色帽子，坐在球杆顶端。汤姆猫将8号黑球放在台球桌上，然后用球杆击打，杰瑞鼠从球杆顶端滑落，落在球杆末端。",
    "E54.Cue.Ball.Cat_scene023.mp4": "一只老鼠在台球桌上，被击打后翻滚，最终跳到8号球上。",
    "E54.Cue.Ball.Cat_scene024.mp4": "在台球桌上，汤姆猫用三角架和打火机制造火焰陷阱，试图捕捉杰瑞鼠。杰瑞鼠骑在8号球上，巧妙地避开火焰，最终被汤姆用球杆击中并击落。",
    "E54.Cue.Ball.Cat_scene025.mp4": "台球桌上，8号球被击打后弹跳并消失，随后重新出现，最终落入袋中。",
    "E54.Cue.Ball.Cat_scene026.mp4": "一只老鼠在绿色台球桌上，先是被一个黑八球击中，随后它努力推动黑八球，最终成功将黑八球推到角落，自己也沾上了黑八球的图案，显得得意洋洋。",
    "E54.Cue.Ball.Cat_scene027.mp4": "在台球桌上，汤姆猫正准备击球，杰瑞鼠突然出现，抓住了汤姆的球杆并将其弯曲，然后迅速跑开。汤姆愤怒地追赶杰瑞，但杰瑞巧妙地躲开了。汤姆最终抓起8号球，用力扔向台球桌，但球却飞走了。汤姆一脸沮丧地看着空荡荡的球桌。",
    "E54.Cue.Ball.Cat_scene028.mp4": "一只棕色的小老鼠在绿色台球桌上行走，突然一个黑色的台球从左侧高速滚来，撞到小老鼠，小老鼠被撞得向后倒下，蜷缩在角落。",
    "E54.Cue.Ball.Cat_scene029.mp4": "动画片中的猫汤姆趴在台球桌上，突然起身，用爪子抓起一个台球，然后用力扔出去，最后又趴回桌上。",
    "E54.Cue.Ball.Cat_scene030.mp4": "一只老鼠在绿色的台面上奔跑，突然被一根巨大的铅笔从后面追上，铅笔的笔尖划过老鼠的身体，老鼠被卷入铅笔的笔杆中，铅笔继续向前滚动，老鼠在笔杆中被甩动。",
    "E54.Cue.Ball.Cat_scene032.mp4": "在台球厅里，汤姆猫在多个台球桌间快速穿梭，他伸展身体，做出夸张的滑行动作，最后从画面中消失。",
    "E54.Cue.Ball.Cat_scene033.mp4": "一个黄色的自动售货机，上面写着“冷饮”。突然，一只黑猫从上方飞来，用爪子砸碎了售货机的玻璃窗。玻璃碎片四散飞溅，随后售货机开始自动吐出绿色的瓶子，一共吐出了四个瓶子。最后，黑猫从机器上方跳下，站在四个瓶子前面，头上顶着一个红色的瓶盖，表情显得有些惊讶和困惑。",
    "E54.Cue.Ball.Cat_scene034.mp4": "一只棕色的小老鼠在绿色的台球桌上奔跑，它从台球桌的一端跑到另一端，然后跳起并撞到了台球桌的角落。接着，一只蓝色的猫从空中跳下，试图抓住老鼠，但滑倒在台球桌上。猫趴在台球桌上，眼睛紧闭，似乎在睡觉。老鼠从猫的尾巴上爬过，猫没有察觉。",
    "E54.Cue.Ball.Cat_scene035.mp4": "一只棕色的小老鼠正紧紧抓住一条长长的白色尾巴，尾巴的主人似乎是一只猫。小老鼠在尾巴上滑行，表情紧张，似乎在躲避什么。突然，猫的爪子从画面左侧伸出，试图抓住小老鼠。小老鼠惊慌失措，尾巴被猫的爪子拍打，发出“啪”的一声。猫的爪子继续向小老鼠逼近，小老鼠被逼到画面右侧，最终被猫的爪子抓住。",
    "E54.Cue.Ball.Cat_scene036.mp4": "汤姆猫趴在台球桌上，突然伸长身体，用尾巴击打台球桌，然后迅速弹起并消失在画面中。",
    "E54.Cue.Ball.Cat_scene037.mp4": "汤姆猫在房间里，从一个红色的消防栓箱中拉出一条白色的消防水带，然后用力将水带甩向右侧。",
    "E54.Cue.Ball.Cat_scene038.mp4": "汤姆用水管向台球桌喷水，杰瑞被水柱喷到，坐在水柱上。汤姆拿着拖把试图把杰瑞从水柱上弄下来，但杰瑞在水柱上晃动，汤姆被水溅到，显得很生气。",
    "E54.Cue.Ball.Cat_scene039.mp4": "一只老鼠趴在一根棍子上，棍子顶端有一个骨头形状的物体。老鼠沿着一根绳子向右移动，绳子另一端连接着一个标有“10”的红色重物。老鼠在绳子上行走时，身体微微前倾，保持平衡，最终到达了骨头形状物体的上方。",
    "E54.Cue.Ball.Cat_scene040.mp4": "汤姆猫用棍子戳破了台球桌上的水柱，水花四溅，他被水淋得跳起来，表情惊慌。",
    "E54.Cue.Ball.Cat_scene041.mp4": "一只棕色的老鼠在蓝色瓷砖天花板上的一根黑色绳子上行走，它用一根长棍子保持平衡，棍子的另一端有一个白色的棉球。老鼠小心翼翼地向前移动，棍子随着它的动作摆动。",
    "E54.Cue.Ball.Cat_scene042.mp4": "汤姆猫在台球桌旁，先是做出准备击球的姿势，接着被击球杆击中，身体失去平衡，随后用两只手抓住两根台球杆，做出滑行的动作，最后从台球桌边缘滑过。",
    "E54.Cue.Ball.Cat_scene043.mp4": "一只老鼠在天花板上沿着一根棍子奔跑，棍子的另一端系着一团棉花。老鼠跑动时，棍子弯曲并散落出许多黄色颗粒，随后棍子恢复原状，老鼠继续奔跑。",
    "E54.Cue.Ball.Cat_scene044.mp4": "汤姆猫手持台球杆，用力挥杆击球，但因动作过猛，身体失去平衡向前扑倒。",
    "E54.Cue.Ball.Cat_scene045.mp4": "一只老鼠在天花板上沿着一根棍子滑行，棍子的另一端连接着一个云朵形状的物体。老鼠滑行时，棍子突然弯曲，老鼠被弹起并旋转，随后棍子恢复原状，老鼠继续滑行。整个过程在蓝色的天花板背景下进行。",
    "E54.Cue.Ball.Cat_scene046.mp4": "一只棕色的小老鼠正用前爪抓住一根横梁，身体悬挂在一根黑色的绳子上。它先是紧张地盯着前方，随后开始喘息，尾巴在身后摆动，表情显得有些疲惫和焦虑。背景是深蓝色的天空，隐约可见几朵白云。",
    "E54.Cue.Ball.Cat_scene047.mp4": "一只棕色的小老鼠站在一根长棍上，棍子的另一端粘着一团白色的奶油。小老鼠用爪子抓着棍子，试图拉扯奶油。随着小老鼠的拉扯，棍子逐渐倾斜，最终小老鼠失去平衡，从棍子上滑落，掉到了蓝色的天花板上。",
    "E54.Cue.Ball.Cat_scene048.mp4": "一只蓝色的猫趴在台球桌上，表情专注。它突然被击打，身体被弹起，随后消失在画面中。接着，猫的爪子从桌边探出，它慢慢从桌边探出头来，表情惊讶，嘴巴张开，露出惊讶的表情。",
    "E54.Cue.Ball.Cat_scene049.mp4": "一只棕色的小老鼠在绿色的地面上快速奔跑，背景是紫色和蓝色的天空。",
    "E54.Cue.Ball.Cat_scene050.mp4": "汤姆猫正在打台球，他专注地瞄准球，击球后球散开，汤姆猫因用力过猛而失去平衡，身体悬空，随后他用球杆支撑身体，保持平衡。",
    "E54.Cue.Ball.Cat_scene051.mp4": "一只棕色的小老鼠在绿色台球桌上奔跑，它跳过桌边，然后掉进了一个球洞里。接着，几个彩色的台球滚入洞中，最终洞里只剩下空洞。",
    "E54.Cue.Ball.Cat_scene052.mp4": "一只老鼠在台球桌上追逐并推动多个彩色台球，台球依次滚入袋口，老鼠在桌面上奔跑。",
    "E54.Cue.Ball.Cat_scene053.mp4": "一只老鼠站在台球桌上，面对着一个红白相间的台球和一个蓝色台球，它们叠在一起并位于球洞边缘。老鼠看起来很紧张，随后它向后退缩，最终被吓得跑开。接着，红白台球和蓝色台球一起掉入球洞，其他台球也相继滚入球洞，最后球洞里只剩下黑色的8号球。",
    "E54.Cue.Ball.Cat_scene054.mp4": "一只棕色的小老鼠在绿色的台球桌上，它先是靠近一个红色的台球，然后继续向右移动，依次经过蓝色和黑色的台球，最后跳开，三个台球留在原地。",
    "E54.Cue.Ball.Cat_scene055.mp4": "汤姆猫正专注地玩台球，杰瑞鼠突然从空中飞来，跳到汤姆的头上。杰瑞用尾巴击打汤姆的鼻子，导致汤姆的脖子被拉长，表情痛苦。汤姆张大嘴巴，似乎在尖叫，而杰瑞则得意地坐在他的头上。台球在桌面上滚动，汤姆的脖子随着球的滚动而不断拉长，最终汤姆的脖子几乎垂直于地面，而杰瑞则从汤姆头上跳开。",
    "E54.Cue.Ball.Cat_scene056.mp4": "一只老鼠在台球桌上奔跑，跳入球洞。猫拿着球杆试图用球杆把老鼠从球洞中捞出来，但老鼠用剑和绳子从球洞中逃脱，并用剑刺向猫。",
    "E54.Cue.Ball.Cat_scene057.mp4": "汤姆猫在台球桌上用球杆试图拉出一个球，但球杆被卡住，他用力拉扯后球杆断裂，汤姆猫被弹飞出去，随后晕倒。杰瑞鼠出现在台球桌上，得意洋洋地跳舞，然后跑开。汤姆猫醒来后，发现杰瑞鼠已经离开，他感到非常愤怒。",
    "E54.Cue.Ball.Cat_scene058.mp4": "一只老鼠在台球桌上，先是推倒装满台球的盒子，然后拿起台球杆，用一个红色小方块击打白球，白球撞击彩色台球，导致彩色台球散开。老鼠在击球后高兴地跳起。",
    "E54.Cue.Ball.Cat_scene059.mp4": "在台球桌上，猫汤姆躲在角落里，看着台球被击打后四处散开，最终只剩下一颗黄色的1号球在桌面上滚动。",
    "E54.Cue.Ball.Cat_scene060.mp4": "汤姆猫趴在台球桌上，杰瑞鼠拿着球杆从左侧滑入画面，用球杆击打汤姆猫的嘴，汤姆猫张大嘴巴，球进入嘴里，随后汤姆猫从台球桌下探出头，表情愤怒，镜头逐渐变暗，最后显示“THE END”。",
    "E54.Cue.Ball.Cat_scene061.mp4": "视频展示了“Tom and Jerry”动画片的片尾画面，背景为红色，中央有“THE END”字样，随后逐渐出现“An MGM Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”的字样。"
}