{
    "S1950E07 - The Framed Cat_scene002.mp4": "视频展示了米高梅动画公司的标志，背景为深蓝色，中央有一个圆形框，框内是一只咆哮的狮子。狮子上方有“A METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样。狮子在圆形框内不断咆哮，表情凶猛。",
    "S1950E07 - The Framed Cat_scene003.mp4": "视频开始显示了米高梅动画的标志，随后画面转为黑色，最后出现“Tom and Jerry”的标题，伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "S1950E07 - The Framed Cat_scene004.mp4": "这是一个《猫和老鼠》动画片的开场画面，画面中展示了主角汤姆和杰瑞的卡通形象，背景为深绿色，文字“Tom and Jerry”以黄色字体显示在画面中央。随着画面推进，文字“THE FRAMED CAT”和“Directed by WILLIAM HANNA and JOSEPH BARBERA”逐渐浮现。汤姆猫面带微笑，杰瑞鼠则在画面左侧欢快地挥手。整体风格充满经典动画的幽默与活力。",
    "S1950E07 - The Framed Cat_scene005.mp4": "这是一个动画片的片头，标题为《The Framed Cat》，由William Hanna和Joseph Barbera执导。画面中显示了制作人员名单，包括动画师Kenneth Muse、Irven Spence和Ray Patterson，音乐由Scott Bradley负责。此外，还提到了制片人Fred Quimby。背景为紫色，标题框为绿色和橙色装饰。",
    "S1950E07 - The Framed Cat_scene006.mp4": "视频开始时显示一个带有“Produced by FRED QUIMBY”字样的装饰性标志。随后画面转为全黑，接着展示了一个昏暗的厨房场景，厨房内有一张铺着格子桌布的桌子，上面放着一只烤鸡，旁边是炉灶和橱柜。",
    "S1950E07 - The Framed Cat_scene007.mp4": "镜头缓慢向左移动，展示了一个厨房的场景。厨房内有一张铺着格子桌布的桌子，上面放着一只烤好的火鸡，火鸡正冒着热气。桌子旁边有一个绿色的水壶和几个盘子。厨房的右侧是白色的炉灶和橱柜，炉灶上放着一些碗和一个蓝色的杯子。炉灶旁边有一个绿色的凳子。窗户上有紫色的百叶窗，窗户旁边挂着一个装有绿色植物的红色鸟笼。整个场景色彩鲜艳，充满温馨的家庭氛围。",
    "S1950E07 - The Framed Cat_scene009.mp4": "猫拿着鸡腿从洞口跳出，看到老鼠后扑过去，但老鼠已经叼着鸡腿逃走了。随后，一个穿着围裙的胖女人走进房间，看到老鼠后，用手指着它，老鼠则吓得缩成一团。",
    "S1950E07 - The Framed Cat_scene010.mp4": "在厨房里，汤姆猫从绿色的椅子后面探出头来，眼睛闪烁着狡黠的光芒。他迅速跳起来，用后腿蹬地，前爪高高举起，做出一个得意洋洋的姿势，然后又迅速消失在画面中。",
    "S1950E07 - The Framed Cat_scene011.mp4": "杰瑞抱着一块肉从墙洞里跑出来，被汤姆从后面扑倒。",
    "S1950E07 - The Framed Cat_scene012.mp4": "一只棕色的小老鼠从门内跑出，迅速穿过门前的木制台阶，沿着小路向右跑去。随后，一只灰猫从门内跳出，紧追小老鼠，但最终小老鼠已经跑远，灰猫未能追上。",
    "S1950E07 - The Framed Cat_scene013.mp4": "一只灰色的猫从墙后跳出来，追逐一只棕色的小老鼠。猫成功抓住了老鼠，然后站在墙边，用爪子捏着老鼠，表情得意。老鼠在猫的爪子里挣扎，猫则显得非常满足和自豪。背景是一个户外的院子，有绿色的草地、树木和一堵黄色的墙。",
    "S1950E07 - The Framed Cat_scene015.mp4": "一只灰色的斗牛犬躺在狗窝前，嘴里叼着一根骨头，开心地摇晃着尾巴，随后张大嘴巴，露出牙齿，显得非常快乐。背景是一栋黄色的房子，有绿色的窗户和花盆，周围有树木和栅栏。",
    "S1950E07 - The Framed Cat_scene016.mp4": "一只灰色的斗牛犬躺在狗窝前的草地上，手里拿着一根骨头。它先是开心地笑着，然后闭上眼睛，似乎在享受骨头的美味，接着又睁开眼睛，继续开心地笑着。",
    "S1950E07 - The Framed Cat_scene017.mp4": "一只棕色的小老鼠站在黄色墙壁旁边，背景是浅绿色的栅栏和绿色的草地。小老鼠先是张开双臂，面带微笑，随后表情变得愤怒，张大嘴巴，似乎在喊叫。接着，它开始快速奔跑，从墙壁旁跑开，最终消失在画面左侧。",
    "S1950E07 - The Framed Cat_scene018.mp4": "一只灰色的狗正在草地上睡觉，手里拿着一根骨头。一只小老鼠出现，试图偷走骨头。老鼠用力拉扯骨头，但骨头没有动。老鼠被骨头弹开，狗仍然在睡觉。狗醒来后，伸出舌头舔了舔自己的爪子。",
    "S1950E07 - The Framed Cat_scene019.mp4": "一只戴着红色项圈的灰色斗牛犬在狗窝前，先是愤怒地咆哮，然后趴在地上，接着又站起来，最后跑出了画面。",
    "S1950E07 - The Framed Cat_scene020.mp4": "一只灰色的斗牛犬从狗屋跑出来，沿着房屋前的步道奔跑。它表情愤怒，随后突然停下，张大嘴巴，舌头伸出，显得非常惊讶或震惊。",
    "S1950E07 - The Framed Cat_scene021.mp4": "一只灰色的猫汤姆正靠在一棵树下，手里拿着一根骨头，看起来很放松。突然，一只灰色的狗斯派克冲过来，对汤姆大叫，想要夺走骨头。汤姆一开始很淡定，但随着斯派克的威胁，他变得紧张并试图保护骨头。斯派克最终成功抢走了骨头，汤姆看起来很沮丧。",
    "S1950E07 - The Framed Cat_scene022.mp4": "一只灰色的狗拿着骨头，愤怒地对着一只灰色的猫大声吼叫，猫则被狗抓住，显得害怕和无助。狗不断咆哮，猫则试图躲避和反抗。",
    "S1950E07 - The Framed Cat_scene023.mp4": "一只灰色的狗拿着骨头，把一只黑色的猫从树后拖出来，猫被狗吓到后躲到树后，狗把骨头伸到猫面前，猫被骨头吸引，但狗把骨头拿走了，猫生气地跺脚，然后又把猫的舌头伸出来舔树，狗又把骨头伸到猫面前，猫被骨头吸引，但狗又把骨头拿走了，猫生气地跺脚，然后又把猫的舌头伸出来舔树，狗又把骨头伸到猫面前，猫被骨头吸引，但狗又把骨头拿走了，猫生气地跺脚，然后又把猫的舌头伸出来舔树，狗又把骨头伸到猫面前，猫被骨头吸引，但狗又把骨头拿走了，猫生气地跺脚，然后又把猫的舌头伸出来舔树，狗又把骨头伸到猫面前，猫被骨头吸引，但狗又把骨头拿走了，猫生气地跺脚，然后又把猫的舌头伸出来舔树，狗又把骨头伸到猫面前，猫被骨头吸引，但狗又把骨头拿走了，猫生气地跺脚，然后又把猫的舌头",
    "S1950E07 - The Framed Cat_scene024.mp4": "一只棕色的小老鼠站在草地上，面对着一栋黄色的房子，它兴奋地挥舞着手臂，然后突然转身逃跑。紧接着，一只黑色的猫从画面右侧快速冲出，追逐小老鼠，最后猫消失在画面中。",
    "S1950E07 - The Framed Cat_scene026.mp4": "一只小老鼠从狗屋中探出头来，观察四周。随后，一只灰色的斗牛犬叼着骨头从右侧走来，它在狗屋前停下，用爪子刨地，制造了一个泥坑。小老鼠看到后，迅速跑向泥坑，试图偷走骨头。斗牛犬发现后，愤怒地用爪子拍打泥坑，试图将小老鼠赶走。最后，斗牛犬躺在泥坑中，显得非常沮丧和疲惫。",
    "S1950E07 - The Framed Cat_scene027.mp4": "一只灰色的猫坐在一个红色的垃圾桶旁边，它用前爪扒着垃圾桶的边缘，然后将头伸进垃圾桶里，似乎在寻找或嗅探什么。背景是黄色的木制房屋外墙和栏杆，阳光照射在地面上，投下树影。",
    "S1950E07 - The Framed Cat_scene028.mp4": "杰瑞拽着一根大骨头，突然被汤姆的尾巴缠住，他奋力挣扎，试图摆脱束缚。",
    "S1950E07 - The Framed Cat_scene029.mp4": "一只猫趴在红色垃圾桶旁，一只老鼠在垃圾桶旁边走动，猫突然打开垃圾桶盖，老鼠吓得跳开。",
    "S1950E07 - The Framed Cat_scene030.mp4": "一只小老鼠在草地上奔跑，经过一只躺在狗屋前的灰色斗牛犬。斗牛犬被小老鼠激怒，开始追赶。突然，一只猫从斗牛犬身后出现，用绳子牵着斗牛犬的尾巴，把斗牛犬拖得团团转。斗牛犬被拖得筋疲力尽，最终躺在地上，被猫用骨头玩具逗弄。斗牛犬生气地挖了一个坑，然后跑进狗屋，留下一个大坑。",
    "S1950E07 - The Framed Cat_scene031.mp4": "猫汤姆在草地上追逐一只老鼠杰瑞，但被一根绳子绊倒，绳子另一端连接着一个骨头，骨头被一只狗咬住，狗拉着绳子，汤姆被狗拖着跑，最后汤姆被狗拖到远处。",
    "S1950E07 - The Framed Cat_scene032.mp4": "在后院里，汤姆被一只狗用骨头和绳子拉扯，最终两人被绳子缠绕在树上，互相拉扯，最后汤姆得到了骨头。",
    "S1950E07 - The Framed Cat_scene033.mp4": "汤姆猫拿着骨头站在树旁，与一只灰色的斗牛犬对峙。斗牛犬愤怒地逼近，汤姆猫则用骨头与斗牛犬争夺。最终，汤姆猫成功将骨头从斗牛犬口中夺走，并得意地展示自己的胜利。斗牛犬被骨头缠住，表情无奈，随后被骨头拖走。",
    "S1950E07 - The Framed Cat_scene034.mp4": "一只灰色的斗牛犬躺在草地上，闭着眼睛，似乎在打盹或休息。背景是一道绿色的栅栏和一些花草树木，画面整体呈现出宁静的户外场景。",
    "S1950E07 - The Framed Cat_scene036.mp4": "一只老鼠从洞口探出头，然后拖着一个蓝色的螺旋钻进入洞中，洞外有一只灰色的猫在睡觉。",
    "S1950E07 - The Framed Cat_scene037.mp4": "一只老鼠在昏暗的房间里，用一个蓝色的螺丝刀试图将一根骨头固定在地板上。它先用螺丝刀旋转，但失败了，然后换用一根蓝色的螺丝，成功将螺丝拧进骨头里。老鼠满意地跳起来，然后跑出了画面。",
    "S1950E07 - The Framed Cat_scene038.mp4": "一只老鼠从洞穴中跑出，经过一只正在睡觉的猫身边，然后跑向画面左侧。",
    "S1950E07 - The Framed Cat_scene039.mp4": "在户外的草地上，一只灰色的猫（汤姆）正躺在地上打盹，一只棕色的老鼠（杰瑞）从树后探出头来，手里拿着一个巨大的红色磁铁。杰瑞用磁铁吸引汤姆的鼻子，汤姆被惊醒并张大嘴巴，杰瑞则用磁铁把汤姆的牙齿吸出来，然后迅速跑开，留下汤姆在原地。",
    "S1950E07 - The Framed Cat_scene040.mp4": "一只灰色的斗牛犬躺在草地上，眼睛盯着狗屋，狗屋中伸出一根骨头。狗用嘴叼起骨头，眼睛闪烁着兴奋的光芒，但随后突然咬紧骨头，发出痛苦的叫声，最终放下骨头，表情变得沮丧。",
    "S1950E07 - The Framed Cat_scene042.mp4": "汤姆猫嘴里叼着骨头，从远处跑来，落地后骨头掉落，他惊慌失措地四处张望。这时，一只灰色的斗牛犬突然冲过来，撞倒了汤姆，汤姆被撞得东倒西歪，最后斗牛犬跑开，汤姆呆立原地。",
    "S1950E07 - The Framed Cat_scene043.mp4": "一只灰色的斗牛犬在围栏外看到一个骨头，它兴奋地奔跑过去，但骨头突然变成了一枚火箭，飞向远方。斗牛犬被火箭的轨迹吓了一跳，张大嘴巴，然后愤怒地咆哮，最后又恢复了惊讶的表情。",
    "S1950E07 - The Framed Cat_scene044.mp4": "视频中，一个骨头被扔向绿色的栅栏，撞击后挂在栅栏上。随后，一只灰色的斗牛犬从栅栏后冲出，撞上栅栏，导致栅栏部分损坏。狗看起来很生气，它用爪子抓挠栅栏，然后消失在画面中。",
    "S1950E07 - The Framed Cat_scene045.mp4": "一个骨头在空中飞行，后面有闪电般的轨迹。一只灰色的狗从画面左侧冲出，追逐骨头。狗咬住骨头后，被骨头的冲击力甩倒在地，身体在草地上翻滚，扬起灰尘。",
    "S1950E07 - The Framed Cat_scene046.mp4": "一只灰色的狗叼着骨头，从树后跑出来，试图追上骨头。它伸长舌头去够骨头，但骨头飞得越来越远。狗的舌头变得越来越长，最终把骨头拉了回来。",
    "S1950E07 - The Framed Cat_scene047.mp4": "动画片中，汤姆猫在草地上追逐一个骨头，但骨头被狗抢走，汤姆猫愤怒地追着骨头跑。随后，画面切换到杰瑞鼠在水壶里，他用喷水壶喷水，水柱喷射出去，最终将汤姆猫击退。",
    "S1950E07 - The Framed Cat_scene048.mp4": "视频展示了经典的动画片《猫和老鼠》中的一个追逐场景。一开始，汤姆猫在一条道路上奔跑，身后拖着一根骨头，而一只灰色的斗牛犬紧追不舍。随着镜头拉远，可以看到汤姆猫和斗牛犬在一条蜿蜒的乡间小路上继续追逐，汤姆猫试图甩掉斗牛犬。突然，汤姆猫被一只穿着蓝色和黄色衣服的小老鼠绊倒，摔倒在地。斗牛犬继续追赶，但最终被小老鼠巧妙地引开，消失在远方。最后，镜头拉远，显示整个乡村风景，汤姆猫和斗牛犬在远处继续追逐，画面逐渐淡出，结束。",
    "S1950E07 - The Framed Cat_scene049.mp4": "视频显示了“THE END”字样，随后逐渐显示出“An M-G-M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色，中央有橙色光晕。"
}