{
    "37. Professor Tom_scene001.mp4": "视频开始时显示黑色背景，右下角有白色数字“0110544170204083”。随后画面逐渐变暗，出现米高梅卡通的标志，标志上方写着“A METRO-GOLDWYN-MAYER”，中间是“CARTOON”，下方是“COLOR BY TECHNICOLOR”。",
    "37. Professor Tom_scene002.mp4": "这是一个米高梅卡通片头，背景为深蓝色，中央是一个圆形标志，里面有一只咆哮的狮子。标志上方写着“A METRO-GOLDWYN-MAYER”，下方是“CARTOON”字样，再下方是“COLOR BY TECHNICOLOR”。狮子在标志内不断咆哮，表情凶猛。画面底部有一串数字“0110544170204083”。",
    "37. Professor Tom_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头。首先出现的是米高梅卡通的标志，随后画面切换至深蓝色背景，显示“Tom and Jerry”的标题，旁边是汤姆猫和杰瑞鼠的卡通形象。汤姆猫面带微笑，杰瑞鼠则欢快地跳跃。整个画面色彩鲜明，充满活力。",
    "37. Professor Tom_scene004.mp4": "这是一个经典的动画片《猫和老鼠》的开场画面，画面中央是黄色的“Tom and Jerry”字样，左侧是小老鼠杰瑞，右侧是大猫汤姆，两者都面带笑容。背景是深绿色，整体风格充满卡通趣味。",
    "37. Professor Tom_scene005.mp4": "这是一个动画片的片头，标题为“Professor Tom”，由William Hanna和Joseph Barbera执导。画面中有一个戴着毕业帽的猫头像雕塑，背景是蓝色的。片头还列出了动画师、音乐作曲家以及制作人Fred Quimby的名字，并显示了版权信息和批准编号。",
    "37. Professor Tom_scene006.mp4": "画面中，一只黑猫站在黑板前，手持教鞭，黑板上写着“MICE LIVE IN HOLES”和“CATS CHASE MICE”，旁边画有老鼠和猫的简笔画。黑猫似乎正在讲课。",
    "37. Professor Tom_scene007.mp4": "视频中，戴着毕业帽的汤姆猫站在黑板前，用教鞭指着黑板上的文字“MICE LIVE IN HOLES”和“CATS CHASE MICE”，似乎在讲课。随后镜头转向一个坐在红色小凳子上的小猫，它先是看起来有些困惑，然后开始大哭，最后又恢复平静。整个场景发生在一个室内环境中，背景简单，有地毯和台灯。",
    "37. Professor Tom_scene008.mp4": "汤姆戴着毕业帽，手持教鞭站在黑板前，黑板上写着“MICE LIVE IN HOLES”和“CATS CHASE MICE”，并配有简笔画。他先是自信地讲解，随后突然被吓到，帽子飞起，表情惊恐地跳开。",
    "37. Professor Tom_scene009.mp4": "一只小猫在红色小凳子上先是睡觉，然后醒来，坐直身子，四处张望。",
    "37. Professor Tom_scene010.mp4": "戴着毕业帽的汤姆猫站在黑板前，手持教鞭，表情严肃。他先是双手握着教鞭，随后挥动教鞭，做出讲课的动作。",
    "37. Professor Tom_scene011.mp4": "一只老鼠站在黑板前，用粉笔在黑板上写下“Mice are very nice”的字样，同时兴奋地挥舞着粉笔，显得非常开心。黑板的边框是红色的，旁边放着几本书。画面下方有中文字幕“老鼠很亲切”。",
    "37. Professor Tom_scene012.mp4": "在教室里，戴着毕业帽的汤姆猫站在黑板前，黑板上写着“MICE”和“very nice”。杰瑞鼠拿着粉笔站在黑板前，汤姆猫愤怒地盯着杰瑞鼠，杰瑞鼠用粉笔在黑板上划了一道，把“very nice”划成了“very knice”，汤姆猫更加愤怒，最后汤姆猫用粉笔擦擦掉了黑板上的字。",
    "37. Professor Tom_scene013.mp4": "一只小老鼠在房间里奔跑，突然被一只戴着毕业帽的猫抓住。猫得意地举起老鼠，但老鼠奋力逃脱，猫则被吓得浑身发抖。",
    "37. Professor Tom_scene014.mp4": "在教室里，一只小猫正在黑板前写字，写着“MICE LIVE IN HOLES”和“CATS CHASE MICE”。突然，一只戴着学士帽的猫（汤姆）出现，他抓起小猫，然后站在黑板前，用手指着黑板上的内容，对小猫进行教育。小猫看起来很害怕，而汤姆则显得非常严肃和权威。",
    "37. Professor Tom_scene015.mp4": "一只小猫站在黑板前，黑板上写着“MICE LIVE IN HOLES”和“CATS CHASE MICE”，旁边画着猫和老鼠的简笔画。小猫用粉笔在黑板上写字，看起来像是在学习或教学。它面前有一个红色的鼓。",
    "37. Professor Tom_scene016.mp4": "汤姆戴着毕业帽，站在黑板前，黑板上写着“MICE LIVE IN HOLES”和“CATS CHASE MICE”，他伸出手指指向黑板上的内容。杰瑞站在黑板旁边，看着汤姆。汤姆突然跳起来，杰瑞被吓了一跳，向后退去。汤姆又跳回来，继续指着黑板。",
    "37. Professor Tom_scene017.mp4": "一只小猫在桌下走路，表情不悦。",
    "37. Professor Tom_scene018.mp4": "一只小老鼠从墙角探出头，一只小猫从楼梯旁走来，小猫看到小老鼠后表现出惊讶和开心，然后伸出爪子想和小老鼠握手，小老鼠也伸出爪子回应，但小老鼠突然喊出“不是！”。",
    "37. Professor Tom_scene019.mp4": "汤姆猫在教室里看到黑板上的字后，突然跳起来大喊“不是！”，表情惊恐。",
    "37. Professor Tom_scene020.mp4": "猫和老鼠在室内，猫抓住老鼠的手，老鼠喊“不是！”，随后老鼠逃跑，猫追赶但未追上，老鼠消失在画面中。",
    "37. Professor Tom_scene021.mp4": "一只小猫追逐一只小老鼠，小猫在追逐过程中撞到椅子上摔倒，小老鼠靠近小猫，小猫站起来后继续追逐小老鼠，最后小猫跑出了画面。",
    "37. Professor Tom_scene022.mp4": "一只棕色的小猫在房间里追逐一只棕色的小老鼠。小猫从沙发后面跑出来，追着老鼠跑过地毯，老鼠钻到桌子底下，小猫停下来看着桌子底下，表情惊讶。",
    "37. Professor Tom_scene023.mp4": "一只小猫在房间里追逐一只小老鼠，小老鼠被抓住后又逃脱，小猫最终疲惫地躺在地毯上。",
    "37. Professor Tom_scene024.mp4": "一只棕色的小老鼠从画面左侧跑入，它跑向浴室门口，停在门口，然后向后退了几步，接着又向前跑了几步，最后被一个从左侧滚入的绿色垫子撞倒。",
    "37. Professor Tom_scene025.mp4": "一只棕色的狗从玻璃门后滑出，撞碎了玻璃门。随后，戴着学士帽的汤姆猫从门后跑出来，惊慌失措地四处张望。",
    "37. Professor Tom_scene026.mp4": "汤姆猫戴着黄色浴帽坐在浴室的红色地板上，正在淋浴。他先是搓洗身体，然后拿起黄色的刷子，用刷子刷洗自己的身体，水花四溅。浴室墙壁是绿色瓷砖，挂着一条黄色毛巾，旁边放着一条绿色毛巾。",
    "37. Professor Tom_scene027.mp4": "在浴室里，戴着毕业帽的汤姆猫站在破碎的玻璃门前，表情愤怒，双手握拳。一只穿着黄色浴袍、戴着黄色浴帽的小老鼠从门外爬进来，汤姆猫看到后，愤怒地伸出手指指向小老鼠。小老鼠慢慢靠近汤姆猫，汤姆猫突然扑向小老鼠，但被小老鼠逃脱。汤姆猫摔倒在地，帽子飞了出去，表情变得惊讶。",
    "37. Professor Tom_scene029.mp4": "一只灰色的猫用爪子抓着一只棕色的小老鼠，小老鼠被倒吊着，表情显得有些惊慌。猫戴着一顶黑色的帽子，眼睛半闭，看起来很得意。背景是单一的浅黄色。",
    "37. Professor Tom_scene030.mp4": "戴着毕业帽的汤姆猫举起小猫，然后把它放下。小猫站在原地，汤姆猫转身跑开，小猫看着汤姆猫离开，随后一只小老鼠从旁边跑出来。",
    "37. Professor Tom_scene031.mp4": "戴着毕业帽的汤姆猫在房间里奔跑，他先是跑向一个柜子，然后又跑向一个垃圾桶，接着又跑向一个门口，最后在门口停下。",
    "37. Professor Tom_scene033.mp4": "杰瑞躲在墙角，突然被汤姆从桌子底下追出来，杰瑞吓得跳起来逃跑，汤姆紧追不舍。",
    "37. Professor Tom_scene034.mp4": "一只小猫在房间里奔跑，镜头跟随其移动。突然，一只戴着学士帽的猫从桌子下出现，追逐小猫。小猫继续奔跑，而戴学士帽的猫紧追不舍。",
    "37. Professor Tom_scene035.mp4": "汤姆戴着学士帽，愤怒地追逐杰瑞。杰瑞在前面逃跑，汤姆在后面追赶。汤姆撞到桌子，摔倒在地，帽子也掉下来。汤姆躺在地上，帽子在空中飘动。",
    "37. Professor Tom_scene038.mp4": "一只老鼠拿着扫帚柄，试图戳醒躺在地上的猫。猫被戳醒后，老鼠迅速逃跑，猫则继续躺在地上不动。",
    "37. Professor Tom_scene040.mp4": "一只棕色的小老鼠在蓝色的地板上奔跑，它从画面右侧跑向左侧，途中经过一个绿色的家具腿。小老鼠表情紧张，似乎在躲避什么，最终跑出了画面。",
    "37. Professor Tom_scene041.mp4": "一只小老鼠爬上了一只大猫的尾巴，然后用爪子抓挠猫的尾巴，导致猫的尾巴被扯得发出“滋滋”的声音。",
    "37. Professor Tom_scene042.mp4": "动画片段中，戴着毕业帽的汤姆猫在房间里追逐杰瑞鼠。汤姆猫被杰瑞鼠击中后摔倒在地，表情痛苦。随后，汤姆猫坐在地上，用尾巴当笔在空中写字，表情显得得意和自信。",
    "37. Professor Tom_scene043.mp4": "一只小老鼠杰瑞在地板上奔跑，突然被一只戴着学士帽的猫汤姆追上。汤姆试图抓住杰瑞，但杰瑞迅速躲开。汤姆在追逐过程中撞到了桌子腿，被绊倒并滑倒。他痛苦地躺在地上，表情痛苦。",
    "37. Professor Tom_scene044.mp4": "一只小老鼠在黄色地毯上奔跑，突然被地毯卷起，被卷入地毯卷中消失不见。",
    "37. Professor Tom_scene045.mp4": "一个黄色的地毯卷在地板上滚动，随后汤姆猫戴着毕业帽出现，他兴奋地跑向地毯卷，然后抱起它并旋转着飞出去，最后消失在画面中。",
    "37. Professor Tom_scene046.mp4": "戴着毕业帽的汤姆猫从房子里跑出来，手里拿着一个卷起来的黄色垫子，他兴奋地奔跑在房子前的草坪和人行道上。",
    "37. Professor Tom_scene047.mp4": "一只棕色的小老鼠从一个黄色的卷筒中探出头来，它用力抓住卷筒，开始在绿色的草地上奔跑，卷筒随着它的奔跑而滚动，小老鼠表情兴奋，张开嘴巴大叫，周围有花草和蒲公英。",
    "37. Professor Tom_scene048.mp4": "在花园里，戴着毕业帽的猫汤姆抱着一个黄色卷轴，小老鼠杰瑞紧紧抓着卷轴的一端，两人一起奔跑。汤姆试图把杰瑞甩进池塘，但杰瑞灵活地挣脱并飞奔而去。",
    "37. Professor Tom_scene049.mp4": "汤姆猫从树上跳入水中，溅起水花。他从水中站起来，抱着一只白色的小猫，站在水里，表情显得有些惊讶和困惑。",
    "37. Professor Tom_scene050.mp4": "一只棕色的小老鼠杰瑞在户外奔跑，它跑向一栋房子并从绿色的门前进入。随后，一只戴着黑色学士帽的灰色猫汤姆从门内冲出，他追着杰瑞跑出房子，经过院子，最终在树下停下并愤怒地瞪着杰瑞。",
    "37. Professor Tom_scene051.mp4": "一只灰色的猫（汤姆）戴着黑色帽子，从窗外伸出手试图抓住一只棕色的小老鼠（杰瑞）。杰瑞在窗内，看到汤姆后迅速逃跑，汤姆追着它，但最终未能抓住它。汤姆显得非常沮丧和愤怒。",
    "37. Professor Tom_scene052.mp4": "汤姆戴着学士帽，表情愤怒，双手紧握拳头，似乎在发怒或准备攻击。背景是室内墙壁和窗户。",
    "37. Professor Tom_scene053.mp4": "一只戴着学士帽的灰色猫从窗户跳出，摔倒在草地上，然后迅速爬起来，继续向前奔跑。",
    "37. Professor Tom_scene054.mp4": "视频中，戴着毕业帽的汤姆猫从门后跑出来，沿着阳台奔跑，随后撞到门上，表情痛苦。他站起身，愤怒地跺脚，然后开始跳舞，最后从画面左侧跑出。",
    "37. Professor Tom_scene055.mp4": "一只戴着毕业帽的猫从台阶上跳下，沿着人行道奔跑，途中经过一棵树和一个邮箱，最后以冲刺的姿态跑过。",
    "37. Professor Tom_scene056.mp4": "一只老鼠从门缝中探出头，试图逃跑，但被门夹住，随后被一只猫发现并追击。猫打开门，老鼠被吓跑，猫则倒在地上，显得非常惊讶。",
    "37. Professor Tom_scene057.mp4": "汤姆猫戴着一顶黑色的帽子，在房间里快速奔跑。他从楼梯旁跑过，经过一张桌子，桌子上有两个台灯。他继续向前跑，经过沙发和椅子，最后跑向房间的另一边。汤姆猫的表情显得非常紧张和急切。",
    "37. Professor Tom_scene058.mp4": "杰瑞从门后跑出，抓起一个红色救生圈，挂在栏杆上，然后被救生圈拉到栏杆上。随后，汤姆从空中飞来，用爪子抓住救生圈，将杰瑞拉回。",
    "37. Professor Tom_scene059.mp4": "动画片中的汤姆猫戴着毕业帽，被一根红色的带子绑着，快速地在户外的小路上奔跑。随着奔跑，汤姆猫的表情从专注变为惊讶，最终被带子甩飞，消失在画面中。背景是绿色的草地和一个装饰着花藤的白色拱门。",
    "37. Professor Tom_scene062.mp4": "一只灰色的猫从绿色邮箱中探出头，随后从邮箱中滑出，挂在黄色的门上，身体悬空，表情惊恐。",
    "37. Professor Tom_scene063.mp4": "在户外的石墙上，一只棕色的小老鼠正用力拖着一根黄色的长棍。突然，一只灰色的猫从墙后探出头来，似乎在偷看。接着，另一只灰色的猫从墙的另一边出现，手里拿着那根黄色的长棍，与小老鼠对峙。小老鼠显得很紧张，而猫则显得很得意。随后，猫用棍子砸向小老鼠，但小老鼠灵活地躲开了。猫试图用棍子击打小老鼠，但小老鼠依然机灵地躲避。最后，猫把棍子折断，小老鼠则开心地跳了起来。",
    "37. Professor Tom_scene064.mp4": "视频展示了一只猫和一只老鼠在一条小路上的互动。猫从空中落下，接着一只老鼠从墙后跳出来，猫和老鼠面对面，猫显得非常开心，把一顶帽子戴在老鼠头上。随后，猫牵着老鼠的手，一起沿着小路向前走。最后，画面通过望远镜视角逐渐缩小，最终变成黑色，出现“The End”的字样。",
    "37. Professor Tom_scene065.mp4": "视频开始时显示“THE END”字样，随后逐渐过渡到“An M.G.M Tom and Jerry CARTOON”字样，下方标注“MADE IN HOLLYWOOD, U.S.A.”，背景为红色，文字为蓝色和白色。",
    "37. Professor Tom_scene066.mp4": "视频开始时显示了MGM的标志，随后画面转为全黑，持续了多秒。"
}