{
    "11. The Yankee Doodle_scene001.mp4": "视频开始时显示一个黑色背景，底部有白色数字“0110544170204083”。随后，画面逐渐变亮，出现“Metro-Goldwyn-Mayer CARTOON”字样，下方标注“Color by Technicolor”，背景为深色，带有红色圆形图案和一只咆哮的狮子形象。整个画面保持静态，没有其他动作或变化。",
    "11. The Yankee Doodle_scene002.mp4": "这是一个米高梅动画片头，背景为红色，中央有一个圆形框架，内有一只咆哮的狮子。下方文字显示“A Metro-Goldwyn-Mayer CARTOON”，并注明“COLOR BY Technicolor”。狮子在画面中不断张合嘴巴，做出咆哮的动作。",
    "11. The Yankee Doodle_scene003.mp4": "视频展示了米高梅动画的片头，先是米高梅的标志，接着是“Tom and Jerry”的标题画面，背景为红色圆形图案，猫和老鼠的形象出现在标题旁边。",
    "11. The Yankee Doodle_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为红色渐变圆环，中央是猫汤姆和老鼠杰瑞的卡通形象，下方有黄色大字“TOM and JERRY”。随后画面叠加文字“THE YANKEE DOODLE MOUSE”以及“Directed by WILLIAM HANNA and JOSEPH BARBERA”和“Academy Award Winner of 1943”，表明这是该动画的某一集标题和获奖信息。",
    "11. The Yankee Doodle_scene005.mp4": "视频片段展示了动画片《The Yankee Doodle Mouse》的片头，包括奥斯卡奖杯、导演、动画师、音乐制作人和制片人的名字，以及版权和制作信息。随后画面转黑，出现一个指向“CAT RAID SHELTER”的箭头标志。",
    "11. The Yankee Doodle_scene006.mp4": "一个标有“CAT RAID SHELTER”的箭头标志挂在蓝色椅子腿上。杰瑞从标志后方跑出来，汤姆从标志后方扑向杰瑞，但被杰瑞躲开。汤姆追着杰瑞跑，杰瑞跑向标志左侧，汤姆追到标志后方，然后从标志后方跑开。",
    "11. The Yankee Doodle_scene007.mp4": "一只老鼠从楼梯上跑下来，一只猫从楼梯上追下来，猫追上老鼠后摔倒在地，老鼠跑开，猫爬起来继续追。",
    "11. The Yankee Doodle_scene008.mp4": "一只老鼠跑向一堆标有“TOBACCO”的袋子，袋子上有一个写着“THIS IS IT!”的箭头。随后，一只猫从右侧出现，趴在地上，注视着袋子。",
    "11. The Yankee Doodle_scene009.mp4": "一只老鼠站在一个装有大番茄的捕鼠器旁边，用一根棍子试图撬动捕鼠器。捕鼠器被触发，番茄被弹起，老鼠被吓了一跳。",
    "11. The Yankee Doodle_scene010.mp4": "猫躺在地上，突然被一个番茄砸中头部，番茄卡在它的嘴里，猫依然躺着不动。",
    "11. The Yankee Doodle_scene011.mp4": "一只棕色的老鼠在洞穴中，它看到地上的捕鼠夹后，迅速跳起并向上攀爬，最终消失在洞穴上方。",
    "11. The Yankee Doodle_scene012.mp4": "一只小老鼠从墙洞中探出头来，爬上架子，拿起一个鸡蛋，又放下，然后把鸡蛋放在架子边缘，接着又拿起一个鸡蛋，最后把鸡蛋放回架子上。",
    "11. The Yankee Doodle_scene013.mp4": "动画片段中，汤姆猫被黄色液体击中，身体被液体覆盖，随后他试图躲避但被液体再次击中。汤姆猫躲到木桶后面，但液体仍从木桶中喷出，击中了他。他被液体击中后，表情痛苦，但最终似乎适应了这种情况。",
    "11. The Yankee Doodle_scene014.mp4": "一只小老鼠在木桶上攀爬，试图解开绑在香槟瓶上的绳子。它成功解开了一瓶，香槟喷涌而出，小老鼠被喷出的液体溅到，显得有些狼狈。",
    "11. The Yankee Doodle_scene015.mp4": "汤姆猫戴着一顶黄色的帽子，从木箱上跳下，帽子被风吹走，他被风吹得翻滚，最后帽子和汤姆都消失了，水从天花板上洒下来。",
    "11. The Yankee Doodle_scene016.mp4": "汤姆猫坐在一个木桶里，桶里装满了水，他手里拿着一个黄色的锅，锅柄是绿色的。汤姆猫的表情显得有些惊讶和紧张，眼睛睁得很大，嘴巴微张。他不断地左右转动头部，似乎在观察周围的环境，或者在躲避什么。背景是一个简陋的房间，墙壁是砖砌的，旁边有一个水龙头和一个木制的搓衣板。整个场景给人一种紧张和不安的感觉。",
    "11. The Yankee Doodle_scene017.mp4": "一只小老鼠正在用一根绳子拉一个巨大的奶酪形状的物体，这个物体被一个蓝色的机械臂支撑着。小老鼠用力拉扯，奶酪物体随之移动，最终被机械臂抬起，小老鼠惊慌失措地后退。",
    "11. The Yankee Doodle_scene018.mp4": "视频中，汤姆猫坐在一个装满水的木桶里，手里拿着一个黄色的水瓢。他先是张大嘴巴，似乎在喊叫，然后用瓢舀水泼向自己，水花四溅。接着，他把水瓢倒扣在头上，水从瓢里流出来，他看起来很享受。最后，汤姆猫把水瓢扔进水里，水桶里的水开始冒泡，然后画面切换到一张纸，上面写着“老鼠总部·芝士部门 第一次战争报告”，并有“只要看到猫咪，全部淹死它们”的字样，签名是“杰瑞中尉”。",
    "11. The Yankee Doodle_scene019.mp4": "视频中，一只戴着黄色帽子的老鼠站在一个管道旁，它小心翼翼地将嘴靠近管道，似乎在倾听什么。墙上贴着两张纸条，一张写着“那个友好的老鼠可能会告诉猫”，另一张写着“关上你的陷阱”。老鼠表情紧张，不时地左右张望，显得非常谨慎。画面下方出现中文字幕：“说不定哪个亲切的老鼠会告诉猫咪”和“嘴巴闭紧”。背景是一个昏暗的地下室或类似环境，有石墙和木板，营造出一种紧张和神秘的氛围。",
    "11. The Yankee Doodle_scene020.mp4": "通过望远镜视角，镜头扫过一个昏暗的地下室，展示了锅炉、铲子、木桶和工作台等物品。随后，汤姆猫从木桶后探出头，手里拿着一个黄色的锤子，表情凶狠。他从木桶后走出，靠近锅炉，继续拿着锤子，表情愤怒，似乎在寻找或准备对付某人。",
    "11. The Yankee Doodle_scene021.mp4": "汤姆猫手持木槌和奶酪，站在一个洞口前，似乎在等待什么。他先是兴奋地展示奶酪，然后将奶酪放在洞口，接着用木槌敲击洞口，似乎在试图吸引或捕捉洞里的东西。",
    "11. The Yankee Doodle_scene022.mp4": "一只戴着黄色帽子的老鼠站在一个洞穴般的环境中，它先是靠近一个管道，然后跳上一个奶酪块，接着用前爪抓住管道，似乎在尝试通过管道逃脱或探索。背景中有两张纸条，一张写着“THAT FRIENDLY RAT MAY TELL THE CAT”，另一张写着“SHUT YOUR TRAP”。地面上还有一个奶酪块。",
    "11. The Yankee Doodle_scene023.mp4": "通过望远镜视角，汤姆猫手持棒球棒，表情专注地观察前方。",
    "11. The Yankee Doodle_scene024.mp4": "一只老鼠在洞穴中，头上顶着一块奶酪，从管道口跳下，然后跑向左侧的石阶并消失在画面中。管道上贴着两张纸条，一张写着“那只友好的老鼠可能会告诉猫”，另一张写着“闭上你的陷阱”。洞穴地面有一块奶酪和一个陶罐。",
    "11. The Yankee Doodle_scene025.mp4": "一只戴着黄色帽子的小老鼠从墙洞中爬出，跑向一辆标有“JEEP”和“U.S.A.”字样的越野车，然后沿着黄色的墙面向上攀爬。",
    "11. The Yankee Doodle_scene026.mp4": "一个黄色的柜门缓缓打开，露出内部的棕色隔板，隔板上有一排小孔。",
    "11. The Yankee Doodle_scene027.mp4": "汤姆猫手持铲子，试图挖洞偷吃奶酪，结果铲子砸穿墙壁，汤姆被砸倒在地，表情痛苦。",
    "11. The Yankee Doodle_scene028.mp4": "一只戴着黄色帽子的卡通狗驾驶着一辆小车，沿着一个斜坡向下行驶。小车在斜坡上快速移动，最终冲向一个打开的行李箱，行李箱里装满了衣物。狗在车里显得很兴奋，而行李箱中的衣物被撞得四散飞扬。",
    "11. The Yankee Doodle_scene029.mp4": "汤姆猫躺在地上，突然起身，露出狰狞的表情，向前跳跃，似乎在追逐或攻击什么。背景是一个破旧的房间，地上有一个洞，洞边有一块黄色的物体。",
    "11. The Yankee Doodle_scene030.mp4": "一个卡通小熊驾驶着一辆白色的小车，在一个房间里穿梭。房间里有扫帚、洗衣板、水桶和一个红色的行李箱。小熊从洗衣板后面驶出，绕过行李箱，继续向前行驶。",
    "11. The Yankee Doodle_scene031.mp4": "汤姆猫看到一块奶酪，兴奋地扑过去，但被奶酪的车轮绊倒，摔倒在地。他躺在地上，表情从愤怒转为沮丧。",
    "11. The Yankee Doodle_scene032.mp4": "一只戴着黄色帽子的老鼠从一个灰色的箱子上探出头，先是开心地挥手，然后举起帽子，闭上眼睛享受。",
    "11. The Yankee Doodle_scene033.mp4": "一只小老鼠驾驶着一辆玩具车撞上了木梁，车翻了，小老鼠被甩了出去。随后，小老鼠被面粉袋和罐子砸中，面粉洒了一地。小老鼠爬起来，拖着面粉袋，结果面粉袋破裂，面粉洒了一地。",
    "11. The Yankee Doodle_scene034.mp4": "一只小老鼠在地板上奔跑，身后拖着一条白色的泡沫带，泡沫带逐渐扩散开来，最终覆盖了整个画面。",
    "11. The Yankee Doodle_scene035.mp4": "杰瑞穿着白色翅膀在地下室里奔跑，身后留下一串烟雾。烟雾弥漫整个地下室，杰瑞在烟雾中若隐若现。随后，汤姆从烟雾中出现，他趴在地上，眼睛瞪得大大的，似乎在寻找杰瑞。汤姆在烟雾中四处张望，试图找到杰瑞的踪迹。",
    "11. The Yankee Doodle_scene036.mp4": "一只小老鼠从木桶后面探出头来，拿着一个黄色的喇叭，对着一只躺在地上的大猫吹响。大猫被惊醒，愤怒地扑向小老鼠，但小老鼠灵活地躲避并继续吹喇叭。大猫被喇叭声激怒，不断试图抓住小老鼠，但小老鼠始终在躲避。最终，大猫被小老鼠的喇叭声弄得晕头转向，躺在地上。",
    "11. The Yankee Doodle_scene037.mp4": "在一间堆满烟花的房间里，汤姆戴着安全帽，手持火柴和烟花。他点燃了烟花，烟花开始冒烟并发出火花，汤姆被吓了一跳，向后退去，显得非常惊慌。",
    "11. The Yankee Doodle_scene038.mp4": "在一个昏暗的房间内，一只小老鼠从洞口跑出，看到地上有一个点燃的红色火药筒。它迅速捡起火药筒，试图将其扔向远处，但火药筒在空中爆炸，小老鼠被炸飞出去，最后摔倒在地。",
    "11. The Yankee Doodle_scene039.mp4": "在一间昏暗的房间里，汤姆猫从木箱后探出头来，看到地上有一根点燃的火柴。他吓得跳起来，用爪子抓起火柴，然后迅速将火柴扔向空中，火柴在空中燃烧并发出火花。汤姆猫看起来非常紧张和害怕。",
    "11. The Yankee Doodle_scene040.mp4": "一只棕色的小老鼠在室内奔跑，它叼着一个红色的火箭筒，火箭筒喷出火花，小老鼠被推着向前跑动，最终冲进一个洞穴。",
    "11. The Yankee Doodle_scene041.mp4": "汤姆猫在地下室里拿着一个点燃的红色火柴，他惊慌失措地四处躲避，火柴的火焰在空中飞舞，他试图用爪子扑灭火焰，但火焰依然在燃烧。",
    "11. The Yankee Doodle_scene042.mp4": "在一间杂乱的房间里，一只小老鼠拿着一个点燃的红色火药筒，不断向一只灰猫汤姆扔去。汤姆试图躲避，但火药筒在空中爆炸，火花四溅，汤姆被吓得四处乱窜，表情惊恐。小老鼠则在一旁得意地笑着，继续扔火药筒，汤姆则在房间里慌乱地躲避，场面十分搞笑。",
    "11. The Yankee Doodle_scene044.mp4": "视频开始时，画面中出现了一只老鼠在地下室里奔跑，它从一个木桶旁边跑过，然后躲到一个大茶壶后面。接着，一只猫从上方出现，手里拿着一个红色的火柴盒，它把火柴盒放在茶壶上，然后点燃了火柴。猫看着火柴燃烧，表情得意，但火柴突然熄灭了，猫显得很失望。老鼠从茶壶后面探出头来，看着猫，然后又躲回茶壶后面。猫继续盯着茶壶，似乎在等待火柴重新点燃。",
    "11. The Yankee Doodle_scene045.mp4": "一只棕色的小老鼠站在一个红色的圆柱形物体旁边，该物体正在燃烧并冒出火花。小老鼠看起来很害怕，随后它迅速跑开，跳过这个物体，最后从左侧的圆形洞口消失。",
    "11. The Yankee Doodle_scene046.mp4": "视频中，一只小老鼠从茶壶的壶嘴中探出头来，随后跳下。一只大灰猫坐在茶壶后面，双手捂住眼睛，然后突然睁开眼睛，露出黄色的眼睛，显得非常惊讶。接着，它把茶壶盖子掀开，茶壶突然爆炸，冒出浓烟，猫的身体被烟雾包裹，最后变成一朵黄色的花，表情痛苦。场景切换后，猫在一堆烟花旁边，点燃了一根烟花，烟花点燃后，猫被吓得跳起来，然后开心地大笑。",
    "11. The Yankee Doodle_scene047.mp4": "一个黄色的纸飞机在房间里飞行，镜头跟随纸飞机移动，经过扫帚、石墙、锅炉和木桌等物体。",
    "11. The Yankee Doodle_scene048.mp4": "一只小老鼠从洞口探出头，看到一个纸飞机从上方飞过并点燃了火花。小老鼠吓得后退，纸飞机继续飞向墙壁并爆炸，火花四溅。小老鼠吓得缩回洞里。",
    "11. The Yankee Doodle_scene049.mp4": "在一个昏暗的仓库里，一只灰色的猫（汤姆）从木箱后面探出头来，观察着空中飞过的黄色纸飞机。纸飞机拖着红色的火花，飞过浴缸、垃圾桶和一箱烟花，最后撞在了旁边的机器上。猫看到纸飞机后，从木箱后爬出来，小心翼翼地靠近烟花箱，似乎在准备捕捉纸飞机。",
    "11. The Yankee Doodle_scene050.mp4": "汤姆猫正趴在地上，看着面前的黄色纸飞机。纸飞机上有一个红色的火柴，火柴点燃后，汤姆猫被火苗烫到，表情从得意转为痛苦。",
    "11. The Yankee Doodle_scene053.mp4": "一只橙色的小老鼠在昏暗的地下室里奔跑，它快速地跳过一个大木桶，然后在桶上滑行，最终从桶的另一侧跳下。",
    "11. The Yankee Doodle_scene054.mp4": "一只小老鼠从洞口滑下，沿着一根红色的铅笔滑行，最终落入一个装有鸡蛋的黄色箱子中。箱子被铅笔牵引着，老鼠在箱子里挣扎，试图抓住箱子边缘。箱子被拉到木板上，老鼠最终被拉出箱子。",
    "11. The Yankee Doodle_scene055.mp4": "两个小船形状的物体在地面上快速移动，经过一个木桶和一个木梯，最终消失在画面中。",
    "11. The Yankee Doodle_scene056.mp4": "一架黄色的小飞机在室内天花板附近飞行，机身带有红色星星标志。飞机在空中翻转、调整方向，最终飞向画面右侧。背景是室内天花板和一些管道结构。",
    "11. The Yankee Doodle_scene057.mp4": "一只灰色的猫站在木制结构上，抬头向上看，表情专注。背景是木质天花板，光线柔和。",
    "11. The Yankee Doodle_scene058.mp4": "一只老鼠驾驶着一架由纸箱和灯泡改装的飞机，在空中飞行。飞机的机头有鲨鱼嘴的图案，机身上有红白蓝三色条纹。老鼠从飞机中探出头来，似乎在享受飞行。飞机下方有一盏灯，灯泡被一根绳子连接着飞机。",
    "11. The Yankee Doodle_scene059.mp4": "画面中，几只发光的灯泡在空中漂浮，镜头逐渐向下移动，展现出一个充满各种物品的房间，包括一个悬挂的秤、一个木箱、一些瓶子和一个装有面包的篮子。房间的墙壁和地面呈现出温暖的色调，整体氛围宁静而略带神秘。",
    "11. The Yankee Doodle_scene060.mp4": "汤姆猫在房间里，被一个从天花板掉落的灯泡砸中，灯泡破碎后他被溅起的玻璃碎片击中，表情痛苦。",
    "11. The Yankee Doodle_scene061.mp4": "一个黄色的玩具飞机从天花板上飞下来，飞机的机翼和机身是黄色的，机身上有红色和白色的条纹，机翼上有红色的锯齿状图案。飞机的驾驶舱里有一个小熊。飞机飞到一半时，突然分解成两部分，一部分是飞机的机身，另一部分是飞机的机翼。机身继续向前飞行，而机翼则在空中翻滚。最后，飞机的机翼变成了一个黄色的香蕉，香蕉在空中翻滚着，然后掉落在地上。",
    "11. The Yankee Doodle_scene062.mp4": "汤姆猫在房间里，被一个香蕉皮砸中后，香蕉皮粘在了他的脸上。他试图甩掉香蕉皮，但没有成功。随后，他拿起一根红色的蜡烛，似乎在思考如何处理这个麻烦。",
    "11. The Yankee Doodle_scene063.mp4": "动画片段中，两个黄色的盒子在天花板上飞行，其中一个盒子被一只猫抓住，随后盒子撞上天花板，产生火花和爆炸效果。",
    "11. The Yankee Doodle_scene064.mp4": "一只灰色的猫坐在一个有木桶和烟花的房间里，手里拿着一个橙色的烟花筒。它先是兴奋地点燃烟花筒，烟花筒喷出彩色的火花和烟雾。猫被烟花的声响和效果吓到，身体后仰，然后又坐直，继续玩弄烟花筒，表情从兴奋转为惊讶和困惑。烟花筒不断喷出火花和烟雾，猫被弄得措手不及，但依然保持着好奇和顽皮的态度。",
    "11. The Yankee Doodle_scene065.mp4": "一只老鼠驾驶着一个黄色的橡皮擦飞机在天花板上飞行，飞机被击中后解体，老鼠从飞机上掉落并摔在地上。",
    "11. The Yankee Doodle_scene066.mp4": "一只小老鼠从高处坠落，随后展开一个粉色的降落伞，安全地降落到地面。",
    "11. The Yankee Doodle_scene067.mp4": "一只小老鼠从空中落下，躲过几个瓶子，跑向墙角的一个洞。一只拿着橙色棍子的猫从洞里冲出来，挥舞棍子，但棍子突然冒烟，猫被烟熏得睁不开眼，最后猫被烟熏得倒在地上，墙上的纸也被熏得破了洞。",
    "11. The Yankee Doodle_scene068.mp4": "动画片段展示了一只小老鼠从洞中跑出，身后拖着彩色的火焰尾巴，在一片废墟般的场景中奔跑。背景中有破碎的墙壁和散落的石块，远处是连绵的山丘轮廓。小老鼠跑过时，镜头跟随其移动，最后画面被一个木制结构遮挡。",
    "11. The Yankee Doodle_scene069.mp4": "动画片中，一只棕色小老鼠从洞口跳出，被一个燃烧的火箭击中，随后它从洞口爬出，继续奔跑，火箭在它身后爆炸，最后它跑向一个木制结构。",
    "11. The Yankee Doodle_scene070.mp4": "一只灰猫趴在木桶上，用爪子托着脸颊，眼睛四处张望，表情显得悠闲自得。",
    "11. The Yankee Doodle_scene071.mp4": "一只小老鼠在狭窄的通道中奔跑，身后跟着几枚燃烧的火柴。火柴在地面上划出明亮的轨迹，小老鼠在火柴的追逐下惊慌失措地奔跑，最终被火柴击中并消失在画面中。",
    "11. The Yankee Doodle_scene072.mp4": "一只小老鼠在追逐一个彩色的火箭，火箭在地面上快速移动，小老鼠跑过瓶子、木屋和椅子等物体，最终火箭消失在画面中。",
    "11. The Yankee Doodle_scene073.mp4": "一只灰色的猫趴在木桶上，先是张嘴打哈欠，然后眯眼伸懒腰，最后伸出手臂指向远方。",
    "11. The Yankee Doodle_scene074.mp4": "视频展示了一组彩色的辣椒在空中爆炸并散开的动画效果。辣椒从画面左侧开始，逐渐向右上方飞升，随后在空中炸裂成多个彩色的火花和碎片，最后逐渐消失在画面中。整个过程充满了动感和色彩的变化。",
    "11. The Yankee Doodle_scene075.mp4": "视频中，一只小老鼠在地面上奔跑，它跑向一根红色的软管。小老鼠用牙齿咬住软管的喷嘴，然后将软管的喷嘴对准前方，喷出一股水流。背景是一个室内环境，有木桶和砖墙。",
    "11. The Yankee Doodle_scene076.mp4": "汤姆猫被困在一个木桶里，被两束激光击中后桶炸开，汤姆被弹出并摔在地上。他爬起来，发现一个飞镖靶和飞镖盒，捡起一个飞镖并瞄准靶子。",
    "11. The Yankee Doodle_scene077.mp4": "一只棕色的小老鼠在沙漠中奔跑，它跑向一个洞穴并跳进去。洞穴口有一个蓝色的马桶搋子，小老鼠被马桶搋子挡住，它试图爬出来，但被马桶搋子推回洞里。小老鼠在洞里挣扎，最终爬了出来。",
    "11. The Yankee Doodle_scene078.mp4": "汤姆猫用马桶搋子从木头洞里把杰瑞鼠拽出来，杰瑞鼠被拽出来后，汤姆猫得意洋洋地举着杰瑞鼠，但杰瑞鼠突然挣脱并反击，导致汤姆猫被撞飞出去。",
    "11. The Yankee Doodle_scene079.mp4": "汤姆猫在厨房里点燃了一个红色的火箭，火箭点燃后喷出火焰，汤姆猫抱着杰瑞鼠，脸上露出得意的笑容。",
    "11. The Yankee Doodle_scene080.mp4": "猫汤姆拿着一根绑着红色桶的棍子，桶里有火花。他用绳子绑住老鼠杰瑞，然后把杰瑞放下去。杰瑞被放下来后，汤姆开始大喊大叫，然后桶爆炸了，产生大量白烟。",
    "11. The Yankee Doodle_scene081.mp4": "视频开始于夜空，一颗烟花升空并绽放，逐渐形成美国国旗的图案，周围环绕着烟花。随后，场景切换到一个老鼠站在建筑物前，背景中出现“SEND MORE CATS!”的标语，老鼠似乎在敬礼或欢呼。",
    "11. The Yankee Doodle_scene082.mp4": "视频展示了一张标有“FINAL WAR COMMUNIQUE”（最终战争公报）的纸张，上面用黑色手写体写着“SEND MORE CATS!”（再派更多猫过来！），并署名“SIGNED... LT. JERRY MOUSE”（签名...杰瑞中尉）。随后画面逐渐变暗，最终出现“The End”字样，标志着视频的结束。",
    "11. The Yankee Doodle_scene083.mp4": "视频显示了“THE END”的字样，随后逐渐显示出“An MGM Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。",
    "11. The Yankee Doodle_scene084.mp4": "视频开始时显示了“An MGM Tom and Jerry Cartoon”标题，背景为红色，文字为蓝色，下方有“MADE IN HOLLYWOOD, U.S.A.”字样。随后画面转为全黑，持续一段时间。"
}