{
    "07. The Bowling Alley Cat_scene001.mp4": "视频开始时显示一个黑色背景，右下角有数字“0110544170204083”。随后，画面逐渐淡入，出现“Metro Goldwyn Mayer Cartoon”的标志，标志中央是一只咆哮的狮子，周围有“TRADE MARK”字样和“ARS GRATIA ARTIS”标语。狮子咆哮后逐渐安静，标志逐渐淡出。接着，画面再次变黑，然后淡入“Tom and Jerry”的标题，标题上方是猫汤姆和老鼠杰瑞的卡通形象，背景为红色。",
    "07. The Bowling Alley Cat_scene002.mp4": "视频片段展示了经典动画《猫和老鼠》的片头和片尾。首先出现的是《猫和老鼠》的标志性红色背景和卡通形象，随后切换到该集的标题“THE BOWLING ALLEY-CAT”（打保龄球的小偷猫），并附有中文翻译。接着显示了导演William Hanna和Joseph Barbera的名字，以及制片人Fred Quimby的信息。最后，画面转为黑色，暗示即将进入动画内容。整个片段是动画片的开场，用于介绍本集的标题和制作团队。",
    "07. The Bowling Alley Cat_scene004.mp4": "一只棕色的小老鼠从柱子后面探出头来，它开心地在地板上蹦跳着，随后沿着一条红色的线向前跑动，它时而停下，时而跳跃，显得非常活泼和快乐。",
    "07. The Bowling Alley Cat_scene005.mp4": "视频中，汤姆猫从两个黑色保龄球后面探出头来，露出狡黠的笑容，随后又缩回去，保龄球重新回到原位。",
    "07. The Bowling Alley Cat_scene006.mp4": "一只小老鼠在保龄球道上奔跑，不慎摔倒后又爬起来继续跑。它在球道尽头遇到一只大猫，猫慢慢靠近，小老鼠惊慌失措地试图逃跑，但被猫抓住。",
    "07. The Bowling Alley Cat_scene007.mp4": "一只小老鼠在猫的尾巴下玩耍，猫的尾巴突然扫过，小老鼠被甩到一边。猫低头看小老鼠，小老鼠被猫的胡须缠住，猫张嘴想吃小老鼠，但小老鼠挣扎着逃脱。",
    "07. The Bowling Alley Cat_scene008.mp4": "一只小老鼠从猫的尾巴后面探出头，它先是小心翼翼地观察四周，然后开始沿着猫的尾巴爬行。小老鼠爬到尾巴尖时，它兴奋地张开双臂，似乎在庆祝自己的成功。最后，小老鼠从猫的尾巴上滑落，消失在画面中。",
    "07. The Bowling Alley Cat_scene009.mp4": "在保龄球馆里，汤姆猫蹲在地上，眼睛盯着前方的小老鼠杰瑞。他突然站起来，露出愤怒的表情，然后猛地向前扑去，但只看到保龄球和空荡荡的地面。",
    "07. The Bowling Alley Cat_scene010.mp4": "一只小老鼠在地板上奔跑，一只大黑猫紧追不舍。黑猫在追逐过程中摔倒，又挣扎着站起来，但最终还是摔倒在地，显得非常狼狈。",
    "07. The Bowling Alley Cat_scene011.mp4": "一只棕色的小老鼠在地板上奔跑，身后扬起一撮灰尘，随后它停下脚步，转身面向画面右侧。",
    "07. The Bowling Alley Cat_scene012.mp4": "一只黑猫躺在地板上，它伸展身体，然后慢慢站起来，接着又躺下，重复这个动作。",
    "07. The Bowling Alley Cat_scene013.mp4": "一只小老鼠在木地板上奔跑，突然遇到一只大黑猫。小老鼠停下，面对黑猫，黑猫则俯视着小老鼠，露出凶狠的表情。小老鼠张大嘴巴，似乎在尖叫或害怕。黑猫突然扑向小老鼠，但小老鼠迅速躲开，黑猫扑空后摔倒在地，表情痛苦。",
    "07. The Bowling Alley Cat_scene014.mp4": "一只小老鼠跑向一条猫的尾巴，抓住尾巴并骑在上面，随着猫尾巴的摆动，小老鼠在地板上滑行，最后被甩了下来。",
    "07. The Bowling Alley Cat_scene015.mp4": "一只黑白相间的猫在保龄球道上滚动，它四肢朝天，表情痛苦，似乎在经历某种不适或被击打的反应。背景中可以看到几个黑色的保龄球。",
    "07. The Bowling Alley Cat_scene016.mp4": "一只黑猫从一个装满冰激凌的碗里爬出来，碗被打翻，冰激凌洒了一地。黑猫被冰激凌覆盖，变成了一座冰激凌山。",
    "07. The Bowling Alley Cat_scene017.mp4": "动画片段中，一个巨大的沙堆在桌子下方逐渐隆起，沙堆顶端突然喷发，将一只灰猫从沙堆中喷出。猫被喷出后，脸上沾满沙子，表情愤怒。随后，猫叼起烟斗，表情变得得意，但烟斗突然爆炸，猫被炸得满脸是沙，最后猫眯起一只眼睛，露出得意的笑容。",
    "07. The Bowling Alley Cat_scene018.mp4": "一只小老鼠站在保龄球瓶前，兴奋地举起一只手，似乎在庆祝或准备投球。背景是深色的，突显出保龄球瓶和小老鼠。",
    "07. The Bowling Alley Cat_scene019.mp4": "一只灰色的猫从一堆面粉中跳出来，它在保龄球馆里，试图用保龄球打球，但失败了，最终它被保龄球砸中，躺在地上。",
    "07. The Bowling Alley Cat_scene020.mp4": "一只棕色的小老鼠在保龄球瓶旁兴奋地跳舞，它张开双臂，摇摆身体，显得非常开心。背景是室内环境，有木质地板和蓝色墙壁。",
    "07. The Bowling Alley Cat_scene021.mp4": "一只灰色的猫在保龄球馆里，抱着一个保龄球，试图投掷，但球砸中了它，导致它翻滚并摔倒在地。",
    "07. The Bowling Alley Cat_scene022.mp4": "一只小老鼠在保龄球瓶旁边，它先是跳起来撞向一个保龄球瓶，然后又用力推这个瓶子，最后累得躺在地上。",
    "07. The Bowling Alley Cat_scene023.mp4": "一只猫在保龄球馆里，抱着一个保龄球，然后被球砸中，摔倒在地。",
    "07. The Bowling Alley Cat_scene024.mp4": "一只老鼠在保龄球瓶后面，突然被一个保龄球击中，从球瓶后跳起。",
    "07. The Bowling Alley Cat_scene026.mp4": "一只小老鼠躲在保龄球瓶上，躲避滚来的保龄球。保龄球击倒了瓶子，小老鼠被甩了下来，最后它爬起来跑开了。",
    "07. The Bowling Alley Cat_scene027.mp4": "在保龄球馆里，一只小老鼠躺在球道上，一个黑色保龄球滚来，撞倒了左边的保龄球瓶，球瓶飞出去。",
    "07. The Bowling Alley Cat_scene028.mp4": "一只猫在保龄球馆里，它先是用爪子抓着保龄球瓶，然后用球瓶上的毛巾擦了擦脸，接着拿起一个保龄球，做出投掷的动作，最后成功地将球投了出去。",
    "07. The Bowling Alley Cat_scene029.mp4": "一只小老鼠从墙角爬出，看到地上的一个大木勺，它爬过去抱住木勺，然后用力一推，木勺被推得飞了起来，小老鼠也被弹飞了出去，最后躺在地上。",
    "07. The Bowling Alley Cat_scene030.mp4": "一个黑色小球从绿色窗帘上方滚落，镜头跟随小球向下移动，最终小球滚到窗帘下方。",
    "07. The Bowling Alley Cat_scene031.mp4": "一只黑猫在室内环境中，从桌子旁开始，依次跳上沙发、柜子、椅子，最后跳到台阶上，全程张开双臂，表情夸张，似乎在表演或跳舞。",
    "07. The Bowling Alley Cat_scene032.mp4": "在台球室里，汤姆猫兴奋地跳跃着，突然被一个黑色台球砸中，从空中摔落，砸出一个大坑。台球滚入坑中，汤姆猫从坑里探出头来，台球竟然长出了眼睛和嘴巴，变成了一个有表情的黑色球。汤姆猫惊讶地看着这个球，然后露出得意的笑容，似乎在计划如何对付这个“新朋友”。",
    "07. The Bowling Alley Cat_scene033.mp4": "一只小老鼠坐在保龄球瓶上，它举起一只手，似乎在庆祝或准备投球。背景中可以看到保龄球和球道。",
    "07. The Bowling Alley Cat_scene034.mp4": "汤姆猫在台球厅里，被一个黑色台球砸中头部，他痛苦地在地上翻滚，随后愤怒地抓起台球，用力砸向墙壁。",
    "07. The Bowling Alley Cat_scene035.mp4": "在保龄球馆里，汤姆猫试图投掷保龄球，但被球道上的障碍物绊倒，最终摔倒在地。",
    "07. The Bowling Alley Cat_scene036.mp4": "在保龄球馆里，汤姆被一个保龄球击中后，被弹射出去，沿着球道滑行，最终撞向球瓶区。",
    "07. The Bowling Alley Cat_scene037.mp4": "一只老鼠在保龄球道上，先是站在球瓶上，随后被球击倒，接着它抓住了上方的栏杆，最后从栏杆上滑落。",
    "07. The Bowling Alley Cat_scene038.mp4": "在保龄球馆里，汤姆猫被保龄球瓶包围，他先是躺在地上，然后被球瓶压住，最后他坐起来，做出各种夸张的表情和动作，显得非常滑稽。背景中可以看到保龄球和球架。",
    "07. The Bowling Alley Cat_scene039.mp4": "一个卡通小老鼠在保龄球道上奔跑，从近处向远处跑去，最终消失在球道尽头。",
    "07. The Bowling Alley Cat_scene040.mp4": "一只灰色的猫在保龄球道上，用爪子推着一个黑色的保龄球。球沿着球道滚动，最终滚向球瓶。",
    "07. The Bowling Alley Cat_scene041.mp4": "视频展示了一只小老鼠在保龄球道上奔跑，它试图推动一个巨大的黑色保龄球。小老鼠从画面右侧跑入，靠近保龄球，然后用尽全力推球，但球没有移动。小老鼠看起来非常努力，表情专注而紧张。背景是保龄球道的木质表面和淡蓝色的墙壁。",
    "07. The Bowling Alley Cat_scene042.mp4": "一只小老鼠在楼梯上奔跑，突然被两个黑色球体滚过，它被吓得趴下，随后又站起来继续跑，最后从楼梯上跳起。",
    "07. The Bowling Alley Cat_scene043.mp4": "一个黑色的保龄球沿着木质轨道滚动，轨道呈弯曲状，背景为灰色墙面。保龄球表面光滑，有三个白色圆点作为标记。镜头聚焦于保龄球的运动，展示其从高处滑下并逐渐接近轨道尽头的过程。",
    "07. The Bowling Alley Cat_scene044.mp4": "一只棕色的小老鼠在保龄球道上奔跑，它面前排列着四个巨大的黑色保龄球。小老鼠跑动时表情紧张，似乎在躲避或追赶这些球。",
    "07. The Bowling Alley Cat_scene045.mp4": "在保龄球馆里，汤姆猫趴在球道边缘，先是张大嘴巴笑，然后打了个大大的哈欠，尾巴高高翘起。",
    "07. The Bowling Alley Cat_scene046.mp4": "一只棕色的小老鼠在保龄球道上奔跑，它试图躲避前方排列的几个黑色保龄球。小老鼠表情紧张，身体前倾，快速移动，似乎在躲避即将滚来的保龄球。背景是深蓝色的墙壁和木质的保龄球道。",
    "07. The Bowling Alley Cat_scene047.mp4": "在保龄球馆里，一只灰白相间的猫趴在球道边缘，张大嘴巴打哈欠。突然，几个黑色的保龄球从右侧滚来，猫被吓得向后翻滚，球滚到它身上，它被压得动弹不得。",
    "07. The Bowling Alley Cat_scene048.mp4": "在保龄球馆里，汤姆猫躺在球道上，一个保龄球压在他的脸上。杰瑞鼠从球里钻出来，站在球上，然后跳到球道上方，用尾巴拉住球，把球拉向汤姆。汤姆被球拉得动弹不得，表情痛苦。",
    "07. The Bowling Alley Cat_scene049.mp4": "在保龄球馆里，汤姆猫躺在球道上，杰瑞鼠从斜坡上跳下来，汤姆猫被惊醒后，愤怒地抓起保龄球，结果一连扔出多个保龄球，将球道上的球全部击倒。",
    "07. The Bowling Alley Cat_scene050.mp4": "一只灰色的猫在保龄球道上被黑色的保龄球撞击，它摔倒在球道上，然后被球道上的机械装置夹住，最后被球道上的保龄球撞飞。",
    "07. The Bowling Alley Cat_scene051.mp4": "在保龄球馆，汤姆猫试图偷走保龄球，但被杰瑞鼠发现并藏在保龄球后面。汤姆猫被保龄球砸中后，杰瑞鼠从保龄球后探出头来，露出得意的表情。",
    "07. The Bowling Alley Cat_scene052.mp4": "一只棕色的小老鼠从黑色保龄球上跳起，然后在空中奔跑，最后消失在画面中。",
    "07. The Bowling Alley Cat_scene053.mp4": "一只灰色的猫从桌子后面探出头，靠近一个黑色的保龄球。它用爪子拨弄保龄球，然后突然被球里弹出的小老鼠吓到，张大嘴巴惊叫，同时伸手试图抓住小老鼠。",
    "07. The Bowling Alley Cat_scene054.mp4": "一只猫用爪子抓住一只老鼠，老鼠奋力挣扎，最终挣脱并飞向空中。",
    "07. The Bowling Alley Cat_scene055.mp4": "一只小老鼠从一个黑色球体的洞里钻出来，坐在球体上，先是舔了舔爪子，然后打了个喷嚏，喷出一些灰尘，最后又钻回洞里。",
    "07. The Bowling Alley Cat_scene056.mp4": "一只灰色的猫（汤姆）站在保龄球道旁，双手握着一个黑色的保龄球。他先是眯着眼睛，表情凶狠，然后张大嘴巴，似乎在大声喊叫或咆哮，接着又咬住保龄球，表现出一种紧张或兴奋的情绪。背景中可以看到保龄球道的边缘和一个蓝色的保龄球瓶。",
    "07. The Bowling Alley Cat_scene057.mp4": "一只灰色的猫正抱着一个黑色的球，球上有一只小老鼠。猫试图用球把老鼠弹飞，但每次老鼠都会从球上弹起，然后又落回球上。猫显得非常兴奋和得意，而老鼠则显得有些惊慌和无助。整个场景充满了幽默和喜剧效果。",
    "07. The Bowling Alley Cat_scene058.mp4": "在保龄球馆里，汤姆猫拿着一个保龄球，杰瑞鼠在球上。汤姆猫把球举过头顶，然后用力扔出，球砸在了保龄球架上，汤姆猫被球砸得飞了起来，然后重重地摔在地上。汤姆猫站起来，揉揉眼睛，然后又开始跳舞，最后被球砸得飞了起来。",
    "07. The Bowling Alley Cat_scene059.mp4": "一只小老鼠在室内奔跑，躲到一个垃圾桶后面。一只大猫从上方扑下，试图抓住老鼠。老鼠被猫抓住，但猫又松开手，老鼠逃跑了。",
    "07. The Bowling Alley Cat_scene060.mp4": "在保龄球馆里，汤姆猫兴奋地挥舞着拳头，然后突然摔倒在地，接着又站起来，做出投球的姿势，最后滑倒并消失在画面中。",
    "07. The Bowling Alley Cat_scene062.mp4": "猫和老鼠在黑色球体上进行拉扯游戏，猫用白布条与老鼠角力，最终老鼠逃脱并跑开，猫则躺在地上。",
    "07. The Bowling Alley Cat_scene063.mp4": "一只灰白相间的猫在室内地板上奔跑，它的尾巴末端拖着一个黑色的球形物体。猫的表情显得紧张和专注，嘴巴张开，似乎在大声叫喊或喘息。背景中可以看到一些家具，如沙发和桌子，环境看起来像是一个客厅或休息室。猫的动作迅速而有力，显示出一种紧迫感或追逐的状态。",
    "07. The Bowling Alley Cat_scene064.mp4": "一只小老鼠从柱子后面跑出来，一只黑猫从柱子后面追出来，黑猫张开嘴露出牙齿，小老鼠躲在柱子后面，黑猫追着小老鼠跑，黑猫撞到一个黑色的球，球滚到小老鼠面前，黑猫追着球跑。",
    "07. The Bowling Alley Cat_scene065.mp4": "一只小老鼠从沙发底下跑过，随后一只猫从沙发底下追了出来，猫的尾巴被沙发腿卡住，猫被卡住动弹不得。",
    "07. The Bowling Alley Cat_scene066.mp4": "在保龄球馆里，汤姆猫正准备投球。他先是小心翼翼地靠近球道，然后用力将球掷出。球在球道上滚动，汤姆猫则紧随其后，表情专注而兴奋。最终，球击中了球瓶，汤姆猫满意地笑了。",
    "07. The Bowling Alley Cat_scene067.mp4": "一个黑色的球体从飞机尾部喷出，导致飞机结构破裂，碎片四散飞溅。",
    "07. The Bowling Alley Cat_scene069.mp4": "在保龄球馆里，汤姆猫滑行着，手里拿着一个保龄球，然后向前滚动，最终撞倒了球瓶。",
    "07. The Bowling Alley Cat_scene070.mp4": "一个黑色的保龄球滚向一排白色的保龄球瓶，球瓶被击倒，散落在地上。",
    "07. The Bowling Alley Cat_scene071.mp4": "夜晚，一堵砖墙突然被炸开，砖块四散飞溅，形成一个大洞。",
    "07. The Bowling Alley Cat_scene072.mp4": "一只猫从垃圾桶里掉出来，然后画面切换到一只老鼠拿着一支巨大的铅笔在记分表上画叉，它看起来非常得意。最后，老鼠在记分表上画了一个叉，然后高兴地跳了起来。",
    "07. The Bowling Alley Cat_scene073.mp4": "视频开始时显示红色背景上的白色文字“The End”，随后文字逐渐淡出，出现“M.G.M Tom and Jerry CARTOON”的标志，背景保持红色，文字为白色并带有阴影效果。",
    "07. The Bowling Alley Cat_scene074.mp4": "视频开始时显示了“MGM Tom and Jerry CARTOON”的标志，随后画面转为全黑，持续一段时间。"
}