{
    "S1950E09 - Casanova Cat_scene001.mp4": "画面展示了米高梅动画的标志，背景为深蓝色，标志中央是一个黑色的圆形，下方写着“CARTOON”字样，上方有“A METRO-GOLDWYN-MAYER”字样，底部标注“COLOR BY TECHNICOLOR”。整个画面呈现出经典的动画片头风格。",
    "S1950E09 - Casanova Cat_scene002.mp4": "视频展示了米高梅动画公司的标志，一只狮子从圆形框中出现并咆哮，随后画面切换到“Tom and Jerry”的标题，伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "S1950E09 - Casanova Cat_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深绿色，金色大字“TOM and JERRY”醒目地显示在中央。左侧是棕色的小老鼠杰瑞，它面带微笑，一只前爪抬起，似乎在欢快地跳跃。右侧是灰色的猫汤姆，它咧嘴大笑，露出牙齿，表情显得非常开心。随后，画面中出现了“CARTOON CAT”字样以及导演“William Hanna”和“Joseph Barbera”的名字。整个画面充满活力和欢乐的氛围。",
    "S1950E09 - Casanova Cat_scene004.mp4": "这是一个动画片的片头，展示了《Casanova Cat》的标题和制作人员名单。画面首先显示了导演William Hanna和Joseph Barbera的名字，接着是动画师、音乐作曲家等工作人员的名单，最后是制片人Fred Quimby的名字。整个片头背景为深色，文字以金色和粉色为主，风格复古。在片头结束时，画面逐渐变暗，转场到下一个场景。",
    "S1950E09 - Casanova Cat_scene005.mp4": "汤姆戴着帽子，手里拿着一束花，牵着一只小老鼠在街上散步。",
    "S1950E09 - Casanova Cat_scene006.mp4": "一只穿着黄色翅膀的小老鼠在墙上奔跑，被一根绳子拉扯，它摔倒后又挣扎着站起来，最终紧紧抓住绳子。",
    "S1950E09 - Casanova Cat_scene007.mp4": "汤姆戴着帽子，手持花束和报纸，牵着杰瑞在街道上行走。杰瑞戴着一顶小帽子，被绳子牵着。汤姆停下脚步，展开报纸，似乎在阅读，而杰瑞则坐在地上，看着汤姆。背景是城市街道，有建筑物和树木。",
    "S1950E09 - Casanova Cat_scene008.mp4": "视频展示了一张报纸的特写，标题为“Morning Herald”，头条新闻是“KITTEN INHERITS MILLION!”（小猫继承百万！）。报纸上有一幅插图，描绘了一只优雅的白色小猫躺在一张豪华的躺椅上，背景是深色的窗帘。下方的副标题写着“'TOODLES' SOLE HEIR OF FORTUNE”（“托迪”是唯一的继承人）。随着镜头向下移动，可以看到更多文字，包括“TOODLES SOLE HEIR OF FORTUNE MOVES TO SWANK PARK RITZ APT.”（“托迪”作为唯一的继承人搬进了奢华的帕克里茨公寓）。此外，旁边还有其他新闻标题，如“BLIZZARD HITS MIDWEST STATE”（暴风雪袭击中西部州）和“LAST MIN”（最后时刻）。整个画面以黑白灰为主色调，具有经典动画风格。",
    "S1950E09 - Casanova Cat_scene009.mp4": "汤姆戴着一顶黄色的帽子，站在一个标有“PARK”的拱门下，手里拿着一份报纸。他先是低头阅读报纸，然后抬起头来，露出微笑。背景是一栋建筑物，窗户上有栏杆。",
    "S1950E09 - Casanova Cat_scene010.mp4": "一只戴着黄色蝴蝶结的小老鼠坐在地上，手里拿着一张纸。一只大猫从上方出现，用爪子拿着纸条，上面写着“TO TOODLES WITH LOVE TOM”。猫微笑着展示纸条，小老鼠则表情严肃地看着。随后猫收回纸条，小老鼠依旧坐在原地。",
    "S1950E09 - Casanova Cat_scene011.mp4": "视频中，一只戴着帽子、手持花束的猫（汤姆）正牵着一只戴帽子的小老鼠（杰瑞）在街道上行走。猫显得非常开心和自信，似乎在进行某种浪漫或正式的活动。他们穿过街道，进入一栋房子的走廊。猫继续牵着老鼠，走到一扇门前，似乎准备敲门。这时，一位穿着女仆服装的女性出现在门口，猫向她鞠躬并递上帽子，表现出礼貌和尊重。女仆接过帽子，猫则继续牵着老鼠，似乎准备进入房子。整个场景充满了幽默和轻松的氛围，猫和老鼠之间的互动充满了喜剧色彩。",
    "S1950E09 - Casanova Cat_scene012.mp4": "汤姆猫从门后探出头，先是微笑，然后张大嘴巴，伸出舌头，眼睛瞪得很大，似乎在追逐或盯着什么。",
    "S1950E09 - Casanova Cat_scene013.mp4": "一只白猫正在涂指甲油，这时灰猫汤姆出现，他先是亲吻白猫的手，然后递给她一束花，花上坐着一只小老鼠。白猫看到后非常开心，汤姆则得意地展示着小老鼠。",
    "S1950E09 - Casanova Cat_scene014.mp4": "汤姆猫站在绿色幕布前，手里拿着一只小老鼠玩具，他面带微笑，用手指轻轻拨弄着玩具老鼠，玩具老鼠在汤姆的指间晃动，汤姆看起来非常开心和满足。",
    "S1950E09 - Casanova Cat_scene015.mp4": "汤姆猫从一个盒子里拿出杰瑞鼠，杰瑞鼠站在桌子上，表情愤怒，不断跺脚并摆动身体，显得非常生气。",
    "S1950E09 - Casanova Cat_scene016.mp4": "汤姆猫和杰瑞鼠在室内互动。汤姆猫坐在桌子旁，杰瑞鼠坐在椅子上。汤姆猫先是用手指指向杰瑞鼠，然后拿出一个彩色的球，展示给杰瑞鼠看。杰瑞鼠双手合十，面带微笑地看着汤姆猫。汤姆猫接着将球抛向空中，杰瑞鼠继续注视着球。",
    "S1950E09 - Casanova Cat_scene017.mp4": "一只老鼠戴着黄色帽子，在舞台上表演杂技，它先用球滚到面前，然后跳上球，开始在球上保持平衡并做出各种动作。最后，一只大脚出现在画面中，老鼠被吓了一跳。",
    "S1950E09 - Casanova Cat_scene018.mp4": "汤姆猫张开双臂，杰瑞鼠站在一个橙色球上从他头顶飞过，然后跳进一个鱼缸里，球也跟着沉入水中。杰瑞鼠在水中挣扎，球浮在水面，杰瑞鼠在球上挣扎。",
    "S1950E09 - Casanova Cat_scene019.mp4": "汤姆猫坐在桌旁，嘴里叼着雪茄，手里拿着点燃的火柴，正在吸烟。他身旁坐着一只白猫，系着紫色围巾，双手合十，面带微笑。汤姆吸着烟，烟雾缭绕，白猫则闭上眼睛，享受着这一刻。随后，汤姆将火柴熄灭，烟雾散去，他拿起一个棕色的小老鼠玩具，继续吸烟，白猫则依然保持着双手合十的姿势，注视着汤姆。",
    "S1950E09 - Casanova Cat_scene020.mp4": "汤姆猫用爪子捏着杰瑞鼠，杰瑞鼠在汤姆的爪子里挣扎。汤姆猫吹了一口气，杰瑞鼠被烟熏黑了，但汤姆猫依然微笑着看着杰瑞鼠。",
    "S1950E09 - Casanova Cat_scene021.mp4": "汤姆猫用爪子轻轻捏着一只小老鼠，小老鼠戴着黄色蝴蝶结，表情惊恐。汤姆猫面带微笑，眼神温柔地看着小老鼠，似乎在逗弄它。随后，汤姆猫将小老鼠轻轻捏住，小老鼠的嘴巴张开，显得更加惊慌。汤姆猫继续用爪子捏着小老鼠，表情依旧温柔，但小老鼠的惊恐表情更加明显。",
    "S1950E09 - Casanova Cat_scene022.mp4": "汤姆猫拿着一只穿着黄色蝴蝶结的小老鼠，将它放在一个云朵形状的盘子上，然后用一根点燃的火柴支撑着盘子，让小老鼠站在盘子上。旁边坐着一只白色的猫，她双手合十，面带微笑地看着这一幕。",
    "S1950E09 - Casanova Cat_scene023.mp4": "一只穿着黄色围巾的黑色小老鼠站在一个圆形平台上，平台逐渐变红，小老鼠看起来很紧张，双手抱在胸前，表情惊恐。",
    "S1950E09 - Casanova Cat_scene024.mp4": "一只穿着黄色领结的小老鼠在红色的圆形平台上跳舞，它不断跳跃和旋转，表情开心。随后，它突然被一股力量向上抛起，平台周围冒出白烟，最终消失在画面中。",
    "S1950E09 - Casanova Cat_scene025.mp4": "汤姆猫将一只小老鼠放在手掌上展示给坐在椅子上的杰瑞猫看，杰瑞猫表现出惊讶和不满。汤姆猫随后凑近杰瑞猫，似乎在亲吻或舔她，杰瑞猫则用手推拒汤姆猫。",
    "S1950E09 - Casanova Cat_scene026.mp4": "一只小老鼠被猫的手抓住，它试图用猫的尾巴推动一个红色的容器，最终猫的尾巴被容器卡住，猫痛苦地蜷缩起来。",
    "S1950E09 - Casanova Cat_scene027.mp4": "汤姆和杰瑞在室内对峙，汤姆表情愤怒，杰瑞则显得不屑一顾。",
    "S1950E09 - Casanova Cat_scene028.mp4": "动画片段中，一只红猫和一只白猫坐在沙发上。红猫突然张大嘴巴打哈欠，白猫则露出惊讶的表情。随后，红猫的舌头伸长，白猫被吓到后退，表情变得惊恐。",
    "S1950E09 - Casanova Cat_scene029.mp4": "视频中，汤姆猫和杰瑞鼠在室内对话。汤姆猫站在桌子旁，面带笑容，显得非常开心。杰瑞鼠坐在椅子上，穿着紫色围巾，表情从惊讶逐渐变为不满，最后双手叉腰，显得有些生气。背景是绿色的窗帘，整体氛围轻松幽默。",
    "S1950E09 - Casanova Cat_scene030.mp4": "一只小老鼠从花盆后面探出头来，然后小心翼翼地走出来，沿着阳台边缘奔跑。",
    "S1950E09 - Casanova Cat_scene031.mp4": "一只黑猫倒挂在垃圾桶里，它先是用一只脚悬空，然后用两只手抓住垃圾桶边缘，接着又用一只脚悬空，如此反复。背景是砖墙和一些杂物。",
    "S1950E09 - Casanova Cat_scene032.mp4": "一只棕色的小老鼠从阳台跑下来，看到一张报纸，它把报纸展开，上面写着“小猫继承了一百万”。小老鼠兴奋地读着报纸，然后把报纸折成纸飞机，扔了出去。纸飞机在空中飞舞，小老鼠看着纸飞机飞走，脸上露出开心的笑容。",
    "S1950E09 - Casanova Cat_scene033.mp4": "一只黑猫从垃圾桶里探出头来，先是踢了踢垃圾桶，然后从垃圾桶里拿出一张报纸阅读，读到有趣的内容时露出开心的表情，接着报纸着火了，黑猫看着燃烧的报纸，表情变得惊讶。",
    "S1950E09 - Casanova Cat_scene034.mp4": "一只棕色的小老鼠站在窗台上，它先是小心翼翼地探出头，然后开始左右张望，似乎在观察周围的环境。窗台上还摆放着一盆盛开的玫瑰花。",
    "S1950E09 - Casanova Cat_scene035.mp4": "一只黑猫坐在垃圾桶里，手里拿着一块肉，开心地大笑。它突然被垃圾桶盖子盖住，然后被倒出，肉也飞了出去。",
    "S1950E09 - Casanova Cat_scene036.mp4": "一只黑色的猫从高楼的窗户跳出，在空中翻滚后继续向上飞，最终消失在画面顶部。背景是倾斜角度的城市建筑和天空。",
    "S1950E09 - Casanova Cat_scene037.mp4": "一只黑猫从窗外跳进房间，飞身扑向沙发上的白猫，白猫惊慌失措，黑猫紧紧抱住白猫，白猫挣扎着，黑猫则一脸得意。",
    "S1950E09 - Casanova Cat_scene038.mp4": "灰色猫和黑色猫在沙发上对峙，灰色猫指责黑色猫，黑色猫愤怒地反击，灰色猫被击飞后撞到鱼缸，导致鱼缸破裂，灰色猫被水淹没，最后被鱼缸盖住头部。",
    "S1950E09 - Casanova Cat_scene039.mp4": "汤姆猫被关在一个鱼缸里，一只橙色的小金鱼在鱼缸里游来游去，时而靠近汤姆猫的嘴边，时而游到汤姆猫的耳朵旁边。汤姆猫的表情从平静到微笑，最后露出得意的笑容。",
    "S1950E09 - Casanova Cat_scene040.mp4": "汤姆猫被一个鱼缸罩住头部，他挣扎着试图摆脱，结果鱼缸破裂，水洒了一地，汤姆猫浑身湿透，狼狈不堪。他愤怒地跺脚，然后愤怒地跑开。",
    "S1950E09 - Casanova Cat_scene041.mp4": "一只灰色的猫从窗户探出头来，抓住一根绳子，用力拉扯，导致绳子弯曲，末端的球形物体随之摆动。",
    "S1950E09 - Casanova Cat_scene042.mp4": "灰色的猫汤姆拉着一根绳子，绳子的另一端是黑色的猫，黑色猫在沙发上，汤姆用力拉绳子，黑色猫被拉得身体后仰，汤姆和黑色猫开始拉扯绳子，汤姆把黑色猫拉到沙发边，黑色猫被拉到沙发边后，汤姆松开绳子，黑色猫和白色猫在沙发上，黑色猫叼着雪茄，白色猫戴着紫色蝴蝶结，黑色猫向白色猫展示雪茄，白色猫看着黑色猫，黑色猫被拉到沙发边后，汤姆松开绳子，黑色猫和白色猫在沙发上，黑色猫叼着雪茄，白色猫戴着紫色蝴蝶结，黑色猫向白色猫展示雪茄，白色猫看着黑色猫，黑色猫被拉到沙发边后，汤姆松开绳子，黑色猫和白色猫在沙发上，黑色猫叼着雪茄，白色猫戴着紫色蝴蝶结，黑色猫向白色猫展示雪茄，白色猫看着黑色猫，黑色猫被拉到沙发边后，汤姆松开绳子，黑色猫和白色猫在沙发上，黑色猫叼着雪茄，白色猫戴着紫色",
    "S1950E09 - Casanova Cat_scene043.mp4": "视频开始时，一只黑猫挂在一根旗杆上，随后场景切换到室内，一只灰猫和一只白猫坐在沙发上。白猫拿着一盒糖果，不断将糖果抛向灰猫，灰猫张嘴接住糖果，但每次都因糖果的甜味而喷出唾沫。这时，黑猫从沙发后面探出头来，手里拿着一个黑色的球，准备扔向灰猫。灰猫被黑猫的举动吓到，身体突然变长，最后变成了一根柱子，糖果洒落在沙发上。",
    "S1950E09 - Casanova Cat_scene044.mp4": "一只猫从沙发破洞中被弹簧弹出，身体被弹簧缠绕，表情惊恐。",
    "S1950E09 - Casanova Cat_scene045.mp4": "一只黑猫和一只白猫在沙发上互动，黑猫用爪子轻捏白猫的爪子，白猫则表现出不悦和抗拒，随后黑猫继续拉扯白猫的爪子，白猫试图挣脱。",
    "S1950E09 - Casanova Cat_scene046.mp4": "一只黑白相间的猫趴在绿色的物体上，用前爪抓着白色物体，表情从开心到专注再到放松，眼睛时而眯起时而睁开。",
    "S1950E09 - Casanova Cat_scene047.mp4": "一只白猫戴着紫色蝴蝶结，闭着眼睛，看起来很放松。一只灰猫从背后出现，手里拿着一个捕鼠夹，放在白猫的背上。灰猫离开后，白猫依然不动。随后，一只黑猫出现，把捕鼠夹从白猫背上拿走，并咬住捕鼠夹，露出惊讶的表情。",
    "S1950E09 - Casanova Cat_scene048.mp4": "汤姆猫从绿色扶手椅后探出头，露出开心的笑容，随后突然从椅子上跳起，快速向画面右侧跑去，最终消失在画面中。",
    "S1950E09 - Casanova Cat_scene049.mp4": "视频中，汤姆猫从门后跑出来，试图抓住从门缝中探出头来的杰瑞鼠。杰瑞鼠迅速躲进房间，汤姆猫紧追不舍，但最终被杰瑞鼠巧妙地甩开。杰瑞鼠得意地站在房间中央，而汤姆猫则在门外懊恼地跺脚。",
    "S1950E09 - Casanova Cat_scene051.mp4": "一只白猫戴着紫色围巾，站在绿色沙发上，一只棕色老鼠从她身后靠近并亲吻她的脸颊。白猫被惊吓，喷出一口唾沫，老鼠被吓飞到空中。白猫转头看向老鼠飞走的方向，表情不满。",
    "S1950E09 - Casanova Cat_scene052.mp4": "一只棕色的小老鼠从房间的一角跑出来，它快速地穿过房间，然后撞到了墙上的一个开关。接着，一只黑色的猫从墙后跳出来，它看起来很惊讶。随后，一只灰色的猫也从墙后跑出来，它看起来很生气，站在黑色猫的旁边。",
    "S1950E09 - Casanova Cat_scene053.mp4": "一只老鼠从墙上的通风口探出头来，被一只猫的尾巴抓住，随后老鼠被拉回通风口内。",
    "S1950E09 - Casanova Cat_scene054.mp4": "猫汤姆站在墙边，尾巴轻轻摆动，眼睛盯着墙上的通风口。突然，一只老鼠从通风口探出头来，汤姆迅速转身，尾巴一甩，将通风口盖子掀开，老鼠吓得缩回去了。汤姆一脸得意地看着通风口，似乎对刚才的举动感到满意。",
    "S1950E09 - Casanova Cat_scene055.mp4": "一只小老鼠在两个长条状物体之间玩耍，它先是抓住白色的物体，然后又抓住黑色的物体，最后又回到白色的物体上。小老鼠的表情非常开心，一直在笑。",
    "S1950E09 - Casanova Cat_scene056.mp4": "汤姆猫站在墙边，身体前倾，双手握拳，表情专注。他用力拉扯墙上的通风口盖板，盖板被他拉得晃动，汤姆猫的表情从专注变为愤怒，他继续用力拉扯，盖板被拉得更加晃动，汤姆猫的表情变得更加愤怒。",
    "S1950E09 - Casanova Cat_scene057.mp4": "动画片中，汤姆猫在房间里被窗户砸中，他痛苦地翻滚着，随后站起来，愤怒地用爪子抓向窗户。",
    "S1950E09 - Casanova Cat_scene058.mp4": "一只灰色的猫正在用力撞击墙壁上的一个木制通风口，导致墙壁破裂，碎片四溅。猫的表情显得非常愤怒和用力，它不断撞击，墙壁的裂缝越来越大。",
    "S1950E09 - Casanova Cat_scene059.mp4": "一只黑猫正在用尾巴拉扯墙上的一个窗户，试图把它拉下来。它用力拉扯，身体前倾，尾巴紧贴窗户，最终窗户被拉得更紧，黑猫也因为用力过猛而向后倒去。",
    "S1950E09 - Casanova Cat_scene060.mp4": "汤姆猫从墙洞中探出头，表情紧张，随后被一块木板压住头部，显得痛苦和惊恐。",
    "S1950E09 - Casanova Cat_scene061.mp4": "一只黑猫在房间里追逐一只被关在纸箱里的灰猫，黑猫撞到纸箱后，灰猫从箱子里出来，两只猫对峙着。",
    "S1950E09 - Casanova Cat_scene062.mp4": "一只黑猫从绿色沙发上跳下，随后一只灰猫也从沙发上跳下。两只猫在沙发旁来回跳跃，动作夸张而富有喜剧效果。背景是蓝色窗帘。",
    "S1950E09 - Casanova Cat_scene063.mp4": "一只黑猫从画面右侧跑入，跳到窗台上，另一只灰猫紧随其后也跳到窗台上，两只猫并排趴在窗台上向外张望。",
    "S1950E09 - Casanova Cat_scene064.mp4": "一辆蓝色的汽车在街道上行驶，逐渐驶离画面，留下尾气。背景中有建筑物和停放的车辆。",
    "S1950E09 - Casanova Cat_scene065.mp4": "一只白猫穿着紫色衣服坐在蓝色汽车的后座上，她闭着眼睛，似乎在休息。突然，一只棕色的小老鼠从车后座的另一边探出头来，微笑着看着白猫。小老鼠站起来，举起一只前爪，似乎在向白猫打招呼或示意。白猫睁开眼睛，看着小老鼠，表情从惊讶变为微笑。接着，画面切换到车窗的剪影，白猫和小老鼠的轮廓在车窗上清晰可见。小老鼠开始跳舞，白猫看着它，表情变得愉快。小老鼠继续跳舞，白猫则保持微笑。最后，画面逐渐变暗，显示“THE END”字样。",
    "S1950E09 - Casanova Cat_scene066.mp4": "视频展示了“THE END”字样，随后逐渐显现出“An M-G-M Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色。"
}