{
    "E64.The.Duck.Doctor_scene001.mp4": "视频展示了米高梅动画公司的经典标志，一只咆哮的狮子出现在红色的圆形框架内，下方有“METRO-GOLDWYN-MAYER CARTOON”字样，标明这是由Technicolor公司上色的动画作品。",
    "E64.The.Duck.Doctor_scene002.mp4": "视频展示了米高梅动画的标志，背景为红色，中央是一个咆哮的狮子，狮子被一个红色的圆形框架包围。标志下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY Technicolor”。狮子在标志中不断咆哮，表情凶猛，牙齿和舌头清晰可见。整个画面色彩鲜艳，具有复古风格。",
    "E64.The.Duck.Doctor_scene003.mp4": "视频展示了米高梅动画片的标志，随后出现“TOM and JERRY”的标题，背景为红色圆形图案，中间是猫和老鼠的经典形象。",
    "E64.The.Duck.Doctor_scene004.mp4": "这是一个《猫和老鼠》动画片的片头画面，背景是红色渐变的同心圆，画面中央是汤姆猫和杰瑞鼠的卡通形象，下方是黄色的“TOM and JERRY”字样。随后画面切换，出现红色的“THE DUCK DOCTOR”标题，以及“Directed by WILLIAM HANNA and JOSEPH BARBERA”的字样。",
    "E64.The.Duck.Doctor_scene005.mp4": "这是一个动画片的片头，标题为《The Duck Doctor》，由William Hanna和Joseph Barbera执导。片头显示了动画师、音乐制作人和制片人的名字，包括Irven Spence、Ray Patterson、Ed Barge、Kenneth Muse、Scott Bradley和Fred Quimby。背景是黄色的，有卡通风格的猫和老鼠的剪影。",
    "E64.The.Duck.Doctor_scene006.mp4": "夕阳西下，天空中一群鸟儿飞过，水面平静，岸边有芦苇。",
    "E64.The.Duck.Doctor_scene007.mp4": "夕阳西下，天空中一群鸭子排成“人”字形飞行，远处还有另一群鸟儿在飞翔，下方是宁静的水面和岸边的芦苇。",
    "E64.The.Duck.Doctor_scene008.mp4": "一群鸭子在天空中飞翔，镜头逐渐聚焦到一只小鸭子，它在飞行中显得有些吃力，随后被一只大鸭子追赶并最终被抓住。",
    "E64.The.Duck.Doctor_scene009.mp4": "视频中，汤姆猫戴着红色帽子，手持猎枪，站在水边的草丛中。他先是兴奋地举起猎枪，随后调整姿势，瞄准天空，似乎在寻找猎物。背景是黄昏时分的天空，云彩呈现出橙色和紫色的渐变。",
    "E64.The.Duck.Doctor_scene010.mp4": "一群鸭子在天空中飞行，其中一只鸭子被一根长杆击中后从队伍中分离出来，它在空中翻滚、挣扎，最终调整姿态继续飞行，逐渐飞出了画面。",
    "E64.The.Duck.Doctor_scene011.mp4": "汤姆戴着红色帽子，手持猎枪站在草丛中，他开枪后帽子飞起，他惊慌失措地躲避，最终从草丛中跳开，画面中只留下草丛和天空。",
    "E64.The.Duck.Doctor_scene012.mp4": "一只绿头鸭在天空中飞翔，背景是渐变的天空和几朵云彩。随着镜头推进，鸭子飞过一个带有红色风车的农舍。",
    "E64.The.Duck.Doctor_scene013.mp4": "汤姆猫戴着红色头巾，手持猎枪，在田野中奔跑。背景是乡村景色，有树木、栅栏和远处的房屋。汤姆表情兴奋，似乎在追逐或打猎。",
    "E64.The.Duck.Doctor_scene014.mp4": "一只绿色的小鸭子从空中飞过，落在一个红色的谷仓旁，然后它开始奔跑，最后在树下摔倒并休息。",
    "E64.The.Duck.Doctor_scene015.mp4": "一只棕色的小老鼠从红色墙壁上的拱形门中跑出来，它张开双臂，看起来很兴奋，然后它突然停下，表现出惊讶的表情，接着又继续跑开，最后完全离开了画面。",
    "E64.The.Duck.Doctor_scene016.mp4": "一只棕色的小老鼠出现在画面中，它站在一只躺在地上的灰色鸭子旁边。小老鼠看起来很惊讶，它的眼睛睁得很大，嘴巴微张。鸭子似乎已经失去了意识，它的身体躺在地上，周围有一些星星和闪光效果，暗示它可能刚刚经历了一场碰撞或摔倒。背景是一个木制围栏和一些绿色的植物，场景看起来是在户外。",
    "E64.The.Duck.Doctor_scene017.mp4": "汤姆戴着红色帽子，手持猎枪，在草丛中潜行并瞄准，随后迅速跑开。",
    "E64.The.Duck.Doctor_scene018.mp4": "一只棕色的小老鼠站在一只躺着的鸭子旁边，它看起来很惊讶。小老鼠突然跳起来，然后扑向鸭子，把鸭子拖向一棵大树。小老鼠拖着鸭子跑向树根，最后消失在树根后面。",
    "E64.The.Duck.Doctor_scene019.mp4": "一只戴着红色帽子的猫，手持猎枪，在红色谷仓外奔跑，随后在树旁停下，摆出射击姿势，接着又转身跑开。",
    "E64.The.Duck.Doctor_scene021.mp4": "汤姆猫戴着红色帽子，手持猎枪，站在红色谷仓旁的大树下。他先是警惕地环顾四周，随后露出得意的笑容，似乎在等待猎物出现。",
    "E64.The.Duck.Doctor_scene022.mp4": "一群卡通风格的兔子在彩色云层背景中排成队列向前移动。",
    "E64.The.Duck.Doctor_scene023.mp4": "在洞穴中，一只受伤的鸭子和一只老鼠相遇。鸭子用翅膀包裹着受伤的腿，兴奋地跳舞并展示自己的伤势，随后快速离开。老鼠站在一卷胶带旁，先是惊讶地看着鸭子，然后鸭子再次出现，试图与老鼠互动，但最终鸭子又迅速跑开，留下老鼠独自站在胶带旁。",
    "E64.The.Duck.Doctor_scene024.mp4": "汤姆戴着红色帽子，手持猎枪，站在树旁，准备射击。一只鸭子突然从树后跑出，汤姆开枪后被击中，向后飞出，最终倒在地上。他躺在地上，表情痛苦，随后闭上眼睛，似乎失去意识。",
    "E64.The.Duck.Doctor_scene025.mp4": "一只绿头鸭在田野中飞行，突然被一只戴着红色帽子、手持猎枪的猫（汤姆）瞄准。鸭子惊慌失措地飞逃，最终落在一片芦苇丛旁，猫则紧追不舍。",
    "E64.The.Duck.Doctor_scene026.mp4": "一只棕色的小老鼠在树旁的围栏边惊慌地奔跑，随后从画面中消失。",
    "E64.The.Duck.Doctor_scene027.mp4": "汤姆戴着红色帽子，手持猎枪瞄准一只鸭子。杰瑞突然从草丛中窜出，抢走猎枪的子弹，导致汤姆的枪口喷出浓烟，他的头发也被熏黑，变成了一只黑猫。汤姆在烟雾中表情痛苦，继续瞄准前方。",
    "E64.The.Duck.Doctor_scene028.mp4": "一只小鸭子背着一只小老鼠，跑向红色谷仓，然后消失在谷仓的小门后。",
    "E64.The.Duck.Doctor_scene029.mp4": "一只棕色的小老鼠抱着一只绿色头、红色胸脯、黄色脚的鸭子，从画面左侧跑向右侧。小老鼠把鸭子放在地上，然后自己也站稳，两只动物面对面站着，小老鼠似乎在和鸭子交谈，鸭子则看着小老鼠。背景是一个木制房间，地上铺着圆形地毯，房间右侧有一个木柜和一面镜子。",
    "E64.The.Duck.Doctor_scene030.mp4": "一群卡通风格的兔子在天空中飞行，它们排成队形，背景是渐变的天空和云彩。",
    "E64.The.Duck.Doctor_scene031.mp4": "在一间木屋内，一只棕色老鼠和一只绿头鸭站在圆形地毯上。鸭子兴奋地跳起来，挥舞着翅膀，然后走向一扇门，把门打开后又关上。老鼠则在一旁观察，最后靠近门，似乎在思考什么。",
    "E64.The.Duck.Doctor_scene032.mp4": "一只鸭子在田野中奔跑，被一只戴着红色帽子、拿着猎枪的猫追击。鸭子跑过田野，经过一个红色的谷仓，最后撞进谷仓的小门里，门被撞开，羽毛四散。",
    "E64.The.Duck.Doctor_scene033.mp4": "一只绿色的鸭子和一只棕色的老鼠在木屋内对峙。鸭子右腿缠着绷带，不断用左手指着老鼠，嘴巴张开似乎在大声说话或威胁。老鼠则站在地毯上，双手交叉在胸前，表情从警惕逐渐变为得意。随后，老鼠突然用脚踩住鸭子的腿，鸭子痛苦地倒地，老鼠则拿着一卷绷带站在一旁，露出得意的笑容。鸭子在地上挣扎，老鼠则继续用绷带缠绕鸭子的腿，鸭子痛苦地大叫。",
    "E64.The.Duck.Doctor_scene034.mp4": "一只戴着红色帽子的灰色猫从树后探出，手持蓝色玩具枪，瞄准前方的木栅栏，然后开枪射击。",
    "E64.The.Duck.Doctor_scene035.mp4": "在一间木屋内，一只穿着红色领结的绿色头鸭子和一只棕色老鼠正在对峙。老鼠突然冲向门口，鸭子则转身准备攻击。老鼠被鸭子击中后飞出去，撞在门上，最终被门板压住，动弹不得。",
    "E64.The.Duck.Doctor_scene036.mp4": "一只鸭子在农场外奔跑，突然被一根从树后伸出的猎枪击中，鸭子被击飞出去。",
    "E64.The.Duck.Doctor_scene037.mp4": "一只穿着红领结的绿色鸭子在田野中奔跑，身后扬起尘土，背景是农场和天空。",
    "E64.The.Duck.Doctor_scene038.mp4": "一只鸭子从树桩后跑出，被戴着红色帽子、手持猎枪的猫追捕。猫瞄准树桩后方的鸭子开枪，鸭子被击中后从树桩上飞起，猫则因枪口喷出的烟雾而显得惊讶。",
    "E64.The.Duck.Doctor_scene039.mp4": "在农场的背景下，汤姆戴着红色帽子，手持猎枪追逐一只鸭子。鸭子逃跑时，汤姆开枪但未击中。随后，一只猪从谷仓中跑出，汤姆误以为是鸭子，再次开枪。猪被击中后倒地，汤姆则被猪压扁，表情惊恐。猪站起来后，汤姆被压得更扁，最终只能从猪的下方露出头部，表情呆滞。",
    "E64.The.Duck.Doctor_scene040.mp4": "一只绿色的鸭子从红色谷仓的破洞中跑出来，它看起来很生气。一只棕色的老鼠从破洞中探出头来，然后迅速跑开。鸭子追着老鼠，但老鼠跑得太快，鸭子最终摔倒在地。",
    "E64.The.Duck.Doctor_scene041.mp4": "视频中，一只鸭子和一只老鼠在昏暗的环境中互动。鸭子一开始在桶边跳舞，老鼠则在一旁观看。随后，老鼠用胶带缠住鸭子的嘴，使鸭子无法说话。接着，老鼠用胶带将鸭子全身缠绕起来，使其动弹不得。最后，老鼠用绳子将鸭子绑在铁砧上，鸭子被彻底困住。整个过程充满幽默和恶作剧的氛围。",
    "E64.The.Duck.Doctor_scene043.mp4": "一只鸭子在田野里沿着一根绳子奔跑，绳子的另一端连接着一个蓝色的铁锚。铁锚被拉得飞快，扬起尘土。随后，一只戴着红色帽子、手持猎枪的猫从尘土中冲出，紧追不舍。",
    "E64.The.Duck.Doctor_scene044.mp4": "一只小鸭子拉着一根绳子，绳子的另一端绑着一个蓝色的物体。小鸭子拉着绳子跑动，蓝色物体被拉得越来越远。突然，蓝色物体被拉到一个树干上，然后被拉到一个池塘边。接着，一只猫从池塘边跑出来，被蓝色物体拉得飞了起来，最后摔倒在地，变成了一个扁平的形状。",
    "E64.The.Duck.Doctor_scene045.mp4": "一只戴着绿色头巾的鸭子在田野里奔跑，被一根绳子绊倒。随后，一个穿着蓝色衣服、戴着红色帽子的猫从树后出现，手持猎枪，沿着绳子奔跑，似乎在追赶或准备射击鸭子。",
    "E64.The.Duck.Doctor_scene046.mp4": "一只被绑住的鸭子在草地上奔跑，一只戴着红色帽子、手持猎枪的猫从画面左侧冲出，瞄准并准备射击鸭子。",
    "E64.The.Duck.Doctor_scene047.mp4": "一个蓝色的物体被绑在树上，随后突然爆炸，碎片四溅，树也倒下，场景恢复平静。",
    "E64.The.Duck.Doctor_scene048.mp4": "汤姆戴着红色帽子，手持猎枪瞄准前方。前方有一只被绳子绑住的鸭子正在奔跑。汤姆开枪后，枪管被炸飞，鸭子拉着绳子继续跑。随后汤姆站在木桩上，表情痛苦，背景是乡村景色。",
    "E64.The.Duck.Doctor_scene049.mp4": "动画片段中，汤姆猫戴着一顶红色帽子，站在一个木制平台上，旁边是一个木桶。他用力地从嘴里喷出水，水滴落入木桶中。背景是一个乡村场景，有红色的谷仓和木栅栏。",
    "E64.The.Duck.Doctor_scene050.mp4": "一只鸭子被绑在一根长杆上，被拖拽着在田野上飞行。镜头跟随鸭子移动，随后镜头转向长杆的另一端，显示一个蓝色的重物被绳子连接着，随着鸭子的拖拽在空中旋转。背景是乡村景色，有树木、房屋和风车。",
    "E64.The.Duck.Doctor_scene051.mp4": "一只被绷带缠绕的鸭子正紧紧抓住一根杆子，在空中摇摆。背景是渐变的天空，有紫色和橙色的云彩。鸭子不断调整姿势，试图保持平衡。",
    "E64.The.Duck.Doctor_scene052.mp4": "汤姆戴着红色帽子，手持猎枪瞄准，随后开枪，枪口冒出浓烟。",
    "E64.The.Duck.Doctor_scene053.mp4": "一只穿着宇航服的鸭子从一根绳子上坠落，绳子断裂后，鸭子在空中翻滚。镜头随后聚焦于绳子的另一端，显示它连接着两个蓝色的物体，最终绳子消失在画面中。",
    "E64.The.Duck.Doctor_scene054.mp4": "汤姆戴着红色帽子，手持猎枪，奔跑中突然摔倒，接着他挖了一个坑，然后点燃香烟，烟雾中出现一个蓝色的物体，最后他被压在土堆下，蓝色物体从土堆中冒出花朵。",
    "E64.The.Duck.Doctor_scene055.mp4": "一只被绑着绷带的鸭子在空中飞行，随后绷带脱落，它恢复了正常形态。它继续飞行，并与另一只鸭子相遇，两者在空中互动，最终那只鸭子张开嘴巴，似乎在说话或叫喊。",
    "E64.The.Duck.Doctor_scene056.mp4": "一只棕色的小老鼠站在草地上，仰望天空中飞行的鸟群，它兴奋地挥舞着手臂，随后拿起一个蓝色的杯子，似乎在模仿望远镜观察鸟群。画面逐渐变暗，最终显示“THE END”字样。",
    "E64.The.Duck.Doctor_scene057.mp4": "视频展示了“THE END”字样，随后过渡到“An MGM Tom and Jerry CARTOON”标题，下方标注“MADE IN HOLLYWOOD, U.S.A.”。背景为红色，文字为蓝色和白色，具有经典卡通片尾风格。"
}