{
    "29. The Cat Concerto_scene001.mp4": "视频开始时为全黑画面，底部显示一串数字“0110544170204083”。随后画面渐显，出现一个深蓝色背景，中央展示“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样，整体呈现经典卡通片头风格。",
    "29. The Cat Concerto_scene002.mp4": "视频展示了米高梅动画公司的标志，一只狮子在圆形框内咆哮，背景为深蓝色，下方有“CARTOON”和“COLOR BY TECHNICOLOR”的字样。随后画面转黑，出现“TOM and JERRY”字样和奥斯卡奖杯，标注“ACADEMY AWARD BEST CARTOON 1946”。",
    "29. The Cat Concerto_scene003.mp4": "这是一个动画片《猫和老鼠》的片头，展示了该动画获得1946年奥斯卡最佳动画短片奖的荣誉。片头中还介绍了导演威廉·汉纳和约瑟夫·巴伯拉，以及动画师、音乐人和制片人等制作团队成员。背景为深红色，配有金色文字和奥斯卡奖杯图案，整体风格典雅庄重。",
    "29. The Cat Concerto_scene004.mp4": "视频展示了一个剧院内部，舞台中央摆放着一架黑色的三角钢琴，背景是绿色和紫色的幕布，上方悬挂着一盏水晶吊灯。观众席上坐满了观众，灯光逐渐变亮，整个场景显得庄重而典雅。镜头缓慢向前推进，聚焦于舞台上的钢琴。",
    "29. The Cat Concerto_scene005.mp4": "一只穿着燕尾服的灰色猫从幕布后走出，走向舞台上的钢琴，然后站在钢琴前，似乎在准备演奏。",
    "29. The Cat Concerto_scene006.mp4": "一只穿着正式礼服的灰色猫站在一架黑色钢琴前，它先是调整姿势，然后坐下，双手放在膝盖上，接着开始用双手做出夸张的姿势，似乎在表演或表达某种情绪，最后又恢复到双手放在膝盖上的姿势，眼睛微微睁大，表情略显严肃或专注。背景是黄色和绿色相间的条纹幕布。",
    "29. The Cat Concerto_scene008.mp4": "一只穿着黑色燕尾服、打着白色领结的灰色猫坐在钢琴前，背景是绿色的竖条纹。猫的表情从平静逐渐变得专注，它抬起右手，手指轻轻敲击钢琴键，似乎在弹奏音乐。猫的眼睛时而闭合，时而睁开，显得十分投入。整个画面充满优雅和艺术氛围。",
    "29. The Cat Concerto_scene009.mp4": "一只穿着正式礼服的灰色猫坐在钢琴前，它先是调整着自己的领结，然后伸展手臂，似乎在准备演奏。接着，它用手指轻触嘴唇，表现出一种专注或沉思的状态，最后它又恢复了自信的姿态，准备开始演奏。背景是绿色的幕布，整个场景显得优雅而庄重。",
    "29. The Cat Concerto_scene010.mp4": "一只穿着黑色燕尾服的灰色猫坐在钢琴前，专注地弹奏着。它的手指在黑白琴键上灵活跳跃，时而轻柔，时而有力，展现出高超的演奏技巧。猫的表情随着音乐变化，时而闭眼陶醉，时而抬头微笑，显得非常享受音乐。背景是绿色的，给人一种宁静而优雅的感觉。",
    "29. The Cat Concerto_scene011.mp4": "一只穿着燕尾服的灰色猫坐在一架黑色钢琴前，背景是黄色的窗帘。猫的表情专注，双手在琴键上弹奏，身体随着音乐节奏微微摆动。镜头逐渐拉远，展示出钢琴的全貌和猫的全身。猫的演奏充满激情，时而闭眼陶醉，时而抬头微笑，展现出对音乐的热爱和享受。",
    "29. The Cat Concerto_scene012.mp4": "一只穿着西装的猫在弹钢琴，钢琴内部有两只拟人化的苹果在弹奏。随后镜头切换到钢琴内部，一只老鼠在床上睡觉，被苹果的弹奏声吵醒，老鼠翻了个身继续睡觉，苹果继续弹奏。",
    "29. The Cat Concerto_scene013.mp4": "一只老鼠在钢琴内部，被一条巨大的白色蛇缠住。老鼠奋力挣扎，最终挣脱蛇的束缚，掉落在钢琴的琴弦上，然后在琴弦上滚动并最终停下来。",
    "29. The Cat Concerto_scene014.mp4": "一只穿着黑色西装打着白色领结的灰色猫站在车窗边，背景是绿色的条纹。它先是用右手食指指向镜头，然后双手握拳在胸前晃动，接着用右手食指指向镜头，最后双手握拳在胸前晃动。",
    "29. The Cat Concerto_scene015.mp4": "一只老鼠从钢琴内部探出头来，表情从好奇变为开心。",
    "29. The Cat Concerto_scene016.mp4": "汤姆穿着西装坐在钢琴前弹奏，突然杰瑞从钢琴上跳出来，汤姆惊讶地看着杰瑞。",
    "29. The Cat Concerto_scene017.mp4": "一只棕色的小老鼠躺在黑色的表面上，它举起一只前爪，做出胜利的手势，然后又放下，重复几次，显得非常得意和自信。",
    "29. The Cat Concerto_scene018.mp4": "汤姆穿着西装坐在钢琴前，杰瑞在钢琴上嬉戏。汤姆用手指弹钢琴，杰瑞在钢琴上跳舞。汤姆弹钢琴时，杰瑞从钢琴上跳下来，汤姆继续弹钢琴。",
    "29. The Cat Concerto_scene019.mp4": "一只棕色的小老鼠从钢琴的琴键缝隙中探出头来，表情显得有些紧张或好奇。",
    "29. The Cat Concerto_scene020.mp4": "一只穿着西装的灰色猫坐在钢琴前，用手指弹奏钢琴键。在钢琴的键盘上，有一只棕色的小老鼠躲在键盘的缝隙里。猫用手指弹奏时，老鼠被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，然后又躲回缝隙里。猫继续弹奏，老鼠再次被弹出缝隙，",
    "29. The Cat Concerto_scene021.mp4": "一只穿着西装的灰色猫坐在一架黑色钢琴前，正在弹奏。它先是专注地看着琴键，然后开始用爪子弹奏，表情从认真逐渐变得开心和得意。背景是绿色的窗帘。",
    "29. The Cat Concerto_scene022.mp4": "一只穿着黑色礼服的灰色猫坐在钢琴前，专注地弹奏着。它的手指在黑白琴键上灵活地移动，表情从专注逐渐变为愉悦，眼睛闪烁着光芒，似乎沉浸在音乐中。背景是柔和的绿色渐变，营造出宁静的氛围。",
    "29. The Cat Concerto_scene023.mp4": "在钢琴内部，一只小老鼠杰瑞正用爪子抓着琴弦，试图演奏。一只穿着西装的猫汤姆从钢琴上方探出头来，用手指拨动琴弦，让杰瑞无法演奏。杰瑞被吓了一跳，摔倒在地，但仍然保持着调皮的表情。",
    "29. The Cat Concerto_scene024.mp4": "一只穿着黑色西装的灰色猫坐在钢琴前，专注地弹奏钢琴。它用双手在黑白琴键上灵活地移动，表情专注而享受。背景是柔和的绿色渐变，营造出宁静优雅的氛围。猫的耳朵微微抖动，显示出它沉浸在音乐中的状态。",
    "29. The Cat Concerto_scene025.mp4": "一只棕色的小老鼠从钢琴的缝隙中探出头来，它小心翼翼地观察四周，然后开始沿着钢琴的边缘爬行。在爬行过程中，它显得非常谨慎和机警，似乎在寻找什么或者躲避什么。最后，它突然从钢琴上跳了下来，伴随着一个爆炸效果，显示出它可能遇到了某种危险或意外情况。",
    "29. The Cat Concerto_scene026.mp4": "动画片中的猫汤姆穿着黑色西装，坐在钢琴前。它先是闭眼微笑，然后张大嘴巴，露出舌头，接着又眯起眼睛，表情显得得意和满足。背景是绿色渐变的条纹。",
    "29. The Cat Concerto_scene027.mp4": "动画片段中，一双戴着白色手套的手在弹奏钢琴，手指在黑白琴键上灵活地移动，演奏音乐。",
    "29. The Cat Concerto_scene028.mp4": "一只老鼠从钢琴的缝隙中探出头，手里拿着一把大剪刀，与一只伸出的手进行剪刀对峙。老鼠表情紧张，手握剪刀，似乎在准备攻击或防御。伸出的手则试图用剪刀剪断老鼠的剪刀，但老鼠灵活地躲避，剪刀在空中来回摆动，形成紧张的追逐场面。背景是简单的黄色墙壁，突显了老鼠和剪刀的互动。",
    "29. The Cat Concerto_scene029.mp4": "杰瑞从钢琴里探出头，用大剪刀剪断琴键，然后把琴键搬走，接着又搬走一个捕鼠夹，最后被一只手吓跑。",
    "29. The Cat Concerto_scene030.mp4": "一只戴着白手套的手在钢琴前，手指不断挥动，最后不小心触发了放在钢琴上的捕鼠夹，夹住了手指。",
    "29. The Cat Concerto_scene031.mp4": "汤姆猫穿着西装，表情狰狞，手里拿着一个捕鼠夹，夹住了一个小老鼠。他先是得意洋洋地展示捕鼠夹，随后表情变得凶狠，似乎准备对小老鼠采取行动。背景是绿色的。",
    "29. The Cat Concerto_scene032.mp4": "一只棕色的小老鼠在钢琴键上跳舞，它用前爪保持平衡，后腿跳跃，身体随着节奏摆动，看起来非常开心。背景是模糊的绿色和黑色条纹。",
    "29. The Cat Concerto_scene033.mp4": "一只穿着燕尾服的猫在钢琴前挥舞双手，似乎在指挥或表演。一只小老鼠从右侧跳出来，与猫互动，猫用爪子拍打老鼠，老鼠被拍打后倒地，随后又站起来继续跑动。背景是模糊的绿色条纹。",
    "29. The Cat Concerto_scene034.mp4": "猫汤姆穿着黑色西装，正在钢琴上追逐一只小老鼠杰瑞。杰瑞敏捷地在琴键上跳跃，而汤姆则笨拙地试图抓住它，但每次都失败。汤姆的表情从专注变为沮丧，他不断调整姿势，试图用爪子抓住杰瑞，但杰瑞总是巧妙地逃脱。整个场景充满了紧张和幽默的追逐气氛。",
    "29. The Cat Concerto_scene035.mp4": "动画片段中，一双戴着白色手套的手正在弹奏钢琴。手指在黑白琴键上灵活地移动，时而轻触，时而按压，展现出演奏的节奏与技巧。背景简洁，聚焦于手部动作和钢琴键盘，营造出专注而优雅的音乐氛围。",
    "29. The Cat Concerto_scene036.mp4": "一只穿着黑色燕尾服的灰色猫正在弹钢琴，它表情专注，手指在琴键上灵活跳跃，随后突然张大嘴巴，双手张开，似乎被音乐或某个意外逗乐了。背景是柔和的黄绿色渐变。",
    "29. The Cat Concerto_scene037.mp4": "一只棕色的小老鼠在一根绳子上跳舞，它不断变换着姿势，时而张开双臂，时而单腿抬起，表情开心，背景是橙色和绿色的渐变色。",
    "29. The Cat Concerto_scene038.mp4": "一只穿着西装的猫正在弹钢琴，一只小老鼠突然出现在钢琴上，猫继续弹琴，老鼠在钢琴上跳舞，猫突然抓住老鼠，老鼠被猫捏住，猫露出得意的笑容。",
    "29. The Cat Concerto_scene039.mp4": "一只穿着西装的猫从钢琴凳下抓起一只小老鼠，然后把凳子盖上。",
    "29. The Cat Concerto_scene040.mp4": "一只穿着西装的灰色猫坐在钢琴前，正在弹奏钢琴。它先是用右爪轻敲琴键，然后用左爪继续弹奏，表情专注而认真。背景是绿色的渐变色。",
    "29. The Cat Concerto_scene041.mp4": "一只小老鼠从钢琴凳的锁孔中探出头来，它看起来很兴奋和得意。随后，钢琴凳的盖子被抬起，露出了内部的机械结构，小老鼠继续在锁孔附近活动，似乎在享受这个场景。",
    "29. The Cat Concerto_scene042.mp4": "汤姆穿着西装，倒挂在钢琴上，身体逐渐被拉长变形，表情痛苦。",
    "29. The Cat Concerto_scene043.mp4": "杰瑞在一台机器的边缘，用爪子抓住一个旋转的螺母，试图攀爬。螺母旋转得越来越快，杰瑞被甩了出去，最终从机器边缘掉落。",
    "29. The Cat Concerto_scene044.mp4": "一只穿着黑色西装的灰色猫（汤姆）倒挂在一架钢琴的琴键上，他先是惊慌失措地挣扎，随后调整姿势，最终以一种自信的姿态站立在钢琴上，摆出一副得意洋洋的样子。",
    "29. The Cat Concerto_scene045.mp4": "汤姆穿着黑色西装，手里拿着杰瑞，表情凶狠，似乎在威胁或准备吃掉杰瑞。背景是绿色渐变。",
    "29. The Cat Concerto_scene046.mp4": "汤姆猫从钢琴上方探出头，用爪子抓住杰瑞鼠，然后将杰瑞鼠按在钢琴的琴键上。杰瑞鼠被紧紧按住，表情惊恐。",
    "29. The Cat Concerto_scene047.mp4": "汤姆穿着黑色西装，坐在钢琴前弹奏。他先是用右手轻拍钢琴盖，然后双手在琴键上弹奏，表情专注。背景是绿色的。",
    "29. The Cat Concerto_scene048.mp4": "一只老鼠从管道中探出头，表情愤怒，随后管道中喷出液体，老鼠被液体淋湿后表情变得惊恐。",
    "29. The Cat Concerto_scene049.mp4": "一只棕色的小老鼠在钢琴内部的琴槌之间穿梭，它被琴槌夹住并不断被弹开，显得非常惊慌和无助。小老鼠试图躲避琴槌的撞击，但最终被琴槌击中并从琴槌间弹出。整个场景充满了紧张和混乱，小老鼠的表情和动作显示出它的恐惧和挣扎。",
    "29. The Cat Concerto_scene050.mp4": "一只棕色的小老鼠从钢琴的琴键上方跳下，沿着琴键的边缘滑行，最终滑到琴键下方。",
    "29. The Cat Concerto_scene051.mp4": "一只小老鼠躲在钢琴内部，被钢琴锤击中后飞出画面。",
    "29. The Cat Concerto_scene052.mp4": "杰瑞在传送带上奔跑，突然被传送带的凸起部分绊倒，摔倒在传送带上。",
    "29. The Cat Concerto_scene053.mp4": "一只棕色的小老鼠在钢琴内部，它用前爪抓住琴槌，身体悬挂在琴弦上，表情紧张，似乎在努力保持平衡，同时试图控制琴槌。",
    "29. The Cat Concerto_scene054.mp4": "一只棕色的小老鼠在钢琴内部的琴槌上奔跑，它从一个琴槌跳到另一个琴槌，不断向前移动，期间还被琴槌弹起，展现出活泼好动的特性。",
    "29. The Cat Concerto_scene055.mp4": "一只棕色的小老鼠在钢琴内部的琴弦和琴槌上行走，它小心翼翼地踩在琴槌上，然后突然被琴槌弹起，接着又重新站稳，继续向前走。在行走过程中，它偶尔会停下来，观察四周，然后继续前进。",
    "29. The Cat Concerto_scene056.mp4": "一只棕色的小老鼠在钢琴内部的琴弦上奔跑，它被琴弦绊倒后滑落，随后爬起来，用两根琴槌敲击琴弦，制造出声音。",
    "29. The Cat Concerto_scene057.mp4": "杰瑞在钢琴上用琴槌敲击琴键，然后被琴槌弹起，接着被琴槌击中。",
    "29. The Cat Concerto_scene058.mp4": "一只穿着黑色西装的灰色猫坐在一架黑色钢琴前，它先是用手指轻触琴键，然后开始弹奏。猫的表情专注，眼睛睁得很大，随着音乐节奏，它的身体微微摆动。在弹奏过程中，猫的双手在琴键上快速移动，偶尔还会抬起手做出夸张的动作，似乎在享受音乐。背景是渐变的绿色和黄色，营造出一种温馨的氛围。",
    "29. The Cat Concerto_scene059.mp4": "一只棕色的小老鼠站在钢琴前，用木槌敲击琴键，发出响亮的声音。它专注地演奏着，表情认真。钢琴的黑色琴键和白色琴键在画面中清晰可见，背景是黄色的墙壁。",
    "29. The Cat Concerto_scene061.mp4": "视频显示了“THE END”字样，随后出现“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面。背景为红色，文字为蓝色和白色，具有复古动画风格。",
    "29. The Cat Concerto_scene062.mp4": "视频开始显示了MGM的“Tom and Jerry Cartoon”标志，背景为红色，文字为蓝色。随后画面切换为全黑，持续了大约9秒。整个视频片段没有其他内容或动作。"
}