{
    "35. The Truce Hurts_scene001.mp4": "视频开始时显示黑色背景，右下角有白色数字“0110544170204083”。随后画面逐渐变亮，出现米高梅卡通片头标志，标志上写着“A METRO-GOLDWYN-MAYER CARTOON COLOR BY TECHNICOLOR”，背景为深蓝色。",
    "35. The Truce Hurts_scene002.mp4": "视频展示了米高梅动画公司的标志，背景为深蓝色，中央有一个圆形框，框内是一只咆哮的狮子，狮子周围有蓝色的装饰带，上面写着“A METRO-GOLDWYN-MAYER”，下方是黄色的“CARTOON”字样，再下方是红色的“COLOR BY TECHNICOLOR”字样。狮子在圆形框内不断咆哮，头部轻微晃动，整个画面保持静态。",
    "35. The Truce Hurts_scene003.mp4": "视频展示了米高梅动画片《猫和老鼠》的片头，首先出现的是米高梅卡通的标志，随后画面转黑，接着是《猫和老鼠》的标题和角色形象。",
    "35. The Truce Hurts_scene004.mp4": "视频片段展示了《猫和老鼠》动画片的片头。首先出现的是“Tom and Jerry”的标题，接着是该集的标题“The Truce Hurts”，并标注了导演William Hanna和Joseph Barbera。随后，片头显示了动画制作团队和音乐制作人的名字，包括Kenneth Muse、Ed Barge、Ray Patterson、Irven Spence和Scott Bradley。最后，片头显示了制片人Fred Quimby的名字。整个片头以蓝色背景为主，配以黄色和红色的文字，以及猫和老鼠等角色的卡通形象。",
    "35. The Truce Hurts_scene005.mp4": "视频中，一个房子的门廊上发生了一系列混乱的事件。首先，一些物品如花瓶和椅子被风吹得四处飞散。接着，一只老鼠从门内跑出，似乎在逃避什么。随后，一只猫从门内跳出来，看起来很生气。猫在门廊上四处张望，似乎在寻找老鼠。最后，猫拿起一个棒球棒，准备追击老鼠。整个场景充满了动感和喜剧效果。",
    "35. The Truce Hurts_scene006.mp4": "视频中，一只棕色的小老鼠正在草地上奔跑，突然被一只灰色的猫和一只灰色的斗牛犬追捕。小老鼠在逃跑过程中，不小心撞到了一个蓝色的管子，然后被猫和狗围住。猫拿着一个蓝色的平底锅，狗拿着一根棒球棒，他们试图抓住小老鼠。小老鼠用管子作为武器进行反击，猫和狗则试图用平底锅和棒球棒攻击它。最终，猫和狗被小老鼠的反击所困扰，他们开始互相争吵，争论谁应该先攻击小老鼠。",
    "35. The Truce Hurts_scene007.mp4": "一只灰色的猫和一只戴着红色带刺项圈的灰色斗牛犬面对面站立，斗牛犬张嘴说话，字幕显示“猫可以爱狗，不是吗？”，猫的表情从惊讶逐渐变为困惑。随后画面出现像素化和模糊效果。",
    "35. The Truce Hurts_scene008.mp4": "一只小老鼠抱着一根蓝色的管子，面对着一只灰色的大狗。大狗戴着红色项圈，表情凶狠，张开嘴巴似乎在大声说话或咆哮，而小老鼠则显得有些紧张和害怕，但仍然紧紧抱着管子。画面中显示字幕：“还有老鼠能和猫友好的相处，不是吗？”",
    "35. The Truce Hurts_scene009.mp4": "视频中，汤姆猫和一只大灰狗站在一个黄色的木门前，汤姆猫手持一个蓝色的锅盖，而大灰狗则拿着一个蓝色的管子。大灰狗看起来非常兴奋，他张开双臂，似乎在向汤姆猫提出和解的请求。汤姆猫则显得有些惊讶和犹豫。在大灰狗的旁边，有一只小老鼠，它也拿着一个蓝色的管子，看起来非常开心。大灰狗和汤姆猫都张开嘴巴，似乎在大声说话，而小老鼠则在一旁笑得非常开心。大灰狗和汤姆猫似乎在讨论如何成为朋友，而小老鼠则在一旁欢呼。大灰狗和汤姆猫在一张桌子上签署了一份文件，大灰狗用红色的笔在文件上签字，而汤姆猫则在一旁微笑地看着。大灰狗拿着文件，似乎在向汤姆猫展示他的签名，而汤姆猫则显得非常满意。整个场景充满了欢乐和友好的气氛，大灰狗和汤姆猫似乎已经和解，并决定成为好朋友。",
    "35. The Truce Hurts_scene010.mp4": "这是一个动画片中的和平条约画面，条约上写着狗、猫和老鼠同意和平共处，任何一方破坏条约都是可耻的。条约由汤姆、杰瑞和布奇签署，旁边有一个印章。画面装饰有和平鸽、小天使和红心，象征和平与爱。",
    "35. The Truce Hurts_scene012.mp4": "汤姆猫和杰瑞鼠在房间内，汤姆盖着蓝色毯子躺在地上，杰瑞在毯子下睡觉。汤姆先是用手轻轻拉扯毯子，然后竖起大拇指，接着双手交叉放在胸前，最后闭上眼睛。旁边有一只灰色的狗，戴着红色项圈，舌头伸出，看起来很放松。背景中有一个木制书架，上面放着书籍和一个烟斗。",
    "35. The Truce Hurts_scene013.mp4": "一只小老鼠在睡觉的狗旁边醒来，它先是惊讶地张望，然后开始与狗互动，用爪子拉扯狗的舌头，接着又用手指戳狗的鼻子，最后小老鼠爬回被窝里继续睡觉。",
    "35. The Truce Hurts_scene014.mp4": "在房间里，汤姆和杰瑞正在睡觉，一只狗突然醒来，拿起烟斗，把烟斗放在汤姆的头上，然后跑开。汤姆被惊醒，发现烟斗在自己头上，他一脸惊讶，然后转头看向杰瑞，杰瑞也醒了，汤姆和杰瑞相视一笑。",
    "35. The Truce Hurts_scene015.mp4": "一只穿着绿色围裙的灰色狗站在一张铺有黄格子桌布的桌子旁，桌上放着两个玻璃杯、一个黄铃和一个白色瓶子。狗先是用双手各持一个玻璃杯，然后将它们放在桌上，接着拿起黄铃摇晃，脸上露出得意的表情。背景是一个厨房，可以看到橱柜和一些厨房用品。",
    "35. The Truce Hurts_scene016.mp4": "在浴室里，汤姆猫正给杰瑞鼠刷牙。汤姆猫拿着牙刷，杰瑞鼠张着嘴，汤姆猫把牙刷放进杰瑞鼠的嘴里，然后开始刷牙。杰瑞鼠突然吐出一口水，汤姆猫被水溅到，显得很生气。杰瑞鼠趁机逃跑，汤姆猫追了上去。",
    "35. The Truce Hurts_scene017.mp4": "汤姆猫从门口跑进来，看到一把椅子上堆满了书，他兴奋地跳起来，用爪子扶住椅背，然后一只小老鼠从地板上爬上来，跳到书堆上。汤姆猫看着小老鼠，露出得意的笑容，然后用爪子轻轻推了一下椅子，试图把小老鼠推下去。小老鼠在书堆上坐着，看起来很镇定。",
    "35. The Truce Hurts_scene018.mp4": "一只灰色的猫和一只灰色的狗在一张桌子旁互动。狗用前爪抓住一把红色的椅子，猫从桌子后面走出来，坐到椅子上。狗和猫都张开嘴巴，似乎在说话或大笑。背景是蓝色的墙壁和紫色的地板，桌子上铺着黄色的格子桌布，桌布上放着一个透明的玻璃杯。",
    "35. The Truce Hurts_scene019.mp4": "一只灰色的斗牛犬坐在红色的椅子上，面前是一张铺着黄色格子桌布的桌子，桌上放着一个装有牛奶的瓶子。斗牛犬开心地打开瓶盖，取出一个黄色的硬币，放进嘴里，然后开心地大笑起来。这时，一只灰色的猫和一只棕色的小老鼠出现在画面中，猫似乎在和斗牛犬互动，而小老鼠则在桌子旁边跑来跑去。",
    "35. The Truce Hurts_scene020.mp4": "在餐桌旁，一只灰狗用香蕉喂猫，猫伸出舌头舔香蕉，但香蕉皮滑落。狗随后用香蕉皮弹飞坐在书上的老鼠，老鼠被弹飞后又落回书上。狗接着拿起尺子和牛奶瓶，似乎准备进行下一步动作。",
    "35. The Truce Hurts_scene021.mp4": "一只灰色的斗牛犬坐在桌子前，用尺子测量三个玻璃杯中的液体高度。它先将液体倒入第一个杯子，然后倒入第二个杯子，最后倒入第三个杯子，确保每个杯子中的液体高度相同。",
    "35. The Truce Hurts_scene022.mp4": "一只灰色的大狗、一只灰色的猫和一只棕色的小老鼠围坐在一张铺着黄色格子桌布的桌子旁。桌上摆放着三杯牛奶。大狗和猫各自拿起一杯牛奶，与小老鼠碰杯，然后一起喝完牛奶，杯子空了。接着，大狗用筷子夹起一根面条，猫也伸手想要拿筷子，但大狗抢先一步，猫只能看着。",
    "35. The Truce Hurts_scene023.mp4": "汤姆猫拿着一根牙签，先是将牙签放在嘴边，然后将牙签插入嘴里，接着又将牙签从嘴里拿出来，最后将牙签放在嘴边。",
    "35. The Truce Hurts_scene024.mp4": "汤姆猫和一只灰狗在蓝色背景前互动，汤姆猫用手指指向狗，狗则伸出爪子与汤姆猫的手指相碰，随后狗露出笑容。",
    "35. The Truce Hurts_scene025.mp4": "一只灰色的斗牛犬，戴着红色项圈，正在用牙签剔牙。它张开嘴巴，露出尖锐的牙齿，将牙签伸进嘴里，然后满意地闭上嘴，露出微笑。背景是蓝色的。",
    "35. The Truce Hurts_scene026.mp4": "一只小老鼠坐在书上，用牙签指挥，旁边的大狗看着它，表情从微笑变为惊讶。",
    "35. The Truce Hurts_scene027.mp4": "一只棕色的老鼠坐在一本紫色的书上，用牙齿拉扯一根黄色的细线，显得非常开心。随后，它从书上跳下来，走到一个木制门廊上，继续拉扯细线，然后转身跑开。背景是一栋房子和蓝天白云。",
    "35. The Truce Hurts_scene029.mp4": "汤姆从门里跑出来，表情惊恐，张大嘴巴，随后向前奔跑并消失在画面中。",
    "35. The Truce Hurts_scene030.mp4": "一只黑猫正在用刀切一个桶里的小老鼠，这时灰猫突然出现，抢走了小老鼠。黑猫生气地把桶盖盖在头上，结果被桶盖弹开，眼睛变成了橙色，然后他把橙子塞进嘴里，最后他生气地瞪着灰猫。",
    "35. The Truce Hurts_scene031.mp4": "在“Chingling Circus”的招牌前，汤姆猫蹲在地上，用爪子抓着杰瑞鼠。杰瑞鼠在汤姆猫的爪子里挣扎，汤姆猫则露出得意的笑容。突然，汤姆猫张大嘴巴，似乎在大笑，而杰瑞鼠则被汤姆猫的爪子弹开。汤姆猫继续用爪子抓着杰瑞鼠，杰瑞鼠在汤姆猫的爪子里挣扎，汤姆猫则露出得意的笑容。汤姆猫突然张大嘴巴，似乎在大笑，而杰瑞鼠则被汤姆猫的爪子弹开。汤姆猫继续用爪子抓着杰瑞鼠，杰瑞鼠在汤姆猫的爪子里挣扎，汤姆猫则露出得意的笑容。汤姆猫突然张大嘴巴，似乎在大笑，而杰瑞鼠则被汤姆猫的爪子弹开。汤姆猫继续用爪子抓着杰瑞鼠，杰瑞鼠在汤姆猫的爪子里挣扎，汤姆猫则露出得意的笑容。汤姆猫突然张大嘴巴，似乎在大笑，而杰瑞鼠则被汤姆猫的爪子弹开",
    "35. The Truce Hurts_scene032.mp4": "一只黑猫站在两个垃圾桶旁，先是张大嘴巴，然后捂住脸，接着张大嘴巴露出舌头，最后举起一个红色盒子，愤怒地砸向自己的头。",
    "35. The Truce Hurts_scene033.mp4": "一只黑猫站在垃圾桶旁，手里拿着一个红色的物体，表情凶狠。随后画面变黑，接着出现一只橙色的猫躺在地上，面前有一个蓝色的碗，碗里有一根骨头，猫正在啃骨头。背景是夜晚的户外，有木栅栏和树木。",
    "35. The Truce Hurts_scene035.mp4": "一只灰色的狗从门里跑出来，它先是开心地跳跃，然后突然张大嘴巴，舌头伸出来，看起来非常惊讶或震惊。",
    "35. The Truce Hurts_scene036.mp4": "一只狗抱着一个装满苹果和胡萝卜的托盘，上面躺着一只猫。狗大笑着，猫突然从托盘上跳起来，与狗握手。狗被猫的突然动作吓到，表情从大笑变为惊恐，然后又恢复笑容。",
    "35. The Truce Hurts_scene037.mp4": "一只狗张大嘴巴，牙齿掉落，表情痛苦，随后闭上嘴，露出惊讶的表情。",
    "35. The Truce Hurts_scene038.mp4": "在户外的围栏前，一只灰色的猫（汤姆）被一只灰色的狗紧紧抓住，猫的嘴巴张得很大，似乎在大喊或惊讶。狗则显得非常关切，不断询问猫是否没事，并催促它说话。地面上散落着一个胡萝卜和一个番茄。",
    "35. The Truce Hurts_scene039.mp4": "视频中，一只灰色的猫和一只灰色的狗在绿色围栏前对峙。猫张大嘴巴，似乎在大声叫喊，狗则用爪子抓住猫的脖子，表情紧张。随后，猫的表情变得愤怒，狗则显得惊讶和紧张。两者继续对峙，猫时而张嘴，时而皱眉，狗则保持警惕的姿态，双方似乎在进行一场激烈的争斗或对话。",
    "35. The Truce Hurts_scene040.mp4": "一只灰色的猫和一只灰色的狗在木栅栏前对峙。狗举起拳头，猫被击中后倒地，狗惊讶地看着倒地的猫。",
    "35. The Truce Hurts_scene041.mp4": "一只灰色的狗站在一只倒地的灰色猫旁边，狗看起来很惊讶。随后画面变暗，接着出现三只动物：一只灰色猫、一只灰色狗和一只棕色老鼠，它们一起在街道上行走。",
    "35. The Truce Hurts_scene042.mp4": "视频中，汤姆和一只大狗在人行道上奔跑，杰瑞在他们后面跟着。大狗突然停下，汤姆也跟着停下。大狗脱下自己的外套，汤姆看着大狗。突然，一辆车从他们面前驶过，溅起水花。",
    "35. The Truce Hurts_scene043.mp4": "一辆黄色的肉车驶过，车身上写着“MEAT”。车后跟着三只湿漉漉的猫，它们站在路边，看着车驶过。",
    "35. The Truce Hurts_scene044.mp4": "一辆标有“MEAT”的黄色肉车行驶在街道上，车后门打开，一个白色包裹从车上掉落，滚落到路边，最终停在一座房子前。",
    "35. The Truce Hurts_scene045.mp4": "视频中，汤姆猫和一只大灰狗在户外发现了一个包裹，汤姆猫好奇地靠近，大灰狗则兴奋地用爪子拨开包裹，露出里面一块巨大的牛排。三人看到牛排后都流口水，显得非常兴奋。随后，场景切换到室内，三人围坐在餐桌前，牛排放在盘子里，热气腾腾，汤姆猫和大灰狗继续流口水，显得非常期待。小老鼠杰瑞则在一旁，似乎对牛排并不感兴趣，只是在一旁观望。",
    "35. The Truce Hurts_scene046.mp4": "一只灰色的斗牛犬站在桌子前，用剪刀在一块红色的肉上剪出两条线，然后把剪刀放在嘴里，看起来非常享受。背景是粉红色的。",
    "35. The Truce Hurts_scene047.mp4": "汤姆猫、一只大狗和杰瑞鼠围坐在餐桌旁，桌上放着一块牛排。汤姆猫用手指指向大狗，大狗则拿着一根牙签，似乎在和汤姆猫交谈。杰瑞鼠坐在桌边，看着他们。",
    "35. The Truce Hurts_scene048.mp4": "汤姆猫和杰瑞鼠坐在桌子旁，汤姆用一根棍子在一块肉上画线，杰瑞则在一旁观看并做出反应。汤姆似乎在向杰瑞展示或解释什么，而杰瑞则表现出好奇和惊讶的表情。",
    "35. The Truce Hurts_scene049.mp4": "一只棕色的小老鼠在餐桌上，它先是靠近一把叉子，然后爬上一块巨大的牛排。小老鼠用叉子当作指挥棒，在牛排上“指挥”着，似乎在演奏音乐。它看起来非常开心和自信。",
    "35. The Truce Hurts_scene050.mp4": "在一张桌子旁，一只灰色的猫汤姆、一只灰色的狗和一只小老鼠杰瑞正在看着盘子里的牛排。狗兴奋地挥舞着手臂，然后伸手抓住了杰瑞，把杰瑞扔到了桌子旁边。接着，狗拿起刀叉，准备切牛排。汤姆则在一旁瞪着狗，表情愤怒。",
    "35. The Truce Hurts_scene051.mp4": "一只灰色的卡通狗，戴着红色项圈，正用刀叉切割盘子里的牛排。它表情专注，动作有力，似乎在享受美食。背景是紫色的墙壁。",
    "35. The Truce Hurts_scene052.mp4": "一只小老鼠坐在桌边，看着面前的肉罐头。一双大手拿着刀叉，将肉罐头里的肉挖出来，然后离开。小老鼠看着空空的罐头，表情失落。",
    "35. The Truce Hurts_scene053.mp4": "一只灰色的卡通狗正在用刀叉切割一块放在盘子里的肉，它看起来非常享受。",
    "35. The Truce Hurts_scene054.mp4": "汤姆猫坐在餐桌前，一只大手从上方递给他一个装有食物的罐子，汤姆猫看着罐子，表情从期待变为惊讶。",
    "35. The Truce Hurts_scene055.mp4": "一只灰色的斗牛犬坐在餐桌前，面前放着一块肉。它正准备享用美食，但突然被一只灰色的猫用长舌头伸过来舔它的鼻子，斗牛犬显得非常愤怒和惊讶，张大嘴巴，露出牙齿，同时举起手中的叉子。",
    "35. The Truce Hurts_scene056.mp4": "猫用嘴拉长狗的鼻子，然后吹气使狗的鼻子变短，狗生气地反击，猫也生气地回应。",
    "35. The Truce Hurts_scene057.mp4": "一个黄色的长条形物体在桌子上滑动，桌面上有茶杯、盘子和棋子。",
    "35. The Truce Hurts_scene058.mp4": "一只灰色的斗牛犬从桌子后面探出头，张大嘴巴，似乎在咆哮或叫喊。接着，它从桌子上拿起一个黄色的物体，看起来像一个热狗或香肠，然后把它塞进嘴里。斗牛犬吃完后，它开始打嗝，然后突然站起身来，张大嘴巴，似乎在大笑或欢呼。这时，一只灰色的猫从画面左侧跳出来，它看起来很生气，用爪子抓住斗牛犬的脖子，然后把斗牛犬推倒在地。猫把斗牛犬推倒后，它拿起那个黄色的物体，把它举起来，然后把它塞进自己的嘴里。斗牛犬看着猫，看起来很惊讶或困惑。猫吃完后，它把黄色的物体扔到地上，然后它和斗牛犬一起看着它。",
    "35. The Truce Hurts_scene059.mp4": "一只棕色的小老鼠正用前爪紧紧抓住一支巨大的铅笔，身体悬空，似乎在努力向上攀爬。铅笔的笔尖朝上，笔身呈黄色和红色相间，笔帽为红色。小老鼠的表情显得非常专注和用力，它的尾巴微微翘起，四肢在空中摆动，仿佛在与铅笔进行一场力量的较量。背景是简单的绿色墙壁和淡紫色的天花板，地面为白色。整个画面充满了卡通风格的夸张和幽默感。",
    "35. The Truce Hurts_scene060.mp4": "汤姆用一根长棍子试图抓住杰瑞，但杰瑞巧妙地逃脱了。随后，一只狗出现并帮助汤姆抓住了杰瑞。然而，杰瑞再次逃脱，最终成功地从汤姆手中溜走。",
    "35. The Truce Hurts_scene061.mp4": "汤姆猫和杰瑞鼠在室内进行激烈的追逐和打斗。汤姆猫试图抓住杰瑞鼠，但杰瑞鼠灵活地躲避并反击，最终汤姆猫被击倒在地，而杰瑞鼠则得意地躺在地上。整个场景充满了卡通式的夸张动作和幽默感。",
    "35. The Truce Hurts_scene062.mp4": "一个黄色的物体从窗户飞出，砸碎玻璃后飞向街道，落入水中。随后，一只小老鼠和两只猫出现在街道旁，小老鼠在奔跑，两只猫在追赶。",
    "35. The Truce Hurts_scene063.mp4": "视频中，一只黄色的小船在水渠中漂浮，随后一只棕色的小老鼠从水渠上方跳下，落入水中。接着，一只灰色的猫和一只灰色的狗也从上方跳入水中，与小老鼠一同在水中嬉戏。随后，它们都爬上水渠边缘，猫和狗互相瞪视，而小老鼠则在旁边观察。最后，狗从口袋中掏出一份写着“和平条约”的文件，展示给猫看。",
    "35. The Truce Hurts_scene064.mp4": "一只灰色的猫拿着一张写着“和平条约”的纸，表情愤怒。它撕碎纸张，纸片化作黄色的星星状碎片四散飞舞，猫在碎片中挣扎并最终被碎片包围。",
    "35. The Truce Hurts_scene065.mp4": "一只棕色的小老鼠在院子里奔跑，突然被两只猫追上。一只猫拿着平底锅，另一只猫拿着棒球棒，它们试图抓住小老鼠。小老鼠用一根蓝色的管子作为武器，与两只猫展开了一场激烈的追逐和对抗。",
    "35. The Truce Hurts_scene066.mp4": "动画片《猫和老鼠》的结尾画面，汤姆和杰瑞在木板墙前，汤姆挥舞着棒球棒，杰瑞拿着一个蓝色的锅，锅里冒着烟。随后画面转黑，出现“THE END”的字样。",
    "35. The Truce Hurts_scene067.mp4": "视频展示了“THE END”字样，随后逐渐出现“An M.G.M Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。",
    "35. The Truce Hurts_scene068.mp4": "视频开始时显示了“An MGM Tom and Jerry Cartoon MADE IN HOLLYWOOD, U.S.A.”的标题画面，随后画面转为全黑，持续数秒。"
}