{
    "E101.Muscle.Beach.Tom_scene001.mp4": "视频展示了米高梅卡通片头，背景为深蓝色，中央有米高梅标志和“CARTOON”字样，下方标注“COLOR BY TECHNICOLOR”。",
    "E101.Muscle.Beach.Tom_scene002.mp4": "这是一个米高梅卡通片头，背景为蓝色，中央有一个圆形标志，内有一只咆哮的狮子，下方写着“CARTOON”字样，底部标注“COLOR BY TECHNICOLOR”。狮子在标志内微微晃动，整体画面色彩鲜艳，具有复古卡通风格。",
    "E101.Muscle.Beach.Tom_scene003.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面，其中汤姆猫和杰瑞鼠的形象出现在标题旁。",
    "E101.Muscle.Beach.Tom_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为绿色，标题“TOM and JERRY”以黄色立体字呈现，左侧是灰色的猫汤姆，右侧是棕色的老鼠杰瑞，两者表情生动。随后画面中出现“Tugle Beach”和“CINEMASCOPE”字样，汤姆的脸上还出现了一片红色的印记。",
    "E101.Muscle.Beach.Tom_scene005.mp4": "视频片段展示了动画片《Muscle Beach Tom》的片头。首先，画面中出现标题“Muscle Beach Tom in CINEMASCOPE”，背景为蓝色，左侧有猫的剪影叠罗汉，下方有三把彩色遮阳伞。接着，画面切换到制作人员名单，包括动画师、布局师、背景师和音乐师等，以及制片人和导演威廉·汉纳与约瑟夫·巴伯拉的名字。最后，画面逐渐变暗，出现“MUSCLE BEACH”的标志，背景是海滩和遮阳伞。整个片段以卡通风格呈现，色彩鲜艳，充满活力。",
    "E101.Muscle.Beach.Tom_scene007.mp4": "在沙滩上，一只松鼠躺在绿色的毛巾上晒太阳，戴着太阳镜，穿着蓝色泳裤。远处有几把彩色的遮阳伞。随后，汤姆猫穿着红色泳衣，背着一个装满沙滩玩具的黄色篮子走过来，他开心地把篮子里的东西倒在地上，包括一个蓝白相间的球、一把紫色的伞和一个紫色的盒子。汤姆猫站在一旁，露出得意的笑容。",
    "E101.Muscle.Beach.Tom_scene008.mp4": "一只穿着蓝色泳裤的小老鼠在沙滩上，它从一个黄色的建筑物后面爬出来，手里拿着一块绿色的布。它把布铺在地上，然后躺在上面享受阳光。",
    "E101.Muscle.Beach.Tom_scene009.mp4": "汤姆穿着红色泳衣，手持紫色遮阳伞，站在沙滩上，旁边放着野餐篮和救生圈。他先是面带微笑地看着坐在沙滩上的性感猫女，然后转身走向野餐篮，举起遮阳伞，似乎准备开始野餐。猫女则坐在沙滩上，表情略显傲慢，似乎对汤姆的行为不屑一顾。",
    "E101.Muscle.Beach.Tom_scene011.mp4": "在海滩上，汤姆穿着红色泳衣，悠闲地吃着冰淇淋，旁边是正在晒太阳的杰瑞。突然，一只小老鼠从桌子后面探出头来，戴着香蕉皮帽子，挑衅地对汤姆挥手。汤姆被激怒，迅速站起，用气球将小老鼠吹成一个大大的气球，然后得意地把气球吹爆，小老鼠被吹得四分五裂。",
    "E101.Muscle.Beach.Tom_scene012.mp4": "一个棕色的圆形角色在黄色的地面上滚动，背景是蓝色的天空。它从画面右侧滚到左侧，然后消失在画面边缘。接着，它从画面左侧滚回，再次消失在画面边缘。最后，它从画面左侧滚出，完全消失在画面外。",
    "E101.Muscle.Beach.Tom_scene013.mp4": "汤姆穿着红色泳衣在沙滩上，起初他开心地笑着，随后躺下休息，但很快变得不耐烦，最后他站起来，表情变得愤怒。",
    "E101.Muscle.Beach.Tom_scene014.mp4": "一只黑猫在沙滩上举重，展示肌肉，旁边有一只棕猫观看。黑猫举起杠铃，做出各种姿势，棕猫则表现出欣赏和兴奋。随后，黑猫拿出弹力带，另一只灰猫出现并咬住弹力带，黑猫继续展示力量。",
    "E101.Muscle.Beach.Tom_scene015.mp4": "两个卡通猫角色在进行拉橡皮筋游戏，一只灰色猫穿着红色衣服，另一只黑色猫。灰色猫用力拉扯橡皮筋，黑色猫则面带微笑，显得很享受。最终灰色猫将橡皮筋拉断，黑色猫被弹开。",
    "E101.Muscle.Beach.Tom_scene016.mp4": "一只黑猫穿着黄色泳裤，手持弹弓，走到沙滩上的锚旁，用弹弓拉住锚，然后用力向后拉，试图把锚拉走。",
    "E101.Muscle.Beach.Tom_scene017.mp4": "在沙滩上，穿着红色泳衣的汤姆猫正站立着，突然黑猫从右侧跑来，手中拿着三根紫色弹力带，将汤姆猫的脖子缠住并拉扯，汤姆猫被拉得向后倒去，黑猫则得意地站在原地。",
    "E101.Muscle.Beach.Tom_scene020.mp4": "动画片段中，汤姆穿着红色运动服，背着喷气背包，从一个黄色降落伞中滑出，沿着一根绳子滑行，最终安全着陆。",
    "E101.Muscle.Beach.Tom_scene021.mp4": "一只棕色的老鼠从船边探出头，抓住一个黄色的滑轮装置，通过紫色和蓝色的绳索拉动红色的船帆。老鼠看起来很兴奋，面带微笑，似乎在享受这个过程。背景是蓝色的海洋。",
    "E101.Muscle.Beach.Tom_scene022.mp4": "汤姆穿着红色衣服，被几根紫色的弹力绳拉扯着向右奔跑，绳子的另一端固定在一根白色的柱子上，柱子上有一只老鼠正看着汤姆。汤姆被拉扯着逐渐减速，最终被绳子拉到柱子旁，老鼠则继续挂在柱子上。",
    "E101.Muscle.Beach.Tom_scene023.mp4": "一只黑猫穿着黄色短裤站在杠铃上，摆出胜利姿势。另一只灰猫穿着红色运动服从右侧冲过来，抓住黑猫的尾巴，将其拖拽。黑猫被拖拽时身体失去平衡，表情惊恐，沙子被扬起。",
    "E101.Muscle.Beach.Tom_scene024.mp4": "视频中，汤姆猫穿着红色衣服站在木桩上，被一根绳子绑住，绳子连接着一根白色的柱子。突然，汤姆猫被弹起，身体被拉长，然后恢复原状。接着，画面切换到柱子底部，露出一双眼睛，似乎在偷看。",
    "E101.Muscle.Beach.Tom_scene025.mp4": "汤姆穿着红色衣服从柱子后面探出头，然后慢慢爬出来，发现一只红色的螃蟹。螃蟹突然跳起来，旋转着飞走，汤姆目送它离开。",
    "E101.Muscle.Beach.Tom_scene027.mp4": "一只穿着蓝色尿布的小老鼠站在紫色物体上，与一个拟人化的香蕉皮玩耍。香蕉皮像人一样弯曲、扭动，与小老鼠拉扯，小老鼠开心地笑着，与香蕉皮互动。背景是蓝天。",
    "E101.Muscle.Beach.Tom_scene029.mp4": "视频中，一只穿着黄色短裤的黑猫在沙滩上行走，突然被一只从沙子里冒出的红色螃蟹用钳子夹住短裤，黑猫被夹得跳了起来。随后，画面切换到一个海滩场景，一只穿着红色泳衣的灰猫和一只穿着白色泳衣的棕猫在跳舞，接着黑猫加入跳舞，三人一起跳起舞来。最后，灰猫被甩出画面，掉进一个标有“TRASH”的垃圾桶里。",
    "E101.Muscle.Beach.Tom_scene030.mp4": "动画片《猫和老鼠》中的汤姆猫从一个白色屋顶的蓝色小屋中探出头来，表情凶狠，眼睛瞪大，露出牙齿，似乎在观察或准备攻击。",
    "E101.Muscle.Beach.Tom_scene031.mp4": "在码头上，一只猫从伞下探出头，伸手拉走了一个气球，然后又拉走了一个黄色的气球，气球飞走了。",
    "E101.Muscle.Beach.Tom_scene032.mp4": "汤姆穿着红色衣服，先是抱着一个黄色的香蕉，然后把香蕉放下，接着抓住一根绳子，拉出一个紫色的气球，最后把气球抱在怀里。",
    "E101.Muscle.Beach.Tom_scene033.mp4": "汤姆穿着红色衣服，站在一个类似船舱的地方，他开始用力拉一个系在锚上的绳子，最终将自己拉得身体前倾，绳子缠绕在腰间，他用力拉扯，表情变得愤怒。",
    "E101.Muscle.Beach.Tom_scene035.mp4": "一只穿着蓝色短裤的棕色老鼠坐在橙色的物体上，手里拿着黄色的布条。它开始向右移动，布条随之飘动，最后从画面右侧掉落，老鼠也从物体上滑落消失在画面中。背景是蓝天。",
    "E101.Muscle.Beach.Tom_scene036.mp4": "一只穿着蓝色短裤的小老鼠从一个橙色的篮子后面跑出来，它看到一个被绳子绑住的大脚，便用力拉扯绳子，结果绳子被解开，老鼠成功逃脱。",
    "E101.Muscle.Beach.Tom_scene037.mp4": "在沙滩上，汤姆穿着红色的泳衣，躺在沙滩椅旁，试图靠近坐在椅子上的杰瑞。杰瑞穿着白色泳衣，戴着粉色项链，闭着眼睛享受阳光。汤姆先是躺在地上，然后翻滚起来，试图抓住杰瑞的脚。杰瑞睁开眼睛，看着汤姆，显得很不耐烦。汤姆爬起来，抓住沙滩椅的杆子，试图靠近杰瑞。杰瑞继续坐着，看着汤姆，显得很不耐烦。汤姆则不断地试图靠近杰瑞，但杰瑞始终没有理会他。",
    "E101.Muscle.Beach.Tom_scene038.mp4": "视频中，汤姆猫穿着红色的救生衣，手持一根杆子，站在沙滩上，头顶有一把紫色的伞。镜头向右移动，展示了沙滩上的其他遮阳伞和躺椅。随后，镜头聚焦到一个气瓶上，杰瑞老鼠正坐在气瓶的阀门上，用双手操作阀门，周围有多个彩色气球。",
    "E101.Muscle.Beach.Tom_scene039.mp4": "在沙滩上，汤姆被一个巨大的红色气球包裹着，他试图用脚撑住伞杆。杰瑞拿着一个钩子靠近气球，然后钩住气球的管子，气球突然放气，汤姆被吹得飞了起来。他四处乱飞，最终落在远处。与此同时，一只猫在沙滩椅上晒太阳，对这一切毫不在意。",
    "E101.Muscle.Beach.Tom_scene040.mp4": "在海滩上，一只穿着蓝色泳裤的小老鼠站在一个木制平台上，举着一个由两个大番茄组成的杠铃。他先是用毛巾擦拭杠铃，然后开始举重，将杠铃举过头顶。旁边站着一只穿着白色泳衣的猫，她微笑着看着小老鼠，似乎在欣赏他的努力。背景是蓝色的海洋和紫色的遮阳篷。",
    "E101.Muscle.Beach.Tom_scene041.mp4": "一只穿着蓝色短裤的老鼠正在举着一个由两个大番茄组成的杠铃，它努力地将杠铃举过头顶，然后突然失去平衡，摔倒在地，杠铃掉落在地上，老鼠被压在下面。画面随后变黑，出现“The End”字样，接着显示“An M.G.M. Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题。"
}