{
    "S1950E48 - Tom And Chérie_scene001.mp4": "画面展示了米高梅动画公司的经典标志，背景为深蓝色，标志中央是一只咆哮的狮子，上方写着“A METRO-GOLDWYN-MAYER”，下方是“CARTOON”字样，底部标注“COLOR BY TECHNICOLOR”。",
    "S1950E48 - Tom And Chérie_scene002.mp4": "这是一个米高梅动画片头，蓝色背景上显示“METRO-GOLDWYN-MAYER CARTOON”字样，上方有一个咆哮的狮子图案，下方标注“COLOR BY TECHNICOLOR”。狮子在画面中不断张合嘴巴，表现出咆哮的动作。",
    "S1950E48 - Tom And Chérie_scene003.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面，其中汤姆猫和杰瑞鼠的形象出现在标题旁。",
    "S1950E48 - Tom And Chérie_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为蓝色，黄色字体写着“Tom and Jerry”，左侧是老鼠杰瑞，右侧是猫汤姆，两者都面带笑容。随后画面中出现“Directed by William Hanna and Joseph Barbera”的字样。",
    "S1950E48 - Tom And Chérie_scene005.mp4": "这是一个动画片的片头画面，展示了标题“Tom and Chérie”，导演为William Hanna和Joseph Barbera。画面中有一个羽毛笔和墨水瓶，背景为紫色。随后，画面中出现了制作人员名单，包括动画师、布局师、背景师和音乐师等。整个画面风格复古，具有经典动画片的特色。",
    "S1950E48 - Tom And Chérie_scene006.mp4": "视频展示了一个紫色背景的片头字幕，左侧有一个蓝色羽毛笔插在黑色墨水瓶中，墨水瓶底座装饰有金色花纹。字幕内容包括动画师、布局师、背景画师和音乐师的姓名，以及制片人Fred Quimby的名字。画面底部还有版权信息和Western Electric Sound System的标志。整个画面保持静态，没有动作或变化。",
    "S1950E48 - Tom And Chérie_scene007.mp4": "一只戴着红色帽子的棕色老鼠坐在一张粉红色的桌子前，桌上有一面金色边框的镜子，镜子里映出一只穿着紫色衣服的棕色老鼠。老鼠看着镜子中的自己，脸上露出微笑，然后开始用绿色羽毛笔在纸上写字。背景是一面绿色的墙和一个紫色的椅子。",
    "S1950E48 - Tom And Chérie_scene008.mp4": "一只手拿着绿色羽毛笔在卷轴上书写，卷轴上写着“CAPITAINE DES MOUSEKETEERS”和“Chère Lilli - Je t'aime”。背景为粉红色。",
    "S1950E48 - Tom And Chérie_scene009.mp4": "一只戴着帽子、穿着蓝色背心的棕色老鼠坐在一张粉红色的桌子前，用绿色羽毛笔在纸上写字。桌上有镜子，镜中反射出老鼠的影像，镜子上写着“Je t'aime, Tillie”。镜头向右移动，展示了一只灰色老鼠坐在拱形门洞内的红色桌子旁，正在阅读一本红色封面的书，书上写着“Le Code des Mousquetaires”。",
    "S1950E48 - Tom And Chérie_scene010.mp4": "一只戴着黄色帽子和紫色羽毛装饰的老鼠坐在木桌前，专注地阅读一本红色封面的书，书上写着“LE CODE des Mausolées”。桌上还有一支点燃的蜡烛，背景是温暖的室内环境，光线柔和。老鼠表情专注，偶尔露出微笑，似乎沉浸在书中的内容。",
    "S1950E48 - Tom And Chérie_scene011.mp4": "视频展示了一本打开的书，书页上用法语写着“Le Code des Mouseketeers”（小老鼠骑士团的准则），并列出了三条准则：I. 一个Mouseketeer是勇敢的；II. 一个Mouseketeer是服从的；III. 一个Mouseketeer是勇敢的。书页装饰精美，文字清晰可见。",
    "S1950E48 - Tom And Chérie_scene012.mp4": "一只穿着蓝色斗篷、戴着黄色帽子和紫色羽毛的灰色老鼠坐在一张木桌前，桌上放着一本红色封面的书和一支点燃的蜡烛。老鼠先是看着书，然后站起来，拿起一把剑，走向一面镜子。它在镜子前停下，看着自己的倒影，然后转身离开。",
    "S1950E48 - Tom And Chérie_scene013.mp4": "一只穿着蓝色围裙、戴着红色帽子的老鼠坐在紫色椅子上，正在阅读一封信。旁边出现另一只戴着黄色帽子、紫色卷发的灰色老鼠，它好奇地靠近，看着信件，然后从棕色老鼠手中接过信，转身离开。棕色老鼠则低头继续阅读信件，显得很专注。桌上有镜子、书本和一个装饰盒，镜子中映出棕色老鼠的倒影。",
    "S1950E48 - Tom And Chérie_scene014.mp4": "一只穿着蓝色斗篷、头戴黄色帽子的小老鼠，手持一把剑和一封信，从一扇木门前走出。它兴奋地阅读信件，表情从惊讶转为喜悦，随后又因信件内容而显得有些困惑和担忧。接着，它继续向前走，表情逐渐变得坚定，最后露出自信的笑容。背景是石墙和木质地板，环境看起来像是一个古堡或宫殿内部。",
    "S1950E48 - Tom And Chérie_scene015.mp4": "一只穿着蓝色衣服、头戴黄色帽子的小老鼠从洞口走出，手持一把剑，背着一个紫色的包袱，小心翼翼地在城堡的走廊里行走。突然，一只穿着红色斗篷、戴着黑色帽子的猫从右侧出现，手持一把剑，气势汹汹地冲向小老鼠，挥舞着剑，似乎要攻击它。小老鼠被吓了一跳，赶紧逃跑。猫则在后面追赶，挥舞着剑，试图抓住小老鼠。",
    "S1950E48 - Tom And Chérie_scene017.mp4": "在城堡内，汤姆穿着红色斗篷和黑色帽子，手持一把剑，站在一扇绿色门前。他表情严肃，似乎在等待什么。随后，一个蓝色的头盔从门后滚出来，停在门前。汤姆看到头盔后，表情变得惊讶，他举起剑，似乎准备应对。接着，他摘下帽子，露出惊讶的表情，然后又戴上帽子，继续保持着警惕的姿势。整个场景充满了紧张和期待的氛围。",
    "S1950E48 - Tom And Chérie_scene018.mp4": "动画片段中，汤姆穿着骑士服装，手持剑，与一个蓝色的头盔进行剑斗。汤姆挥剑攻击头盔，头盔也挥剑反击，两者在木制房间内激烈对战。",
    "S1950E48 - Tom And Chérie_scene019.mp4": "一只穿着蓝色背心、戴着紫色帽子的棕色老鼠站在一个紫色的物体上，背景是蓝绿色的墙壁和棕色的地面。老鼠的表情从专注变为惊讶，然后又恢复专注。",
    "S1950E48 - Tom And Chérie_scene020.mp4": "在一条街道上，穿着红色斗篷和黑色帽子的汤姆与一个蓝色的鸟形角色进行剑术对决。汤姆挥舞着剑，鸟形角色也持剑迎战。随后，一个穿着蓝色衣服、戴着黄色头盔的小角色从红色桶后出现，向汤姆发起攻击。汤姆被击中后倒地，最终滑进墙上的一个小洞，消失不见。",
    "S1950E48 - Tom And Chérie_scene022.mp4": "视频展示了一个教室场景，黑板上写满了“Un Mouseketeer est brave”（一个 Mouseketeer 是勇敢的）这句话。两个穿着类似骑士服装的老鼠站在黑板前，一个较小的灰色老鼠正在用剑指着黑板上的文字，似乎在练习或学习，而另一个较大的棕色老鼠则站在一旁，双臂交叉，表情严肃，像是在监督或指导。背景是简单的教室墙壁和地板，整体氛围轻松幽默。",
    "S1950E48 - Tom And Chérie_scene023.mp4": "一只穿着蓝色斗篷、戴着黄色帽子的小老鼠，手持一把剑，站在一个房间内，他先是用剑刺向一扇门，然后把剑收回，转身面对另一只穿着同样服装、戴着红色帽子的小老鼠，两只小老鼠似乎准备进行一场对决。",
    "S1950E48 - Tom And Chérie_scene024.mp4": "动画片段中，汤姆猫身穿斗篷、头戴帽子，手持一把剑，从墙后探出身体，似乎在警戒或准备战斗。画面下方，杰瑞老鼠从远处跑来，身后拖着紫色的烟雾。汤姆猫迅速转身，剑尖指向杰瑞，表情警惕。背景为一座古朴的建筑，墙壁呈黄褐色，窗户有格子设计。",
    "S1950E48 - Tom And Chérie_scene025.mp4": "一只穿着蓝色盔甲、头戴黄色头盔、背着紫色披风的小老鼠，手持一把剑，从画面左侧跑入。它停在一座石墙建筑前，靠近一扇红色窗户。小老鼠先是抬头望向窗户，然后伸手打开窗户，从里面拿出一张纸，仔细阅读。接着，它又拿出一块紫色布料，似乎在擦拭或整理什么。整个场景充满了中世纪的童话氛围。",
    "S1950E48 - Tom And Chérie_scene027.mp4": "一只穿着红色斗篷的猫蹲在木板上，一只小老鼠从猫的斗篷下钻出，然后迅速跑开。猫随后起身，镜头拉远，显示小老鼠在远处的木板上继续奔跑。",
    "S1950E48 - Tom And Chérie_scene028.mp4": "视频展示了一个动画场景，背景是一个带有石墙和窗户的室内环境。画面中，一只穿着红色斗篷、戴着黑色帽子的猫（汤姆）从墙后出现，手持一把剑，与一只穿着蓝色盔甲、头戴黄色头盔的小老鼠（杰瑞）对峙。猫摆出战斗姿态，挥舞着剑，而老鼠则在地面快速移动，似乎在躲避猫的攻击。猫的动作夸张，表情凶狠，而老鼠则显得机灵敏捷，不断闪避。整个场景充满了紧张和幽默的氛围，展现了经典的猫鼠追逐和对抗。",
    "S1950E48 - Tom And Chérie_scene029.mp4": "一个穿着蓝色斗篷、头戴黄色帽子和紫色羽毛的灰色老鼠从绿色拱门中飞入房间，手持一把剑。它向前冲刺，剑尖发出一道蓝色光束，击中房间中央的镜子。镜子被击中后，老鼠被弹飞出去，最终消失在画面左侧。",
    "S1950E48 - Tom And Chérie_scene030.mp4": "一只戴着红色帽子的棕色老鼠坐在桌子前，桌上铺着粉红色桌布，摆放着书籍、羽毛笔和墨水瓶。另一只灰色老鼠拿着紫色纸张走到桌前，递给棕色老鼠。棕色老鼠接过纸张阅读，然后用羽毛笔在纸上写字，完成后将纸张递给灰色老鼠。灰色老鼠接过纸张后，转身离开。棕色老鼠低头看着镜子里的自己，显得有些失落。",
    "S1950E48 - Tom And Chérie_scene032.mp4": "一个紫色纸条上写着“L'amour est fini Lilli”，一只戴着黄色帽子、穿着蓝白条纹衣服的老鼠从右侧进入画面，看着纸条，表情悲伤。",
    "S1950E48 - Tom And Chérie_scene034.mp4": "视频中，穿着红色披风和黑色帽子的猫（汤姆）手持黄色的剑，站在一个木制结构的房间内，表情严肃。在他面前，一只穿着蓝色衣服、戴着金色王冠的小老鼠（杰瑞）站在地上，显得非常兴奋和开心，它在猫的脚边来回走动，似乎在与猫互动。猫低头看着老鼠，表情从严肃逐渐变得温和。最后，画面逐渐变暗，出现“THE END”的字样，标志着视频的结束。",
    "S1950E48 - Tom And Chérie_scene035.mp4": "视频展示了“THE END”字样，随后逐渐出现“An MGM Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色和橙色渐变。"
}