{
    "E43.The.Cat.and.the.Mermouse_scene001.mp4": "画面显示了米高梅动画公司的标志，背景为深蓝色，标志中央是“CARTOON”字样，上方有“A METRO-GOLDWYN-MAYER”字样，下方有“COLOR BY TECHNICOLOR”字样。整个标志设计经典，具有复古风格。",
    "E43.The.Cat.and.the.Mermouse_scene002.mp4": "这是一个米高梅动画片头，蓝色背景上显示“Metro-Goldwyn-Mayer Cartoon”字样，中间有一个圆形框，框内是一只咆哮的狮子，下方标注“Color by Technicolor”。狮子在圆形框内不断张合嘴巴，表现出咆哮的动作。",
    "E43.The.Cat.and.the.Mermouse_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现“Tom and Jerry”的标题，伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "E43.The.Cat.and.the.Mermouse_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深绿色，左侧是棕色老鼠杰瑞，右侧是灰色猫汤姆，中间是黄色的“TOM and JERRY”字样。随后，画面中出现“THE CAT and the MERMOUSE”字样，以及导演“WILLIAM HANNA and JOSEPH BARBERA”的名字。",
    "E43.The.Cat.and.the.Mermouse_scene005.mp4": "视频开始时显示了动画片《The Cat and the Mermouse》的片头，包括导演William Hanna和Joseph Barbera的名字，以及动画师和音乐制作人的名单。随后，画面切换到一个夜晚的海滩场景，猫汤姆坐在沙滩上，正在用一瓶黄色液体涂抹自己的手，周围散落着各种防晒和护肤用品，如防晒油、防晒霜和润肤油等。背景中可以看到一把红黄相间的遮阳伞和远处的海洋。整个画面呈现出一种轻松愉快的氛围。",
    "E43.The.Cat.and.the.Mermouse_scene007.mp4": "杰瑞站在沙滩上，手持红色鱼竿和鱼线轮，兴奋地准备钓鱼。他先是调整姿势，然后用力拉扯鱼竿，结果被鱼线拉得向后倒下。杰瑞摔倒在沙地上，但很快爬起来继续钓鱼。突然，猫汤姆被鱼线拉扯着从沙地下冒出来，他一脸惊讶和愤怒，咬住毛巾试图挣脱。汤姆用力拉扯毛巾，表情痛苦，汗水直流，最终成功挣脱了毛巾，但毛巾仍缠绕在他的身上。",
    "E43.The.Cat.and.the.Mermouse_scene008.mp4": "一只老鼠在码头上用鱼竿钓鱼，钓到了一块奶酪，然后又把奶酪放回水中。",
    "E43.The.Cat.and.the.Mermouse_scene009.mp4": "视频中，汤姆猫在码头的木桩间攀爬，目光锁定悬挂在绳子上的奶酪。他先是小心翼翼地观察，随后伸出爪子拉住绳子，准备将奶酪拉近自己。背景是蓝天白云和远处的海滩景色，画面充满卡通风格的幽默感。",
    "E43.The.Cat.and.the.Mermouse_scene012.mp4": "汤姆猫从高处坠落，随后画面切换到水花四溅的场景，水花逐渐消散。",
    "E43.The.Cat.and.the.Mermouse_scene013.mp4": "一只小老鼠在码头上奔跑，跳到一根柱子上，看着水中的气泡。镜头切换到水下，一只猫在水中游泳，追逐着气泡，周围是水草和珊瑚。",
    "E43.The.Cat.and.the.Mermouse_scene015.mp4": "在水下场景中，猫汤姆看着美人鱼杰瑞游动。杰瑞在水中嬉戏，而汤姆则表现出惊讶和好奇。随后，汤姆试图抓住杰瑞，但杰瑞巧妙地逃脱。汤姆在水中显得有些笨拙，而杰瑞则继续自由自在地游动。整个场景充满了幽默和动感。",
    "E43.The.Cat.and.the.Mermouse_scene016.mp4": "在深海中，杰瑞化身为美人鱼，穿着绿色上衣和黄色鱼尾，正在游泳。突然，汤姆也潜入水中，紧追不舍。杰瑞慌张地躲避，汤姆则用尽各种手段试图抓住他。两人在海底的沉船周围追逐，汤姆从船窗中探出头来，试图咬住杰瑞，但杰瑞灵巧地逃脱。最终，杰瑞成功躲过汤姆的追捕，继续在深海中游弋。",
    "E43.The.Cat.and.the.Mermouse_scene017.mp4": "在水下，汤姆猫透过一个圆形开口观察，他的眼睛里反射出杰瑞鼠的身影。杰瑞穿着绿色的潜水服，正在水中游动。汤姆随后戴上潜水装备，从开口处潜入水中，紧追杰瑞。杰瑞在水中灵活地游动，而汤姆则努力追赶，两人在水下展开追逐。",
    "E43.The.Cat.and.the.Mermouse_scene018.mp4": "在海底，一只穿着绿色衣服的棕色小老鼠正在游动，随后一只蓝色的猫从上方出现，也游了下来。猫在海底四处张望，似乎在寻找什么，然后停下来看着前方。",
    "E43.The.Cat.and.the.Mermouse_scene019.mp4": "在深蓝色的海底，汤姆猫面带微笑，注视着从岩石后游出的一队红色海马。随着海马数量增加，一只穿着绿色鱼尾的杰瑞老鼠也加入其中，跟在海马队伍后面。汤姆猫伸出爪子，轻轻托住杰瑞老鼠，继续向前游动，而海马们则排成一列，跟随在汤姆猫身边。",
    "E43.The.Cat.and.the.Mermouse_scene020.mp4": "在海底，汤姆猫先是兴奋地跳舞，随后突然惊恐地发现水下环境，接着他开始游泳并用绳子制造气泡，最后用力甩动绳子。",
    "E43.The.Cat.and.the.Mermouse_scene021.mp4": "在海底，一只穿着美人鱼尾巴的棕色老鼠被海马群推着向前游动。突然，一根绳子从上方垂下，老鼠抓住绳子，被拉向水面。随后，一只蓝色的猫出现在画面中，他正用力拉绳子，试图将老鼠钓上来。猫的表情从惊讶变为兴奋，最终成功将老鼠拉近。",
    "E43.The.Cat.and.the.Mermouse_scene022.mp4": "在水下，汤姆用鱼竿钓着杰瑞，杰瑞穿着美人鱼尾巴，奋力游走，汤姆紧追不舍。",
    "E43.The.Cat.and.the.Mermouse_scene023.mp4": "在海底，一只猫从潜艇的圆形窗口游出，随后被一个巨大的锚链缠住，最终被吊起，露出愤怒的表情。",
    "E43.The.Cat.and.the.Mermouse_scene024.mp4": "在深海中，一只穿着潜水服的老鼠从一个圆形的金属管道口探出头来，随后它完全游出管道，开始在水中自由游动。",
    "E43.The.Cat.and.the.Mermouse_scene025.mp4": "一只穿着美人鱼尾巴的猫在海底游动，遇到一条巨大的剑鱼，猫在剑鱼身上滑行，剑鱼张开嘴，猫从剑鱼嘴里滑出，继续在水下游动。",
    "E43.The.Cat.and.the.Mermouse_scene026.mp4": "一只剑鱼在水中追逐一只小老鼠，小老鼠在水中游动，剑鱼张开大嘴试图捕捉它，最终剑鱼迅速游走，小老鼠被甩在后面。",
    "E43.The.Cat.and.the.Mermouse_scene028.mp4": "动画片段中，汤姆猫在水下环境中游泳，周围有水草和沉船残骸。他游过一些障碍物，包括铁链和木桶，最后从画面右侧游出，消失在视野中。整个场景充满气泡，营造出水下氛围。",
    "E43.The.Cat.and.the.Mermouse_scene029.mp4": "在水下场景中，杰瑞穿着美人鱼尾巴，手持画笔在木桶上涂画红色圆圈。他先是专注地画出一个红色圆圈，随后被自己的作品吓到，表现出惊讶和害怕的表情。接着，杰瑞游向木桶，似乎在检查自己的作品，但突然被木桶上的红色圆圈吓到，转身逃离。最后，一个蓝色的鱼从画面左侧游入，似乎对杰瑞的画作感到好奇或感兴趣。",
    "E43.The.Cat.and.the.Mermouse_scene030.mp4": "一条蓝色的鱼在水下靠近一个木桶，用嘴吹动桶上的红色圆环，气泡从桶口和鱼嘴冒出。",
    "E43.The.Cat.and.the.Mermouse_scene031.mp4": "汤姆猫在水下被海草缠住，挣扎着游动，随后被一条鲨鱼追赶，最终鲨鱼游过画面。",
    "E43.The.Cat.and.the.Mermouse_scene032.mp4": "汤姆在水下游泳，被水草缠住，他挣扎着游到一棵树旁，发现了一条鲨鱼。汤姆用尾巴缠住鲨鱼的尾巴，鲨鱼愤怒地咬住树干，汤姆则用尾巴把鲨鱼的尾巴缠得更紧，鲨鱼痛苦地挣扎，汤姆则得意地笑着。",
    "E43.The.Cat.and.the.Mermouse_scene033.mp4": "汤姆猫在水下，手持一根黑色的管子，他先是用爪子遮住眼睛，然后张开嘴，似乎在水中呼吸，接着他放松下来，露出微笑，最后他再次张开嘴，水泡从他的鼻子和嘴巴周围冒出，他的眼睛变得愤怒。",
    "E43.The.Cat.and.the.Mermouse_scene034.mp4": "在深海中，一只穿着美人鱼尾巴的小老鼠游过，停在一个巨大的章鱼身上。章鱼的眼睛突然亮起，露出愤怒的表情。小老鼠迅速游走，章鱼紧随其后。随后，一只猫从水中出现，站在一个沉船的罐子旁，与章鱼对峙。猫露出得意的笑容，而章鱼则瞪大眼睛，显得十分愤怒。",
    "E43.The.Cat.and.the.Mermouse_scene036.mp4": "在深海中，一只巨大的红色章鱼伸出触手，抓住了正在游泳的汤姆猫。汤姆猫被紧紧拖拽着，身体在水中挣扎，气泡从他周围冒出。章鱼的眼睛闪烁着，似乎在享受这场捕猎。背景是深蓝色的海底，有珊瑚和岩石。",
    "E43.The.Cat.and.the.Mermouse_scene037.mp4": "一只穿着美人鱼尾巴的猫在海底游动，周围有水草和气泡，背景是深蓝色的海底和远处的岩石。猫在水中摆动尾巴，向前游动，气泡从它身边冒出。",
    "E43.The.Cat.and.the.Mermouse_scene038.mp4": "在水下，汤姆追逐杰瑞，杰瑞用尾巴缠住汤姆的鼻子，随后两人被水流冲到木板上，汤姆被水呛到，杰瑞站在汤姆身上。",
    "E43.The.Cat.and.the.Mermouse_scene039.mp4": "视频中，一只灰色的猫（汤姆）躺在木制码头上，身边有一个救生圈，它似乎在休息或睡觉。一只棕色的小老鼠（杰瑞）站在猫的身上，看起来很兴奋或调皮。猫的眼睛突然睁开，露出黄色的瞳孔，它似乎被老鼠的行为激怒或惊讶。猫开始张嘴说话或叫喊，同时老鼠继续在它身上活动。猫用爪子抓老鼠，试图赶走它，但老鼠仍然站在猫的身上。猫继续说话或叫喊，而老鼠则继续在它身上活动。猫的眼睛突然睁开，露出黄色的瞳孔，它似乎被老鼠的行为激怒或惊讶。猫开始张嘴说话或叫喊，同时老鼠继续在它身上活动。猫用爪子抓老鼠，试图赶走它，但老鼠仍然站在猫的身上。猫继续说话或叫喊，而老鼠则继续在它身上活动。猫的眼睛突然睁开，露出黄色的瞳孔，它似乎被老鼠的行为激怒或惊讶。猫开始张嘴说话或叫喊，同时老鼠继续在它身上活动。猫用爪子抓老鼠，试图赶走它，但老鼠仍然站在猫的身上。猫",
    "E43.The.Cat.and.the.Mermouse_scene040.mp4": "视频显示了“THE END”字样，随后出现“An MGM Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。"
}