{
    "S1950E21 - Triplet Trouble_scene002.mp4": "视频展示了一个经典的米高梅动画片头标志，背景为深红色，中央是一个咆哮的狮子头像，周围环绕着红色的胶片带。标志下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY Technicolor”。狮子在画面中不断咆哮，表情生动。",
    "S1950E21 - Triplet Trouble_scene003.mp4": "视频展示了米高梅动画的片头，首先出现的是米高梅的标志和“CARTOON”字样，接着画面转为黑色，最后出现“TOM and JERRY”的标题，背景为红色圆形图案，中间是猫汤姆和老鼠杰瑞的卡通形象。",
    "S1950E21 - Triplet Trouble_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为红色渐变圆形图案。画面中央是猫汤姆和老鼠杰瑞的卡通形象，汤姆张大嘴巴，杰瑞则在旁边露出调皮的表情。下方是黄色的“TOM and JERRY”标题。随后，画面出现“TRIPLET TROUBLE”字样，以及“Directed by WILLIAM HANNA and JOSEPH BARBERA”的导演信息。",
    "S1950E21 - Triplet Trouble_scene005.mp4": "视频展示了动画片《猫和老鼠》的片头，标题为“Triplet Trouble”，由William Hanna和Joseph Barbera执导。随后显示了动画师、音乐制作人和制片人的名字。最后，画面切换到一个黑色背景，然后出现汤姆猫躺在沙发上，手里拿着一个绿色的盘子，杰瑞鼠在盘子下方。",
    "S1950E21 - Triplet Trouble_scene006.mp4": "汤姆躺在沙发上，用镜子玩弄杰瑞。杰瑞被镜子吸引，试图抓住镜子，但被汤姆用镜子弹开。汤姆最终抓住杰瑞，但杰瑞逃脱了。汤姆被吓到，躲到沙发后面，然后被女仆发现。",
    "S1950E21 - Triplet Trouble_scene007.mp4": "一只蓝色的猫趴在黄色沙发上，它先是闭着眼睛，然后睁开眼睛四处张望，接着又闭上眼睛，最后再次睁开眼睛四处张望。",
    "S1950E21 - Triplet Trouble_scene009.mp4": "视频中，汤姆猫在沙发上与三只小猫玩耍，其中一只小猫拿着刀威胁汤姆。随后，一位穿着蓝色长袍、手持红色棍子的女性出现，将汤姆打倒在地，三只小猫则紧紧抱在一起，看着汤姆。",
    "S1950E21 - Triplet Trouble_scene010.mp4": "动画片中的汤姆猫坐在地上，用爪子捂住眼睛，张大嘴巴，看起来非常痛苦或惊讶。背景是一面紫色的墙和一个绿色的沙发。",
    "S1950E21 - Triplet Trouble_scene011.mp4": "视频中，汤姆猫坐在地上，看着沙发上三个小猫紧紧拥抱在一起。一位穿着蓝色衣服的女性拿着扫帚从汤姆身边走过，汤姆猫迅速躲到桌子底下，然后从桌子底下爬出来，走向沙发上的小猫们，似乎想要把它们分开。",
    "S1950E21 - Triplet Trouble_scene012.mp4": "一只蓝色的猫，表情从愤怒逐渐转变为惊讶和困惑，背景是单一的粉红色。",
    "S1950E21 - Triplet Trouble_scene013.mp4": "汤姆猫坐在沙发上，用爪子轻轻拨弄着一只红色的毛绒玩具猫。在他脚边，一只黑白相间的小猫和一只橙色的小猫正开心地玩耍，它们互相追逐、嬉戏，显得非常快乐。汤姆猫看着它们，脸上露出温柔的笑容，似乎很享受这一刻的温馨时光。整个场景充满了家庭的温暖和欢乐。",
    "S1950E21 - Triplet Trouble_scene014.mp4": "两只小猫在室内地板上玩耍，它们先是坐在大人腿边，随后拿起玩具滑板车，开始滑行。在滑行过程中，它们撞到了沙发腿，最终摔倒在地。",
    "S1950E21 - Triplet Trouble_scene015.mp4": "汤姆猫穿着旱冰鞋在房间里滑行，表情惊恐，嘴巴张开，似乎在尖叫。镜头跟随他从一个房间滑到另一个房间，经过书架、沙发和窗帘等家具。",
    "S1950E21 - Triplet Trouble_scene016.mp4": "一只红色的小猫坐在椅子上，用爪子推开门，门后出现一只穿着旱冰鞋的蓝色大猫，大猫滑进来，停在椅子旁边，然后大猫的腿伸直，身体靠在椅子上，小猫则躲在门后。",
    "S1950E21 - Triplet Trouble_scene017.mp4": "一只小老鼠从抽屉里探出头来，好奇地观察着周围环境。",
    "S1950E21 - Triplet Trouble_scene018.mp4": "视频中，汤姆猫在房间里发现几个小猫，他先是惊慌地逃跑，然后遇到一个穿着绿色大衣、戴着红色帽子的神秘人物。汤姆猫试图与这个神秘人物互动，他先是用爪子拍打神秘人物的帽子，然后把帽子摘下来，发现里面藏着一只橙色的小猫。接着，他又从大衣里拉出一只黑色的小猫和一只红色的小猫。汤姆猫看起来非常惊讶和兴奋，他抱着这些小猫，似乎在庆祝自己的发现。整个场景充满了卡通式的幽默和惊喜。",
    "S1950E21 - Triplet Trouble_scene019.mp4": "一只小猫从一个穿着绿色外套和蓝色裤子的人的腿后爬出来，它用爪子抓着人的裤腿，看起来很生气。随后，另一只小猫从画面右侧走来，看着第一只小猫。",
    "S1950E21 - Triplet Trouble_scene020.mp4": "一只穿着绿色大衣的灰色猫被三只小猫围住，其中一只小猫拉住大衣，另一只小猫从门后探出头来，灰色猫试图摆脱小猫们的纠缠，最终被小猫们推倒在地，倒挂在空中，三只小猫则跑出了房间。",
    "S1950E21 - Triplet Trouble_scene021.mp4": "视频中，一只小老鼠躲在一张木制书桌的抽屉上，偷偷观察。随后，三只小猫从书桌下方探出头来，好奇地张望。小老鼠看到后，迅速从抽屉上跳下，躲到书桌后面。三只小猫也跟着躲到书桌后面，然后又一起跑出来，围在书桌前，似乎在讨论着什么。整个场景充满了紧张和趣味。",
    "S1950E21 - Triplet Trouble_scene022.mp4": "视频中，一只棕色的小老鼠从抽屉里探出头来，表情兴奋地四处张望。随后，两只猫从抽屉两侧出现，一只红色，一只黑色，它们都瞪着黄色的眼睛，表情凶狠地盯着小老鼠。小老鼠被吓得后退，然后倒挂在抽屉边缘，继续惊慌地大叫。最后，小老鼠重新站稳，继续用手指着猫，似乎在挑衅或警告它们。整个场景发生在昏暗的室内环境中，背景有书架和一些家具。",
    "S1950E21 - Triplet Trouble_scene023.mp4": "三只小猫在抽屉柜前玩耍，它们试图把对方推进抽屉，结果抽屉被撞开，小猫们纷纷被弹出或躲进抽屉，最后抽屉柜空无一物。",
    "S1950E21 - Triplet Trouble_scene024.mp4": "三只猫在柜子上观看一只老鼠被拖拽，老鼠被拖到地板上的通风口，随后通风口盖子打开，老鼠被吸入其中并变成一个球形的物体。",
    "S1950E21 - Triplet Trouble_scene025.mp4": "动画片段中，汤姆猫从门后跑出来，停在门口，表情显得紧张和警觉。",
    "S1950E21 - Triplet Trouble_scene026.mp4": "一只小老鼠在室内地毯上快速奔跑，镜头跟随其移动，背景中可见家具的腿和窗帘。",
    "S1950E21 - Triplet Trouble_scene027.mp4": "一只红色的猫从窗帘后伸出爪子，试图抓住从洞口跑出来的棕色老鼠。老鼠被猫的爪子击中后，被弹开并摔倒在地。随后，场景切换到另一个房间，一只棕色的小猫骑在一个蓝色的肉 grinder 上，将老鼠推进去，然后把 grinder 拿起来，把老鼠从里面推出来。老鼠被推出后，站在地上，看起来很惊讶。",
    "S1950E21 - Triplet Trouble_scene028.mp4": "一只黑猫拿着一个热狗，另一只红猫用勺子往热狗上倒酱料，然后红猫吃热狗时，热狗上的老鼠跳到窗外逃走了。",
    "S1950E21 - Triplet Trouble_scene029.mp4": "一只蓝色的猫在房间里跳舞，它张开双臂，抬起一条腿，做出各种舞蹈动作，看起来非常开心。",
    "S1950E21 - Triplet Trouble_scene030.mp4": "三只小猫在楼梯下，其中一只棕色小猫拿起一把红色雨伞，然后用它当武器，做出攻击的动作。另外两只小猫则在一旁观看。",
    "S1950E21 - Triplet Trouble_scene031.mp4": "汤姆猫在房间内兴奋地跳舞，突然被一把蓝色雨伞击中，雨伞卡在了他的嘴里，他惊愕地站着不动。",
    "S1950E21 - Triplet Trouble_scene032.mp4": "三只小猫在房间里跑动，随后堆叠在一起。大猫汤姆出现，被三只小猫抓住并吊起，他挣扎着，最后被摔在地上。",
    "S1950E21 - Triplet Trouble_scene033.mp4": "视频中，一只蓝色的猫（汤姆）正在睡觉，两只小猫（杰瑞的两个孩子）突然出现，开始拉扯汤姆的腿。汤姆被吵醒后，先是惊讶，然后生气地站起来，试图摆脱小猫们的纠缠。最后，汤姆与小猫们握手，似乎达成了某种和解。",
    "S1950E21 - Triplet Trouble_scene034.mp4": "一只黑白相间的猫从椅子上跳起，抓住窗户上的卷帘绳，用力一拉，卷帘被拉下，猫被卷帘带得翻滚着摔在地上。",
    "S1950E21 - Triplet Trouble_scene035.mp4": "汤姆正在和三只小猫互动，其中一只小猫用绳子拉住汤姆的手，导致汤姆被拉向一边。随后，三只小猫站在一起，看起来很得意。",
    "S1950E21 - Triplet Trouble_scene036.mp4": "一个蓝色的幽灵状生物正从窗户向外伸出手臂，似乎在试图抓住什么。它位于室内，旁边是一把绿色的扶手椅，窗外可以看到绿色的植物。",
    "S1950E21 - Triplet Trouble_scene037.mp4": "动画片段中，汤姆猫和杰瑞鼠在窗台上对峙。汤姆猫表情凶狠，杰瑞鼠则显得机警。杰瑞鼠突然向汤姆猫喷出一团气体，汤姆猫被熏得后退并捂住鼻子，最终被杰瑞鼠成功逃脱。",
    "S1950E21 - Triplet Trouble_scene038.mp4": "动画片《猫和老鼠》片段，汤姆猫在厨房里，趴在桌子上，试图抓住杰瑞鼠。杰瑞鼠在桌子下面，用爪子拨弄着汤姆猫的尾巴，汤姆猫被弄得手忙脚乱，最终被杰瑞鼠推倒在地。",
    "S1950E21 - Triplet Trouble_scene039.mp4": "在厨房里，汤姆推着装有三块派的红色手推车，杰瑞从水槽边用软管喷水，试图把派推倒。汤姆看到后惊讶地跳上手推车，然后坐下来，表情得意。",
    "S1950E21 - Triplet Trouble_scene040.mp4": "一只棕色的小老鼠从画面下方跑入，停在墙角，四处张望。",
    "S1950E21 - Triplet Trouble_scene041.mp4": "三只小猫正用吸管从一个蓝色碗里喝东西，它们的表情显得非常享受。背景中有一个黄色沙发和一些倒地的牛奶瓶和牛奶盒。",
    "S1950E21 - Triplet Trouble_scene042.mp4": "一只棕色的小老鼠站在房间的角落里，它抬起一只前爪，似乎在挥手或打招呼。背景中可以看到绿色条纹的墙壁、一扇窗户和一把蓝色的扶手椅。",
    "S1950E21 - Triplet Trouble_scene043.mp4": "汤姆猫戴着护目镜坐在红色手推车上，他先挥手，然后摘下护目镜，接着又戴上，最后看向一侧。手推车上放着一个三明治。",
    "S1950E21 - Triplet Trouble_scene044.mp4": "一只棕色的小老鼠站在房间的角落，它先是站立不动，随后转身向右跑动，最终消失在画面右侧。房间内有条纹壁纸、地毯、椅子和窗帘等家具。",
    "S1950E21 - Triplet Trouble_scene045.mp4": "三只小猫正在用吸管喝碗里的牛奶，一只小老鼠突然出现并跳进碗里，导致牛奶四溅，三只小猫都被牛奶喷到，表情变得愤怒。",
    "S1950E21 - Triplet Trouble_scene046.mp4": "视频展示了一个室内场景，墙壁是绿色和米色条纹，地面铺着深色地毯。房间里有一把绿色的扶手椅和一个红色窗帘的窗户。一开始，一只棕色的小老鼠从右侧门后跑出来，然后消失在画面中。接着，三只猫从右侧门后跑出来，分别是黑色、红色和棕色，它们看起来很生气，表情凶狠。最后，三只猫停下脚步，面朝前方，表情变得严肃。",
    "S1950E21 - Triplet Trouble_scene047.mp4": "在厨房里，一只黑猫坐在一辆红色小车上，手持一把刀，准备攻击。小车被两条红色的带子固定在厨房的两侧，带子的末端固定在门框上。黑猫高举刀具，似乎在准备一场攻击。厨房的背景中可以看到橱柜、冰箱和窗户，整体场景充满了紧张的气氛。",
    "S1950E21 - Triplet Trouble_scene048.mp4": "三只小猫站在门前，被一条红布带绊倒，随后红布带将它们弹开，最后只剩下一只红猫被弹到门边。",
    "S1950E21 - Triplet Trouble_scene049.mp4": "汤姆猫戴着护目镜，坐在红色手推车上，手里拿着一把刀，旁边放着几个派。他挥舞着刀，然后从画面中消失，留下空荡荡的厨房。",
    "S1950E21 - Triplet Trouble_scene050.mp4": "三只小猫并排跑过房间，随后趴在地上，尾巴翘起。一只戴着墨镜的猫推着红色小车经过，小猫们被车轮压到尾巴，尾巴飞起后又落回原位。小猫们抬头看向天花板，然后转头看向镜头。",
    "S1950E21 - Triplet Trouble_scene051.mp4": "汤姆戴着护目镜，坐在一个装有西瓜和派的红色手推车上，推车在房间里移动，经过沙发和楼梯，最终停在楼梯旁。",
    "S1950E21 - Triplet Trouble_scene052.mp4": "一只戴着护目镜的蓝色猫坐在一个红色手推车上，手推车上放着一叠煎饼。猫在房间里飞起来，经过一盏吊灯，然后降落在地板上。",
    "S1950E21 - Triplet Trouble_scene053.mp4": "三只小猫从门口跑进来，沿着墙边奔跑，随后跳上沙发，最后消失在画面中。",
    "S1950E21 - Triplet Trouble_scene054.mp4": "汤姆戴着护目镜，坐在一架由西瓜和红色框架组成的简易飞机上，手里拿着一叠派。他飞行过程中经过室内吊灯、书架，最后飞出窗外。",
    "S1950E21 - Triplet Trouble_scene055.mp4": "三个派在空中飞行，从绿色地面飞向一扇木门。",
    "S1950E21 - Triplet Trouble_scene056.mp4": "一只棕色的小老鼠站在走廊里，它先是双手合十，然后弯下腰，做出祈祷的姿势。背景是绿色条纹墙纸和一个房间，房间内有一把蓝色的椅子和红色窗帘。",
    "S1950E21 - Triplet Trouble_scene057.mp4": "三只小猫趴在沙发上，突然被紫色液体溅到，随后它们惊讶地发现窗户被打破，外面有一辆装着西瓜的小车，三只小猫露出愤怒的表情。",
    "S1950E21 - Triplet Trouble_scene058.mp4": "一只棕色的小老鼠站在房间的地毯上，它先是低头看着地面，然后抬起双手放在嘴边，似乎在思考或感到紧张。背景中可以看到绿色条纹的墙壁、一把绿色的扶手椅和红色窗帘。",
    "S1950E21 - Triplet Trouble_scene059.mp4": "一架红色的飞机在乡村上空飞行，飞过几座房子和树木，最后从画面中消失。",
    "S1950E21 - Triplet Trouble_scene060.mp4": "汤姆戴着飞行眼镜，驾驶着一架由西瓜和红色框架组成的简易飞行器，在室内楼梯上滑行。飞行器在空中飞行时，西瓜脱离了框架，随后落地。镜头跟随西瓜的下落轨迹，最终西瓜停在壁炉旁的地板上。",
    "S1950E21 - Triplet Trouble_scene061.mp4": "三只小猫追逐一只老鼠，途中被一个飞盘击中，其中一只小猫被击中后膨胀变大，变得圆滚滚的，最后它慢慢地走开。",
    "S1950E21 - Triplet Trouble_scene062.mp4": "一只戴着护目镜的蓝色猫趴在一架红色的玩具飞机上，飞机有三轮，猫张着嘴，似乎在兴奋地飞行。飞机从室外飞入室内，经过一扇门，背景从室外的绿色地面和黄色墙壁变为室内的棕色门和绿色墙壁。",
    "S1950E21 - Triplet Trouble_scene063.mp4": "三只小猫在房间里排成一列，抬头看着天花板。突然，一只戴着护目镜的蓝色大猫从天花板上飞过，留下一道红色的痕迹。镜头切换到房间的另一侧，展示了一个装饰典雅的房间，有窗帘、柜子和镜子。",
    "S1950E21 - Triplet Trouble_scene064.mp4": "一个卡通风格的乡村场景，画面中有一栋房子，窗户打开，一只猫从窗户飞出，驾驶着一架红色双翼飞机，飞机上还有其他卡通角色。飞机飞过田野和树木，背景是蓝天和远处的房屋。",
    "S1950E21 - Triplet Trouble_scene065.mp4": "一只戴着护目镜的蓝猫驾驶着一架红色的小飞机，飞机上还坐着三只小猫。飞机在空中飞行，随后蓝猫突然将三只小猫从飞机上扔了下去，小猫们在空中翻滚着坠落。",
    "S1950E21 - Triplet Trouble_scene066.mp4": "一只老鼠站在围墙上，手持一个蓝色的网兜。它用网兜试图捕捉从晾衣架上爬下来的猫。猫们一个接一个地从晾衣架上滑落，试图躲避老鼠的捕捉。老鼠不断拉扯网兜，猫们则在空中翻滚或挣扎，场面充满动感和喜剧效果。",
    "S1950E21 - Triplet Trouble_scene067.mp4": "汤姆戴着护目镜，手持剪刀和纸张，站在一个装满物品的篮子旁。他先是剪纸，然后将剪下的纸片展开，似乎在制作或装饰什么。背景中，有两只小猫在空中飞舞，一只黑色，一只橙色，它们似乎被某种装置牵引着。汤姆的表情专注而兴奋，整个场景充满了动感和趣味。",
    "S1950E21 - Triplet Trouble_scene068.mp4": "一位穿着蓝绿色连衣裙和黑色高跟鞋的女士，手拿一个装有液体的瓶子，从一扇门走进房间。她走过一个木柜，然后走向窗户，停在窗前，似乎在观察窗外的景色。",
    "S1950E21 - Triplet Trouble_scene069.mp4": "三只长着翅膀的猫在旋转木马上玩耍，它们随着木马的旋转而上下摆动，画面最后逐渐变暗并显示“The End”。",
    "S1950E21 - Triplet Trouble_scene070.mp4": "视频展示了“THE END”字样，随后逐渐过渡到“An MGM Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面。背景为红色，文字为蓝色和白色，具有经典卡通片尾风格。"
}