{
    "E41.Hatch.Up.Your.Troubles_scene001.mp4": "视频展示了米高梅动画公司的标志，标志中央是一只咆哮的狮子，背景为红色，下方有“Metro-Goldwyn-Mayer CARTOON”字样，以及“Color by Technicolor”的说明。",
    "E41.Hatch.Up.Your.Troubles_scene002.mp4": "视频展示了一个经典的米高梅动画片头，红色背景上有一个圆形框架，里面是一只咆哮的狮子，下方有“Metro-Goldwyn-Mayer CARTOON”字样，以及“COLOR BY Technicolor”的说明。狮子在框架内不断张合嘴巴，表现出咆哮的动作。",
    "E41.Hatch.Up.Your.Troubles_scene003.mp4": "视频展示了米高梅动画的片头，先是米高梅的标志，随后是《猫和老鼠》的标题画面。",
    "E41.Hatch.Up.Your.Troubles_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面。画面中央是灰色的猫汤姆和棕色的小老鼠杰瑞，汤姆张大嘴巴，杰瑞则在旁边开心地笑着。背景是红色的圆形图案，下方是黄色的“TOM and JERRY”字样。随后，画面中出现橙色的标题“HATCH UP YOUR TROUBLES”，并标注了导演威廉·汉纳和约瑟夫·巴雷拉的名字。",
    "E41.Hatch.Up.Your.Troubles_scene005.mp4": "视频展示了动画片《Hatch Up Your Troubles》的片头标题画面，背景为深绿色，标题文字为黄色，显示了导演威廉·汉纳和约瑟夫·巴伯拉的名字。随后，画面切换到制作人员名单，包括动画师和音乐制作人，最后显示制片人弗雷德·奎姆比的名字。整个画面风格复古，具有经典动画片的特色。",
    "E41.Hatch.Up.Your.Troubles_scene006.mp4": "视频开始时显示了制作人Fred Quimby的标题，随后画面切换到一个宁静的户外场景，镜头从树梢缓缓拉远，展示了一个绿意盎然的庭院，庭院中有树木、草坪和白色的栅栏。镜头逐渐聚焦到一棵大树的树枝上，可以看到一个鸟巢，里面有一只红冠鸟正在孵蛋。整个场景充满了宁静和自然之美。",
    "E41.Hatch.Up.Your.Troubles_scene008.mp4": "一个粉色的蛋从树上的蜘蛛网上掉落，穿过云层，最终落在一株黄色郁金香的花心，花儿随之绽放。",
    "E41.Hatch.Up.Your.Troubles_scene009.mp4": "一个粉红色的蛋从黄色郁金香中掉落，滚过花园，最终滚进一个白色小屋的门口。",
    "E41.Hatch.Up.Your.Troubles_scene010.mp4": "一个粉红色的球滚入房间，停在一个正在睡觉的棕色小动物旁边，小动物穿着黄色衣服，躺在绿色垫子上，周围有两盏台灯和一个梳妆台。",
    "E41.Hatch.Up.Your.Troubles_scene012.mp4": "在一间木制房间内，啄木鸟伍迪用喙啄击一个抽屉柜，导致木屑飞溅。随后，一只棕色的小老鼠杰瑞突然出现，它先是被木屑吓到，接着迅速靠近伍迪，似乎准备与它互动或对抗。",
    "E41.Hatch.Up.Your.Troubles_scene013.mp4": "啄木鸟伍迪正在敲击一盏绿色的灯罩，导致灯罩脱落并洒出谷物。一只老鼠从上方出现，被谷物砸中后摔倒在地，随后用灯罩盖住自己，接着又爬起来，戴着灯罩继续前行。",
    "E41.Hatch.Up.Your.Troubles_scene015.mp4": "一只棕色的小老鼠从蓝色的拱形门后走出，怀里抱着一只红色的小鸟。它开心地蹦跳着，随后跳到树上，继续抱着小鸟在树枝上蹦跳。树上有一个鸟巢。",
    "E41.Hatch.Up.Your.Troubles_scene017.mp4": "一只小老鼠杰瑞从门后探出头来，看到一只啄木鸟站在门前。杰瑞迅速扑过去抓住啄木鸟，试图把它塞进门里。他用力推门，但啄木鸟从门缝中逃了出来。杰瑞被啄木鸟的啄击弄得满头是包，他愤怒地盯着啄木鸟，但啄木鸟却在门后悠闲地站着。杰瑞气得直跺脚，啄木鸟则继续在门后啄着木头。",
    "E41.Hatch.Up.Your.Troubles_scene018.mp4": "动画片中，一只棕色老鼠从蓝色拱形门里走出，抓住一只红色啄木鸟。老鼠把啄木鸟推到门外，然后叉腰站立，用手指着啄木鸟，似乎在责备它。啄木鸟低头看着地面。背景是一栋白色房子和绿色草地，前景有几朵粉红色的花。",
    "E41.Hatch.Up.Your.Troubles_scene020.mp4": "一只红色的小鸟站在草地上，面对着一个木制结构。它用喙啄着木头，木屑飞溅。小鸟看起来很专注，似乎在努力啄开木头。背景是绿色的灌木丛。",
    "E41.Hatch.Up.Your.Troubles_scene021.mp4": "汤姆猫躺在沙滩椅上，手里拿着一杯饮料。他先是皱眉，然后愤怒地将饮料倒在地上。",
    "E41.Hatch.Up.Your.Troubles_scene022.mp4": "一只啄木鸟站在木头上，突然木头裂开，黄色的液体喷涌而出，把啄木鸟淋湿。啄木鸟抖了抖身子，然后用喙啄木头，木头被啄开，木屑飞溅。",
    "E41.Hatch.Up.Your.Troubles_scene023.mp4": "汤姆猫坐在一张红白条纹的躺椅上，正在喝一杯黄色的饮料。突然，他被什么东西吓到，身体向后仰，嘴巴张开，眼睛瞪大，表情惊恐。躺椅的靠背部分被他撑得变形，背景是蓝天和木栅栏。",
    "E41.Hatch.Up.Your.Troubles_scene024.mp4": "在一片绿草如茵的院子里，啄木鸟伍迪正悠闲地走着。突然，他被一只从天而降的灰色大猫——汤姆吓了一跳。汤姆在空中翻滚着，重重地摔在草地上，随后又迅速地弹起，追赶伍迪。伍迪惊慌失措地四处逃窜，最终躲进了一棵大树后面。汤姆在草地上翻滚着，追赶伍迪，但伍迪成功地躲进了树后。",
    "E41.Hatch.Up.Your.Troubles_scene025.mp4": "一只棕色的小老鼠从蓝色的拱形门后探出头来，门缓缓打开，小老鼠完全走出门口，站在门外，表情警觉。",
    "E41.Hatch.Up.Your.Troubles_scene026.mp4": "一只小老鼠拿着耙子追赶一只灰猫，灰猫被耙子击中后倒地，随后灰猫抢过耙子并用它追赶小老鼠。",
    "E41.Hatch.Up.Your.Troubles_scene027.mp4": "一只老鼠被蓝色的耙子夹住，一只红色的鸟飞过来啄耙子，导致耙子断裂，鸟飞走。",
    "E41.Hatch.Up.Your.Troubles_scene028.mp4": "汤姆猫手持一根黄色棍子，在草地上奔跑，背景是房屋和树木。",
    "E41.Hatch.Up.Your.Troubles_scene029.mp4": "动画片中，汤姆猫戴着黄色帽子和红色领结，坐在邮箱杆上，随后他被一根黄色棍子击中，从杆上摔下。接着，汤姆猫拿着棍子在草地上奔跑，做出各种夸张的动作，包括旋转和跳跃，表情愤怒且充满活力。背景是绿色的草地和远处的房屋。",
    "E41.Hatch.Up.Your.Troubles_scene030.mp4": "一只棕色的小老鼠正在草地上追逐一只红色的啄木鸟。啄木鸟被小老鼠抓住后，突然从嘴里喷出黄色的木屑，木屑喷完后啄木鸟被弹飞，掉在地上。小老鼠被吓了一跳，躲到树后，啄木鸟则站在地上，看起来很惊讶。",
    "E41.Hatch.Up.Your.Troubles_scene031.mp4": "一只灰色的猫在树下追逐一只红色的小鸟，猫多次扑空，最后沮丧地站在树旁，不断做出夸张的姿势和表情，显得非常无奈和搞笑。",
    "E41.Hatch.Up.Your.Troubles_scene032.mp4": "汤姆猫在院子里，他拿起一个装满水的桶，把水泼在自己头上，然后水从他的身体里喷出来，形成一个小型喷泉，最后水逐渐流干。",
    "E41.Hatch.Up.Your.Troubles_scene033.mp4": "一只棕色的小老鼠在草地上奔跑，突然被一条巨大的灰色尾巴扫中，它抓住尾巴并被甩起，最终被甩到空中。",
    "E41.Hatch.Up.Your.Troubles_scene034.mp4": "一只灰色的猫，表情狰狞，牙齿紧咬，嘴里含着一颗红色的樱桃，随后樱桃被吐出，猫的表情从愤怒转为惊讶，最后猫低头，似乎在思考或准备下一步行动。",
    "E41.Hatch.Up.Your.Troubles_scene035.mp4": "一只棕色的小老鼠在草地上奔跑，突然跳上一个树桩，但被树桩上插着的一把斧头击中，飞了出去，躺在树桩上。这时，一只灰色的猫——汤姆，从画面右侧跳出来，兴奋地张开双臂，看着躺在树桩上的小老鼠，脸上露出得意的笑容。",
    "E41.Hatch.Up.Your.Troubles_scene036.mp4": "动画片中，汤姆猫手持斧头，表情凶狠，一只啄木鸟不断飞来飞去，落在他的头上，汤姆猫愤怒地挥舞斧头，但啄木鸟总是飞走。最后，汤姆猫站在一个树桩上，树桩上躺着一只小老鼠，汤姆猫举起拳头，似乎在庆祝胜利，然后他拿起一个瓶塞，准备打开瓶子。",
    "E41.Hatch.Up.Your.Troubles_scene037.mp4": "汤姆猫用爪子托着一个倒扣的杯子，杯子里有一只红色的小鸟。小鸟从杯子里探出头来，汤姆猫伸出舌头舔了舔小鸟，小鸟被吓到飞了起来，但很快又飞回杯子里。汤姆猫继续用爪子托着杯子，看着小鸟在杯子里晃动。",
    "E41.Hatch.Up.Your.Troubles_scene038.mp4": "汤姆猫拿着一个木塞和一只小鸟，兴奋地跳跃着，随后飞出画面，留下杰瑞躺在树桩上。",
    "E41.Hatch.Up.Your.Troubles_scene039.mp4": "在户外的院子里，汤姆猫兴奋地跑向一根木桩，手里拿着一个红色的小鸟玩具。他用绳子绑住小鸟，然后用力拉扯，小鸟被绑在木桩上。汤姆猫试图把小鸟拉近自己，但小鸟突然飞走，汤姆猫被绳子绊倒，摔倒在地。他站起来后，愤怒地瞪着小鸟，但小鸟已经飞走了。汤姆猫无奈地站在原地，看着小鸟飞走。",
    "E41.Hatch.Up.Your.Troubles_scene040.mp4": "啄木鸟用嘴叼着一个木桶，用力向树干上敲击，木桶被敲击后飞出去，啄木鸟被绳子拉住，悬在树干上，张大嘴巴，看起来很惊讶。",
    "E41.Hatch.Up.Your.Troubles_scene041.mp4": "汤姆猫拿着斧头站在树桩上，试图砍死一只老鼠。老鼠在树桩上挣扎，汤姆猫挥舞斧头，但每次挥斧都未能真正砍到老鼠，反而把斧头挥到空中。汤姆猫表情兴奋，似乎非常享受这个过程。",
    "E41.Hatch.Up.Your.Troubles_scene042.mp4": "一只红色的小鸟被一根黄色的绳子绑在树干上，它用力挣扎，最终挣脱了绳子。小鸟在地上跑动，随后从树干后面拿出一张纸和一支铅笔，开始在纸上写字。",
    "E41.Hatch.Up.Your.Troubles_scene043.mp4": "一只猫在院子里用锯子锯木头，一只手拿着铅笔在前景中。",
    "E41.Hatch.Up.Your.Troubles_scene044.mp4": "啄木鸟伍迪拿着铅笔在纸上画画，他先是低头专注地画，然后突然抬头，举起铅笔，似乎对画作感到满意或惊讶。背景是木栅栏和草地。",
    "E41.Hatch.Up.Your.Troubles_scene045.mp4": "啄木鸟伍迪手持一支巨大的铅笔，正用力地敲击着电线杆。背景是蓝天和一些绿色的树木。",
    "E41.Hatch.Up.Your.Troubles_scene046.mp4": "啄木鸟伍迪趴在一张纸上，用铅笔在纸上写字。",
    "E41.Hatch.Up.Your.Troubles_scene047.mp4": "一个卡通风格的动画片段，展示了一只手拿着铅笔在纸上画图和计算。图上画了一只猫和一根标有“30”和“POLE”的杆子，猫和杆子之间有一条虚线，虚线上标有“X”和“Y”。铅笔在纸上写下“X:30 = 30:Y”，然后计算出“X:Y = 12”。整个过程是用卡通风格呈现的，手是白色的，铅笔是黄色的，背景是绿色的。",
    "E41.Hatch.Up.Your.Troubles_scene048.mp4": "啄木鸟伍迪拿着铅笔在树干上画了一个“X”，然后用喙啄树干，树干裂开，伍迪被弹出，树干上出现了一个洞。",
    "E41.Hatch.Up.Your.Troubles_scene049.mp4": "镜头从远处的电线杆开始，逐渐推近，最终聚焦在电线杆顶部的横梁和电线连接处。电线杆是棕色的，上面有多个绝缘子，电线在空中延伸。背景是蓝天和几朵白云，下方有绿色的树冠。",
    "E41.Hatch.Up.Your.Troubles_scene050.mp4": "汤姆拿着斧头，试图用斧头击打杰瑞，但杰瑞迅速逃跑。汤姆被一个从天而降的木头砸中，木头砸在汤姆头上，汤姆被砸得晕头转向，最终倒在地上。木头滚落在地，汤姆消失在画面中。",
    "E41.Hatch.Up.Your.Troubles_scene051.mp4": "一只小老鼠从树干后跑出，看到一只小鸟后，它开心地跑向小鸟并将其抱起。随后，一只更大的鸟从空中飞来，降落在地面上，与小老鼠和小鸟对峙。"
}