{
    "S1940E39 - Polka-Dot Puss_scene001.mp4": "画面展示了一个经典的卡通片头标志，背景为深蓝色，中央是一个黑色的圆形轮廓，上方有“METRO-GOLDWYN-MAYER”的字样，下方是醒目的“CARTOON”字样，再下方是“COLOR BY TECHNICOLOR”的字样，整体设计简洁而富有复古感。",
    "S1940E39 - Polka-Dot Puss_scene002.mp4": "视频展示了一个经典的卡通片头标志，背景为深蓝色，中央是一个圆形框架，里面是一只咆哮的狮子。狮子上方有“A METRO-GOLDWYN-MAYER”字样，下方是大大的“CARTOON”字样，再下方是“COLOR BY TECHNICOLOR”字样。狮子在圆形框架内不断咆哮，表情凶猛，嘴巴张开露出牙齿，头部微微晃动，显示出强烈的动态感。整个画面色彩鲜明，具有复古卡通风格。",
    "S1940E39 - Polka-Dot Puss_scene003.mp4": "视频展示了米高梅动画的标志，随后出现“Tom and Jerry”的标题，伴随着汤姆猫和杰瑞鼠的卡通形象。",
    "S1940E39 - Polka-Dot Puss_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为绿色，左侧是棕色老鼠杰瑞，右侧是灰色猫汤姆，两者面带笑容。画面中央是黄色的“Tom and Jerry”字样，随后出现“POLKA-DOT Puss”和导演“William Hanna & Joseph Barbera”的字样。",
    "S1940E39 - Polka-Dot Puss_scene005.mp4": "视频片段展示了动画片《Tom and Jerry》中的一个标题画面，标题为“Polka-Dot Puss”，由William Hanna和Joseph Barbera执导。画面中还列出了动画师、音乐制作人以及制片人Fred Quimby的名字。背景是深绿色的，文字颜色鲜艳，具有复古卡通风格。随后画面逐渐变暗，过渡到下一个场景。",
    "S1940E39 - Polka-Dot Puss_scene006.mp4": "汤姆猫躺在粉色沙发上，手里拿着一个被黄色绳子缠住的小老鼠玩具。他先是悠闲地玩弄着玩具，随后突然露出兴奋的笑容，眼睛睁大，嘴巴张开，似乎对玩具老鼠的反应感到非常开心。",
    "S1940E39 - Polka-Dot Puss_scene008.mp4": "汤姆猫站在窗前，看着外面的雨景。他先是伸出手，似乎想抓住什么，然后又缩回手，表情显得有些焦急和困惑。接着，他转过身，双手交叉在胸前，看起来有些无奈和不满。最后，他再次面向窗户，似乎在思考或等待什么。",
    "S1940E39 - Polka-Dot Puss_scene009.mp4": "一只棕色的小老鼠从粉红色沙发的缝隙中探出头来，它先是小心翼翼地观察四周，然后完全爬出来，露出开心的笑容。",
    "S1940E39 - Polka-Dot Puss_scene010.mp4": "一个穿着蓝色花睡衣的角色站在门前，门把手是金色的。一只灰色的猫从右侧进入画面，它靠近角色的脚边，抬头看着角色，然后慢慢后退，最后蹲坐在地上，抬头望着角色。背景是粉红色的墙壁和红色的地板。",
    "S1940E39 - Polka-Dot Puss_scene011.mp4": "一只灰色的猫站在门前，先是开心地笑着，随后表情变得愤怒，开始大喊大叫，并做出夸张的伸展动作，最后疲惫地瘫坐在地上。",
    "S1940E39 - Polka-Dot Puss_scene012.mp4": "一只灰色的猫坐在地上，面对着一位穿着蓝色花袍的女性角色。猫先是用爪子捂住脸，然后张大嘴巴，似乎在叫喊或表达不满。接着，它用爪子拉住女性角色的袍子，女性角色则用手捂住脸，显得有些无奈或生气。猫继续用爪子抓挠女性角色的袍子，女性角色则保持站立姿势，没有明显的动作反应。",
    "S1940E39 - Polka-Dot Puss_scene013.mp4": "一只穿着黄色腰带的棕色小老鼠坐在粉色沙发上，它先是四处张望，然后突然张大嘴巴，似乎在尖叫或惊讶，接着它用手捂住脸，最后又恢复平静，用前爪托着下巴，表情显得有些忧郁或沉思。",
    "S1940E39 - Polka-Dot Puss_scene014.mp4": "在室内，汤姆猫站在地上，面对着一个穿着蓝色花袍、红色头巾和黄色袜子的女性角色。女性角色正缓慢地从画面右侧向左侧移动，汤姆猫则一直注视着她。随着女性角色靠近，汤姆猫突然张大嘴巴，似乎在大笑或惊叫，身体后仰并靠在粉色沙发上。女性角色伸出手指指向汤姆猫，汤姆猫则显得有些惊讶和困惑。",
    "S1940E39 - Polka-Dot Puss_scene015.mp4": "汤姆猫坐在红色沙发上，表情从惊讶变为愤怒，然后又转为得意，最后露出不屑的表情。",
    "S1940E39 - Polka-Dot Puss_scene016.mp4": "一只棕色的小老鼠坐在一个粉红色的沙发上，它系着一条黄色的绳子，绳子的另一端垂在沙发边缘。小老鼠先是双臂交叉，表情略显得意，随后它转头看向一侧，似乎在观察周围的环境。整个画面充满了卡通风格的幽默和轻松感。",
    "S1940E39 - Polka-Dot Puss_scene017.mp4": "一位穿着花衣服的女性角色正在给躺在地毯上的汤姆盖上黄色毯子，随后她转身离开，汤姆突然坐起并表现出惊讶和愤怒的表情。",
    "S1940E39 - Polka-Dot Puss_scene018.mp4": "汤姆猫看到一个粉红色的沙发，沙发扶手上挂着一根黄色的绳子。汤姆猫兴奋地扑向沙发，用力拉扯绳子，最终将绳子从沙发扶手上拽了下来。",
    "S1940E39 - Polka-Dot Puss_scene019.mp4": "汤姆猫拿着一块肥皂，杰瑞鼠趴在肥皂上。汤姆伸出舌头舔肥皂，肥皂起泡，杰瑞鼠被泡沫覆盖。杰瑞鼠从肥皂上跳下，用绳子拉汤姆，汤姆被拉得转圈，最后汤姆生气地瞪着杰瑞鼠。",
    "S1940E39 - Polka-Dot Puss_scene020.mp4": "一只老鼠被一根黄色的绳子牵引着，拖着绳子从窗帘后跑过，经过一个柜子，最后钻进墙角的一个洞里。随后，一只灰色的猫从洞里出现，抓住绳子，用力拉扯，试图将老鼠拉出来。",
    "S1940E39 - Polka-Dot Puss_scene021.mp4": "汤姆猫拿着一个黄色的捕鼠器，试图用嘴咬住它。捕鼠器突然弹起，夹住了汤姆的鼻子，导致他的鼻子被拉长。汤姆惊恐地张大嘴巴，表情痛苦，最终鼻子恢复原状，他看起来非常震惊和害怕。",
    "S1940E39 - Polka-Dot Puss_scene022.mp4": "动画片中的猫汤姆戴着防毒面具，表情惊恐。随后画面变黑，接着汤姆坐在地上，用毛巾擦拭一个红色瓶子。",
    "S1940E39 - Polka-Dot Puss_scene023.mp4": "汤姆猫躺在地毯上，盖着黄色毯子，旁边放着一个橙色瓶子。他看起来很放松，但突然间，杰瑞鼠从门后探出头来，手里拿着一个装有红色液体的瓶子，瓶子上写着“FIRE”。杰瑞鼠兴奋地跑出来，似乎准备用这个瓶子搞点恶作剧。",
    "S1940E39 - Polka-Dot Puss_scene025.mp4": "视频中，汤姆猫看到一盆牛奶，但被一根绳子牵着，绳子的另一端被杰瑞鼠咬住。杰瑞鼠坐在沙发上，手里拿着一份报纸，报纸上写着“总统向国会发表讲话”。汤姆猫愤怒地试图抓住杰瑞鼠，但杰瑞鼠巧妙地躲避。汤姆猫的脸颊上出现了红色的斑点，表明他非常生气。整个场景充满了紧张和幽默的氛围。",
    "S1940E39 - Polka-Dot Puss_scene026.mp4": "视频展示了一份报纸的特写，标题为“麻疹疫情席卷全国！打喷嚏和流鼻涕是初期症状”。报纸的版面设计复古，文字清晰可见，背景为浅色纸张，整体氛围传达出紧急和警示的信息。",
    "S1940E39 - Polka-Dot Puss_scene027.mp4": "视频中，一只灰色的猫（汤姆）和一只棕色的小老鼠（杰瑞）在室内互动。汤姆脸上有红点，表情愤怒，正盯着杰瑞。杰瑞拿着一份报纸，随后用镜子反射汤姆的脸，让汤姆看到自己脸上的红点，汤姆因此大叫并表现出惊恐。最后，画面转暗，出现一本名为“Dr. Quack's Home Treatment”的书和一个温度计，暗示可能与治疗有关。",
    "S1940E39 - Polka-Dot Puss_scene028.mp4": "杰瑞在桌旁的书本和温度计旁，拿起听诊器，开始给生病的汤姆听诊。汤姆脸上有红点，看起来很不舒服。杰瑞将听诊器放在汤姆的耳朵上，然后又放在汤姆的胸口，一边听一边观察汤姆的反应。汤姆看起来很痛苦，但杰瑞似乎很认真地在检查他。",
    "S1940E39 - Polka-Dot Puss_scene029.mp4": "杰瑞用听诊器听猫的脉搏，然后将听诊器的另一端对准闹钟，似乎在试图通过听闹钟的声音来判断时间。",
    "S1940E39 - Polka-Dot Puss_scene030.mp4": "一只灰色的猫，脸上有红色斑点，眼睛是黄色的，瞳孔是绿色的。它双手拿着两根红色的棍子，放在脸颊两侧，表情看起来很得意或自信。背景是浅黄色的。",
    "S1940E39 - Polka-Dot Puss_scene031.mp4": "一只老鼠正用绿色水管对着一个蓝色闹钟喷水，闹钟的指针在水的冲击下不断转动。老鼠表情兴奋，动作幅度大，似乎在努力让闹钟的指针转动得更快。",
    "S1940E39 - Polka-Dot Puss_scene032.mp4": "视频中，汤姆猫坐在绿色凳子上，表情痛苦，脸上有红点，眼睛睁得很大。杰瑞鼠从右侧出现，手持红色锤子，用力敲击汤姆猫的头部。汤姆猫被击中后，身体剧烈晃动，最终倒在地上，张大嘴巴，显得非常痛苦。整个场景充满了喜剧和夸张的动作。",
    "S1940E39 - Polka-Dot Puss_scene033.mp4": "杰瑞用体温计打汤姆，汤姆被击中后发烧，体温计卡在汤姆嘴里。",
    "S1940E39 - Polka-Dot Puss_scene034.mp4": "汤姆猫生病了，嘴里含着体温计，脸上有红点。杰瑞鼠拿着打火机靠近体温计，点燃后体温计上的水银柱上升，顶端出现一个红色气球。气球逐渐变大，最终爆炸，红色液体喷出，汤姆猫表情痛苦。",
    "S1940E39 - Polka-Dot Puss_scene035.mp4": "视频展示了一本名为“Dr. Quack's Treatments”的书，其中一页写着“HIGH TEMPERATURE: APPLY ICE TO PATIENT'S VICINITY”。随后画面切换到一个冰箱内部，杰瑞（Tom）正在偷取冰块，导致冰块堆积成山。与此同时，一个被冰冻的猫（可能是汤姆）出现在冰块堆中，表情惊恐。杰瑞似乎在享受偷冰的乐趣，而被冰冻的猫则显得非常惊慌。",
    "S1940E39 - Polka-Dot Puss_scene036.mp4": "在冰冻的环境中，一只被冰封的猫露出痛苦的表情，而一只老鼠拿着黄色的勺子从冰柜中出现，将冰块放入猫的嘴里，猫因疼痛而张大嘴巴，老鼠则得意地笑着。随后，老鼠跳回冰柜中，猫继续痛苦地张着嘴。",
    "S1940E39 - Polka-Dot Puss_scene037.mp4": "视频中，一只被冰封在冰箱里的猫，表情惊恐。随后，一只老鼠从冰箱外爬进冰箱，发现猫后，老鼠开心地跳上冰箱顶部，然后伸手去拉冰箱门把手，试图打开冰箱门。",
    "S1940E39 - Polka-Dot Puss_scene038.mp4": "一只棕色的小老鼠站在冰箱顶部，看着冰箱门打开，冰块掉落。随后，一只被冰冻的蓝色猫从冰箱中爬出，跪在地上，嘴里冒着白气，显得非常寒冷。",
    "S1940E39 - Polka-Dot Puss_scene039.mp4": "一只棕色的小老鼠站在一个黄色台面上，它先是站立，然后张开双臂，接着跳起并向前奔跑。在奔跑过程中，它经过一本打开的红色书，书上写着“DR. QUACK'S HOME TREATMENT”。",
    "S1940E39 - Polka-Dot Puss_scene040.mp4": "视频开始时展示了一本打开的书，书页上写着“DR. QUACK'S TREATMENTS”，标题为“EXTREME CHILLS”，并注明“MAKE IT HOT FOR PATIENT”。随后镜头切换到一个房间内，一只棕色的小老鼠站在红色的地板上，面对着一只被冻得发抖的蓝色猫。猫的身体呈现出冰冻状态，身上有冰晶和雪花，表情痛苦，似乎在寒冷中瑟瑟发抖。老鼠则显得非常得意，似乎在嘲笑猫的处境。背景是厨房的橱柜和一扇门。",
    "S1940E39 - Polka-Dot Puss_scene041.mp4": "一只棕色的小老鼠从烤箱里逃出来，烤箱里有一只蓝色的猫。老鼠跑出烤箱后，烤箱门关闭，老鼠在地板上奔跑。",
    "S1940E39 - Polka-Dot Puss_scene043.mp4": "一只棕色的小老鼠站在一个白色物体上，面对着一个红色的物体。它先是张开嘴巴，然后伸出手指指向红色物体，接着似乎被击中，身体后仰并被弹开，周围出现爆炸和烟雾效果。",
    "S1940E39 - Polka-Dot Puss_scene044.mp4": "一只棕色的小老鼠从冰箱顶部探出头，抓住挂在门上的蓝色格子布，用它作为滑翔翼滑翔而下。",
    "S1940E39 - Polka-Dot Puss_scene045.mp4": "一个愤怒的红色火焰猫从门口冲出来，被一只小老鼠推着一个装满食物的盘子向前冲。火焰猫在盘子里挣扎，表情愤怒，而小老鼠则在后面奔跑。场景从门口逐渐过渡到房间内部，背景中可以看到家具和窗帘。",
    "S1940E39 - Polka-Dot Puss_scene046.mp4": "在浴室里，汤姆被杰瑞用拖把拖着，汤姆愤怒地燃烧着，杰瑞则得意地拖着他。汤姆撞到浴帘上，浴帘被扯开，汤姆被甩出去，杰瑞则继续拖着拖把，得意地笑着。",
    "S1940E39 - Polka-Dot Puss_scene048.mp4": "一只小老鼠正用前爪抱着一本红色封面的书，书的封面上写着“DROUACK”，它在室内地板上行走，背景是浅黄色的墙壁和深色的家具边缘。",
    "S1940E39 - Polka-Dot Puss_scene049.mp4": "汤姆穿着浴袍，头上裹着毛巾，站在镜子前。他用毛巾擦拭额头上的红点，然后低头看着自己的手，发现手心也有红点，表情惊讶。他转过身，继续低头看着手心的红点。",
    "S1940E39 - Polka-Dot Puss_scene050.mp4": "汤姆穿着白色浴袍，从柜子后面探出头，伸手拿起放在地上的黄色瓶子，瓶子里插着一根黄色的棍子。",
    "S1940E39 - Polka-Dot Puss_scene051.mp4": "汤姆穿着浴袍，头上裹着毛巾，站在镜子前，手里拿着一杯饮料，用吸管喝着。他看着镜子里的自己，表情专注。",
    "S1940E39 - Polka-Dot Puss_scene052.mp4": "一只小老鼠拿着一本红色封面的书，书上写着“DR. QUACK”。它先是用书挡住自己，然后放下书，站在书上，兴奋地跳跃和舞动。",
    "S1940E39 - Polka-Dot Puss_scene053.mp4": "汤姆穿着浴袍，头上裹着毛巾，拿着画笔在镜子前给自己画上红色的点。画完后，镜子中的汤姆变成了一个兔子，并且镜子上出现了“JACKASS”的字样。",
    "S1940E39 - Polka-Dot Puss_scene054.mp4": "汤姆穿着浴袍和拖鞋，在房间里拿着一瓶红色液体。他不小心打翻了瓶子，液体洒在地上。汤姆惊慌失措地试图用浴袍遮住自己，但最终浴袍和拖鞋都被弄乱了，他只好无奈地站在原地。",
    "S1940E39 - Polka-Dot Puss_scene055.mp4": "汤姆猫在房间里伸展身体，随后拿起一把剑开始挥舞，最后从画面中消失。",
    "S1940E39 - Polka-Dot Puss_scene056.mp4": "动画片段中，汤姆猫手持一把长剑，从房间门口跳出来，表情凶狠，似乎在追逐或准备攻击。他冲向一只小老鼠，小老鼠坐在地上，看起来有些害怕。汤姆猫用剑尖指向小老鼠，做出威胁的姿势，小老鼠则显得有些惊慌。整个场景发生在一间布置简单的房间里，背景中有床、桌子和柜子等家具。",
    "S1940E39 - Polka-Dot Puss_scene057.mp4": "一只棕色的小老鼠坐在地上，用前爪抓着一条蓝色的带子，带子从画面右侧延伸出来。小老鼠的表情从专注逐渐变为困惑，然后又恢复专注。背景是浅蓝色的地面，左上角有一个棕色的家具底部。",
    "S1940E39 - Polka-Dot Puss_scene058.mp4": "汤姆猫手持一把剑，表情凶狠，随后表情变得惊讶。他抓起一只小老鼠，小老鼠看起来很害怕。汤姆猫看着小老鼠，表情从愤怒转为惊讶和困惑。",
    "S1940E39 - Polka-Dot Puss_scene059.mp4": "一只棕色的小老鼠被紧紧抓在猫的爪子里，表情痛苦，脸上不断出现红色的斑点，似乎正在遭受某种折磨或感染。",
    "S1940E39 - Polka-Dot Puss_scene060.mp4": "汤姆猫手持一把剑，将杰瑞鼠高高举起，表情愤怒。随后，汤姆松开手，杰瑞被抛向一旁。汤姆表情惊愕，随后转为狂喜，挥舞着拳头庆祝，最后转身跑开。",
    "S1940E39 - Polka-Dot Puss_scene061.mp4": "汤姆猫在浴室里慌张地洗手，然后开始乱喝各种瓶子里的液体，导致他全身被染成不同颜色，最后被诊断为麻疹，只能待在窗边。杰瑞鼠从窗外偷看汤姆猫。",
    "S1940E39 - Polka-Dot Puss_scene062.mp4": "一只棕色带红点的小猫坐在绿色沙发上，它先是伸展身体，然后拿起一个绿紫相间的扇子，用舌头舔着扇子，接着放下扇子，双手托腮，表情显得有些忧郁。随后，画面逐渐变暗，最后出现“The End”的字样。",
    "S1940E39 - Polka-Dot Puss_scene063.mp4": "视频显示了经典的动画片《猫和老鼠》（Tom and Jerry）的片尾画面。画面背景为红色，中央有一个明亮的黄色光圈，上面用蓝色字体写着“The End”。随后，画面下方逐渐出现“An M.G.M Tom and Jerry CARTOON”字样，以及“MADE IN HOLLYWOOD, U.S.A.”的制作信息。整个画面设计风格复古，充满20世纪中期好莱坞动画片的特色。",
    "S1940E39 - Polka-Dot Puss_scene064.mp4": "视频开始时显示了“An MGM Tom and Jerry Cartoon”标题，背景为红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑。"
}