{
    "S1950E51 - That's My Mommy_scene001.mp4": "画面展示了米高梅动画公司的标志，背景为深蓝色，标志中央是一只咆哮的狮子，上方写着“A METRO GOLDWYN MAYER”，下方是“CARTOON COLOR BY TECHNICOLOR”的字样，字体为黄色和红色。",
    "S1950E51 - That's My Mommy_scene002.mp4": "这是一个米高梅动画片的片头标志，背景为深蓝色，中央是一个咆哮的狮子头像，周围环绕着“METRO-GOLDWYN-MAYER”字样。下方是黄色的“CARTOON”字样，底部标注“COLOR BY TECHNICOLOR”，表明该动画采用特艺彩色技术制作。狮子头像在标志中逐渐张开嘴巴，表现出咆哮的姿态。",
    "S1950E51 - That's My Mommy_scene003.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面，其中汤姆猫和杰瑞鼠的形象出现在标题两侧。",
    "S1950E51 - That's My Mommy_scene004.mp4": "视频展示了经典动画《猫和老鼠》的标题画面，背景为蓝色，标题“Tom and Jerry”以黄色字体呈现，左侧是老鼠杰瑞，右侧是猫汤姆，两者都面带笑容。随后，画面中出现了一只小黄鸭在水中游动，同时叠加了文字“'That's My Mommy'”。",
    "S1950E51 - That's My Mommy_scene005.mp4": "视频展示了动画片《Tom and Jerry》的片头标题画面，标题为“That's My Mommy”，背景为蓝色，中间有一只黄色小鸭子在水中游动。随后，画面显示了制作人员名单，包括动画师、布局师、背景画家和音乐师等，最后是制片人和导演Joseph Barbera和William Hanna的名字。整个画面风格复古，充满经典动画的韵味。",
    "S1950E51 - That's My Mommy_scene006.mp4": "视频开头显示了“Produced and Directed by Joseph Barbera and William Hanna”的字样，随后画面转为黑暗，最后出现了一只鹅在谷仓里。",
    "S1950E51 - That's My Mommy_scene009.mp4": "一只棕色的小老鼠从红色谷仓的白色柱子后面探出头来，它先是小心翼翼地观察四周，然后开始奔跑，接着突然停下，张大嘴巴，似乎受到了惊吓。",
    "S1950E51 - That's My Mommy_scene010.mp4": "汤姆猫正在烤一只小鸡，但杰瑞鼠突然出现并偷走了小鸡。汤姆猫试图用盐和胡椒调味，结果火势失控，汤姆猫被火焰烧伤并逃跑了。",
    "S1950E51 - That's My Mommy_scene011.mp4": "一只小老鼠用棍子挑起一只小黄鸡，然后小黄鸡被甩了下来，小老鼠追着小黄鸡跑。",
    "S1950E51 - That's My Mommy_scene012.mp4": "一只黄色的小鸭子在红色墙壁和柱子旁的木地板上奔跑，它张开双臂，看起来很兴奋或快乐。",
    "S1950E51 - That's My Mommy_scene013.mp4": "汤姆猫坐在红色木箱前，手里拿着一根黑色羽毛，表情惊讶。一只黄色小鸡从画面下方跑来，撞到汤姆猫的腿上，然后爬到汤姆猫的身上，最后被汤姆猫叼在嘴里。",
    "S1950E51 - That's My Mommy_scene015.mp4": "一只老鼠拖着装有小黄鸭的浴缸奔跑，小黄鸭从浴缸中爬出并挂在椅子腿上，随后滑落并继续奔跑。",
    "S1950E51 - That's My Mommy_scene016.mp4": "一只棕色的小老鼠正吃力地扛着一个装满水的浅蓝色盆子，盆子边缘有白色的泡沫。小老鼠从画面右侧向左侧移动，经过一个墙角，墙角处有一个黄色的扫帚和一个绿色的簸箕。小老鼠表情紧张，四肢用力，似乎在躲避什么。",
    "S1950E51 - That's My Mommy_scene017.mp4": "一只黄色的小鸡在灰色的猫身上走动，猫张开嘴巴，小鸡在猫的身上移动，最后小鸡从猫身上飞走。",
    "S1950E51 - That's My Mommy_scene018.mp4": "一只黄色的小鸟站在橱柜上，手里拿着一个粉红色的水壶，它把水壶倾斜，水从壶嘴中流出。",
    "S1950E51 - That's My Mommy_scene019.mp4": "汤姆猫躺在地上，突然从上方喷出一股水流，浇在它身上，它被淋得湿透，表情痛苦，随后坐起来甩水。",
    "S1950E51 - That's My Mommy_scene020.mp4": "一只黄色的小鸭子在厨房的柜台上行走，随后被汤姆猫用爪子抓住并靠近观察。",
    "S1950E51 - That's My Mommy_scene023.mp4": "一只棕色的小老鼠从墙上的洞口探出头，试图偷吃挂在锁上的胡萝卜，但被突然出现的黄色小鸟用喙啄中，老鼠被吓跑，小鸟则紧追不舍，最终老鼠被小鸟抓住并拖入洞中。",
    "S1950E51 - That's My Mommy_scene024.mp4": "一只小鸭子从木板缝隙中探出头来，被一只拿着胡萝卜的棕色老鼠抓住。老鼠用胡萝卜威胁小鸭子，但小鸭子并不害怕，反而与老鼠对峙。老鼠试图用胡萝卜吓唬小鸭子，但小鸭子依然保持镇定。随后，老鼠将小鸭子推到一旁，自己则躲到一个蓝色的大书后面，小鸭子则站在原地，似乎在观察老鼠的举动。",
    "S1950E51 - That's My Mommy_scene025.mp4": "画面展示了一本打开的图画书，左侧页面标题为“Mother DUCK”，画着一只母鸭和一只小鸭子，背景是农场；右侧页面标题为“Mother CAT”，画着一只猫和一只小猫，背景是栅栏。一只黄色的小鸭子从画面下方出现，先是抬头看着书页，然后突然扑向右侧的猫，用嘴咬住猫的尾巴，猫显得惊讶。",
    "S1950E51 - That's My Mommy_scene026.mp4": "画面中有一本打开的书，左侧页标题为“Mother DUCK”，画着一只母鸭和小鸭；右侧页标题为“Mother CAT”，画着猫汤姆和小猫。一只棕色的小老鼠杰瑞从右侧走进画面，先是好奇地看着书，然后走向小鸭，用手指着书中的母鸭和母猫，似乎在与小鸭交流。小鸭先是张开双臂，随后指向书中的母猫，最后又指向书中的母鸭，像是在解释或讨论书中的内容。杰瑞和小鸭在书页前互动，而书中的母鸭和母猫则保持静态。背景是木质墙面和黄色的稻草堆。",
    "S1950E51 - That's My Mommy_scene027.mp4": "一只黄色的小鸭子从一本蓝色的书后飞出，随后消失在书的另一侧。接着，一只棕色的小老鼠从书后探出头来，站在书旁，表情显得有些惊讶和警惕。背景是一面木墙和一片金黄色的草地。",
    "S1950E51 - That's My Mommy_scene028.mp4": "汤姆猫在厨房里，看到一只小鸡从门外走进来。汤姆猫先是惊讶，然后表现出害怕和紧张，接着他迅速拿起桌上的一个黄色罐子，似乎想用它来对付小鸡。",
    "S1950E51 - That's My Mommy_scene029.mp4": "汤姆猫蹲在门边，手里拿着一个黄色的杯子和一个红色的物体。一只小老鼠从画面左侧跑过，汤姆猫看到后露出得意的笑容，然后用杯子盖住小老鼠，接着又用杯子把小老鼠盖住。",
    "S1950E51 - That's My Mommy_scene030.mp4": "汤姆猫将一排黄色带红盖的罐子逐个移开，最后只剩下一个罐子，并用绳子将这个罐子绑紧。",
    "S1950E51 - That's My Mommy_scene032.mp4": "视频中，一只黄色的小鸭子站在一本打开的食谱书旁边，书上写着“STEWED DUCK”的食谱。小鸭子先是好奇地阅读食谱，然后表情变得惊讶和困惑，似乎对食谱的内容感到不解或担忧。",
    "S1950E51 - That's My Mommy_scene034.mp4": "汤姆猫抱着一只黄色的小鸭子，先是开心地笑着，然后突然开始大哭，眼泪不断流下，小鸭子在他的怀里也显得很惊讶。",
    "S1950E51 - That's My Mommy_scene035.mp4": "一只小老鼠从井边探出头来，好奇地观察四周。",
    "S1950E51 - That's My Mommy_scene036.mp4": "一只棕色的小老鼠从画面左侧跑入，停在一本打开的食谱前，食谱标题为“STEWED DUCK”，小老鼠好奇地用爪子翻动书页。",
    "S1950E51 - That's My Mommy_scene037.mp4": "一只老鼠跑向厨房的锅子，跳上勺子，然后站在勺子上，看着锅里的食物。",
    "S1950E51 - That's My Mommy_scene038.mp4": "一只棕色的小老鼠从窗帘后探出头来，然后跳到窗台上，接着沿着窗台跑向画面左侧。窗外是绿色的草地和一座红色的谷仓，背景是几棵高大的树木。",
    "S1950E51 - That's My Mommy_scene039.mp4": "在池塘中，汤姆猫和一只小黄鸭正在互动。汤姆猫面带微笑，身体微微前倾，似乎在与小黄鸭玩耍。小黄鸭则在水中游动，显得活泼可爱。背景是茂密的芦苇和一棵大树，池塘边还有几朵紫色的莲花。整个画面充满了温馨和欢乐的氛围。",
    "S1950E51 - That's My Mommy_scene040.mp4": "一只黄色的小鸭子在水中游泳，它先是闭着眼睛，然后睁开眼睛并张开嘴巴，似乎在唱歌或叫喊。接着，它又闭上眼睛，继续游泳。最后，画面逐渐变暗，出现“THE END”的字样，表明视频结束。",
    "S1950E51 - That's My Mommy_scene041.mp4": "视频展示了“An MGM Tom and Jerry Cartoon”标题，背景为红色和金色渐变，文字为蓝色和白色，下方标注“MADE IN HOLLYWOOD, U.S.A.”，随后画面变黑。"
}