{
    "S1940E45 - Jerry's Diary_scene001.mp4": "视频展示了米高梅动画的标志，背景为深红色，标志中央是一个咆哮的狮子，下方有“CARTOON”字样和“COLOR BY Technicolor”的文字。",
    "S1940E45 - Jerry's Diary_scene002.mp4": "视频展示了米高梅动画公司的标志，一只狮子在红色背景上咆哮，随后画面转黑，接着出现“TOM and JERRY”的标题。",
    "S1940E45 - Jerry's Diary_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头画面。画面中央是大猫汤姆和小老鼠杰瑞的卡通形象，汤姆张大嘴巴，表情夸张，杰瑞则在旁边做出调皮的动作。背景是红色渐变的同心圆图案，下方是黄色的“TOM and JERRY”标题字样。随后，画面中出现了“DIRECTED by WILLIAM HANNA and JOSEPH BARBERA”的导演署名。整个画面色彩鲜明，充满卡通风格。",
    "S1940E45 - Jerry's Diary_scene004.mp4": "视频展示了《Jerry's Diary》的片头，以一本日记本为中心，上面写着“Jerry's Diary”，并逐渐显示制作人员信息，包括导演William Hanna和Joseph Barbera，动画师Kenneth Muse和Ed Barge，音乐由Scott Bradley负责，制片人是Fred Quimby。背景为深色，突出了日记本和文字。最后画面逐渐变暗。",
    "S1940E45 - Jerry's Diary_scene005.mp4": "猫汤姆从洞口探出头，然后跳入房间，手里拿着各种捕鼠工具。他将工具一一摆放在洞口前，最后举起一把大刀，准备对付从洞里出来的老鼠。",
    "S1940E45 - Jerry's Diary_scene006.mp4": "一个绿色的机器人坐在蓝色的桌子上，它有圆形的眼睛和微笑的嘴巴。机器人的眼睛在不断转动，嘴巴也在微微张合，似乎在说话或表达情绪。背景是一面浅色的墙，墙上挂着一幅画，旁边有一盏紫色的台灯。",
    "S1940E45 - Jerry's Diary_scene007.mp4": "一只灰色的猫，手持一把大刀，先是面带微笑，随后用爪子遮住眼睛，表情变得凶狠，似乎在思考或策划什么。背景是单一的浅黄色。",
    "S1940E45 - Jerry's Diary_scene008.mp4": "一个绿色的机器人坐在蓝色的桌子上，它的嘴巴在不断开合，似乎在说话或唱歌。机器人旁边有一盏紫色的台灯，背景是米色的墙壁和一幅画。",
    "S1940E45 - Jerry's Diary_scene009.mp4": "汤姆猫手持一把大菜刀，先是用手指擦拭刀刃，然后将刀握紧，表情专注。接着，他将刀举到面前，似乎在检查刀的状态。最后，他将刀背朝向自己，做出一个挥刀的动作，但并未真正挥出，只是轻轻晃动了一下。整个过程中，汤姆猫的表情从专注变为得意，最后又恢复平静。背景是单一的浅黄色。",
    "S1940E45 - Jerry's Diary_scene010.mp4": "一个绿色的行李箱，放在蓝色的桌子上，行李箱上有两个眼睛和一个微笑的嘴巴，它在不断地眨眼睛和微笑。",
    "S1940E45 - Jerry's Diary_scene011.mp4": "动画片中的汤姆猫，手持一把大菜刀，先是眯眼微笑，随后张大嘴巴露出开心的笑容，最后双手握拳，显得非常兴奋和得意。",
    "S1940E45 - Jerry's Diary_scene012.mp4": "汤姆猫在房间里，先是拿着斧头和捕鼠器，然后变成拿着花束和礼物盒，最后放下礼物，用爪子拍打墙上的通风口，把通风口拆下来。",
    "S1940E45 - Jerry's Diary_scene013.mp4": "这是一个动画片段，展示了一个木屋内部的场景。画面开始时，一只猫（汤姆）从窗户探头，表情好奇。镜头逐渐向右平移，展示了屋内的细节，包括一盏台灯、一个杯子、一个装有食物的盒子、一盆花和一个壁挂钟。接着，镜头继续向右移动，聚焦到一张桌子上，上面有一本名为《我的日记，杰瑞鼠》的红色日记本、一支羽毛笔和一个墨水瓶。桌上的台灯灯罩上有一个问号和数字“6”。整个场景温馨而宁静，光线柔和，营造出一种安静的氛围。",
    "S1940E45 - Jerry's Diary_scene014.mp4": "汤姆猫从墙洞中探出头，表情惊讶，随后从洞中取出一本红色的书，脸上露出开心的笑容。",
    "S1940E45 - Jerry's Diary_scene015.mp4": "画面中，一只老鼠的双手捧着一本红色封面的日记本，封面上写着“My Diary JERRY MOUSE”。背景为单一的浅黄色。",
    "S1940E45 - Jerry's Diary_scene016.mp4": "汤姆猫拿着一本红色的书，站在墙边的通风口旁。他先是开心地笑着，然后表情变得严肃，接着又露出微笑。他打开书，开始阅读，神情专注。",
    "S1940E45 - Jerry's Diary_scene017.mp4": "视频片段展示了一本打开的日记，记录了4月5日星期天，汤姆和杰瑞打高尔夫球的活动，汤姆没有带球杆，杰瑞代替他打球。随后画面切换到夜晚的户外场景，杰瑞在草地上奔跑，而汤姆的手从上方伸下来，似乎要抓住他。",
    "S1940E45 - Jerry's Diary_scene018.mp4": "一只小老鼠在草地上，被一只巨大的高尔夫球杆击中头部，球杆的头部在小老鼠头上方晃动。随后，小老鼠头上顶着一个高尔夫球，球杆在它旁边晃动，小老鼠看起来很紧张，最后它张大嘴巴，似乎在尖叫或惊讶。",
    "S1940E45 - Jerry's Diary_scene019.mp4": "一个巨大的坑洞正在形成，泥土和碎石从坑壁上掉落，坑洞边缘的草丛被破坏，背景中可以看到树木和天空。",
    "S1940E45 - Jerry's Diary_scene020.mp4": "汤姆猫手持高尔夫球杆，准备击球。杰瑞鼠站在球杆的杆头上，手里拿着一个高尔夫球，表情得意。汤姆猫专注地盯着杰瑞鼠和球，随后挥杆击球，杰瑞鼠被击打后向后退去。",
    "S1940E45 - Jerry's Diary_scene021.mp4": "在户外的草地上，一个标有“BALL CLEANER”的清洁箱旁，杰瑞被高尔夫球杆击中后落入箱内。汤姆看到后，兴奋地伸手去抓杰瑞，结果被箱内的水溅了一身，表情从得意转为惊讶和狼狈。随后画面转黑，接着切换到汤姆在室内安静地读书的场景。",
    "S1940E45 - Jerry's Diary_scene022.mp4": "汤姆猫坐在地上，手里拿着一本红色的书，正在阅读。他先是开心地大笑，然后又继续看书，表情专注。他的周围有一些礼物和鲜花，背景是一面黄色的墙和一个窗户。",
    "S1940E45 - Jerry's Diary_scene023.mp4": "一只黑猫坐在地上，手里拿着一本书在阅读。它周围有一些礼物和花。随后画面变黑，接着黑猫出现在户外，手持一根棍子，抬头望天。",
    "S1940E45 - Jerry's Diary_scene024.mp4": "在户外的高尔夫球场上，汤姆猫正准备挥杆击球。他双手紧握球杆，身体后仰，眼睛紧盯着前方的高尔夫球。突然，杰瑞鼠从球杆下方钻出，手里拿着一个高尔夫球，挡在了汤姆面前。汤姆猫被杰瑞鼠的举动惊得张大了嘴巴，但很快又露出得意的笑容，继续挥杆击球。杰瑞鼠则一脸得意地看着汤姆猫。",
    "S1940E45 - Jerry's Diary_scene025.mp4": "画面中，天空呈现蓝白渐变，下方有几棵松树。一个白色圆形物体从画面左侧缓缓升起，逐渐变大，最终占据画面大部分空间。",
    "S1940E45 - Jerry's Diary_scene026.mp4": "画面展示了一个宁静的自然景观，蓝天白云下，绿色的山丘和树木环绕。一个圆形物体从天空中缓缓飘落，最终停在山丘上。",
    "S1940E45 - Jerry's Diary_scene028.mp4": "动画片中的汤姆猫手持滑雪杖，面带微笑，随后突然张大嘴巴，似乎在大声喊叫，同时身体和衣物上出现雪花和冰块飞溅的效果，表现出他在寒冷环境中的惊讶或激动。",
    "S1940E45 - Jerry's Diary_scene029.mp4": "动画片段中，汤姆猫在夜晚张大嘴巴，似乎在大声喊叫，手中握着一根棍子。随后画面变黑，接着汤姆猫在昏暗的环境中低头阅读一本红色的书。",
    "S1940E45 - Jerry's Diary_scene030.mp4": "汤姆猫正在认真地阅读一本红色封面的书，他表情专注，不时翻动书页。",
    "S1940E45 - Jerry's Diary_scene031.mp4": "视频展示了一本打开的日记，日期为5月12日星期四。日记中写着：“今天刮了胡子——他们说好奇心害死猫——今天它差点抓到了老鼠——！”日记的边框上有火车、帆船等图案，右侧有一只卡通手握着书页。",
    "S1940E45 - Jerry's Diary_scene032.mp4": "动画片段中，汤姆猫在房间里，从门后探出头来，表情紧张，似乎在躲避什么。画面切换到一本打开的日记本，上面写着“5月12日，星期四：今天差点被剃须刀刮到——他们说好奇心害死猫，今天它差点害了老鼠！”最后画面变黑。",
    "S1940E45 - Jerry's Diary_scene033.mp4": "一只黑猫汤姆抱着一本书走进房间，把书放在地上，然后躺在书上，开始阅读。他读得非常开心，不时发出笑声，还做出各种夸张的表情和动作，比如张大嘴巴、挥舞爪子、打滚等。整个过程充满了欢乐和幽默。",
    "S1940E45 - Jerry's Diary_scene034.mp4": "一只小老鼠从墙洞里探出头来，然后小心翼翼地爬出来，最后跑开了。",
    "S1940E45 - Jerry's Diary_scene035.mp4": "一只黑猫躺在地板上，正在打哈欠，旁边有一只小老鼠。小老鼠靠近黑猫，黑猫突然抓住书本，把书本翻转，然后翻身，把小老鼠压在身下。小老鼠试图逃跑，但黑猫用爪子抓住它，最后黑猫把小老鼠压在身下，小老鼠被压得动弹不得。",
    "S1940E45 - Jerry's Diary_scene036.mp4": "一只黑猫躺在地上，正在阅读一本打开的书，一只小老鼠在书旁边。黑猫先是大笑，然后表情变得严肃，接着把书合上，抱在怀里，转身背对小老鼠，最后小老鼠爬到黑猫的背上，黑猫继续阅读。",
    "S1940E45 - Jerry's Diary_scene037.mp4": "一只黑猫坐在地板上，面前摊开一本书，它开心地笑着。一只小老鼠从猫的怀里跳出来，站在书上，然后猫突然变得愤怒，抓起书本，表情狰狞，似乎要对小老鼠采取行动。",
    "S1940E45 - Jerry's Diary_scene038.mp4": "视频中，一只黑猫（汤姆）先是兴奋地搓手，然后用爪子捧起一只小老鼠（杰瑞）。汤姆温柔地抱着杰瑞，杰瑞则表现出害怕和抗拒。随后，杰瑞突然反抗，抓着汤姆的鼻子，最终从汤姆手中挣脱，飞向空中，而汤姆则大喊大叫，显得非常惊讶和懊恼。",
    "S1940E45 - Jerry's Diary_scene039.mp4": "一只黑色的猫正在打喷嚏，一只棕色的小老鼠在空中飞舞。随后画面变黑，接着出现一只猫正在阅读一本书。",
    "S1940E45 - Jerry's Diary_scene040.mp4": "汤姆猫拿着一本红色的书，先是翻阅，然后闻了闻一束蓝色的花，接着被花刺扎到，最后继续读书。",
    "S1940E45 - Jerry's Diary_scene041.mp4": "视频开始时展示了一本打开的日记，记录着6月3日星期一的内容，提到为Tom准备惊喜，他以为是意外。随后场景切换到厨房，Jerry在熨衣板上奔跑，不小心跳到橱柜上，Tom从后面跳出来试图抓住Jerry，但Jerry敏捷地躲开了。",
    "S1940E45 - Jerry's Diary_scene042.mp4": "一只老鼠从上方跳入水槽，溅起水花。它抓住水龙头的链子，拉起水龙头，导致水槽中的碗碟被冲散。随后，一只猫从上方跌入水槽，被碗碟碎片包围，最终被卡在水槽中。",
    "S1940E45 - Jerry's Diary_scene043.mp4": "一只老鼠从窗户跳进来，迅速跑向一个木板，用尾巴勾住木板并将其推倒。随后，一只猫从窗户探出头，伸出长长的舌头试图捕捉老鼠，但老鼠已经逃走了。猫的表情显得非常惊讶和失望。",
    "S1940E45 - Jerry's Diary_scene044.mp4": "汤姆猫正在阅读一本书，随着阅读内容的推进，他的表情逐渐变得愤怒，毛发竖起，头上冒出怒气符号，最终他愤怒地将书摔在地上。",
    "S1940E45 - Jerry's Diary_scene045.mp4": "一只猫拿着一本书，试图用书挡住从洞里伸出的爪子。它跳起来，书被扔出去，蛋糕和礼物散落一地。猫重新站稳，举起书，然后打开书阅读。",
    "S1940E45 - Jerry's Diary_scene046.mp4": "视频开始展示一本打开的日历，日期为7月4日星期六，页面上写着“今天有大量烟花。事情真正开始变得热闹起来，当汤姆点燃了一个鞭炮并朝我扔来时——”。随后画面变黑，接着出现一个戴着帽子、手持工具的猫，周围散落着烟花和工具，场景显得昏暗。",
    "S1940E45 - Jerry's Diary_scene047.mp4": "一只戴着安全帽的猫在仓库中点燃了一根烟花，烟花爆炸后猫被吓了一跳，随后又恢复了镇定。",
    "S1940E45 - Jerry's Diary_scene048.mp4": "在一个昏暗的地下室里，一只小老鼠从洞口跑出来，发现地上有一个红色的圆筒状物体。它好奇地靠近，用爪子拨弄这个物体，结果物体突然爆炸，小老鼠被炸飞出去，最后它重新站稳，继续在地下室里四处张望。",
    "S1940E45 - Jerry's Diary_scene049.mp4": "在昏暗的仓库中，汤姆猫从木箱后探出头，看到地上一根点燃的红色火柴。他吓得后退，接着又小心翼翼地靠近，试图用爪子去抓火柴，但火柴却突然爆炸，汤姆被吓得跳了起来。",
    "S1940E45 - Jerry's Diary_scene050.mp4": "一只小老鼠拿着红色的喷火器在雪地里奔跑，喷火器喷出火花，小老鼠被火花吓到，向洞穴跑去。",
    "S1940E45 - Jerry's Diary_scene051.mp4": "汤姆猫在地下室里，手里拿着一个正在燃烧的红色火柴，他惊慌失措地四处乱跳，试图躲避火柴的火花。",
    "S1940E45 - Jerry's Diary_scene052.mp4": "在一个昏暗的房间里，一只小老鼠拿着一个点燃的烟花，不断向一只黑猫扔去。黑猫被烟花吓到，不断后退和躲避，但始终无法摆脱烟花的干扰。小老鼠则显得非常得意，继续不断地扔烟花，而黑猫则被烟花的火花和声响弄得手忙脚乱，最终只能无奈地坐在地上，看着烟花在空中飞舞。",
    "S1940E45 - Jerry's Diary_scene054.mp4": "在一间昏暗的地下室里，一只小老鼠杰瑞从角落里跑出来，躲进一个大茶壶后面。这时，猫汤姆从上方跳下来，手里拿着一个红色的瓶子，他把瓶子倒进茶壶里，然后坐到茶壶上，露出得意的笑容。",
    "S1940E45 - Jerry's Diary_scene055.mp4": "一只棕色的小老鼠站在一个红色的圆柱形物体旁，该物体的引线正在燃烧并冒出火花。小老鼠看起来很紧张，随后迅速跑向左侧的一个圆形开口并钻了进去，消失在画面中。",
    "S1940E45 - Jerry's Diary_scene056.mp4": "一只小老鼠从茶壶的壶嘴中探出头来，随后跳下。猫汤姆站在茶壶后面，表情愤怒，双手握拳。他伸手拿起茶壶盖，然后将盖子盖在自己头上，结果被蒸汽喷出，身体膨胀成一朵花的形状，表情痛苦。最后，汤姆变成一朵花，眼睛睁大，嘴巴张开，显得非常惊恐。",
    "S1940E45 - Jerry's Diary_scene057.mp4": "汤姆猫正在读一本红色的书，突然他生气地撕毁了书页，然后愤怒地跳起来，最后站在地上，拳头紧握，显得非常生气。旁边有一个写着“致杰瑞，以爱”的派。",
    "S1940E45 - Jerry's Diary_scene058.mp4": "一只棕色的小老鼠在房间内奔跑，它从角落跑向画面中央，然后停下，张开双臂，露出开心的表情。房间内有桌子和柜子，地面铺着紫色地毯。",
    "S1940E45 - Jerry's Diary_scene059.mp4": "一只猫站在一个写着“To Jerry With Love”的派旁边，一只老鼠从洞里跑出来，停在派前，看着猫。",
    "S1940E45 - Jerry's Diary_scene060.mp4": "动画片中的猫汤姆在黄色背景前做出一系列夸张的肢体动作，包括弯腰、伸展双臂、挥舞爪子和转动头部，表情显得非常生气和不满。",
    "S1940E45 - Jerry's Diary_scene061.mp4": "一个绿色的机器人坐在蓝色的桌子上，它的眼睛和嘴巴在不断变化，似乎在说话或表达情绪。背景中有一盏紫色的台灯和一幅画。",
    "S1940E45 - Jerry's Diary_scene062.mp4": "动画片中的猫汤姆先是做出得意的表情，随后拿出一个装满红色果酱的派，他不断舔嘴唇，露出兴奋和贪婪的表情，最后将派举高，准备享用。",
    "S1940E45 - Jerry's Diary_scene063.mp4": "猫汤姆拿着一个派，面对着老鼠杰瑞。杰瑞挑衅地站在洞口前。汤姆生气地把派扔向杰瑞，派在空中破裂，红色的果酱溅出，杰瑞被果酱包围。汤姆落地后，愤怒地挥舞着爪子。",
    "S1940E45 - Jerry's Diary_scene064.mp4": "一只小老鼠被红色液体包围，它挣扎着从液体中浮出，表情惊恐。随后，它坐在液体中，看起来很害怕。最后，画面通过一个圆形的镜头逐渐变暗，最终完全变黑，出现“The End”字样。",
    "S1940E45 - Jerry's Diary_scene065.mp4": "视频显示了“THE END”字样，随后过渡到“An MGM Tom and Jerry CARTOON”的标题画面，背景为红色，文字为蓝色和白色，具有复古卡通风格。"
}