{
    "S1950E05 - Safety Second_scene001.mp4": "画面从全黑开始，随后出现一个深蓝色背景，中央是一个圆形徽章，徽章内有模糊的卡通人物形象。徽章下方有文字“A METRO-GOLDWYN-MAYER CARTOON”，并注明“COLOR BY TECHNICOLOR”。整体呈现经典动画片头风格。",
    "S1950E05 - Safety Second_scene002.mp4": "这是一个米高梅卡通片头，背景为深蓝色，中央有一个圆形框，框内是一只咆哮的狮子，狮子上方有“A METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”字样，底部标注“COLOR BY TECHNICOLOR”。狮子在画面中不断张合嘴巴，表现出咆哮的动作。",
    "S1950E05 - Safety Second_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现《猫和老鼠》的标题画面，画面中汤姆猫和杰瑞鼠的形象出现。",
    "S1950E05 - Safety Second_scene004.mp4": "这是一个《猫和老鼠》动画片的片头，标题为“Safety Second”，由威廉·汉纳和约瑟夫·巴伯拉执导，动画师包括雷·帕特森、埃德·巴奇、肯尼斯·穆斯、欧文·斯宾塞和阿尔·格兰德曼，音乐由斯科特·布拉德利创作，由弗雷德·奎姆比制作。画面背景为蓝色，左侧有一个燃烧的红色火柴，文字以黄色呈现。",
    "S1950E05 - Safety Second_scene005.mp4": "画面展示了一个宁静的乡村场景，阳光洒在一座小屋上，屋前有绿色的草地和一些植物。镜头逐渐拉近，小屋的门上挂着一个红色的小灯笼，屋内可以看到两只小动物——一只老鼠和一只猫，它们正躺在床上睡觉。老鼠的床铺上写着“JERRY”，猫的床铺上写着“NIBBLES”。整个场景显得非常安静和平和。",
    "S1950E05 - Safety Second_scene006.mp4": "在昏暗的房间里，两只老鼠分别躺在两张床上。左边的老鼠叫杰瑞，右边的老鼠叫尼布尔斯。杰瑞醒来后伸了个懒腰，然后坐起来，张大嘴巴打了个哈欠，接着又躺下继续睡觉。尼布尔斯则一直睡得很香。",
    "S1950E05 - Safety Second_scene007.mp4": "一个挂在木墙上的日历，显示“七月四日”，下方写着“让这一天安全而理智”。",
    "S1950E05 - Safety Second_scene008.mp4": "在一间昏暗的房间里，两只老鼠分别躺在各自的床上。棕色老鼠在床上兴奋地指着灰色老鼠，灰色老鼠起初在睡觉，随后被惊醒，从床上跳下来，穿着尿布，开心地跑向房间角落挂着的“七月四日”海报。棕色老鼠则在一旁惊讶地看着。",
    "S1950E05 - Safety Second_scene009.mp4": "一只小老鼠小心翼翼地从一扇门后探出头来，然后拖着一个装满各种烟花的纸箱走出。",
    "S1950E05 - Safety Second_scene010.mp4": "一只棕色的小老鼠在房间里，突然另一只小老鼠提着装满彩色烟花的箱子从右侧进入画面，棕色小老鼠被吓了一跳，然后转身逃跑，而提箱子的小老鼠跟在后面。",
    "S1950E05 - Safety Second_scene011.mp4": "一只穿着尿布的小老鼠在地板上睡觉，它先是侧躺着，然后翻身仰卧，接着又翻回侧躺，最后睁开眼睛，警觉地环顾四周。",
    "S1950E05 - Safety Second_scene012.mp4": "一只棕色老鼠背着装满彩色鞭炮的纸箱，小心翼翼地走动，然后突然将纸箱扔掉，转身面对一只灰色小老鼠。棕色老鼠生气地抓住灰色小老鼠，将其抱起并拖走。",
    "S1950E05 - Safety Second_scene013.mp4": "视频中，一只棕色老鼠抱着一只灰色老鼠，站在一个写着“JULY 4 MAKE IT SAFE AND SANE”的日历旁边。棕色老鼠表情愤怒，指着日历，似乎在对灰色老鼠说话或警告它。灰色老鼠则显得有些害怕或无奈，被棕色老鼠紧紧抱着。背景是一个木制的墙壁，上方有一个破洞，整体氛围紧张。",
    "S1950E05 - Safety Second_scene014.mp4": "一只棕色老鼠从洞中走出，手持一个绿色的工具和一个红白条纹的管子，看起来像是在庆祝或进行某种活动。它面带微笑，显得非常开心。随后，一只灰色的小老鼠从洞中爬出，手里拿着一个蓝色的瓶子，似乎在喝东西。棕色老鼠继续挥舞着工具，看起来非常兴奋，而灰色小老鼠则静静地坐在地上，继续喝着瓶中的液体。背景中可以看到一盏红色的灯笼和一些粉红色的花朵，营造出一种节日或庆祝的氛围。",
    "S1950E05 - Safety Second_scene015.mp4": "一只穿着尿布的小老鼠拿着一个彩色的喇叭，先是用喇叭吹，然后放下喇叭，拿出一个红色的烟花棒点燃，烟花棒点燃后发出火花。",
    "S1950E05 - Safety Second_scene016.mp4": "两只老鼠在户外玩耍，一只棕色老鼠拿着一个大烟花筒，另一只灰色小老鼠拿着一个正在燃烧的烟花棒。棕色老鼠兴奋地将烟花筒对准自己，然后被烟花的声响吓到，跳了起来。接着，它抢过小老鼠手中的烟花棒，开始兴奋地挥舞，烟花棒在空中划出火花，棕色老鼠在火花中跳跃和旋转，显得非常开心。小老鼠则在一旁看着，表情从惊讶到无奈。",
    "S1950E05 - Safety Second_scene018.mp4": "视频中，一只大老鼠和一只小老鼠在户外相遇。大老鼠头上顶着一个红色的物体，看起来有些紧张或不安。小老鼠则显得比较好奇和活泼。大老鼠试图与小老鼠互动，似乎在试图说服或邀请小老鼠做某事。小老鼠表现出一些犹豫，但最终还是接受了大老鼠的邀请。随后，大老鼠和小老鼠一起在草地上玩耍，周围散落着许多红色的物体，看起来像是爆竹或烟花。整个场景充满了欢乐和轻松的氛围。",
    "S1950E05 - Safety Second_scene019.mp4": "在一个木屋房间内，一只小老鼠从床边拿起一个点燃的烟花，然后被一只大猫从上方扑下。大猫被烟花的火花吓到，而小老鼠则惊慌失措地逃跑。",
    "S1950E05 - Safety Second_scene020.mp4": "一只老鼠站在洞穴门口，手里拿着一个红色的物体，表情愤怒。它转身面对镜头，挥舞着手臂，似乎在表达不满或威胁。背景中可以看到一扇绿色的门和一个挂在墙上的圆形镜子。",
    "S1950E05 - Safety Second_scene021.mp4": "一只名叫Nibbles的小老鼠从床上坐起，然后躺下盖好被子睡觉。",
    "S1950E05 - Safety Second_scene022.mp4": "视频中，一只老鼠从洞穴中走出，来到户外的吊床上躺下休息。这时，一只猫悄悄出现，手里拿着一个点燃的烟花，准备在老鼠身边制造惊吓。老鼠似乎没有察觉到猫的接近，继续悠闲地躺在吊床上。猫则在老鼠身边点燃烟花，试图吓唬老鼠。整个场景充满了紧张和幽默的氛围。",
    "S1950E05 - Safety Second_scene023.mp4": "动画片中的汤姆猫站在树干旁，双手捂住耳朵，脸上露出开心的笑容。背景颜色在不同帧中变化，从蓝色到橙色再到红色，最后变为深蓝色。",
    "S1950E05 - Safety Second_scene024.mp4": "视频中，汤姆猫躺在树下，显得非常疲惫和放松。杰瑞鼠从树后悄悄出现，先是靠近汤姆，然后用鼻子轻轻触碰汤姆的脸。汤姆被惊醒，愤怒地瞪着杰瑞，但杰瑞却毫不畏惧，反而挑衅地靠近。汤姆试图抓住杰瑞，但杰瑞敏捷地躲开，还用爪子轻轻拍打汤姆的脸。汤姆被激怒，开始追逐杰瑞，但杰瑞灵活地在树根和草地上穿梭，始终不被抓住。汤姆的愤怒和杰瑞的机智形成了鲜明的对比，整个场景充满了幽默和紧张感。",
    "S1950E05 - Safety Second_scene025.mp4": "在房屋后院的草坪上，一只棕色的小老鼠从排水管旁跑过，随后一只蓝灰色的猫从空中扑向老鼠，但猫在扑击过程中滑倒并摔倒在地，最终消失在画面中。",
    "S1950E05 - Safety Second_scene026.mp4": "一只灰色的小老鼠从拱形门洞中探出头来，门洞上方挂着一盏红色的灯笼。另一只棕色老鼠从门洞外跑过，灰色小老鼠被吓了一跳，缩回门洞里。随后，一只大猫从门洞外快速跑过，灰色小老鼠再次探出头来，紧张地观察着。",
    "S1950E05 - Safety Second_scene027.mp4": "一只老鼠杰瑞在院子里奔跑，突然钻进一个洞里。猫汤姆从水管里滑出，愤怒地扑向洞口，但没有抓到老鼠。汤姆随后拿起一把铲子，用力挖掘洞口，试图把老鼠挖出来。",
    "S1950E05 - Safety Second_scene028.mp4": "一只灰色的小老鼠从洞口探出头来，随后迅速跑进洞里。接着，一个巨大的红色蜡笔从洞中滚出，小老鼠被蜡笔推着滚出洞外，最终蜡笔滚出了画面。",
    "S1950E05 - Safety Second_scene029.mp4": "一只小老鼠从一根绿色的排水管中滚出，它拖着一个红色的火箭，火箭点燃后喷出火焰和黑烟，小老鼠被推得向后退去。",
    "S1950E05 - Safety Second_scene030.mp4": "一个灰色的排水管从黄色的墙壁上延伸出来，镜头逐渐拉远，显示排水管连接到屋顶。排水管突然喷出红色的液体和黄色的星星，液体和星星向右上方飞溅，最终消失在画面右侧的树丛中。",
    "S1950E05 - Safety Second_scene031.mp4": "一根管道在建筑物外壁上发生破裂，破裂处迸发出火花和碎片。",
    "S1950E05 - Safety Second_scene032.mp4": "汤姆猫在院子里挥舞着一把蓝色的镐子，用力挖掘地面，泥土飞溅。突然，他被自己的镐子击中，整个人被弹飞出去，身体在空中划出一道红色的轨迹，周围有星星闪烁。最后，汤姆猫倒在地上，镐子也飞了出去。",
    "S1950E05 - Safety Second_scene033.mp4": "汤姆猫骑在一枚红色火箭上，火箭喷射着火焰，他在空中快速飞行，表情兴奋。背景是蓝天和绿色地面。",
    "S1950E05 - Safety Second_scene034.mp4": "汤姆猫从晾衣绳上滑落，摔在草地上，舌头伸出，表情痛苦。",
    "S1950E05 - Safety Second_scene035.mp4": "一只老鼠从木制工作台旁跑过，跳进一个木桶里。一只猫从木桶后面冲出来，试图抓住老鼠，但老鼠已经躲进桶里。猫愤怒地用爪子拍打木桶，试图把老鼠弄出来，最后猫把桶盖盖上，把老鼠关在了里面。",
    "S1950E05 - Safety Second_scene036.mp4": "一只穿着尿布的小老鼠从洞口爬出，来到一个装有胶水瓶和烟花的房间。它用火柴点燃胶水瓶，然后将胶水涂在一根红色的烟花上，接着又涂在另一根烟花上，最后把涂满胶水的烟花推倒，导致烟花滚落。",
    "S1950E05 - Safety Second_scene037.mp4": "一只小老鼠推着一个热狗形状的物体，靠近一只大猫的脚边。",
    "S1950E05 - Safety Second_scene038.mp4": "汤姆猫在院子里，用木桶盖子压住一个红色的爆竹，然后点燃爆竹，结果爆竹爆炸，汤姆被炸飞出去，杰瑞老鼠在一旁观看。",
    "S1950E05 - Safety Second_scene039.mp4": "汤姆猫拿着一个正在燃烧的烟花棒，他一边跑一边躲避烟花的火花，最终被烟花的爆炸声和烟雾击中，被埋在花盆里，花盆里长满了鲜花。",
    "S1950E05 - Safety Second_scene040.mp4": "一只小老鼠在院子里奔跑，突然被一只大猫从后面追上并摔倒在地。小老鼠迅速躲进一个木桶里，大猫则在地上翻滚，试图抓住它。",
    "S1950E05 - Safety Second_scene041.mp4": "一只灰色的小老鼠从墙角跑出来，在草地上奔跑，随后消失在画面右侧。",
    "S1950E05 - Safety Second_scene042.mp4": "一只小老鼠出现在画面中，它靠近一个红色的圆柱形烟花，用爪子拨开烟花的盖子，露出里面的黑色火药。它点燃了烟花的引线，引线开始冒火花，小老鼠被吓得后退，烟花开始滚动，最终滚出画面。",
    "S1950E05 - Safety Second_scene043.mp4": "汤姆猫在院子里奔跑，突然被一个红色的燃烧物绊倒，他惊慌失措地向前扑倒，身体在空中翻滚，四肢张开，表情惊恐，最终摔倒在地。",
    "S1950E05 - Safety Second_scene044.mp4": "一只猫在院子里奔跑，突然被一个点燃的红色烟花吓到，它惊慌失措地后退，然后蹲下观察烟花，烟花燃尽后冒出黑烟。",
    "S1950E05 - Safety Second_scene045.mp4": "猫汤姆蹲在草地上，盯着一个红色圆筒。圆筒翻倒，露出里面的小老鼠杰瑞。汤姆愤怒地扑向圆筒，但杰瑞从里面逃出。杰瑞点燃了圆筒，汤姆被吓得后退。杰瑞拿着点燃的圆筒，汤姆吓得张大嘴巴。圆筒爆炸，汤姆被炸飞。杰瑞得意地站在原地，汤姆则一脸惊恐。",
    "S1950E05 - Safety Second_scene046.mp4": "汤姆猫在栅栏旁点燃了一根烟花棒，他先是开心地挥舞着烟花棒，然后将烟花棒放在鼻子上，烟花在鼻子上继续燃烧，汤姆猫享受着烟花带来的乐趣。",
    "S1950E05 - Safety Second_scene047.mp4": "视频展示了一个爆炸效果，从橙黄色背景中的黑色爆炸图案开始，逐渐过渡到完全黑色的爆炸云朵，最后爆炸云朵逐渐消散，画面变暗。",
    "S1950E05 - Safety Second_scene048.mp4": "两只老鼠在草地上奔跑，随后躲进墙洞。猫拿着烟花追赶，但被烟花绊倒，烟花散落一地。猫试图用桶挡住烟花，但最终失败，烟花在草地上爆炸。",
    "S1950E05 - Safety Second_scene049.mp4": "一只小老鼠从洞里探出头，手里拿着点燃的火柴，小心翼翼地靠近一堆鞭炮，然后点燃了地上的黑火药，火药爆炸后，小老鼠被吓得后退。",
    "S1950E05 - Safety Second_scene050.mp4": "汤姆猫在院子里用火柴点燃了一个装满油的桶，导致桶起火燃烧。汤姆猫惊慌失措地逃跑，但最终被爆炸的冲击波抛入空中，掉进一个大坑里。",
    "S1950E05 - Safety Second_scene051.mp4": "在院子里，汤姆追逐杰瑞，但被杰瑞用自制的炮击中，汤姆被击飞出去，最后被炮弹击中并飞出画面。",
    "S1950E05 - Safety Second_scene052.mp4": "视频中，汤姆猫试图用激光枪击中一个木桶，但激光被木桶反射，击中了汤姆自己，导致他受伤。随后，汤姆猫躲进木桶后，继续用激光枪射击，但激光再次被反射，击中了房屋的窗户。汤姆猫从窗户探出头，看到杰瑞鼠和另一只老鼠正在点燃烟花，汤姆猫试图偷袭，但被杰瑞鼠发现并逃跑。最后，汤姆猫从窗户跳出来，追击杰瑞鼠。",
    "S1950E05 - Safety Second_scene053.mp4": "两只老鼠推着一个点燃的红色火箭筒，火箭筒撞上一个木桶后爆炸，猫汤姆出现并抢走火箭筒，结果被火箭筒喷出的火焰和黑烟熏倒，两只老鼠趁机逃跑。",
    "S1950E05 - Safety Second_scene054.mp4": "动画片段中，汤姆猫被绑在火箭上，火箭升空后爆炸，随后天空中绽放出五彩缤纷的烟花。",
    "S1950E05 - Safety Second_scene055.mp4": "一只棕色的小老鼠在绿色的草地上奔跑，它看起来非常开心和兴奋。它跑向一个蓝色的柱子，然后停下来，用前爪捂住脸，似乎在笑或惊讶。接着，它张开嘴，露出牙齿，继续跳舞和摆动身体，表现出极大的喜悦和活力。背景是一堵浅色的墙，整个场景充满了卡通风格的欢乐氛围。",
    "S1950E05 - Safety Second_scene056.mp4": "一只小老鼠正在草地上玩烟花，点燃后火花四溅。这时，另一只大老鼠跑过来，看到烟花后显得非常兴奋，试图用嘴叼起烟花，但烟花仍在燃烧，火花四溅。小老鼠则显得有些害怕和紧张，躲到一边。大老鼠继续尝试用嘴叼起烟花，但烟花的火花不断飞溅，场面十分热闹。",
    "S1950E05 - Safety Second_scene057.mp4": "一只棕色的老鼠正用嘴咬住一个红白条纹的喇叭，用力吹响，喇叭口冒出黄色的火花。",
    "S1950E05 - Safety Second_scene058.mp4": "视频开始时，画面中央出现一个黄色的爆炸形状，周围是黑色的烟雾。随后，烟雾逐渐扩散并形成一个螺旋状的图案，中间逐渐显现出一个卡通狗的脸。这个卡通狗有着黑色的毛发、红色的鼻子和大大的眼睛，表情看起来有些惊讶或困惑。背景是深蓝色的，带有星星点缀，整体画面呈现出一种卡通风格的爆炸和烟雾效果。",
    "S1950E05 - Safety Second_scene059.mp4": "一只穿着黄色花朵服装的卡通动物，表情从惊讶变为得意，随后转身背对镜头。",
    "S1950E05 - Safety Second_scene060.mp4": "一只戴着向日葵头饰的棕色小狗和一只穿着尿布、手持彩色喇叭和红色玩具的小老鼠在草地上互动。小老鼠先是看着小狗，然后开心地笑起来，接着吹响喇叭，同时用玩具敲击地面，发出声音。小狗表情从平静变为愤怒。最后，画面通过望远镜视角逐渐变暗，最终显示“THE END”。",
    "S1950E05 - Safety Second_scene061.mp4": "视频显示了“THE END”字样，随后逐渐显示出“An MGM Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色，文字为蓝色和白色，具有复古卡通风格。",
    "S1950E05 - Safety Second_scene062.mp4": "视频开头显示了“An MGM Tom and Jerry Cartoon”标题，背景为深红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑。"
}