{
    "E78.Two.Little.Indians_scene001.mp4": "视频展示了米高梅动画公司的标志，狮子咆哮，随后画面转黑，接着出现《猫和老鼠》的标题和角色形象。",
    "E78.Two.Little.Indians_scene002.mp4": "这是一个《猫和老鼠》动画片的开场画面，背景为蓝色，画面中央是黄色的“Tom and Jerry”字样，左侧是杰瑞（老鼠），右侧是汤姆（猫），两者都面带笑容。随后，画面下方出现“Directed by William Hanna and Joseph Barbera”的字样。",
    "E78.Two.Little.Indians_scene003.mp4": "这是一个动画片的片头，展示了《Two Little Indians》的标题和制作人员名单。背景是红色的，有原住民帐篷的剪影。标题文字以像素风格呈现，下方列出了动画师、背景设计师和音乐制作人等信息。最后显示了制片人Fred Quimby的名字。整个画面风格复古，具有经典动画片的特色。",
    "E78.Two.Little.Indians_scene004.mp4": "画面开始时显示“PRODUCED BY FRED QUIMBY”的字样，随后切换到一个夜晚的场景，一只穿着红色和蓝色帽子、背着红色背包的小老鼠正在草地上行走，背景是一堵石墙。",
    "E78.Two.Little.Indians_scene005.mp4": "两个穿着彩色帽子的小老鼠在草地上奔跑，手里拿着小棍子。它们跑过几朵花，最终停在一个写着“JERRY MOUSE”的橙色邮箱前。背景是绿色的草地、树木和岩石。",
    "E78.Two.Little.Indians_scene006.mp4": "两个穿着彩色帽子、手持箭矢的小老鼠从画面右侧跑入，停在一座带有红色拱门和黄色屋顶的房子前，它们面向房子，似乎在准备做某事。",
    "E78.Two.Little.Indians_scene007.mp4": "一只棕色的小老鼠坐在一个白色的茶杯里，手里拿着一本红色的书在阅读。茶杯放在一个蓝色的垫子上，旁边有一盏绿色灯罩的台灯。背景是一个昏暗的房间，左侧有一个绿色的沙发，上面放着一个紫色的靠垫和一个格子图案的枕头。天花板是蓝色的波浪形装饰。小老鼠专注地看书，偶尔翻动书页，表情显得很投入。",
    "E78.Two.Little.Indians_scene008.mp4": "两个穿着骑士服装的老鼠站在一扇红色门前，手持长矛。一只棕色老鼠从门内走出，接过其中一只灰老鼠递来的纸张并阅读。",
    "E78.Two.Little.Indians_scene009.mp4": "视频展示了一张被双手拿着的白纸，纸上用黑色墨水手写了一封信。信的内容是：“Dear Scoutmaster Jerry, These are the two little orphans you promised to take on a hiking trip. Thanks, Bide-a-wee-Mouse Home。”背景是绿色的。",
    "E78.Two.Little.Indians_scene010.mp4": "一只棕色老鼠站在门口，手里拿着纸，与两只戴帽子、持弓箭的小老鼠交谈。棕色老鼠转身跑进屋内，两只小老鼠随后开始追逐，最终跑出画面。",
    "E78.Two.Little.Indians_scene011.mp4": "一只棕色的老鼠站在梳妆台前，它拿起一条蓝色的围巾，系在脖子上，然后拿起一顶黄色的帽子戴在头上，最后它开心地转身跑出了画面。",
    "E78.Two.Little.Indians_scene012.mp4": "一只戴着帽子和围巾的老鼠从红色的拱形门中跑出来，停在门口，然后张开双臂，仿佛在飞翔。",
    "E78.Two.Little.Indians_scene013.mp4": "一只大狗在狗屋门口打哈欠，一只小老鼠从远处跑来，被狗的嘴叼住，随后狗又打哈欠，另一只小老鼠从远处跑来，被狗的嘴叼住。",
    "E78.Two.Little.Indians_scene014.mp4": "在一条红色的隧道里，一只戴着黄色帽子、穿着白色尿布的老鼠正拉弓射箭。突然，一只棕色的猫从右侧冲进来，用尾巴扫过老鼠，老鼠被击飞出去。",
    "E78.Two.Little.Indians_scene015.mp4": "一只棕色的狗从狗屋里探出头，嘴里叼着一只棕色的老鼠。突然，一只棕色的老鼠和一只灰色的老鼠从远处跑来，棕色的老鼠拿着弓箭，灰色的老鼠拿着剑。棕色的老鼠向狗射箭，狗被箭射中后，棕色的老鼠和灰色的老鼠一起跑开了。",
    "E78.Two.Little.Indians_scene016.mp4": "两只老鼠在墙角处，一只棕色老鼠手持弓箭，另一只灰色老鼠手持红色羽毛。棕色老鼠向灰色老鼠展示弓箭，随后被弓箭射中，飞向空中。",
    "E78.Two.Little.Indians_scene017.mp4": "一只灰色小老鼠手持弓箭，瞄准树枝上的红色小鸟。小鸟被射中后掉落几片羽毛。另一只戴着帽子、手持弓箭的棕色老鼠从右侧跑入画面，与灰色小老鼠对峙。",
    "E78.Two.Little.Indians_scene018.mp4": "一个红色的箭在蓝色的天空中飞行，箭的轨迹呈弧形，最终飞向一个建筑物的屋檐。",
    "E78.Two.Little.Indians_scene019.mp4": "两只老鼠在户外，一只穿着骑士服装，另一只戴着帽子拿着弓箭。戴帽子的老鼠射出一支箭，箭头击中了树上的一个目标。随后，从管道中冒出几个小老鼠，它们似乎被箭击中后从管道中跑出来。",
    "E78.Two.Little.Indians_scene020.mp4": "三只老鼠在草地上行走，其中一只戴着帽子和围巾，另外两只戴着彩色帽子。它们从画面左侧向右侧移动，背景是一棵大树。",
    "E78.Two.Little.Indians_scene021.mp4": "一只灰色的猫（汤姆）躺在树下，双臂交叉，表情放松，似乎在享受宁静的户外时光。背景是蓝天、绿树和一个喷泉，环境宁静祥和。",
    "E78.Two.Little.Indians_scene022.mp4": "两只戴着彩色羽毛头饰的老鼠在草地上跳舞，随后摔倒在地并向前爬行。",
    "E78.Two.Little.Indians_scene023.mp4": "一只戴着帽子和蓝色围巾的老鼠在绿色草地上行走，背景是茂密的树林。",
    "E78.Two.Little.Indians_scene024.mp4": "一只灰色的猫汤姆正靠在树干上睡觉，一只戴着帽子的小老鼠杰瑞从树洞里爬出来，用斧头砍树，导致汤姆被惊醒并感到困惑。",
    "E78.Two.Little.Indians_scene025.mp4": "一只灰色的猫汤姆坐在树下，随后躺下并闭上眼睛睡觉。背景是绿色的草地、树木和一堵墙。",
    "E78.Two.Little.Indians_scene026.mp4": "一只灰色的猫（汤姆）在树洞旁的草地上睡觉，两只老鼠（杰瑞和另一个老鼠）从树洞里探出头来，然后跑出来，牵着手在猫的面前跳舞。",
    "E78.Two.Little.Indians_scene028.mp4": "一只戴着黄色帽子、穿着红色背心的灰色小猫在绿色草地上奔跑，手持蓝色球杆。突然，一条巨大的黑色尾巴从右侧出现，小猫被尾巴击中，向后飞去，球杆掉落。",
    "E78.Two.Little.Indians_scene029.mp4": "汤姆猫在草地上奔跑，手里拿着一个棕色的小物件。突然，他失去平衡，身体向后仰，张大嘴巴，四肢伸展，似乎要摔倒。背景是一堵墙和一些绿色的灌木。",
    "E78.Two.Little.Indians_scene030.mp4": "一只小老鼠戴着帽子和红色的球，正在草地上奔跑。一只大猫从后面追来，用爪子抓住了小老鼠。大猫将小老鼠握在手中，表情凶狠。",
    "E78.Two.Little.Indians_scene031.mp4": "汤姆猫手持一只小老鼠，表情凶狠。突然，另一只穿着海盗服装的老鼠从右侧飞来，跳到汤姆猫头上，挥舞着斧头砍向汤姆猫的头顶。汤姆猫被击中后，头顶出现一个红色的伤痕，他痛苦地闭上眼睛，随后睁开眼睛，表情愤怒。",
    "E78.Two.Little.Indians_scene032.mp4": "一只戴着红色帽子的小老鼠在草地上奔跑，被一只灰猫从后方追上并抓住。猫得意地将老鼠举在手中，老鼠则显得惊慌失措。背景是绿色的草地和灌木丛，远处有围墙。",
    "E78.Two.Little.Indians_scene033.mp4": "一只戴着帽子和蓝色领结的老鼠跑向一个红色的邮箱，它用尽全力推邮箱的柱子，导致柱子断裂，老鼠抱着断裂的柱子跑开。",
    "E78.Two.Little.Indians_scene034.mp4": "汤姆猫坐在草地上，手里拿着杰瑞老鼠的帽子。杰瑞老鼠从画面右侧跑来，用一根长棍子将汤姆猫的帽子打飞。汤姆猫被帽子击中后，身体变形为一个红色的长方体，帽子落在他的头上。杰瑞老鼠站在长棍子的另一端，看着汤姆猫。",
    "E78.Two.Little.Indians_scene035.mp4": "在一片绿色的草坪上，几只老鼠骑着摩托车飞驰而过，随后一只灰色的猫从墙后跳出来追赶它们。猫在追逐过程中被弹飞，身体扭曲变形，最终消失在画面中。",
    "E78.Two.Little.Indians_scene036.mp4": "一只灰色的猫从栅栏后跳出，然后用前爪抓住栅栏，身体前倾，试图翻越栅栏。",
    "E78.Two.Little.Indians_scene037.mp4": "一只戴着帽子和蓝色围巾的老鼠在白色栅栏后面偷偷摸摸地跑动，它被一只猫的手抓住后迅速逃走。",
    "E78.Two.Little.Indians_scene038.mp4": "汤姆猫在院子里，手里拿着杰瑞鼠，然后用尾巴勾住一个风筝线，把风筝拉过来，最后蹲下抱着杰瑞和风筝。",
    "E78.Two.Little.Indians_scene039.mp4": "在一片绿色的草地上，两只穿着盔甲、手持弓箭的小老鼠从左向右奔跑。镜头向右移动，一只灰色的猫汤姆从右侧进入画面，他手持苍蝇拍，怀里抱着一只小老鼠。汤姆用苍蝇拍击打其中一只小老鼠，使其倒地。随后，两只小老鼠继续向右奔跑，汤姆则保持蹲姿，面带微笑，注视着它们。背景是一道白色的栅栏和一棵树。",
    "E78.Two.Little.Indians_scene040.mp4": "三只小老鼠从大树根部跑过，其中一只拿着火把，随后两只小老鼠爬上树根，探头观察四周，最后消失在画面中。",
    "E78.Two.Little.Indians_scene041.mp4": "汤姆猫在院子里，手里拿着一个红色的苍蝇拍，怀里抱着杰瑞鼠。他先是用苍蝇拍轻轻拍打空气，然后放下苍蝇拍，开始奔跑。杰瑞鼠戴着一顶小帽子，被汤姆猫紧紧抱在怀里。汤姆猫一边跑，一边回头看着杰瑞鼠，表情得意。背景是白色的栅栏和绿色的草地，远处有一棵大树和一张红色的桌子。",
    "E78.Two.Little.Indians_scene042.mp4": "视频展示了一个卡通风格的户外场景，背景是蓝天、绿色草地和树木，右侧可见一栋黄色房子的一部分。画面中，两个黑色的不明飞行物（UFO）从远处飞来，它们在空中移动并逐渐靠近，其中一个UFO在飞行过程中分解成多个小碎片，随后重新组合成一个完整的UFO。整个过程在宁静的自然环境中进行，没有其他人物或动物出现。",
    "E78.Two.Little.Indians_scene043.mp4": "一只穿着红色斗篷、戴着蓝色帽子的老鼠站在一个银色烤面包机上，烤面包机插着紫色电源线。老鼠用爪子按动烤面包机的按钮，烤面包机冒出黑烟，老鼠被弹飞出去，落在草地上。镜头转向一个白色栅栏旁，老鼠站在一堆羽毛球旁边，它拿起一个羽毛球，用力挥动，羽毛球飞向空中，老鼠开心地跳跃。",
    "E78.Two.Little.Indians_scene044.mp4": "一只灰色的猫（汤姆）站在草地上，手里拿着一只戴着帽子的小老鼠（杰瑞）。背景是一道白色的栅栏和一棵绿色的灌木。猫的表情从得意变为惊讶，眼睛睁大，嘴巴微张。",
    "E78.Two.Little.Indians_scene045.mp4": "一群戴着羽毛头饰的卡通人物从白色栅栏后探出头来，他们表情严肃，似乎在观察或等待什么。背景是绿色的灌木和树木，地面是修剪整齐的草坪。镜头缓慢向右移动，展示更多人物。",
    "E78.Two.Little.Indians_scene046.mp4": "汤姆猫在院子里拿着杰瑞鼠，突然被一股力量甩飞，飞出了画面。",
    "E78.Two.Little.Indians_scene047.mp4": "汤姆猫在户外追逐一只小老鼠，他跳过柱子，抓住老鼠，但被老鼠的尾巴缠住，随后他跳到一张桌子上，然后从窗户跳进屋内。",
    "E78.Two.Little.Indians_scene048.mp4": "汤姆猫从壁炉上方的猎枪上滑落，猎枪和火鸡装饰物随之掉落，汤姆猫在空中翻滚，最终消失在画面左侧。",
    "E78.Two.Little.Indians_scene049.mp4": "一只戴着帽子的小老鼠站在柱子旁，一只戴着猎人帽、手持猎枪的猫从绿色木箱后探出头来，瞄准小老鼠。",
    "E78.Two.Little.Indians_scene050.mp4": "一只穿着白色裤子、戴着红色羽毛头饰的老鼠站在草地上，手持弓箭瞄准前方。它拉弓射箭，箭矢射中了一把放在地上的平底锅的把手，平底锅被箭矢带动飞起，随后老鼠被弹飞出去。背景是绿色的草地、树木和白色的栅栏。",
    "E78.Two.Little.Indians_scene051.mp4": "汤姆戴着一顶棕色帽子，躲在木制平台上，手持一把蓝红相间的长枪瞄准。他瞄准的目标是一个悬挂在屋檐下的红色箭头，箭头通过一根绳子与一个橙色的平底锅相连。汤姆开枪后，绳子被拉紧，平底锅被甩向空中，随后汤姆被绳子拉扯，身体向后仰，最终被平底锅击中，他痛苦地闭上眼睛。",
    "E78.Two.Little.Indians_scene052.mp4": "两只小老鼠穿着斗篷，戴着帽子，拿着刷子，来到一只戴着羽毛头饰、躺在地上的大狗面前。一只老鼠用刷子给大狗的脸上涂上红色颜料，另一只老鼠则用刷子给大狗的头上涂上蓝色颜料。大狗被涂颜料后，显得非常生气。两只小老鼠继续涂颜料，大狗则躺在地上，愤怒地瞪着它们。",
    "E78.Two.Little.Indians_scene053.mp4": "汤姆戴着红色帽子，手持一个橙色的卷轴，从墙后跑出来。他跑到墙边停下，与一个戴着羽毛头饰、脸上有红色条纹的棕色狗对峙。汤姆被卷轴拉得身体拉长，表情惊恐，而狗则露出愤怒的表情。汤姆最终被卷轴拉得完全伸长，随后消失在画面中，只留下狗还在原地。",
    "E78.Two.Little.Indians_scene054.mp4": "汤姆戴着红色帽子，从空中跃起，扑向一张红色的躺椅，然后躺进去，双手抓着躺椅的边缘，露出得意的表情。背景是绿色的草地、树木和白色的栅栏。",
    "E78.Two.Little.Indians_scene055.mp4": "一只穿着白色尿布、头戴蓝色羽毛头饰的老鼠，手持弓箭站在一个打开的火柴盒旁。它从火柴盒中抽出一根火柴，点燃后用弓箭射出，火柴燃烧的火焰随箭矢飞向远处的灌木丛。",
    "E78.Two.Little.Indians_scene056.mp4": "汤姆猫戴着红色帽子躺在躺椅上，突然一根点燃的火柴从右侧飞来，落在躺椅上引发火焰。汤姆猫被火焰烧到，从躺椅上被弹起，被一根黑色绳索缠住，随后被甩出，重重摔在地上。汤姆猫挣扎着站起来，但最终被绳索拖走，消失在画面中。背景是绿色的草地、树木和白色的栅栏。",
    "E78.Two.Little.Indians_scene057.mp4": "汤姆戴着红色帽子从墙后跳出，试图抓住杰瑞，但杰瑞在柱子旁迅速躲开，汤姆扑空后撞到墙上。",
    "E78.Two.Little.Indians_scene058.mp4": "汤姆猫戴着红色帽子，手持一把蓝色长枪，趴在绿色的栏杆上，眼睛瞪得很大，表情凶狠，似乎在瞄准目标。背景是蓝色的天空和黄色的墙壁。",
    "E78.Two.Little.Indians_scene059.mp4": "两只戴着彩色帽子的小老鼠从草地上跑向一个蓝色的管道，它们互相推搡着试图进入管道，最后其中一只成功进入，另一只则继续在草地上奔跑。",
    "E78.Two.Little.Indians_scene060.mp4": "一只戴着红色羽毛帽子的小老鼠被一根绳子牵引着，绳子另一端连接着一只大猫的尾巴。小老鼠在红色地砖上奔跑，试图挣脱绳子，但被大猫的尾巴拉住。在过程中，小老鼠不小心撞到了大猫的尾巴，导致一些黑色的颗粒物从尾巴上洒落出来。小老鼠停下来看着洒落的颗粒物。",
    "E78.Two.Little.Indians_scene061.mp4": "猫戴着红色帽子，手持长枪，瞄准前方。突然，一只小老鼠从枪口飞出，猫被射中，表情痛苦。猫愤怒地盯着老鼠，老鼠则飞走。",
    "E78.Two.Little.Indians_scene062.mp4": "汤姆猫手持猎枪瞄准杰瑞鼠，但杰瑞鼠迅速逃脱并点燃了地上的火药，引发爆炸和浓烟。",
    "E78.Two.Little.Indians_scene063.mp4": "在一片绿草如茵的庭院中，汤姆手持猎枪追逐着一只小鸟。他沿着蜿蜒的小路奔跑，身后留下一串黑色的痕迹。在追逐过程中，汤姆不慎跌倒，猎枪掉落在地，引发了一连串的火花和爆炸。爆炸的火焰四处飞溅，最终在草地上留下了一片燃烧的痕迹。",
    "E78.Two.Little.Indians_scene064.mp4": "一个穿着蓝色衣服、戴着红色帽子的卡通人物从画面左侧跑入，手持一根长杆，沿着草坪奔跑，身后留下一条黑色的轨迹。他跑向画面右侧，最终消失在画面边缘。背景是一座带有红色屋顶和黄色车库门的白色建筑，周围有绿色的草坪、树木和围墙。",
    "E78.Two.Little.Indians_scene065.mp4": "在一间木制的仓库里，猫汤姆手持猎枪，追逐着一只小老鼠杰瑞。杰瑞沿着地面的黑线快速逃跑，汤姆紧追不舍。在追逐过程中，汤姆不慎撞到一个红色的“GAS”箱子，导致箱子旁边的油桶被撞倒，油桶里的油洒在地上。汤姆继续追赶杰瑞，最终在窗边停下，瞄准并开枪射击。枪声响起后，地上的油被点燃，引发了一场小火灾，火焰在地面蔓延。汤姆看着火焰，显得有些惊讶和无奈。",
    "E78.Two.Little.Indians_scene066.mp4": "在一间木制的谷仓内，汤姆猫手持猎枪，紧张地瞄准门外。他身后地上有一条黑色的油迹，旁边放着标有“GAS”和“OIL”的容器。汤姆猫突然开枪，枪口喷出火焰，他被爆炸的冲击力震得后退，表情惊恐。他继续奔跑，同时枪口不断喷火，最终在谷仓内引发小规模火灾。",
    "E78.Two.Little.Indians_scene068.mp4": "视频开始时显示“THE END”字样，随后过渡到“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面，最后画面逐渐变暗直至全黑。"
}