{
    "26. Solid Serenade_scene001.mp4": "视频开始时显示一个黑色背景，右下角有数字“0110544170204083”。随后画面逐渐变亮，出现米高梅动画公司的标志，标志中央是一只咆哮的狮子，上方写着“A METRO-GOLDWYN-MAYER”，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。背景为深蓝色，整体风格复古。",
    "26. Solid Serenade_scene002.mp4": "这是一个米高梅卡通片头，蓝色背景上有一个咆哮的狮子，狮子位于一个圆形框架内，下方写着“A METRO-GOLDWYN-MAYER CARTOON COLOR BY TECHNICOLOR”。狮子不断张合嘴巴，展示出咆哮的动作。画面底部有一个数字编号“0110544170204083”。",
    "26. Solid Serenade_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现《猫和老鼠》的标题画面，其中汤姆猫和杰瑞鼠的形象出现。",
    "26. Solid Serenade_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深绿色，左侧是棕色的小老鼠杰瑞，右侧是灰色的猫汤姆，两者都面带笑容。画面中央是黄色的“Tom and Jerry”字样。随后，画面下方出现“Solid Serenade”和“Directed by William Hanna and Joseph Barbera”的字样，以及中文“精彩的小夜曲”。",
    "26. Solid Serenade_scene005.mp4": "视频片段展示了动画片《Tom and Jerry》中的一个标题画面，标题为“Solid Serenade”，由William Hanna和Joseph Barbera执导。画面中还有音乐符号和动画制作人员的名单，包括动画师Ed Barge、Michael Lah和Kenneth Muse，音乐由Scott Bradley创作。最后显示制片人Fred Quimby的名字。整个画面背景为蓝色，充满音乐元素。",
    "26. Solid Serenade_scene006.mp4": "视频开始显示“Produced by FRED QUIMBY”的字样，随后画面转为黑色，最后呈现一个夜晚的乡村房屋场景。",
    "26. Solid Serenade_scene007.mp4": "镜头从高处俯瞰一座房子和其后院，逐渐推近到后院中的狗屋。狗屋内有一只狗，狗屋上方标有“KILLER”字样。",
    "26. Solid Serenade_scene008.mp4": "夜晚，一只名叫“KILLER”的斗牛犬在狗屋中睡觉。墙头，猫汤姆悄悄出现，先是警惕地观察，然后露出得意的笑容，准备捉弄斗牛犬。",
    "26. Solid Serenade_scene009.mp4": "夜晚，一栋蓝色的房子在星空下，窗户亮着灯，一只猫在窗内。镜头逐渐推近，聚焦于窗户。",
    "26. Solid Serenade_scene010.mp4": "夜晚，一扇窗户内，一个女孩的剪影正在窗边用手指轻触玻璃，窗外是深蓝色的夜空。",
    "26. Solid Serenade_scene011.mp4": "夜晚，汤姆猫在狗屋的墙上，拿着大提琴准备演奏，狗屋里的斗牛犬“Killer”正在睡觉。汤姆猫爬上狗屋屋顶，试图用大提琴吵醒斗牛犬，但斗牛犬依然睡得很香。",
    "26. Solid Serenade_scene012.mp4": "一只灰色的斗牛犬躺在狗窝里，戴着红色项圈，看着窗外的夜空。突然，汤姆猫从空中倒挂下来，张大嘴巴，露出尖牙，似乎在威胁斗牛犬。斗牛犬被吓了一跳，猛地站起来，张开嘴，露出牙齿，似乎要扑向汤姆猫。汤姆猫迅速消失在空中，斗牛犬则愤怒地冲向门口。",
    "26. Solid Serenade_scene013.mp4": "一只灰色的斗牛犬从狗屋里跑出来，表情凶狠。一只灰色的猫从狗屋的屋顶上跳下来，手里拿着一个红色的锤子，然后用绳子将斗牛犬绑住。猫接着拿起一把大提琴，开始演奏音乐，斗牛犬被绑在狗屋前，无法动弹。猫演奏完后，离开了画面，斗牛犬仍然被绑在原地。",
    "26. Solid Serenade_scene014.mp4": "在夜晚的户外，汤姆猫拿着一把大提琴，兴奋地演奏着。他一边弹奏，一边随着音乐摇摆身体，脸上洋溢着快乐的笑容。背景是星空下的草地、围墙和一棵大树，营造出宁静而愉快的氛围。汤姆猫似乎沉浸在音乐中，享受着独奏的时光。",
    "26. Solid Serenade_scene015.mp4": "夜晚，一只小猫从窗户探出头，深情地望着窗外，自言自语地说“我们每天都约会，但是我爱她”。镜头转向另一扇窗户，一只戴着红色蝴蝶结的母猫探出头，问：“你是不是我的爱人？”",
    "26. Solid Serenade_scene016.mp4": "汤姆猫在户外的花园里，抱着一把大提琴，一边演奏一边唱歌。他表情丰富，时而微笑，时而皱眉，似乎在表达某种情感或疑问。背景是绿色的草地和一些植物，环境宁静。画面下方有中文字幕，显示汤姆正在唱的歌词。",
    "26. Solid Serenade_scene018.mp4": "汤姆猫在夜晚的户外，手持一把大提琴，一边演奏一边唱歌，歌词显示为“你是不是我的爱人？或者你会找到一个新的爱人”。背景是白色的墙和绿色的植物，天空中有星星。",
    "26. Solid Serenade_scene020.mp4": "夜晚，汤姆猫在户外草地上抱着大提琴，他试图拉琴但琴弦突然断裂，他被弹飞出去，最终大提琴独自留在原地。",
    "26. Solid Serenade_scene021.mp4": "在夜晚的户外，汤姆猫飞扑向被黄色绳子捆绑在狗屋前的杰瑞鼠。汤姆猫用爪子抓住杰瑞鼠的鼻子，杰瑞鼠则用牙齿咬住汤姆猫的爪子。两人互相拉扯，汤姆猫被杰瑞鼠的牙齿咬住后，愤怒地向后飞去，杰瑞鼠则被绳子勒得痛苦地张大嘴巴。",
    "26. Solid Serenade_scene022.mp4": "夜晚，汤姆猫在草地上发现一把大提琴，他兴奋地扑过去，用爪子抱住琴身，摆出演奏的姿势，看起来非常开心。",
    "26. Solid Serenade_scene024.mp4": "汤姆猫在夜晚的户外弹奏大提琴，表情愉悦。突然，一个装满黄色液体的容器飞来，将他淋湿。随后，他又被一个装满红色液体的容器击中，满脸是液体。最后，汤姆猫被彻底弄湿，表情愤怒，但又无奈地耸肩。",
    "26. Solid Serenade_scene025.mp4": "杰瑞在窗台上跳舞，突然被汤姆从窗外追捕，杰瑞慌乱中滑倒，汤姆趁机扑向窗台，但杰瑞迅速逃跑，汤姆扑空后撞到墙上。",
    "26. Solid Serenade_scene026.mp4": "杰瑞在厨房里奔跑，从熨衣板上跳到橱柜上，然后被汤姆从后面抓住并摔倒在熨衣板上。",
    "26. Solid Serenade_scene027.mp4": "一只小老鼠从水龙头上跳入水槽，随后拉起水龙头的链子，导致水槽里的盘子和杯子被打碎。接着，一只大猫从上方掉落，被破碎的餐具包围，最终被餐具刺穿。",
    "26. Solid Serenade_scene028.mp4": "杰瑞从窗户跳出来，跑向一个斜靠在墙边的木板，它试图爬上木板，但滑了下来。这时，汤姆从窗户探出头，伸出长长的舌头试图抓住杰瑞。",
    "26. Solid Serenade_scene029.mp4": "在夜晚的户外，一只棕色的小老鼠正在奔跑，突然一只灰色的猫从左侧冲出，追赶小老鼠。猫在追逐过程中撞到树上，摔倒在地，显得非常狼狈。随后，猫被一个被绳子捆绑的灰色大狗挡住，大狗看起来很生气。小老鼠站在屋顶上，手里拿着绳子，似乎在操控着大狗。整个场景充满了喜剧和追逐的元素。",
    "26. Solid Serenade_scene030.mp4": "夜晚，汤姆猫和一只被黄色绳子缠绕的灰色斗牛犬在狗屋前对峙。斗牛犬愤怒地挣脱绳子，腾空而起，张嘴咆哮。汤姆猫惊恐地向后退去，斗牛犬扑向狗屋，汤姆猫被撞飞。斗牛犬落地后，汤姆猫消失，斗牛犬愤怒地追击，最终消失在画面中。",
    "26. Solid Serenade_scene031.mp4": "一只灰色的斗牛犬站在狗屋前，狗屋上写着“KILLER”。斗牛犬用爪子从狗屋的门里拿出一个装有假牙的玻璃杯，然后把假牙放进嘴里，露出满意的表情。",
    "26. Solid Serenade_scene032.mp4": "一只灰色的斗牛犬，戴着带尖刺的红色项圈，对着星空张开嘴，露出夸张的牙齿，然后将一副红色的假牙装上，接着张大嘴咆哮，最后又把假牙取下，露出原本的牙齿，表情愤怒。",
    "26. Solid Serenade_scene033.mp4": "一只名为“KILLER”的斗牛犬在夜晚从狗屋中冲出，张开大嘴，露出尖牙，眼睛发出光芒，随后在空中翻滚，最后消失在画面中，留下狗屋和夜空。",
    "26. Solid Serenade_scene034.mp4": "夜晚，汤姆在草地上奔跑，突然撞到树上，接着一只巨大的斗牛犬从树后出现，张开大嘴露出尖牙，汤姆吓得四处逃跑，最后消失在画面中。",
    "26. Solid Serenade_scene035.mp4": "在夜晚的户外，汤姆猫正在快速奔跑，身后有一只大狗紧追不舍。汤姆猫突然用脚踢向大狗的嘴，大狗被踢得后退，随后汤姆猫继续向前奔跑，大狗则在后面追赶。背景是星空和远处的房屋与树木。",
    "26. Solid Serenade_scene036.mp4": "夜晚，汤姆从墙后跳出，发现地上有两块红砖。他捡起一块砖，举起来准备攻击。这时，一只灰狗从远处跑来，停在汤姆面前，表情凶狠地盯着汤姆。汤姆吓得后退，但狗突然又变回平静，坐下来，汤姆也愣住了。",
    "26. Solid Serenade_scene037.mp4": "夜晚，汤姆猫手持红色砖块，面对墙头的狗。狗从墙头跳下，汤姆猫兴奋地跑向它，但狗却躺在地上不动，汤姆猫显得惊讶和困惑。",
    "26. Solid Serenade_scene038.mp4": "一只棕色的小老鼠站在草地上，表情惊恐，随后迅速向画面右侧跑去，消失在画面中。背景中有一个红色和米色相间的洒水壶和一丛黄色的花。",
    "26. Solid Serenade_scene039.mp4": "一只棕色的小老鼠从墙后跑出来，然后又躲回墙后。接着，一只灰色的猫从墙后冲出来，但很快又消失不见。小老鼠再次从墙后跑出来，然后又躲回墙后。",
    "26. Solid Serenade_scene040.mp4": "一只小老鼠杰瑞靠近一只躺在地上的斗牛犬，用爪子拨弄狗的鼻子，然后迅速跑开并拿起一块木板，将木板放在狗的鼻子上。",
    "26. Solid Serenade_scene041.mp4": "夜晚，一只小老鼠杰瑞用一块木板撬动一只正在睡觉的大猫汤姆，木板突然翘起，杰瑞被弹飞。",
    "26. Solid Serenade_scene042.mp4": "在夜晚的院子里，一只小老鼠用木板滑行，一只大狗被木板绊倒。随后，猫汤姆出现，抓住木板，与大狗对峙。汤姆试图用木板击打大狗，但大狗不敌，最终被汤姆说服，高兴地跑开。汤姆目送大狗离开，显得有些得意。",
    "26. Solid Serenade_scene043.mp4": "夜晚，一只灰色的斗牛犬在草地上追逐一个黄色的长条形物体。它跑向物体，最终扑倒在地，显得非常疲惫。突然，斗牛犬的身上出现了一个驴子的形象，驴子身上写着“JACKASS”，并伴有中文“傻瓜”的字幕。随后，驴子形象消失，斗牛犬恢复原样，继续趴在草地上。",
    "26. Solid Serenade_scene044.mp4": "汤姆追逐着一只白猫，白猫站在阳台上，汤姆跳上阳台，试图抓住白猫，但白猫躲开了。汤姆又跳下阳台，白猫站在阳台上看着汤姆。突然，一只大狗出现，汤姆被大狗撞倒，大狗叼着白猫跑开，汤姆追上去，大狗把白猫放在阳台上，汤姆又跳上阳台，试图抓住白猫，但白猫躲开了。汤姆又跳下阳台，白猫站在阳台上看着汤姆。",
    "26. Solid Serenade_scene046.mp4": "在夜晚的庭院里，汤姆猫从柱子后面跳出来追逐杰瑞鼠。杰瑞鼠被汤姆猫吓到，快速逃跑，汤姆猫紧追不舍。杰瑞鼠在逃跑过程中突然停下，得意地向汤姆猫挥手，然后继续逃跑。汤姆猫扑空后摔倒在地，杰瑞鼠趁机从他身边跑过。汤姆猫迅速爬起来，再次扑向杰瑞鼠，但杰瑞鼠又巧妙地躲开了。汤姆猫被气得直跺脚，杰瑞鼠则在一旁得意地笑着。",
    "26. Solid Serenade_scene047.mp4": "一只老鼠从狗屋前跑过，猫汤姆从狗屋中冲出，试图抓住老鼠。但老鼠躲进了狗屋，狗屋的门被打开，一只大狗从里面探出头来，与老鼠互动。随后，大狗也退回屋内，门被关上。",
    "26. Solid Serenade_scene048.mp4": "在夜晚的院子里，一只灰色的猫（汤姆）被一只巨大的灰色狗从狗屋中抓起并抛向空中。狗屋在空中翻转，随后汤姆和狗一起落在狗屋上。汤姆被狗紧紧抓住，脸上冒出火花，显得非常痛苦。最后，狗屋恢复原状，汤姆从狗屋中跑出来，惊慌失措地四处张望。",
    "26. Solid Serenade_scene049.mp4": "夜晚，汤姆被一根绳子拉扯着，表情痛苦，舌头伸出，身体被拉得极长，最终被拉到远处的小屋旁。",
    "26. Solid Serenade_scene050.mp4": "夜晚，汤姆猫从狗屋中探出头，手里拿着一支笔和一张写着“MY WILL”的纸，似乎在认真地写遗嘱。",
    "26. Solid Serenade_scene051.mp4": "汤姆猫躺在小屋的床上，正在写遗嘱。他写下“MY WILL”后，继续写“to my under”，但突然一阵风把纸和铅笔吹走了。",
    "26. Solid Serenade_scene052.mp4": "视频开始时，一个狗屋在夜空中飘浮，随后镜头切换到一只白猫从屋顶探头，表情愉悦。接着，镜头转向一只拿着低音提琴的斗牛犬，它在草地上兴奋地演奏，猫和老鼠则在低音提琴上互动，猫显得不悦，老鼠则在拉琴。最后，画面变黑，出现“THE END”字样。",
    "26. Solid Serenade_scene053.mp4": "视频开始时显示红色背景上的“The End”字样，随后逐渐过渡到“An M.G.M Tom and Jerry CARTOON”字样，下方标注“MADE IN HOLLYWOOD, U.S.A.”，整个画面保持静态展示。",
    "26. Solid Serenade_scene054.mp4": "视频开始时显示了“An MGM Tom and Jerry Cartoon”标题，背景为红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑，持续数秒，没有其他内容出现。"
}