{
    "S1950E61 - Feedin' The Kiddie_scene002.mp4": "视频展示了米高梅动画公司的经典标志，标志中央是一只咆哮的狮子，周围环绕着“Metro-Goldwyn-Mayer”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”的字样。随后画面逐渐变暗，最后出现《猫和老鼠》的标题画面，左侧是猫汤姆，右侧是老鼠杰瑞，中间是作品名称“Tom and Jerry”。",
    "S1950E61 - Feedin' The Kiddie_scene003.mp4": "视频展示了《猫和老鼠》的标题画面，左侧是灰色的猫汤姆，右侧是棕色的老鼠杰瑞，中间是“TOM and JERRY”的标题。随后画面中出现“IN CINEMASCOPE”的字样。",
    "S1950E61 - Feedin' The Kiddie_scene004.mp4": "这是一个动画片的标题画面，标题为“FEEDIN' THE KIDDIE”，背景是蓝色的，有橙色的方块装饰。画面左侧有一只穿着白大褂的棕色老鼠，它头顶着一个装有液体的奶瓶。标题下方写着“IN CINEMASCOPE”。随后，画面中出现了制作人员名单和版权信息。",
    "S1950E61 - Feedin' The Kiddie_scene005.mp4": "这是一个动画片的片尾字幕，展示了制作团队的名单。背景是蓝色的，文字以粉色和蓝色为主。字幕列出了动画师、布局师、背景画师和音乐作曲家等工作人员的名字，以及制作公司和版权信息。最后，字幕显示了该动画片由Joseph Barbera和William Hanna制作和导演。",
    "S1950E61 - Feedin' The Kiddie_scene006.mp4": "一只老鼠坐在红色的垫子上，手里拿着一本名为“GOOD MOUSEKEEPING”的书，正在阅读。它旁边有一个陷阱，陷阱上放着一块奶酪。老鼠伸手去拿奶酪，但陷阱突然触发，奶酪被弹开。老鼠吃掉了奶酪后，突然跳了起来，似乎被吓到了。",
    "S1950E61 - Feedin' The Kiddie_scene007.mp4": "一只棕色的小老鼠从画面右侧跑入，停在蓝色门前，抬头看着悬挂的铃铛，表情显得有些紧张和好奇。",
    "S1950E61 - Feedin' The Kiddie_scene008.mp4": "夜晚，一只穿着紫色睡衣、戴着黄色帽子的小老鼠坐在狗屋门前，手里拿着一张纸。突然，一只橙色的猫从狗屋门后探出头来，看着小老鼠，然后迅速缩回屋内。小老鼠被吓了一跳，转身跑开。",
    "S1950E61 - Feedin' The Kiddie_scene009.mp4": "一只棕色的小老鼠从门后走出，它先是惊讶地张大嘴巴，然后开始奔跑，最后在空中跳跃并张开双臂。",
    "S1950E61 - Feedin' The Kiddie_scene010.mp4": "一只穿着紫色小丑服装的老鼠正在一个洞穴入口处的木板上吃奶酪，突然被一只棕色老鼠从左侧扑过来抓住，棕色老鼠把穿着小丑服的老鼠拖到了红色躺椅上。",
    "S1950E61 - Feedin' The Kiddie_scene011.mp4": "一只棕色老鼠和一只穿着小丑服装的灰色老鼠在室内互动。棕色老鼠先是抓住灰色老鼠，然后松开，灰色老鼠抱着一张纸坐在地上。棕色老鼠走向灰色老鼠，从它手中拿过纸张并阅读。",
    "S1950E61 - Feedin' The Kiddie_scene012.mp4": "视频展示了一封手写的感谢信，信件内容为感谢Jerry邀请小侄子Tuffy参加感恩节晚餐。信件署名为Cousin George，并在信末添加了红色的附言：“P.S. He loves to Eat!”，强调Tuffy喜欢吃东西。信件被双手拿着，背景为绿色。",
    "S1950E61 - Feedin' The Kiddie_scene013.mp4": "一只棕色老鼠拿着纸张，站在一只穿着紫色和黄色小丑服装的灰色小老鼠面前，似乎在向它展示或解释纸上的内容。背景中有一个红色沙发和蓝色墙壁。",
    "S1950E61 - Feedin' The Kiddie_scene014.mp4": "视频中，一只穿着紫色和黄色睡衣的小猫在草地上打哈欠，然后开始哭泣，眼泪滴落。随后，画面切换到一只大猫躺在桌子底下，旁边有一碗牛奶。两只小老鼠（一只棕色，一只灰色）从桌子底下探出头来，似乎在观察大猫，然后悄悄地靠近并躲在桌子腿后面，看起来很紧张和小心。大猫仍然在睡觉，没有注意到它们。",
    "S1950E61 - Feedin' The Kiddie_scene015.mp4": "在绿色的地板上，一只灰色的小老鼠被棕色的大老鼠推到一个装满液体的紫色碗里。大老鼠把小老鼠推入碗中后，小老鼠在碗里挣扎，液体溅起。这时，躺在一旁的猫汤姆突然睁开眼睛，露出惊讶的表情，然后迅速扑向碗边，试图抓住小老鼠。大老鼠则迅速将小老鼠拉回，躲到木柱后面。汤姆瞪大眼睛，张开嘴巴，似乎在大喊。",
    "S1950E61 - Feedin' The Kiddie_scene016.mp4": "汤姆猫在桌子下，用爪子捧着一个装满液体的紫色碗，他先是用舌头舔碗里的液体，然后液体溅了出来，汤姆猫看起来很惊讶。接着，他把碗放在地上，用爪子擦了擦脸，然后躺下，似乎在享受刚才的体验。杰瑞老鼠在桌子下偷偷观察着汤姆猫。",
    "S1950E61 - Feedin' The Kiddie_scene017.mp4": "一只灰色的猫躺在绿色的草地上，尾巴尖上滴着一滴白色的液体。两只小老鼠从左侧的棕色柱子后面探出头来，一只棕色，一只灰色。棕色老鼠抓住灰色老鼠的尾巴，灰色老鼠张开嘴巴，尾巴上的液体被挤出来，溅起一些白色的液体。两只小老鼠一起向前移动，靠近紫色的圆盘，然后它们一起趴在圆盘边缘，抬头看着猫，灰色老鼠张开嘴巴，棕色老鼠闭上眼睛。",
    "S1950E61 - Feedin' The Kiddie_scene018.mp4": "视频展示了一个餐桌场景，桌上有各种餐具和食物，包括水果、面条和蔬菜。一个穿着蓝色衣服、戴着黑色帽子的小人偶站在桌边，旁边有一只老鼠从桌子底下探出头来，然后跳上桌子，开始拉扯桌上的面条。老鼠显得非常开心，用力拉扯面条，面条逐渐被拉长。背景是红色的墙壁，整体画面色彩鲜艳，充满卡通风格。",
    "S1950E61 - Feedin' The Kiddie_scene019.mp4": "一只穿着尿布的小老鼠坐在绿色的地面上，它抬头看着从上方垂下的白色绳子，然后伸手抓住绳子并开始用力拉扯，表情显得非常专注和用力。",
    "S1950E61 - Feedin' The Kiddie_scene020.mp4": "一只穿着尿布的老鼠被一根细线吊在空中，它用鼻子顶着线，身体悬空，眼睛半闭，似乎在享受或忍受着这种状态。背景是红色的墙壁和一部分蓝白相间的窗帘。",
    "S1950E61 - Feedin' The Kiddie_scene021.mp4": "一只棕色的小老鼠站在一张铺着白色桌布的桌子上，手里拿着一根绳子。另一只灰色的小老鼠从桌子底下爬上来，开始和棕色小老鼠拉扯绳子。棕色小老鼠被拉得往后退，而灰色小老鼠则继续拉扯，最终棕色小老鼠被拉到桌子边缘，灰色小老鼠则跑开了。",
    "S1950E61 - Feedin' The Kiddie_scene022.mp4": "一只灰色的小老鼠在桌子上吃西瓜，被另一只棕色的老鼠发现并追赶。棕色老鼠抓住灰色老鼠，但灰色老鼠逃脱并躲到蛋糕上。棕色老鼠用蜡烛点燃蛋糕，蜡烛融化并滴落，灰色老鼠站在蛋糕上，蜡烛继续燃烧。",
    "S1950E61 - Feedin' The Kiddie_scene023.mp4": "一只灰色小老鼠站在一个巧克力甜甜圈上，看着中间的奶油慢慢融化。它伸出舌头舔了一口奶油，结果奶油溅到了它脸上。这时，另一只棕色小老鼠从奶油中冒出来，生气地瞪着它。灰色小老鼠吓得跳了起来，然后跑开。棕色小老鼠被奶油糊住了，只能躺在甜甜圈上。",
    "S1950E61 - Feedin' The Kiddie_scene024.mp4": "一只灰色的小老鼠在桌子上奔跑，它跳上一个蓝色的勺子，然后跳到一个红色的果冻上。果冻开始融化，小老鼠从果冻上滑落。接着，一只棕色的小老鼠出现，它看着果冻，然后拿起一个勺子，准备攻击果冻。",
    "S1950E61 - Feedin' The Kiddie_scene026.mp4": "一只戴着火鸡帽、手持望远镜的棕色老鼠在餐桌前走动，观察着桌上的食物。随后，一只穿着尿布、同样戴着火鸡帽的小灰鼠从画面右侧爬入，它好奇地四处张望，然后向左移动，最终消失在画面左侧。",
    "S1950E61 - Feedin' The Kiddie_scene027.mp4": "两只戴着感恩节帽子的老鼠在餐桌旁，一只拿着猎枪，另一只在旁边。他们看到一只装饰成鸡形状的装饰品，棕色老鼠用猎枪对着它，然后跑开并摘下装饰品上的橄榄，最后惊恐地跳开。",
    "S1950E61 - Feedin' The Kiddie_scene028.mp4": "一只灰色的小老鼠戴着小礼帽，试图把一个大橙子从果盘里拿出来，结果被橙子压得圆滚滚的。这时，一只棕色的小老鼠出现，把灰色小老鼠拎起来，然后用一把大刀将它切开，最后把灰色小老鼠放回地上。",
    "S1950E61 - Feedin' The Kiddie_scene029.mp4": "一个橙色的球体在绿色地面上滚动，背景是红色和黑色的条纹。镜头向右移动，出现一把蓝色的扫帚和一个蓝色的沙发。",
    "S1950E61 - Feedin' The Kiddie_scene030.mp4": "汤姆猫躺在地上打哈欠，随后身体被拉长，接着翻滚并伸展身体，最后起身离开。",
    "S1950E61 - Feedin' The Kiddie_scene031.mp4": "一只灰色的猫从柱子后面探出头来，眼睛瞪得很大，表情紧张，似乎在偷偷观察或躲避什么。",
    "S1950E61 - Feedin' The Kiddie_scene032.mp4": "两只穿着感恩节帽子的老鼠在餐桌旁。棕色老鼠拿着橄榄，灰色老鼠吹着喇叭。棕色老鼠把橄榄递给灰色老鼠，然后转身继续走。",
    "S1950E61 - Feedin' The Kiddie_scene033.mp4": "汤姆猫躲在门后，伸手抓住拖把，用力一拉，拖把被拉出，汤姆猫藏在拖把后面，拖把在地板上滑动，汤姆猫从拖把后面探出头来，拖把继续滑动，汤姆猫被拖把拖着向前移动，最终停在桌子旁边。",
    "S1950E61 - Feedin' The Kiddie_scene034.mp4": "两只戴着高帽的老鼠在房间里走动，其中一只老鼠从床下探出头来，另一只老鼠则从床下钻出。随后，一只戴着羽毛头饰的猫从床下探出头来，表情凶狠地盯着老鼠。",
    "S1950E61 - Feedin' The Kiddie_scene035.mp4": "两只穿着火鸡帽的老鼠在冰面上行走，一只灰色老鼠被一只巨大的猫爪拖拽着向前移动，另一只棕色老鼠则在前面奔跑。",
    "S1950E61 - Feedin' The Kiddie_scene036.mp4": "汤姆猫穿着带有红绿黄条纹的羽毛头饰，正用爪子抓住杰瑞鼠的尾巴。杰瑞戴着一顶蓝色礼帽，手里拿着一个喇叭，表情紧张，似乎在努力挣脱汤姆的控制。背景是红色的天空和浅蓝色的地面，画面充满了紧张和喜剧的氛围。",
    "S1950E61 - Feedin' The Kiddie_scene037.mp4": "一只戴着蓝色帽子的老鼠在红色背景前跳舞，旁边有一个装着绿色瓶子的冰桶和两个粉色烛台。",
    "S1950E61 - Feedin' The Kiddie_scene038.mp4": "视频中，一只戴着彩色羽毛头饰的猫（汤姆）趴在雪地上，表情凶狠地盯着前方。一只穿着小礼帽、手持喇叭的小老鼠（杰瑞）从远处跑来，边跑边吹喇叭。汤姆看到后，先是眯起眼睛，随后露出得意的笑容，身体前倾，似乎准备扑向杰瑞。背景是橙红色的天空和白色的雪地。",
    "S1950E61 - Feedin' The Kiddie_scene039.mp4": "一只戴着帽子的老鼠试图偷喝香槟，结果被香槟瓶喷出的液体击中，挂在了瓶口上。",
    "S1950E61 - Feedin' The Kiddie_scene040.mp4": "汤姆戴着印第安羽毛头饰，被杰瑞用喇叭吹得翻滚，随后愤怒地大叫并追赶杰瑞。",
    "S1950E61 - Feedin' The Kiddie_scene041.mp4": "一只戴着小帽子的老鼠从盐瓶旁边跑过，被一只戴着羽毛头饰的猫追捕。猫抓住老鼠，老鼠被猫摔在地上，猫得意地举起老鼠。",
    "S1950E61 - Feedin' The Kiddie_scene042.mp4": "一只戴着蓝色高帽的小猫在餐桌上滑行，它抓住一把叉子，用叉子作为滑板，在桌面上滑行，最终滑进一个绿色的果冻中。",
    "S1950E61 - Feedin' The Kiddie_scene043.mp4": "视频中，一只戴着彩色羽毛头饰的猫（汤姆）正试图用叉子攻击一只戴着小帽子的老鼠（杰瑞）。汤姆先是挥舞叉子，但被杰瑞用叉子反击，导致汤姆被叉子刺中并摔倒。随后，汤姆从地上爬起来，继续追赶杰瑞，但杰瑞已经跑远。汤姆最终抓住叉子，准备再次攻击杰瑞。整个场景充满了卡通式的夸张和幽默。",
    "S1950E61 - Feedin' The Kiddie_scene044.mp4": "一只戴着小礼帽的小老鼠在冰面上滑行，途中被一把叉子绊倒，随后被一只戴着羽毛头饰、穿着红色背心的猫抓住。猫得意地将小老鼠举在手中，表情狰狞。",
    "S1950E61 - Feedin' The Kiddie_scene045.mp4": "一只戴着蓝色帽子的小老鼠在桌面上奔跑，它跳上一把巨大的蓝色勺子，然后沿着勺子滑行，最终从勺子的另一端滑落。桌面上有两个银色烛台，每个烛台上都插着一根粉红色的蜡烛。背景是红色的墙壁。",
    "S1950E61 - Feedin' The Kiddie_scene046.mp4": "汤姆戴着印第安头饰，杰瑞戴着帽子拿着大勺子从左侧冲过来，汤姆被勺子击中后向右飞出，杰瑞站在勺子上得意地笑着。",
    "S1950E61 - Feedin' The Kiddie_scene047.mp4": "汤姆戴着彩色羽毛头饰，从空中飞过，撞上蓝色物体后消失。",
    "S1950E61 - Feedin' The Kiddie_scene048.mp4": "汤姆猫戴着羽毛头饰，从沙发下爬出，偷拿桌上的打火机点燃，火焰喷出后他被吓到后退。",
    "S1950E61 - Feedin' The Kiddie_scene049.mp4": "两只穿着感恩节帽子的老鼠在桌面上奔跑，撞上了一个白色的布罩，布罩被点燃后，老鼠被火焰包围，最终从火圈中跑出。",
    "S1950E61 - Feedin' The Kiddie_scene050.mp4": "一只戴着火鸡帽的老鼠从一个黄色的方块上跳过，然后跳到一个装有黄色液体的盘子上。黄色液体开始冒泡并燃烧，老鼠被液体包围，最后在液体中挣扎。",
    "S1950E61 - Feedin' The Kiddie_scene051.mp4": "汤姆戴着羽毛头饰，点燃了火把，随后愤怒地挥舞双臂，似乎在进行某种仪式或表达强烈情绪。",
    "S1950E61 - Feedin' The Kiddie_scene052.mp4": "两只戴着帽子的老鼠在一片黄色的液体中，一只老鼠突然跳起并抓住一个盖子，掀开盖子后，液体变成了火焰，老鼠被火焰烧伤。",
    "S1950E61 - Feedin' The Kiddie_scene053.mp4": "汤姆戴着一顶带有绿黄羽毛的红色帽子，最初张大嘴巴，舌头伸出，似乎在咆哮或大笑。随后，他将舌头收回，叼起一根香烟，表情变得放松和满足，坐在地上，背景是一个红色的柜子和绿色的地面。",
    "S1950E61 - Feedin' The Kiddie_scene054.mp4": "两只戴着帽子的老鼠在桌面上奔跑，一只老鼠从一个碗里跳出来，另一只老鼠则在碗的边缘奔跑。镜头跟随它们移动，展示它们经过一个装满鸡蛋的碗和一个盖着盖子的碗。",
    "S1950E61 - Feedin' The Kiddie_scene055.mp4": "汤姆戴着印第安风格的羽毛头饰，正在房间里做出夸张的舞蹈动作，他伸展双臂，扭动身体，表情滑稽。背景中有红色的墙壁、绿色的地面和一个粉色的花盆。",
    "S1950E61 - Feedin' The Kiddie_scene056.mp4": "一只戴着帽子的老鼠用刀切黄油，被刀刺中后摔倒在地，帽子飞走，老鼠躺在地上。",
    "S1950E61 - Feedin' The Kiddie_scene057.mp4": "汤姆戴着印第安头饰，先是张大嘴巴大笑，随后身体后仰，最终向后翻滚并消失在画面中。",
    "S1950E61 - Feedin' The Kiddie_scene058.mp4": "汤姆猫戴着羽毛头饰，从空中扑向一只戴小礼帽的老鼠，最终抓起老鼠并高举炫耀。背景为红色墙壁和餐桌，桌上摆放着烤火鸡、茶杯和酒杯。",
    "S1950E61 - Feedin' The Kiddie_scene059.mp4": "一只小老鼠戴着高帽，正努力拖拽一个巨大的派盘，派盘被拉得倾斜，最终小老鼠被甩出画面，派盘则滑向一旁。",
    "S1950E61 - Feedin' The Kiddie_scene060.mp4": "汤姆戴着羽毛头饰，兴奋地举起杰瑞，随后突然被黄色液体喷溅，身体旋转飞出画面，最后重新出现时表情惊讶。",
    "S1950E61 - Feedin' The Kiddie_scene061.mp4": "一只戴着帽子的小老鼠正在用剪刀剪一根插在烤火鸡上的紫色蜡烛。蜡烛被剪断后，小老鼠被弹飞出去，蜡烛的火焰也熄灭了。",
    "S1950E61 - Feedin' The Kiddie_scene062.mp4": "汤姆戴着羽毛头饰坐在桌旁，尾巴上燃起火焰，随后全身着火，变成一只棕色的猫，表情痛苦。",
    "S1950E61 - Feedin' The Kiddie_scene063.mp4": "一只戴着帽子的小老鼠正在拉扯一个系着黄色丝带的绿色瓶子。突然，瓶子爆开，黄色液体喷涌而出，小老鼠被喷飞。液体继续喷射，最终填满了画面中的蓝色杯子。",
    "S1950E61 - Feedin' The Kiddie_scene064.mp4": "一只棕色的卡通动物坐在餐桌旁，突然被一瓶喷出的液体击中，身体被推得飞起，液体喷射穿过房间，击中家具和装饰物。",
    "S1950E61 - Feedin' The Kiddie_scene065.mp4": "两只穿着感恩节帽子的老鼠，一只棕色，一只灰色，从画面左侧跑入，棕色老鼠拉着灰色老鼠的手，随后将灰色老鼠抱在怀里，一起向画面右侧移动。背景是红色的墙壁，墙上挂着水果装饰。",
    "S1950E61 - Feedin' The Kiddie_scene067.mp4": "视频中，一只穿着围裙的灰色小老鼠坐在一堆骨头中间，它开心地笑着，然后用爪子拍打自己的肚子。随后画面逐渐变暗，最终出现“THE END”的字样，两侧分别有猫和老鼠的图案。",
    "S1950E61 - Feedin' The Kiddie_scene068.mp4": "这是一个M·G·M动画片的片尾画面，背景为蓝色，中央有“M·G·M CARTOON”字样，上方有“an”字样，下方有“made in hollywood, U·S·A.”字样。画面中还有卡通猫和老鼠的形象，最后画面逐渐变暗至全黑。"
}