{
    "E65.The.Two.Mouseketeers_scene001.mp4": "视频展示了米高梅动画片头，背景为红色，中央是一个咆哮的狮子图案，下方有“A Metro-Goldwyn-Mayer CARTOON”字样，以及“COLOR BY TECHNICOLOR”的说明。",
    "E65.The.Two.Mouseketeers_scene002.mp4": "这是一个米高梅动画片头，背景为红色，中央有一个蓝色边框的圆形，里面是一只咆哮的狮子。下方有文字“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”。狮子在圆形内不断咆哮，表情生动。",
    "E65.The.Two.Mouseketeers_scene005.mp4": "透过一扇带有菱形格子的拱形窗户，可以看到外面的夜景。窗外是一座高耸的断头台，背景是深蓝色的天空和一轮明月。远处可见一些尖顶建筑的轮廓，整个画面呈现出一种阴郁、肃穆的氛围。",
    "E65.The.Two.Mouseketeers_scene007.mp4": "视频中，一个穿着蓝色盔甲的角色站在室内，背景有楼梯和窗户。盔甲的头盔打开，两只老鼠从头盔中探出头来。其中一只老鼠戴着粉色帽子，另一只戴着黄色帽子。戴粉色帽子的老鼠从头盔中爬出，手里拿着一把剑，随后展开一个蓝色降落伞，开始沿着楼梯向下滑行。戴黄色帽子的老鼠则留在头盔内，注视着同伴。整个场景充满卡通风格，动作夸张有趣。",
    "E65.The.Two.Mouseketeers_scene008.mp4": "一只穿着蓝色衣服、戴着粉色帽子的老鼠在桌子上滑行，经过一盘粉色甜点、一个蛋糕、一个金色烛台和一个装满巧克力的金色碗。它滑行时撞倒了烛台，然后停下来看着碗里的巧克力。另一只穿着蓝色衣服、戴着黄色帽子的小老鼠从碗上方飞过，用剑刺向巧克力。",
    "E65.The.Two.Mouseketeers_scene009.mp4": "视频中，一只棕色的野猪躺在装饰有浆果和叶子的银盘上，闭着眼睛，似乎在休息。突然，一只穿着蓝色衣服、戴着蓝色头盔的小老鼠从右侧跳入画面，它撞到了野猪的鼻子，导致野猪睁开眼睛并张开嘴。随后，另一只穿着蓝色衣服、戴着粉色帽子的小老鼠从右侧进入画面，它用一把小刀在野猪的鼻子上刮擦，导致野猪再次张开嘴。接着，两只小老鼠一起站在野猪的鼻子旁边，似乎在交谈或互动。整个场景充满了卡通风格的幽默和活力。",
    "E65.The.Two.Mouseketeers_scene010.mp4": "一只穿着蓝色衣服、戴着黄色帽子的小老鼠从一块放在蓝色盘子上的大块奶酪的一个洞里爬出来，然后沿着奶酪的侧面向上爬，最终到达奶酪的顶部。背景是一个装饰华丽的房间，有柱子和拱形天花板，旁边还有一个装满水果的碗。",
    "E65.The.Two.Mouseketeers_scene011.mp4": "一只穿着蓝色斗篷、戴着粉色帽子的老鼠，手持小剑，小心翼翼地靠近一个装满水果的银色果盘，果盘里有香蕉、葡萄、苹果和橙子。老鼠表情紧张，似乎在警惕地观察四周，准备偷吃水果。",
    "E65.The.Two.Mouseketeers_scene012.mp4": "动画片段中，杰瑞穿着蓝色斗篷，戴着黄色帽子，背着剑，站在一块大奶酪上。他挥舞着剑，做出战斗姿态，随后被奶酪的边缘绊倒，从奶酪上摔落，消失在画面中。背景是拱形天花板，奶酪上有几个孔洞。",
    "E65.The.Two.Mouseketeers_scene013.mp4": "一只穿着蓝色披风和粉色帽子的老鼠站在一个装满水果的碗旁边，它突然被香蕉击中，向后翻滚，最后停在地板上，表情痛苦。",
    "E65.The.Two.Mouseketeers_scene015.mp4": "画面展示了一张铺着绿色桌布的桌子，桌上摆放着一只烤猪、一盘樱桃番茄和两个高脚杯。镜头向右移动，两只穿着蓝色制服、头戴帽子的小老鼠从右侧进入画面，它们拿着剑，试图用一个巨大的绿色酒瓶向烤猪喷洒液体。酒瓶被他们举起来，瓶口对准烤猪，随后液体从瓶口喷出，溅在桌面上。两只小老鼠被喷出的液体溅到，显得有些狼狈。",
    "E65.The.Two.Mouseketeers_scene016.mp4": "动画片中的猫汤姆穿着骑士服装，手持剑，突然被一股黄色液体喷射，全身被淋湿，帽子被冲掉，最后他甩掉帽子，一脸狼狈。",
    "E65.The.Two.Mouseketeers_scene017.mp4": "视频展示了一个动画场景，背景是一个装饰华丽的房间，桌上摆放着一瓶倒置的绿色酒瓶，酒液正从瓶口流出，周围有气泡上升。旁边有一个盘子，上面放着红色的番茄和一个橙色的南瓜，南瓜上插着一个软木塞。画面中，一只穿着红色和黄色服装、戴着黑色帽子的猫（汤姆）手持一把剑，从左侧进入画面，他先是用剑指向酒瓶，然后转身面对一群穿着厨师服的老鼠。这些老鼠戴着高高的白色厨师帽，穿着蓝色围裙，站在一个装满食物的盘子后面。汤姆用剑指向老鼠，老鼠们看起来有些紧张。汤姆随后转身离开，老鼠们则站在一起，显得有些惊讶或担忧。整个场景充满了幽默和戏剧性，展现了猫和老鼠之间的经典对抗。",
    "E65.The.Two.Mouseketeers_scene019.mp4": "一只穿着蓝色斗篷、戴着粉色帽子的老鼠，手持一把剑，在华丽的室内环境中敏捷地奔跑和跳跃。它从一个装饰有紫色窗帘的区域出发，沿着墙壁和天花板移动，经过一个烛台、一个装饰蛋糕和一些金色的器皿，最终在红色地毯上继续前进。整个场景充满了动感和冒险气息。",
    "E65.The.Two.Mouseketeers_scene020.mp4": "在华丽的室内，穿着红色披风和黑色帽子的猫汤姆被一只穿着蓝色斗篷、手持剑的小老鼠刺中尾巴，汤姆表情痛苦，随后被击飞出去，小老鼠继续挥剑追赶。",
    "E65.The.Two.Mouseketeers_scene022.mp4": "一个穿着盔甲、手持大斧的骑士站立在华丽的室内，一只小老鼠从右侧飞来，落在骑士的肩膀上，然后沿着骑士的盔甲向下爬行，最终停留在骑士的手臂上。镜头逐渐拉远，展示出骑士和老鼠在宏伟建筑内的场景。",
    "E65.The.Two.Mouseketeers_scene023.mp4": "汤姆穿着红色斗篷和黑色帽子，手持剑，摆出战斗姿势。杰瑞站在一旁，戴着粉色帽子，穿着蓝色衣服，似乎在观察汤姆。汤姆转身时，露出他的腹部和白色短裤，同时地板上出现了一把大斧头。汤姆继续摆姿势，杰瑞则在旁边跑动。",
    "E65.The.Two.Mouseketeers_scene024.mp4": "一只小老鼠穿着蓝色衣服，手持细剑，在豪华餐桌前穿梭，试图偷吃水果。它先躲过一盘棉花糖，然后跳到一盘水果上，被猫汤姆发现。汤姆穿着骑士服装，手持长剑，怒气冲冲地追击小老鼠。他用剑刺穿苹果，将小老鼠困在果肉中。小老鼠奋力挣扎，最终从果肉中逃脱，又躲进橙子和葡萄堆里。汤姆继续追击，但小老鼠灵活地在水果间穿梭，最终成功逃脱。",
    "E65.The.Two.Mouseketeers_scene025.mp4": "一只穿着骑士服装的小老鼠在桌面上奔跑，随后跳上一把勺子，用剑刺向汤姆。汤姆穿着厨师服装，手持长柄勺，将小老鼠打飞进一个马提尼酒杯中。小老鼠在杯中挣扎，汤姆则得意地举起酒杯。",
    "E65.The.Two.Mouseketeers_scene026.mp4": "一只穿着蓝色斗篷、戴着粉色帽子的老鼠，手持一把剑，在绿色的地面上奔跑。它从一个银盘旁经过，盘子里有西红柿和大蒜，旁边还有一把剑。老鼠挥舞着剑，似乎在战斗或表演。",
    "E65.The.Two.Mouseketeers_scene027.mp4": "汤姆穿着表演服，戴着帽子，坐在桌前，手里拿着一杯鸡尾酒。突然，一个橙色的球飞来，击中了汤姆的脸，导致红色液体（可能是番茄汁或果汁）溅满他的脸和衣服，汤姆表情痛苦。随后，他用剑刺向橙色球，球被刺穿，液体继续飞溅。汤姆看起来很狼狈，桌上也满是红色液体的污渍。",
    "E65.The.Two.Mouseketeers_scene028.mp4": "一只穿着蓝色围裙、戴着粉色帽子的老鼠正在厨房里试图用双手托住一盘番茄和大蒜，但盘子突然倾斜，导致老鼠被甩出去，最终摔倒在地。",
    "E65.The.Two.Mouseketeers_scene029.mp4": "汤姆穿着红色背心和黑色帽子，从金色盖子后面探出头来，手里拿着一把剑。他用剑挑起一串烤肉，然后将烤肉放在烛台上烤。烤肉在火焰中逐渐变焦，汤姆开心地笑着，享受着烤肉的香味。",
    "E65.The.Two.Mouseketeers_scene030.mp4": "一只穿着蓝色衣服、戴着黄色帽子和紫色翅膀的小老鼠，手持一把小剑，在一个高脚杯的边缘小心翼翼地行走。它在杯沿上保持平衡，不断调整姿势，最终从杯沿跳下，落在绿色的桌面上，然后向左走去。背景是红色的窗帘。",
    "E65.The.Two.Mouseketeers_scene031.mp4": "一只穿着蓝色衣服、戴着黄色帽子的小老鼠，手持一把剑，在一个装饰华丽的房间里，从一只大猫的红色披风下钻出来。大猫醒来后，小老鼠用剑刺向大猫，但大猫用披风将小老鼠卷起并抛向空中。小老鼠落地后，继续挥舞剑，但最终被大猫的披风卷起并消失在画面中。",
    "E65.The.Two.Mouseketeers_scene032.mp4": "一只穿着骑士服装的猫用剑刺向一只小老鼠，小老鼠被刺中后倒地，猫得意地举起小老鼠。",
    "E65.The.Two.Mouseketeers_scene033.mp4": "一只穿着粉色帽子和蓝色衣服的小老鼠，正用一根长杆推动一个蓝色带刺的球体。它滑行经过一个金色烛台，然后撞上一个蓝色的餐盖。此时，一只穿着红色斗篷、戴着黑色帽子的猫出现，手持一根细长的棍子，似乎在准备攻击或防御。小老鼠被球体甩飞，撞向墙壁，随后消失在画面中。猫则站在原地，表情愤怒，周围散落着碎屑。",
    "E65.The.Two.Mouseketeers_scene034.mp4": "两只穿着蓝色衣服的小老鼠在豪华的房间里奔跑，经过一个装满水果的金色碗。随后，一只穿着红色斗篷、戴着黑色帽子的猫突然出现，手持剑与其中一只老鼠对峙，双方开始激烈地剑斗。",
    "E65.The.Two.Mouseketeers_scene035.mp4": "一只穿着蓝色衣服、戴着黄色帽子的小老鼠正在用一根绳子拉动一个蓝色的大炮。它拖着大炮经过一张摆满食物的桌子，包括肉、西红柿、橙子和葡萄。小老鼠依次将桌上的肉、烤鸡和西红柿推入大炮中，然后它站在大炮旁边，似乎在准备发射。",
    "E65.The.Two.Mouseketeers_scene036.mp4": "在一场剑术对决中，猫汤姆身穿红色斗篷，手持长剑，与穿着蓝色斗篷、头戴粉色帽子的小老鼠杰瑞展开激烈交锋。杰瑞灵活地在桌面上跳跃躲避，同时挥舞着自己的短剑进行反击。汤姆步步紧逼，试图用剑尖刺中杰瑞，但杰瑞巧妙地闪避并反击。在战斗过程中，汤姆的剑多次击中桌上的餐具和食物，引发火花四溅。最终，杰瑞成功地将汤姆的剑尖抵在一块蛋糕上，汤姆被迫停下攻击，而杰瑞则站在蛋糕上，得意地举起短剑，展示胜利的姿态。",
    "E65.The.Two.Mouseketeers_scene037.mp4": "一只穿着蓝色围裙、戴着黄色帽子的小老鼠站在一个大炮上，手里拿着一根点燃的引线。引线开始冒火花，然后逐渐燃烧，最终点燃了大炮的引信。小老鼠看起来很专注，似乎在准备发射大炮。背景是一个室内场景，地面是红色的，有楼梯和柱子。",
    "E65.The.Two.Mouseketeers_scene038.mp4": "视频片段中，猫汤姆穿着骑士服装，手持剑，站在一个装满水果的桶旁。突然，他被击中并倒地，表情惊讶。画面切换到模糊的云朵效果，随后清晰显示两只老鼠在夜晚的街道上行走，一只拿着奶酪，另一只拿着香肠，它们似乎在进行某种冒险或任务。",
    "E65.The.Two.Mouseketeers_scene039.mp4": "画面中展示了一个夜晚的场景，一座石制建筑的屋顶上竖立着一个断头台，背景是深蓝色的天空和几朵云。断头台的刀片缓缓下降，然后停住。远处可以看到一些房屋的轮廓。",
    "E65.The.Two.Mouseketeers_scene040.mp4": "在夜晚的街道上，两只穿着蓝色衣服的小老鼠，一只拿着红色的香肠，另一只拿着黄色的奶酪。它们在街道上相遇并开始交谈。随后，它们一起跑向远处的拱门，逐渐消失在视野中。最后，画面变暗，出现“The End”的字样。",
    "E65.The.Two.Mouseketeers_scene041.mp4": "视频显示了“THE END”的字样，随后逐渐显示出“An MGM Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。"
}