{
    "E100.Busy.Buddies_scene001.mp4": "视频展示了米高梅动画的标志，背景为深蓝色，标志中央是狮子头像，周围环绕着“Metro-Goldwyn-Mayer”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样。",
    "E100.Busy.Buddies_scene002.mp4": "视频开始展示的是米高梅卡通的标志，背景为深蓝色，中央有一个咆哮的狮子图案，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。随后画面逐渐变暗，接着切换到“TOM and JERRY”的标题画面，背景为绿色，左侧是猫汤姆，右侧是老鼠杰瑞，两者都面带微笑。",
    "E100.Busy.Buddies_scene003.mp4": "视频展示了《猫和老鼠》动画片的片头和制作人员名单。首先，绿色背景上显示了“TOM and JERRY”的标志，猫和老鼠的形象分别位于文字两侧。接着，画面切换到深蓝色背景，显示了片名“Busy Buddies in CINEMASCOPE”，并配有一个婴儿喝奶瓶的插图。随后，制作人员名单逐一出现，包括动画师、布局师、背景设计师、音乐师等，最后是制片人和导演的名字：Joseph Barbera 和 William Hanna。整个画面风格复古，充满经典动画片的特色。",
    "E100.Busy.Buddies_scene004.mp4": "画面中，一位戴眼镜、叼着烟斗的男士，身披灰色大衣，正与一位穿着蓝色外套、手拿白色手套的女士交谈。女士旁边站着一位金发小女孩，她穿着粉色上衣和深色裙子，双手叉腰，面带微笑地看着他们。三人似乎在室内，背景是门和家具。",
    "E100.Busy.Buddies_scene005.mp4": "一个穿着灰色大衣、戴着帽子和眼镜的男子，嘴里叼着烟斗，站在一扇门前。他旁边是一位穿着紫色外套、戴着白色手套和紫色帽子的女士，她手里提着一个棕色手提包。他们面对着一位穿着粉色上衣和红色裙子、扎着蓝色蝴蝶结的年轻女子。男子先是调整大衣，然后用手指向年轻女子，似乎在与她交谈。年轻女子则双手叉腰，面带微笑地回应。背景是一个室内环境，有一扇门和一个木制家具。",
    "E100.Busy.Buddies_scene006.mp4": "一只灰色的猫从墙角探出头来，面带微笑，注视着前方洞口处的一只棕色小老鼠。小老鼠从洞口探出头，与猫对视。猫的表情时而微笑，时而眯眼，显得非常得意和兴奋。小老鼠则显得有些紧张和警惕，但仍然保持在洞口处。整个场景充满了猫鼠之间的紧张对峙氛围。",
    "E100.Busy.Buddies_scene007.mp4": "一个婴儿在婴儿床里，看着门口站着的三个人。婴儿先是哭泣，然后停止哭泣，面带微笑。",
    "E100.Busy.Buddies_scene008.mp4": "一位穿着紫色外套、戴着白色手套和帽子的女士站在门口，与一位穿粉色上衣和红色裙子、扎着蓝色蝴蝶结的年轻女子交谈。女士用手指指向年轻女子，随后双手交叉放在胸前，面带微笑。年轻女子双手叉腰，面带微笑回应。一位穿着灰色大衣、戴着帽子、嘴里叼着烟斗的男士从左侧走过，走向门口，女士随后也向门口走去。",
    "E100.Busy.Buddies_scene009.mp4": "一个金发女孩穿着粉色上衣和红色裙子，用一根长绳子将电话机拉到自己面前，然后躺在地上打电话。她表情丰富，时而开心，时而惊讶，时而认真，时而生气，时而难过。她不断变换姿势，包括仰卧、侧卧、倒立等，但始终保持着打电话的动作。",
    "E100.Busy.Buddies_scene010.mp4": "猫从墙角探出头，看到老鼠从洞里探出头，猫兴奋地扑过去，老鼠迅速跑出洞口逃跑。",
    "E100.Busy.Buddies_scene011.mp4": "一只老鼠杰瑞偷偷溜进厨房，从一个标有“COOKIES”的紫色罐子里偷吃饼干。他吃得很开心，但不小心把饼干屑洒得到处都是。这时，汤姆从冰箱里探出头来，手里拿着一大块西瓜，正津津有味地吃着，完全没注意到杰瑞的恶作剧。",
    "E100.Busy.Buddies_scene012.mp4": "一个金发女人穿着粉色上衣和红色裙子，躺在地板上，用电话交谈。她的一条腿搭在旁边的柜子上，另一条腿翘起。她一边打电话一边调整姿势，显得很放松。随后，一个婴儿爬进画面，靠近女人，女人继续打电话，没有理会婴儿。婴儿在女人身边爬行，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会婴儿。婴儿爬到女人的腿边，女人继续打电话，没有理会",
    "E100.Busy.Buddies_scene013.mp4": "在厨房里，汤姆猫正拿着一瓶牛奶，喝得满身都是。杰瑞鼠站在旁边的柜子上，手里拿着一块饼干，看着汤姆。突然，一个婴儿从柜子后面爬出来，汤姆看到后吓得往后退，而杰瑞则继续吃着饼干。",
    "E100.Busy.Buddies_scene014.mp4": "一个婴儿在地板上爬行，随后汤姆猫拿着奶瓶出现，试图喂婴儿，但婴儿哭了起来，汤姆猫显得无奈。",
    "E100.Busy.Buddies_scene015.mp4": "一个穿着尿布、有金色卷发的婴儿从画面右侧爬行进入，然后伸手抓住墙角，向上攀爬，最终消失在墙角上方。",
    "E100.Busy.Buddies_scene016.mp4": "一只老鼠拿着奶酪在角落里，突然一个婴儿爬过来，老鼠吓得跑开，婴儿爬进水槽里，老鼠又回来拉婴儿的尿布，结果婴儿被拉得翻了个身，最后婴儿掉在地上，老鼠也消失了。",
    "E100.Busy.Buddies_scene017.mp4": "视频中，一只灰色的猫（汤姆）试图把一个哭泣的婴儿放在床上。猫先是用爪子托着婴儿，然后将婴儿放在床上。接着，猫试图用被子盖住婴儿，但被子被婴儿踢开。猫显得非常困惑和沮丧，最后它站在床上，双手扶着床栏，看起来很无奈。",
    "E100.Busy.Buddies_scene018.mp4": "一个婴儿在房间里爬行，汤姆猫突然出现，试图抓住婴儿，但婴儿没有反应，汤姆猫最终转身离开。",
    "E100.Busy.Buddies_scene019.mp4": "汤姆猫在房间里伸展身体，一个婴儿爬到他的背上，然后被他轻轻放在婴儿床里。汤姆猫随后站在床边，开心地拍手。",
    "E100.Busy.Buddies_scene020.mp4": "一位金发女子穿着粉色上衣和酒红色裙子，躺在地板上，用黑色电话听筒打电话。她一边说话一边调整姿势，从躺着变成侧身，最后坐起。背景是一个壁炉和一个木柜，柜子上放着一部黑色电话机。",
    "E100.Busy.Buddies_scene021.mp4": "一个婴儿在婴儿床里，看着门口。一个小女孩从门后探出头来，然后又缩回去。",
    "E100.Busy.Buddies_scene022.mp4": "一位金发女士穿着粉色上衣和紫色裙子，躺在地板上，一边打电话一边用脚翘起，脚尖放在旁边的木柜上。她正在愉快地交谈，突然一个婴儿爬到她身边，她把电话放在耳边，继续和电话另一头的人交谈。婴儿爬到她的腿上，她用脚尖轻轻推了一下婴儿，婴儿爬到了柜子上，她继续打电话，脸上露出微笑。",
    "E100.Busy.Buddies_scene023.mp4": "汤姆猫正在厨房的台子上倒牛奶，杰瑞鼠站在旁边看着。汤姆猫倒完牛奶后，杰瑞鼠突然跳起来，汤姆猫惊讶地看向它。",
    "E100.Busy.Buddies_scene024.mp4": "一个婴儿在地板上爬行，经过一张桌子的桌腿。随后，汤姆猫拿着一瓶牛奶，坐在一个篮子上，看着婴儿。",
    "E100.Busy.Buddies_scene025.mp4": "汤姆猫正在喝一瓶黄色液体，喝的过程中液体从瓶口溢出，洒在他的脸上和身上。",
    "E100.Busy.Buddies_scene026.mp4": "汤姆猫坐在一个棕色的物体上，正在喝一瓶液体。他喝得非常急，液体从他的鼻子和嘴巴里喷出来。突然，他被一个从上方伸出的木制结构绊倒，身体失去平衡，向后仰倒。他摔倒后，身体悬在空中，四肢张开，看起来非常惊慌。最后，他稳住身体，站在地上，脸上带着惊恐的表情，眼睛睁得很大，嘴巴张开，似乎在惊呼。",
    "E100.Busy.Buddies_scene027.mp4": "一个棕色的篮子在绿色地板上滚动，随后汤姆猫从角落冲出来，试图抓住杰瑞鼠。汤姆猫用篮子挡住杰瑞鼠，但杰瑞鼠躲进了一个洞里。突然，从洞里喷出大量黑色的烟雾和污渍，汤姆猫被熏得跳起来，而杰瑞鼠则在烟雾中逃跑。",
    "E100.Busy.Buddies_scene028.mp4": "汤姆从楼梯上滑下来，追着杰瑞跑。杰瑞在楼梯上跑，汤姆在楼梯下追。汤姆追不上杰瑞，杰瑞跑到了楼梯的尽头。",
    "E100.Busy.Buddies_scene029.mp4": "镜头沿着一根管道缓慢移动，管道由金属带固定，背景为深紫色的地面，地面上有黑色污渍。镜头逐渐靠近管道的弯曲处，展示了管道的连接细节。",
    "E100.Busy.Buddies_scene030.mp4": "在昏暗的房间里，汤姆猫从空中坠落，抓住一把红色的铲子。他用铲子打开一个蓝色的通风口，发现里面坐着一个黑色的小猫，它戴着黄色的发带，坐在铲子的铲头上。汤姆猫惊讶地看着小黑猫，而小黑猫则调皮地眨着眼睛。突然，一个棕色的小老鼠从通风口后面探出头来，似乎在偷看这一幕。汤姆猫和小黑猫对视，气氛紧张。",
    "E100.Busy.Buddies_scene031.mp4": "汤姆猫在婴儿床边，揭开绿色毯子，露出一个婴儿。他温柔地抚摸婴儿的头发，然后拿起一本书，似乎在读故事。突然，杰瑞老鼠从床头板上跳下来，汤姆猫惊慌失措地伸手去抓，但杰瑞迅速逃走。汤姆猫最终离开，留下婴儿独自坐在床上。",
    "E100.Busy.Buddies_scene032.mp4": "一位金发女子正在打电话，随后画面切换到汤姆猫和杰瑞鼠。杰瑞鼠拿着纸巾，用纸巾给汤姆猫包扎头部，但汤姆猫看起来很不高兴。杰瑞鼠继续用纸巾擦拭汤姆猫的头部，汤姆猫的表情变得痛苦。最后，汤姆猫的头上出现了一个纸巾做的帽子，杰瑞鼠看着汤姆猫，汤姆猫则显得很无奈。",
    "E100.Busy.Buddies_scene033.mp4": "一个穿着尿布的婴儿正在爬楼梯，他从楼梯底部开始，一级一级向上爬，最终爬到了楼梯的顶部并消失在画面中。",
    "E100.Busy.Buddies_scene034.mp4": "一个婴儿从窗户爬出，趴在一根绳子上，随后汤姆猫从窗户探出头来，惊讶地看着婴儿。",
    "E100.Busy.Buddies_scene035.mp4": "一个穿着尿布、头顶小角的婴儿在一根横杆上爬行，随后灰色的猫汤姆出现，试图在横杆上保持平衡，但婴儿的爬行导致汤姆失去平衡，最终汤姆从横杆上滑落。",
    "E100.Busy.Buddies_scene036.mp4": "一个穿着尿布、长着小角的橙色小婴儿被两根绳子吊在一根金属杆的顶端，背景是蓝色的水面。小婴儿在空中摆动，绳子随之晃动，婴儿张开双臂，似乎在享受飞翔的感觉。",
    "E100.Busy.Buddies_scene037.mp4": "一个穿着尿布的婴儿被一根绳子吊着，从窗户飞进房间，然后飞向天花板。",
    "E100.Busy.Buddies_scene038.mp4": "一只棕色的小老鼠在房间里奔跑，它从一个家具上跳下，接着被一个从天而降的婴儿撞倒。小老鼠抱着婴儿继续跑，最终跳上床沿，婴儿被抛向空中。",
    "E100.Busy.Buddies_scene039.mp4": "汤姆从楼梯上滑下来，手里拿着一个婴儿篮，篮子里有一个婴儿。他小心翼翼地抱着婴儿，走向房间，小老鼠杰瑞跟在他后面。汤姆把婴儿放在婴儿床边，然后把婴儿放进婴儿床里。",
    "E100.Busy.Buddies_scene040.mp4": "一只老鼠用尾巴托着一个婴儿，婴儿在老鼠的尾巴上摇晃，然后摔倒在地，老鼠也跟着摔倒。之后，老鼠又把婴儿托起来，重复之前的动作。",
    "E100.Busy.Buddies_scene041.mp4": "汤姆猫站在婴儿床旁，双手扶着床栏，表情专注地看着床内。他先是皱眉，随后露出微笑，似乎在思考或观察着什么。背景是绿色的墙壁和木质床栏，床上铺着粉色的被子。",
    "E100.Busy.Buddies_scene042.mp4": "一个婴儿在地板上哭泣，旁边有一只老鼠玩具。一只猫拿着绳子跳进来，试图用绳子缠住婴儿和老鼠，结果自己被绳子缠住，动弹不得。婴儿停止哭泣，爬向猫，猫看起来很无奈。",
    "E100.Busy.Buddies_scene043.mp4": "一个婴儿在地板上爬行，靠近一把椅子。一只小老鼠出现，向婴儿打招呼并试图与之互动。婴儿伸手触摸老鼠，导致老鼠被压扁在地上。婴儿爬走后，老鼠躺在地上不动。",
    "E100.Busy.Buddies_scene044.mp4": "一个婴儿在地板上爬行，突然出现的汤姆猫被婴儿撞到，汤姆猫惊慌失措地倒挂在门上。",
    "E100.Busy.Buddies_scene045.mp4": "一个婴儿在门廊上爬行，随后汤姆猫和杰瑞鼠从左侧跑入画面，汤姆猫停下来看着杰瑞鼠。",
    "E100.Busy.Buddies_scene046.mp4": "一个穿着尿布的橙色小婴儿，从一条通往房子的蓝色小路上爬行，然后从路的尽头滚落消失。",
    "E100.Busy.Buddies_scene047.mp4": "在夜晚的街道上，一只灰色的猫汤姆追逐着一只棕色的小老鼠杰瑞。杰瑞巧妙地躲藏在邮筒后面，汤姆则用叉子试图抓住它。当汤姆用叉子撬开邮筒时，里面突然冒出一个婴儿，汤姆被吓了一跳，而杰瑞则趁机逃跑。",
    "E100.Busy.Buddies_scene048.mp4": "汤姆抱着一个婴儿在草地上奔跑，杰瑞在后面追赶。汤姆跑过一个灌木丛时，灌木丛突然爆炸，形成一个巨大的阴影。汤姆和婴儿被阴影笼罩，杰瑞也出现在阴影中。汤姆从阴影中跳出，继续抱着婴儿逃跑，杰瑞则从阴影中跑开。",
    "E100.Busy.Buddies_scene049.mp4": "汤姆抱着一个婴儿在草地上奔跑，突然被一根晾衣绳绊倒，身体被拉扯着翻滚，最终躺在地上，表情痛苦。",
    "E100.Busy.Buddies_scene050.mp4": "视频开始时，镜头展示了一个蓝色屋顶的房子和一些树木。随后，一个穿着尿布的橙色婴儿从画面左侧出现，他坐在地上，然后向右移动。接着，镜头切换到一个灰色的猫，它正在推着一个红色的婴儿车。猫在草地上奔跑，婴儿车在它后面跟着。婴儿突然从婴儿车里飞出来，被一个白色的毯子包裹着，悬在空中。猫停下来看着婴儿，然后继续推着婴儿车前进。",
    "E100.Busy.Buddies_scene051.mp4": "一只小老鼠在窗台上跳舞，一只猫推着婴儿车从门口经过，猫从婴儿车里拿出一个婴儿，婴儿被小老鼠抱走，猫追着小老鼠跑。",
    "E100.Busy.Buddies_scene052.mp4": "一只老鼠抱着一个哭泣的婴儿在房间里跑，猫汤姆突然出现，抢过婴儿，然后把婴儿放在婴儿床里，自己站在旁边，表情得意地看着老鼠。",
    "E100.Busy.Buddies_scene053.mp4": "汤姆猫站在一个木制栏杆旁，他先是用牙刷刷牙，然后用纸巾擦嘴，接着继续刷牙并露出满意的笑容。背景中有一个绿色的柜子，上面放着一个标有“BABY”字样的瓶子和一叠白色的毛巾。",
    "E100.Busy.Buddies_scene054.mp4": "汤姆猫站在绿色柜子旁，看到杰瑞鼠从左侧跑过，他迅速扑向杰瑞，但因惯性身体向前倾倒，最终滑倒在地。",
    "E100.Busy.Buddies_scene055.mp4": "猫和老鼠在墙角相遇，猫从墙后探出头，老鼠在地面上抬头看着猫。",
    "E100.Busy.Buddies_scene056.mp4": "一个戴帽子和眼镜、叼着烟斗的男子正在脱下灰色大衣，露出里面的蓝色西装。他旁边站着一位穿着紫色外套、戴着紫色帽子的女子，手里拿着白色手套。右边站着一位穿着粉色上衣和红色裙子的金发女子，她双手叉腰，面带微笑地看着他们。三人站在室内，背景是门和墙壁。",
    "E100.Busy.Buddies_scene057.mp4": "在墙角处，一只灰色的猫和一只棕色的老鼠正对视着。猫从墙后探出头，眼睛闪烁着黄色的光芒，显得非常警觉和专注。老鼠则在地面上，也保持着警惕的姿态，眼睛紧盯着猫。两者都处于静止状态，似乎在互相观察，准备随时做出反应。",
    "E100.Busy.Buddies_scene058.mp4": "视频展示了一个婴儿在婴儿床里睡觉的场景。婴儿穿着白色尿布，趴在床上，闭着眼睛，脸上带着微笑。婴儿床是木质的，床单是蓝色的，床边有一条红色的毯子。婴儿偶尔会睁开眼睛，然后又闭上。最后画面变黑，出现“The End”字样，随后显示“An M.G.M. Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样。"
}