{
    "E68.Little.Runaway_scene001.mp4": "视频展示了米高梅动画的标志，背景为深红色，标志中央是一只咆哮的狮子，下方有“CARTOON”字样和“COLOR BY TECHNICOLOR”的文字。",
    "E68.Little.Runaway_scene002.mp4": "这是一个米高梅动画片的片头，画面中央是一个咆哮的狮子头像，周围环绕着蓝色的装饰性边框。狮子下方是“Metro-Goldwyn-Mayer CARTOON”字样，底部注明“COLOR BY TECHNICOLOR”。背景为红色，整体风格复古，具有经典动画片的标志性特征。",
    "E68.Little.Runaway_scene003.mp4": "视频展示了米高梅动画的标志，随后出现《猫和老鼠》的标题画面，背景为红色渐变圆环，汤姆猫和杰瑞鼠的卡通形象出现在标题下方。",
    "E68.Little.Runaway_scene004.mp4": "这是一个《猫和老鼠》动画片的片头画面，展示了主角汤姆和杰瑞的卡通形象。背景是红色的同心圆图案，下方有黄色的“TOM and JERRY”字样。随后，画面出现“LITTLE RUNAWAY”字样，以及导演威廉·汉纳和约瑟夫·巴伯拉的名字。",
    "E68.Little.Runaway_scene005.mp4": "视频片段展示了动画片《Little Runaway》的片头。首先，画面显示了标题“LITTLE RUNAWAY”和导演William Hanna和Joseph Barbera的名字。随后，动画师、音乐制作人和制片人的名字依次出现。最后，画面切换到一个夜晚的马戏团场景，一个穿着蓝色衣服的角色坐在地上，背景是马戏团的帐篷和海报。",
    "E68.Little.Runaway_scene007.mp4": "一片绿叶在空中飘动，镜头逐渐向右移动，最终聚焦于一栋石砌建筑的入口，建筑旁有石板小径和绿色植物。",
    "E68.Little.Runaway_scene009.mp4": "一只蓝色的海豚在室内地毯上跳舞，它挥动着手臂，摆动着身体，尾巴轻轻拍打地面，显得活泼可爱。",
    "E68.Little.Runaway_scene010.mp4": "在室内地毯上，汤姆猫坐在一个空盘子旁，表情困惑。杰瑞鼠戴着蓝色帽子，兴奋地在汤姆面前跳舞，动作夸张，似乎在表演或炫耀什么。汤姆则保持静止，目不转睛地看着杰瑞，显得有些无奈或不解。背景是绿色的沙发和木质家具，整体氛围轻松幽默。",
    "E68.Little.Runaway_scene011.mp4": "一只蓝色的卡通海豚在室内地毯上跳舞，它挥动双臂，做出各种舞蹈动作，表情开心。",
    "E68.Little.Runaway_scene012.mp4": "动画片中的汤姆猫坐在桌边，先是侧头看向一侧，随后张大嘴巴，似乎在惊讶或大叫。背景为绿色墙壁，旁边有台灯和盆栽。",
    "E68.Little.Runaway_scene013.mp4": "一只蓝色的小海豚在室内地毯上跳舞，它先是左右摇摆，然后举起一只鳍，接着又换另一只鳍，最后转身跑向画面左侧并消失在镜头中。",
    "E68.Little.Runaway_scene014.mp4": "汤姆猫站在房间里，先是张开双臂，然后双手合十，接着用爪子捂住嘴巴，露出得意的笑容。背景中可以看到一张桌子和一盏台灯。",
    "E68.Little.Runaway_scene015.mp4": "一只蓝色的小海豚在房间角落里跳舞，它先是独自跳舞，然后一只棕色的小老鼠出现，它先是抱住小海豚，然后又松开，最后小海豚被小老鼠推倒在地。",
    "E68.Little.Runaway_scene016.mp4": "视频展示了一个卡通场景，其中一只蓝色的鱼在后院的游泳池边跳跃和玩耍。随后，一只猫（汤姆）出现，试图抓住鱼。猫成功将鱼从水中捞起，但鱼在被抓住时突然变成了一只黑色的猫，然后又回到了水中。猫显得非常惊讶和困惑，最后它转身离开，似乎对刚才发生的事情感到不解。整个场景充满了幽默和卡通式的夸张表现。",
    "E68.Little.Runaway_scene017.mp4": "一只小老鼠在花园里奔跑，被一只蓝猫追逐。猫扑向老鼠，但老鼠灵活地躲开，猫扑空后摔倒。老鼠继续逃跑，猫重新站起来追赶，最终猫抓到了老鼠。",
    "E68.Little.Runaway_scene018.mp4": "汤姆猫伸出爪子抓住杰瑞鼠，杰瑞鼠奋力挣扎，最终从汤姆猫手中逃脱，汤姆猫惊讶地抬头看着空中的杰瑞鼠。",
    "E68.Little.Runaway_scene019.mp4": "在一片绿色的灌木丛前，一只黑色的小猫托着一只灰色的猫（汤姆猫）做各种高难度的杂技动作。汤姆猫先是被托举着，接着在空中翻转，做出倒立、旋转等动作，最后被黑色小猫托着向上抛起，然后消失在画面中，只留下黑色小猫独自坐在地上。",
    "E68.Little.Runaway_scene020.mp4": "汤姆猫从空中坠落，撞上一个黄色的鸟浴盆，导致鸟浴盆翻倒并砸在汤姆头上。汤姆被砸得晕头转向，最终坐在地上，用鸟浴盆当帽子遮住脸，显得非常狼狈。",
    "E68.Little.Runaway_scene021.mp4": "一只黑色的小猫蹲在草地上，表情显得有些惊讶和好奇。随后，一只棕色的小老鼠从画面右侧跑出来，靠近小猫。小猫转头看着小老鼠，似乎对它的出现感到惊讶。接着，小猫抬头望向房屋的窗台，窗台上摆放着一盆绿色植物和一台收音机。整个场景发生在户外，背景是一面黄色的墙壁和绿色的草地。",
    "E68.Little.Runaway_scene022.mp4": "一只黑色的小猫坐在草地上，面向右侧，注视着前方。一只棕色的小老鼠从左侧靠近小猫，小猫转头看着小老鼠，随后小老鼠继续向右移动，小猫也跟着转动头部观察小老鼠。背景是一面白色砖墙和黄色的房屋外墙，墙角有绿色的灌木丛。",
    "E68.Little.Runaway_scene023.mp4": "一只灰色的猫站在一个黄色的圆盘旁边，它先是警惕地四处张望，然后突然露出开心的笑容，接着又表现出惊讶和困惑的表情。背景是一个木制围栏和绿色的灌木丛。",
    "E68.Little.Runaway_scene024.mp4": "一只小老鼠和一只黑猫在草地上对峙，突然一个装满钱的袋子出现，小老鼠逃跑，黑猫追上并抢走袋子。黑猫得意地抱着袋子，但袋子突然变成了一只黑猫，黑猫惊讶地看着它。",
    "E68.Little.Runaway_scene025.mp4": "在后院的草地上，一只小老鼠拖着一个大袋子奔跑，袋子里装着一只黑色的小猫。一只灰猫（汤姆）追赶并试图抓住小老鼠，但小老鼠巧妙地将袋子里的小猫甩出来，然后自己钻进袋子。汤姆被袋子绊倒，最终袋子被小老鼠拉走，汤姆愤怒地跳起来，表情夸张地大叫。",
    "E68.Little.Runaway_scene026.mp4": "一只老鼠从门后跑出，拖着一个巨大的棕色袋子。它跑过一个红色的消防栓，然后被一只从墙后伸出的黑猫吓到，老鼠惊慌地跳开，袋子掉在地上。",
    "E68.Little.Runaway_scene027.mp4": "汤姆猫从门后探出头，迅速跳过门柱，然后消失在画面中。",
    "E68.Little.Runaway_scene028.mp4": "一只猫从墙后冲出，扑向一个棕色的物体，结果被物体反弹，撞在墙上，身体碎裂成碎片，最后瘫倒在地。",
    "E68.Little.Runaway_scene029.mp4": "一个棕色的小老鼠从房子的排水管里跑出来，一只黑色的小猫从排水管里滑出来，追逐着小老鼠。小猫追着小老鼠跑，最后小猫从排水管里滑出来，站在地上，愤怒地瞪着小老鼠。",
    "E68.Little.Runaway_scene030.mp4": "动画片段中，一只黑色的小猫从屋顶的排水管上滑落，随后一只灰色的猫（汤姆）从下方伸手试图抓住它。汤姆攀爬到排水管上，试图抓住小猫，但小猫迅速跳开，汤姆在追赶过程中失去平衡，从屋顶边缘滑落。",
    "E68.Little.Runaway_scene031.mp4": "一只黑色的小猫从黄色房子的屋顶跳到电线杆上，沿着电线滑行。",
    "E68.Little.Runaway_scene032.mp4": "一只黑猫在屋顶上用绳子荡来荡去，随后一只灰猫（汤姆）出现在屋顶上，紧盯着黑猫，似乎在准备追捕。",
    "E68.Little.Runaway_scene033.mp4": "一只黑色的猫正用爪子抓着一根绳子，在空中荡来荡去，背景是绿色的草地、白色的栅栏和一些房屋。猫从左向右荡过，经过了栅栏和一棵树，最后消失在画面右侧。",
    "E68.Little.Runaway_scene034.mp4": "一只黑色的小猫沿着电线滑行，随后跳到电线杆顶端，停住并环顾四周。",
    "E68.Little.Runaway_scene035.mp4": "一只猫在屋顶上，抓着一根绳子，然后被绳子拉起并飞向空中，最后消失在画面中。",
    "E68.Little.Runaway_scene036.mp4": "汤姆猫被一根绳子吊在空中，随后被绳子缠绕在树上，身体被拉长，最终被卡在树干中，只有眼睛和爪子露在外面。",
    "E68.Little.Runaway_scene038.mp4": "一只棕色小老鼠拿着一个装满水的玻璃杯，走到一片绿色草地上。突然，一只黑色的猫从空中跳下，将老鼠吓了一跳，同时水杯中的水溅了出来。猫飞过老鼠头顶，老鼠则被吓得向后退去。",
    "E68.Little.Runaway_scene039.mp4": "一只灰色的猫站在电线杆上，它试图跳过电线，但失足跌落，身体倒挂并继续下坠。",
    "E68.Little.Runaway_scene040.mp4": "视频中，汤姆猫先是被水杯困住，随后被镜头切换到他用剪刀剪轮胎，结果轮胎变成了一条黑色的长条，汤姆猫被包裹在其中，最后他挣脱出来并跑开。",
    "E68.Little.Runaway_scene041.mp4": "一只小老鼠头顶红黄相间的球，与一只黑猫在户外玩耍。黑猫试图抢球，但被小老鼠巧妙地躲过。黑猫多次尝试跳跃和扑击，却屡屡失败，最终愤怒地在地上挖洞，把小老鼠埋了起来。黑猫看着被埋的小老鼠，显得非常得意。",
    "E68.Little.Runaway_scene042.mp4": "一只棕色的小老鼠从土堆里钻出来，它先是露出惊讶的表情，然后四处张望。",
    "E68.Little.Runaway_scene043.mp4": "两只猫在户外玩耍，它们用一个红黄相间的球进行互动。大猫和小猫轮流将球抛向空中，然后接住。大猫随后将球抛向一扇门，球撞击门后弹回，大猫继续在门后玩球，最后球滚出画面。",
    "E68.Little.Runaway_scene044.mp4": "一只黑色的小猫在人行道上开心地蹦跳，背景是绿色的灌木和房屋。",
    "E68.Little.Runaway_scene045.mp4": "一只穿着黑色兔子服装的猫躲在墙角，被一个拿着网的人影逼近，随后被网捕获。猫被网罩住后，从网中挣脱出来，跑向一只小老鼠，与之对视。",
    "E68.Little.Runaway_scene046.mp4": "一辆红色的马戏团货车在街道上行驶，车后部有栅栏，一只黑猫在里面挥舞双臂。货车驶过拐角后消失，随后画面切换到一个马戏团表演场景，观众席和表演台清晰可见。",
    "E68.Little.Runaway_scene047.mp4": "在马戏团的帐篷内，聚光灯照射下，一只黑猫坐在圆形表演台上，周围是观众席，观众们戴着帽子观看表演。",
    "E68.Little.Runaway_scene048.mp4": "在马戏团的舞台上，一只穿着黑色表演服的猫坐在一个装饰有星星的桶上，面前摆放着四支黄色的喇叭。猫先是用爪子拨弄喇叭，然后站起身，张开双臂，做出表演的姿势。接着，它兴奋地跳跃起来，但被一只蓝色的小鸟突然袭击，导致它被水花溅湿，最后抱着小鸟，表情惊慌。观众席上的人们在观看这场表演。",
    "E68.Little.Runaway_scene049.mp4": "视频开始时显示“THE END”字样，随后逐渐过渡到“An MGM Tom and Jerry CARTOON”标志，下方标注“MADE IN HOLLYWOOD, U.S.A.”，背景为红色渐变。最后画面逐渐变暗。"
}