{
    "S1950E50 - Pecos Pest_scene001.mp4": "视频展示了米高梅动画的标志，背景为深蓝色，标志中央是一只咆哮的狮子，上方写着“A METRO-GOLDWYN-MAYER”，下方是“CARTOON”和“COLOR BY TECHNICOLOR”的字样。",
    "S1950E50 - Pecos Pest_scene002.mp4": "视频展示了米高梅动画公司的标志，一只狮子在圆形框架中咆哮，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。随后画面变暗，出现“Tom and Jerry”的标题，旁边是汤姆猫和杰瑞鼠的卡通形象。",
    "S1950E50 - Pecos Pest_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深蓝色，左侧是杰瑞，右侧是汤姆，中间是黄色的“Tom and Jerry”字样。随后画面中出现“Decos Pest”字样和导演信息“Directed by William Hanna and Joseph Barbera”，背景中还出现了吉他和仙人掌等元素。",
    "S1950E50 - Pecos Pest_scene004.mp4": "这是一个动画片的片头画面，背景是深蓝色的沙漠，画面中央是一把紫色的吉他，吉他的右侧是标题“Pecos Pest”，下方写着“Directed by WILLIAM HANNA and JOSEPH BARBERA”。画面右下角有一个仙人掌的剪影。随后，画面下方逐渐出现制作人员名单和版权信息。",
    "S1950E50 - Pecos Pest_scene005.mp4": "视频开头显示了动画制作的工作人员名单，包括动画师、背景绘制师和音乐指导等。随后，画面切换到由Fred Quimby制作的字样。最后，视频展示了一封电报，内容是Pecos Mouse写给侄子Jerry Mouse的，告知他即将前往大城市进行电视首演，并会在那里过夜。",
    "S1950E50 - Pecos Pest_scene006.mp4": "这是一个黄色背景的西部电报，上面用蓝色字体写着内容。电报的标题是“WESTERN TELEGRAM”，发件地是“TEXAS”，收件人是“JERRY MOUSE”，时间为“9:50 P.M.”。电报内容是：“DEAR NEPHEW ME AND MY GUITAR ON WAY TO BIG CITY FOR TELEVISION DEBUT --- STOP WILL SPEND NIGHT WITH YOU. UNCLE PECOS”。这是一封来自“UNCLE PECOS”的电报，告知“JERRY MOUSE”他和吉他正前往大城市进行电视首秀，并会在那里过夜。",
    "S1950E50 - Pecos Pest_scene007.mp4": "一只棕色的小老鼠站在房间里，手里拿着一张黄色的纸，低头阅读。它先是面带微笑，随后表情变得惊讶，眼睛睁大，嘴巴微张。房间内光线昏暗，背景中有一个蓝色的柜子和一个圆形的物体。",
    "S1950E50 - Pecos Pest_scene010.mp4": "在洞穴中，一只棕色的小老鼠站在树干旁，看着另一只戴着黑色宽边帽、留着白色胡须、穿着蓝色靴子的灰色老鼠。灰老鼠手持一把黄色的曼陀林，正在弹奏音乐。小老鼠先是好奇地观察，然后靠近灰老鼠，似乎在欣赏音乐或与之互动。灰老鼠继续弹奏，小老鼠则表现出愉悦和投入的神情，偶尔点头或微笑。整个场景充满温馨和欢乐的氛围。",
    "S1950E50 - Pecos Pest_scene011.mp4": "一个戴着黑色宽边帽、留着白色长胡子的卡通角色，穿着蓝色靴子和红色领巾，正在弹奏一把黄色的曼陀林。背景是深色木质纹理的墙壁。角色在弹奏过程中，头部和身体有轻微的动作，似乎在随着音乐摇摆。",
    "S1950E50 - Pecos Pest_scene012.mp4": "一个戴着黑色牛仔帽、红色围巾和白色胡须的卡通角色正在弹奏一把黄色的吉他。他站在木制背景前，专注地拨动琴弦，偶尔抬头微笑，表现出愉悦和投入。整个画面充满西部风情，角色的动作流畅自然，传达出一种轻松愉快的氛围。",
    "S1950E50 - Pecos Pest_scene013.mp4": "在洞穴中，一只穿着牛仔服装、戴着宽边帽、系着红色围巾、手持黄色曼陀林琴的小老鼠正在弹奏。另一只棕色小老鼠站在树干旁，好奇地观察着。弹奏者不断调整帽子和琴弦，随后转身离开，棕色小老鼠目送其离去。",
    "S1950E50 - Pecos Pest_scene014.mp4": "一个戴着黑帽子、拿着吉他的人物从门后走出，随后一只棕色小老鼠从左侧门后探出头来，好奇地观察四周。",
    "S1950E50 - Pecos Pest_scene015.mp4": "一只小老鼠戴着帽子，拿着乐器在弹奏，旁边躺着一只蓝猫。小老鼠弹奏时，蓝猫被吵醒并表现出惊讶和不满。随后，小老鼠继续弹奏，蓝猫则蹲在旁边，表情从惊讶转为愤怒。最后，小老鼠被一只棕色的老鼠拖走，蓝猫则愤怒地盯着他们。",
    "S1950E50 - Pecos Pest_scene018.mp4": "汤姆猫从门后探出头来，然后迅速跳开，门也随之被撞开。",
    "S1950E50 - Pecos Pest_scene019.mp4": "杰瑞和一只老鼠从门后偷偷溜出，被汤姆从门后突然出现并追赶。汤姆愤怒地冲出，试图抓住他们，但最终未能成功。",
    "S1950E50 - Pecos Pest_scene020.mp4": "在厨房里，汤姆猫试图抓住杰瑞鼠，但杰瑞鼠躲进了一个橙色的柜子。汤姆猫把柜子扔在地上，然后看着杰瑞鼠从柜子里探出头来。汤姆猫生气地冲向杰瑞鼠，但杰瑞鼠迅速跑开了。",
    "S1950E50 - Pecos Pest_scene021.mp4": "汤姆从门后突然跳出，惊慌失措地向后退，随后发现一只小老鼠在门缝里，他试图用爪子抓住它，但小老鼠迅速逃走。汤姆最终无奈地站在门口，看着小老鼠消失在门后。",
    "S1950E50 - Pecos Pest_scene022.mp4": "汤姆猫在角落里发现了一把拖把和一个水桶，他迅速拿起拖把，准备进行清洁。此时，杰瑞鼠从画面左侧悄悄出现，汤姆猫立刻察觉到他的存在，随即用拖把猛烈地挥舞起来，试图驱赶杰瑞鼠。杰瑞鼠则灵活地躲避着汤姆的攻击，场面充满紧张和趣味。",
    "S1950E50 - Pecos Pest_scene023.mp4": "一个穿着黑色帽子和蓝色裤子的小人从扫帚的毛刷部分慢慢探出头来，手里拿着一把吉他，然后完全爬到扫帚柄上。",
    "S1950E50 - Pecos Pest_scene024.mp4": "汤姆猫用拖把用力推窗，导致窗户玻璃破碎。随后，杰瑞鼠从窗外爬进房间。",
    "S1950E50 - Pecos Pest_scene025.mp4": "汤姆猫从门外跑进来，撞上门，然后摔倒在地。",
    "S1950E50 - Pecos Pest_scene026.mp4": "汤姆猫站在墙边，眼睛盯着墙上的小门。他伸出爪子，试图打开小门，但小门突然弹开，汤姆被弹飞出去，撞在墙上。他捂着脸，一脸惊讶和痛苦，随后又恢复了平静，继续盯着小门。",
    "S1950E50 - Pecos Pest_scene027.mp4": "一个房间内，红色窗帘被拉开，一只猫从窗帘后快速滑过，随后窗帘重新垂下。接着，一只小老鼠从右侧悄悄出现，小心翼翼地在地板上移动，似乎在寻找什么。",
    "S1950E50 - Pecos Pest_scene028.mp4": "一个穿着盔甲的蓝色角色躺在黄色扶手椅上，一边读着紫色书，一边抽着雪茄。一只戴着帽子的小老鼠从右侧进入画面，靠近角色。角色似乎没注意到小老鼠，继续阅读和吸烟。随后，角色突然被惊醒，扶手椅翻倒，角色摔在地上。",
    "S1950E50 - Pecos Pest_scene029.mp4": "一个穿着牛仔服装的小老鼠拿着一把大钥匙，走向一个蓝色的盔甲。他把钥匙插进盔甲的锁孔，盔甲打开，露出里面的猫。猫看到小老鼠后，愤怒地伸出爪子攻击他，小老鼠被击退。",
    "S1950E50 - Pecos Pest_scene030.mp4": "在房间内，一只小老鼠戴着帽子拿着吉他，站在地毯上。一只猫从椅子上跳起，旋转着飞出画面，留下旋转的轨迹。房间内有一张小桌子，上面放着一盏紫色灯罩的台灯。",
    "S1950E50 - Pecos Pest_scene031.mp4": "一只猫从门后快速伸出身体，然后迅速缩回，门随之关闭。",
    "S1950E50 - Pecos Pest_scene032.mp4": "一个穿着牛仔服装、戴着宽边帽的卡通角色正在弹奏一把黄色的吉他。他站在一个拱形门洞前，背景是紫色的地面和蓝色的窗帘。在门洞里，一只棕色的小猫探出头来，好奇地看着弹吉他的角色。小猫随后完全走出门洞，站在那里，继续注视着吉他手。整个场景充满了轻松愉快的氛围。",
    "S1950E50 - Pecos Pest_scene036.mp4": "电视屏幕上，一个戴着黑色帽子、穿着蓝色裤子的角色正在黄色幕布前弹奏一把白色吉他。角色头部有白色羽毛装饰，表情专注。随着画面逐渐变暗，最终屏幕完全变黑，出现“The End”字样。",
    "S1950E50 - Pecos Pest_scene037.mp4": "视频展示了“Tom and Jerry”动画片的片尾画面，背景为红色渐变，中央是“THE END”字样，随后出现“An MGM Tom and Jerry Cartoon”和“MADE IN HOLLYWOOD, U.S.A.”字样。",
    "S1950E50 - Pecos Pest_scene038.mp4": "视频开头显示了“An MGM Tom and Jerry Cartoon”标题，背景为深红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”。随后画面转为全黑。"
}