{
    "12. Baby Puss_scene001.mp4": "视频开始时显示一个黑色背景，右下角有白色数字“0110544170204083”。随后，画面逐渐变亮，出现“Metro-Goldwyn-Mayer CARTOON”字样，上方有一个红色圆形标志，标志内是一个咆哮的狮子形象。下方还有“COLOR BY Technicolor”的字样。整个画面呈现出经典动画片头的风格。",
    "12. Baby Puss_scene002.mp4": "这是一个米高梅动画片的开场标志，画面中央是一只咆哮的狮子，背景为红色，下方有“Metro-Goldwyn-Mayer CARTOON”字样，以及“COLOR BY Technicolor”的说明。狮子在标志中不断张嘴咆哮，表现出威严和动感。",
    "12. Baby Puss_scene003.mp4": "视频展示了米高梅动画的标志，随后出现《猫和老鼠》的标题画面，背景为红色圆形图案，猫和老鼠的形象在标题下方。",
    "12. Baby Puss_scene004.mp4": "视频展示了经典动画《猫和老鼠》的开场画面，背景为红色渐变圆环，前景是大猫汤姆和小老鼠杰瑞的卡通形象，汤姆张大嘴巴露出牙齿，杰瑞则在旁边微笑。画面下方是黄色的“TOM and JERRY”字样。随后画面过渡到标题“BABY PUSS”，并显示导演信息“Directed by WILLIAM HANNA and JOSEPH BARBERA”。",
    "12. Baby Puss_scene005.mp4": "视频展示了一个动画片的片头，标题为“BABY PUSS”，由William Hanna和Joseph Barbera执导。画面背景为蓝色，左侧有一个猫的剪影坐在高脚椅上，右侧显示制作人员名单，包括动画师Kenneth Muse、Ray Patterson、Irven Spence和Pete Burness，音乐由Scott Bradley创作，制片人是Fred Quimby。画面底部有版权信息和批准标志。同时，屏幕下方有中文字幕，分别显示“小猫猫”、“睡吧睡吧 我的宝贝 睡在树上”和“风儿吹啊吹 吹啊吹...”。整个画面风格复古，具有经典动画片的特色。",
    "12. Baby Puss_scene006.mp4": "视频片段开头显示制作人Fred Quimby的署名，随后出现黑色背景上的字幕“风儿吹啊吹 吹啊吹...”，接着是“你真的是个坏坏坏孩子 一点礼貌都不懂”，最后画面切换到一个穿着黄色连衣裙的小女孩站在彩色地毯上，手里拿着红色物品。",
    "12. Baby Puss_scene007.mp4": "一个穿着黄色裙子的小女孩站在彩色地毯上，指着一个柜子，责备一个躲在柜子后面、穿着尿布的猫。小女孩伸手拉猫，猫躺在地上，表情不满。随后小女孩抱起猫，猫抱怨说这不是工作，而是担心她。",
    "12. Baby Puss_scene009.mp4": "在一间充满玩具的房间里，一只小老鼠从玩具屋后探出头来，悄悄地向一个巨大的木马玩具靠近。它先是躲在木马的腿后，然后小心翼翼地爬到木马的底座上，最后从木马的底部探出头来，观察四周。背景中，一个布娃娃坐在窗台上，似乎在看着这一幕。",
    "12. Baby Puss_scene010.mp4": "一只小老鼠躲在红色摇椅的底部，抬头向上看。",
    "12. Baby Puss_scene011.mp4": "汤姆猫躺在婴儿床里，戴着粉色的帽子，手里拿着奶瓶。他先是开心地笑着，然后把奶瓶倒过来，奶水从瓶口喷出，洒在他脸上。",
    "12. Baby Puss_scene012.mp4": "一只棕色的小老鼠从红色的物体后面探出头，表情从惊讶变为兴奋，然后它从物体后面跑出来，背景是蓝色的地面和带有花朵的窗户。",
    "12. Baby Puss_scene013.mp4": "一只小老鼠跑进房间，跳到一台红色的留声机上，开始转动唱针。",
    "12. Baby Puss_scene014.mp4": "一只棕色的小老鼠站在红色的留声机上，它用前爪抓住留声机的喇叭，用力摇晃，嘴巴张开似乎在唱歌或喊叫。背景中可以看到一个木马玩具和一些彩色的积木。",
    "12. Baby Puss_scene015.mp4": "汤姆猫穿着婴儿服，戴着粉色帽子，躺在红色摇篮里，手里拿着奶瓶，似乎在哄自己睡觉。突然，他被摇篮晃动惊醒，坐起身来，表情惊讶。摇篮的顶部挂着一个蓝色的球，随着摇篮晃动而摆动。",
    "12. Baby Puss_scene016.mp4": "一只小老鼠躺在红色的桌子上，它先是大笑，然后开始思考，接着突然站起来，跑出了画面。",
    "12. Baby Puss_scene017.mp4": "在一间布置温馨的房间里，一只灰色的猫（汤姆）正在追逐一只棕色的小老鼠（杰瑞）。猫从柜子上跳下，紧追着老鼠，老鼠灵活地在地板上奔跑，猫则在后面紧追不舍。房间内有一个圆形的地毯、一个红色的沙发和一个床，角落里还有一个玩偶。猫和老鼠在房间里来回追逐，最终猫扑向沙发，而老鼠则从沙发下逃走。",
    "12. Baby Puss_scene018.mp4": "在一间儿童房内，一只小老鼠杰瑞从画面右侧跑入，随后一只穿着粉色帽子的猫汤姆从画面左侧进入，他趴在地板上，眼睛盯着一个玩具房子，房子门上贴着“MEASLES”的牌子，汤姆似乎在观察或等待什么。背景中有一个木制柜子，上面放着一个泰迪熊和一些玩具。",
    "12. Baby Puss_scene019.mp4": "一只戴着白手套的手拉开窗户上的黄色窗帘，露出窗外的景象。",
    "12. Baby Puss_scene021.mp4": "在浴室里，一只小老鼠正在浴缸中刷牙，它看到窗外的猫汤姆正盯着它，便兴奋地继续刷牙。小老鼠用牙刷向汤姆的脸上刷去，汤姆被激怒了，随后小老鼠跳出了浴缸，逃离了现场。",
    "12. Baby Puss_scene022.mp4": "一只棕色的小老鼠从楼上跑下来，进入一个房间，然后跳到床上，惊醒了床上的一个小女孩。小女孩惊慌地喊“妈妈！”，而小老鼠则站在床边，看起来很得意。",
    "12. Baby Puss_scene023.mp4": "视频中，一只穿着女仆装的猫（汤姆）跪坐在一座小房子前，表情从惊讶转为开心。一个小女孩从房子里走出，手持一把粉色雨伞，穿着黄色连衣裙和白色裙子，她走到猫面前，猫则伸出一只爪子，似乎在与她互动。背景是简单的房屋和一些花盆，整体氛围轻松愉快。",
    "12. Baby Puss_scene024.mp4": "在绿色的背景中，一只穿着黄色连衣裙、戴着黄色帽子的小老鼠手持一把粉色阳伞，正在跳舞。她的动作轻盈而优雅，伴随着音乐节奏旋转、摆动。在她的身后，一只巨大的猫躺在地上，穿着白色裤子和灰色上衣，似乎在睡觉。小老鼠的舞姿和表情充满了喜悦和活力，而大猫则显得非常放松和无动于衷。整个场景充满了童趣和欢乐的氛围。",
    "12. Baby Puss_scene025.mp4": "视频中，穿着女仆装的汤姆猫在房间里与一只穿着裙子、戴着帽子的小老鼠互动。小老鼠拿着一根棍子，似乎在逗弄汤姆。汤姆表现出愤怒和困惑的表情，试图抓住小老鼠。随后，汤姆猫摔倒在地，显得狼狈不堪。接着，画面切换到一个穿着黄色裙子的小女孩，她站在门口，似乎在责备汤姆。整个场景充满了卡通式的幽默和夸张的动作。",
    "12. Baby Puss_scene027.mp4": "动画片中，一只老鼠从玩具屋的门后探出头，随后跳出屋外，开心地在屋檐上跳跃。",
    "12. Baby Puss_scene028.mp4": "一只黑猫从垃圾桶里探出头来，随后两只小猫从垃圾桶里探出头来，黑猫看着它们。",
    "12. Baby Puss_scene029.mp4": "一只穿着芭蕾舞裙的小老鼠在屋顶上跳舞，然后跳了起来，芭蕾舞裙散开，最后它飞走了。",
    "12. Baby Puss_scene030.mp4": "一只穿着白色裤子的小老鼠在窗台上奔跑，突然被三只猫从后面追上并扑倒。三只猫趴在窗台上，表情愤怒，随后它们都张大嘴巴，似乎在大声叫喊。",
    "12. Baby Puss_scene031.mp4": "在婴儿房内，穿着婴儿服装的汤姆躺在红色摇篮里，手里拿着奶瓶，开心地摇晃着。他先是把奶瓶举高，然后又把奶瓶倒置，奶水洒了出来，汤姆被溅湿，显得有些狼狈。他努力保持平衡，摇晃着身体，摇篮也随之晃动。",
    "12. Baby Puss_scene032.mp4": "一只黑猫抱着一只小猫在窗台上摇晃，另一只灰猫躺在旁边观看。黑猫不断摇晃小猫，小猫看起来很害怕，黑猫则露出开心的笑容。灰猫则在一旁笑得合不拢嘴，似乎对黑猫的行为感到非常有趣。",
    "12. Baby Puss_scene033.mp4": "三只猫在室内互动，一只黑猫抱着一只灰猫，灰猫伸出爪子与另一只戴着红色帽子的猫玩耍，黑猫随后大笑并举起灰猫。",
    "12. Baby Puss_scene034.mp4": "动画片中的猫汤姆穿着婴儿服，戴着粉色帽子，坐在红色婴儿车里。他先是表情惊讶，随后变得愤怒，脸变红，最后从婴儿车里跳了起来，离开了画面。",
    "12. Baby Puss_scene035.mp4": "四只猫坐在窗台上，其中一只戴着粉色帽子和围裙的猫从左侧飞入画面，落地后与其他三只猫互动。它们先是大笑，然后戴帽子的猫显得不悦，其他猫则继续笑。戴帽子的猫随后站起，双手叉腰，表情愤怒，而其他三只猫则继续大笑。",
    "12. Baby Puss_scene036.mp4": "一只穿着围裙和头巾的猫被另一只黑猫抓住并撕扯衣物，最终黑猫将它完全剥光，然后得意地展示自己的胜利。",
    "12. Baby Puss_scene037.mp4": "在一间装饰有儿童玩具和墙贴的房间里，汤姆猫穿着婴儿服，躺在红色摇篮里，看起来正在睡觉。突然，一只黑猫闯入，温柔地靠近摇篮，轻声哄汤姆睡觉。汤姆被吵醒，显得有些惊讶和不安，但黑猫继续安抚他，轻轻拍打他的脸颊，汤姆最终又安静地睡去。整个场景温馨而幽默，展现了黑猫对汤姆的关怀。",
    "12. Baby Puss_scene038.mp4": "在婴儿床里，一只灰色小猫正在吃奶瓶，旁边一只黑猫开心地看着，然后黑猫伸手去抢奶瓶，小猫用力抵抗。",
    "12. Baby Puss_scene039.mp4": "在婴儿房内，一只黑猫正试图给躺在红色摇篮里的灰色小猫喂奶。黑猫拿着奶瓶，但奶瓶里的奶洒了出来，黑猫显得非常生气和沮丧。小猫则躺在床上，表情不满。房间内有玩具和装饰物。",
    "12. Baby Puss_scene040.mp4": "一只黑猫拿着一个黄色的物体靠近躺在床上的灰色猫，然后用这个物体打灰色猫的脸，灰色猫被击中后表情痛苦，随后被击中后翻了个身，露出肚子。",
    "12. Baby Puss_scene041.mp4": "一只穿着女仆装的猫坐在椅子上，另一只黑猫站在它面前。黑猫用爪子轻轻碰了碰女仆猫的鼻子，女仆猫生气地瞪大眼睛，然后开始吹泡泡糖，泡泡越来越大，最后几乎遮住了她的脸。",
    "12. Baby Puss_scene042.mp4": "在一间装饰有儿童图案的房间里，一只黑猫拿着针刺破了躺在婴儿床里的灰猫吹起的大泡泡。泡泡破裂后，灰猫被弹飞出去，掉进婴儿床里。黑猫开心地把灰猫抱起来，然后又把它扔到地上，重复这个动作，显得非常兴奋和得意。",
    "12. Baby Puss_scene044.mp4": "一只黑猫抱着一只戴粉色帽子的灰猫，黑猫兴奋地摇晃着灰猫，随后将灰猫抛向空中。",
    "12. Baby Puss_scene046.mp4": "汤姆穿着女仆装，先是兴奋地跳跃，然后跳进鱼缸里，被水溅出后狼狈地站在地上，最后沮丧地拉扯着自己的围裙。",
    "12. Baby Puss_scene047.mp4": "三只猫站在墙边，兴奋地指着同一个方向，脸上露出大笑的表情。它们的姿势和表情显示出它们正在分享一个有趣的发现或笑话。画面下方有中文字幕“哎呀 掉进鱼缸里了呢”。",
    "12. Baby Puss_scene048.mp4": "汤姆穿着围裙和帽子，正在给鱼缸换水，但水洒了一地。这时，杰瑞推着小船冲进来，汤姆被撞倒，两人在水中打闹，最后汤姆被推倒在地。",
    "12. Baby Puss_scene049.mp4": "在一间布置温馨的房间里，一只黑猫穿着印有“BABY”字样的围兜，正在给躺在婴儿床里的小猫换尿布。这时，另一只灰猫推着一辆婴儿车，车里躺着一只戴着帽子的小猫。灰猫推着婴儿车靠近婴儿床，黑猫看到后开心地笑了，随后将小猫从婴儿床里抱起，放进婴儿车里，然后又把婴儿车推回原位。整个过程充满了欢乐和温馨的氛围。",
    "12. Baby Puss_scene050.mp4": "一只黑猫抱着一个标有“BABY”的布娃娃，它把布娃娃的布料拉到脸上，遮住口鼻，然后露出得意的表情。背景是浅黄色的墙壁，上面有大象和骆驼的图案。",
    "12. Baby Puss_scene051.mp4": "一只灰色小猫站在椅子上，挥舞着大锤子，似乎在用力敲打。另一只戴着粉色头巾的黑猫躲在桌子后面，眼睛睁得大大的，表情紧张地注视着小猫的动作。背景中可以看到一个篮子和一些家具。",
    "12. Baby Puss_scene052.mp4": "一只黑猫用毛巾捂住脸，随后撕开毛巾，露出愤怒的表情。接着，画面切换到一只棕猫，它也用毛巾捂住脸，然后撕开毛巾，露出得意的表情，并用毛巾擦脸。",
    "12. Baby Puss_scene053.mp4": "一只黑猫在房间里，先是用婴儿爽身粉撒自己，接着用婴儿油涂抹身体，然后用别针别住自己的尾巴，最后被一只粉红色的猫踢飞。",
    "12. Baby Puss_scene054.mp4": "一只小猫坐在椅子上，手持大锤，表情专注。另一只戴着粉色头巾的猫从画板后探出头，表情惊恐，似乎在躲避小猫的攻击。小猫挥舞大锤，动作夸张，而戴头巾的猫则不断后退，显得十分紧张。背景是室内环境，有画板、椅子和篮子等物品。",
    "12. Baby Puss_scene055.mp4": "一只黑猫戴着口罩，先是拿着蓝色的钳子，然后拿起一条黄色的橡胶裤，接着又拿出一双白色的袜子，最后把一条黄色的橡胶裤套在了灰色的猫身上，灰色的猫戴着粉色的帽子，穿着黄色的橡胶裤，坐在地上。",
    "12. Baby Puss_scene056.mp4": "汤姆猫站在鱼缸上，兴奋地抓着一条金鱼，随后将金鱼抛向空中，金鱼在空中划出一道弧线后落回鱼缸里。",
    "12. Baby Puss_scene057.mp4": "两只猫在沙滩上玩，一只灰猫戴着粉色头巾，另一只黑白猫。灰猫坐在黄色的布上，黑白猫在后面拉布。突然，一条小金鱼从空中飞过，灰猫惊讶地张大嘴巴，黑白猫也瞪大眼睛。灰猫被布拉得站起来，双手捂脸，黑白猫则继续拉布。背景中有大象和骆驼的剪影。",
    "12. Baby Puss_scene058.mp4": "视频中，一只穿着婴儿服装的灰色猫坐在地上，戴着粉色帽子和围巾，表情从困惑变为惊讶。随后，一只黑色猫从右侧出现，用爪子拉住灰色猫的耳朵，露出得意的笑容。接着，一只棕色猫从左侧加入，同样用爪子拉住灰色猫的耳朵，三只猫一起对着镜头做出夸张的表情和动作，灰色猫显得非常惊慌。背景是简单的室内墙壁，上面有一些动物图案。",
    "12. Baby Puss_scene059.mp4": "一只小猫在房间里拿着两个沙锤跳舞，它左右摇摆，挥舞着沙锤，脸上露出开心的笑容。",
    "12. Baby Puss_scene060.mp4": "三只猫坐在一个类似摇篮的物体上，其中一只灰猫戴着粉色帽子，另外两只猫分别黑猫和棕猫。黑猫和棕猫交替抱着灰猫，同时大笑。随后，棕猫拿出奶瓶，灰猫张嘴要喝奶，但奶瓶被黑猫抢走并泼向灰猫，导致灰猫被奶液溅湿。接着，黑猫又将奶瓶泼向棕猫，棕猫也被奶液溅湿。整个场景充满喜剧效果。",
    "12. Baby Puss_scene061.mp4": "一只穿着红色舞裙、戴着彩色羽毛头饰的猫在窗边跳舞，旁边坐着两个穿着女仆装的玩偶。猫边跳边唱着“妈妈，我想要喝奶”，表情夸张，动作活泼。",
    "12. Baby Puss_scene062.mp4": "一只戴着彩色羽毛头饰和项链的猫，表情夸张地张嘴大笑，同时举起一只手，似乎在热情地请求或表演。画面底部有中文字幕：“给我一点奶喝吧 啊 给我一点奶喝吧”。",
    "12. Baby Puss_scene063.mp4": "一只穿着红色裙子、戴着彩色羽毛头饰的猫在房间里跳舞，背景中有两个小女孩在观看。猫的动作夸张，表情开心，似乎在表演或庆祝。房间布置温馨，有窗帘和盆栽。",
    "12. Baby Puss_scene064.mp4": "视频中，一只黑猫正站在一个婴儿车旁，手里拿着一块布，似乎在玩耍或展示。婴儿车里躺着一只戴着粉色帽子的灰色小猫，表情看起来有些不悦或困惑。随后，镜头切换到另一只棕色猫，它坐在一个红色的凳子上，手里拿着一把黄色的弓，似乎在拉弓或准备拉弓，而灰色小猫依然在婴儿车里，表情依旧不悦。整个场景发生在室内，背景简单，有墙壁和一些家具。",
    "12. Baby Puss_scene065.mp4": "在室内，一只穿着红色裙子的猫和一个穿着女仆装的小女孩正在跳舞。猫显得非常开心，小女孩则表情夸张。在他们旁边，一个金发小女孩坐在地上观看。跳舞过程中，猫突然摔倒，小女孩也跟着倒下，两人躺在地上，小女孩似乎在喊“妈妈我想要”。背景是粉色窗帘和一盆植物。",
    "12. Baby Puss_scene066.mp4": "一只小老鼠站在窗帘后面，用爪子扒拉着窗帘，试图露出身体，然后它从窗帘下钻出来，穿着白色的小裙子，开心地跳舞，同时喊着“妈妈，我想喝奶”，并请求“给我一点奶喝吧”。",
    "12. Baby Puss_scene067.mp4": "在一间卧室里，三只猫正在玩耍。一只穿红裙的猫在跳舞，一只戴红帽子的猫坐在凳子上敲鼓，另一只黑猫站在婴儿床旁拉扯布料。婴儿床里躺着一只戴着粉色帽子的猫，表情痛苦。房间内还有衣柜和婴儿摇篮等家具。",
    "12. Baby Puss_scene068.mp4": "一个穿着黄色连衣裙的小女孩从门后走出来，站在房间里，旁边有一个红色的婴儿车。她双手张开，似乎在请求或表达什么。画面底部有中文字幕：“给我一点奶喝吧 南美式的 孩子呀”。",
    "12. Baby Puss_scene069.mp4": "在婴儿房内，三只猫围绕着婴儿床展开混乱的追逐。一只黑猫被吊在婴儿床的布幔上，另一只灰猫躺在床里，而一只棕猫则坐在凳子上手持弹簧圈。突然，一只穿着红短裤的小猫从右侧冲入，撞倒了婴儿床，导致黑猫被甩出并翻滚落地。棕猫惊慌失措地跳下凳子，而黑猫则在空中翻滚后重重摔在地上，最终倒挂在婴儿床的布幔上。",
    "12. Baby Puss_scene070.mp4": "视频中，一只戴着粉色头巾的猫被倒挂在椅子上，表情痛苦。一个穿着黄色裙子的小女孩走近，手里拿着一瓶蓖麻油和一把勺子。她将蓖麻油倒进勺子里，然后强迫猫张开嘴喝下。猫表现出极大的抗拒和痛苦，但最终还是被迫喝下了蓖麻油。",
    "12. Baby Puss_scene071.mp4": "杰瑞拿着一把大剪刀，试图剪断汤姆的尾巴。汤姆坐在椅子上，脚放在椅子边缘，尾巴垂下。杰瑞用力剪，但剪刀没有剪断尾巴，反而夹住了尾巴，导致汤姆的尾巴被夹住并拉长。杰瑞继续用力，最终成功剪断了汤姆的尾巴，汤姆的尾巴被剪断后，杰瑞松开剪刀，汤姆的尾巴掉落在地上。",
    "12. Baby Puss_scene072.mp4": "一个穿着粉色头巾和围裙的猫坐在高脚椅上，面前放着一瓶标有“CASTOR OIL”的绿色瓶子。一个人拿着勺子试图喂猫黄色液体，猫先是张大嘴，然后闭上嘴并皱眉，接着猫突然剧烈地咳嗽，最后从椅子上飞出去，瓶子留在椅子上。",
    "12. Baby Puss_scene073.mp4": "一只穿着黄色背心的猫从窗户跳入室内，随后倒挂在窗台上，尾巴高高翘起。",
    "12. Baby Puss_scene074.mp4": "一只小老鼠在椅子腿旁边兴奋地跳跃和欢呼，表现出非常开心和激动的样子。",
    "12. Baby Puss_scene075.mp4": "一个绿色的油瓶放在椅子上，瓶口朝下，黄色的油正从瓶口流出，滴落在椅子的扶手上。油瓶上的标签写着“CASH OIL”。背景是蓝色的墙壁。",
    "12. Baby Puss_scene076.mp4": "一只小老鼠站在椅子腿下，仰头张嘴，似乎在期待什么。突然，一滩黄色的液体从椅子腿上流下，淋在小老鼠身上，它被淋得浑身湿透，惊慌失措地四处乱窜，最后消失在画面中。",
    "12. Baby Puss_scene077.mp4": "一只小老鼠爬上窗台，将一只穿着黄色衣服的猫倒挂在窗台上，然后自己趴在猫身上睡觉。猫在窗台上倒挂不动，小老鼠也睡着了。画面逐渐变暗，最后出现“The End”字样。",
    "12. Baby Puss_scene078.mp4": "视频片段展示了动画片《猫和老鼠》的片尾画面，背景为红色，中央有“THE END”字样，随后出现“An M.G.M Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”字样。画面底部有中文文字“睡吧 睡吧 我的孩子 好好睡吧”。",
    "12. Baby Puss_scene079.mp4": "视频片段开始时显示了“MGM Tom and Jerry Cartoon”标志，背景为红色，文字为蓝色。随后画面转为全黑，持续数秒。整个片段没有其他视觉内容或动作。"
}