{
    "31. Salt Water Tabby_scene001.mp4": "视频开始时显示一个黑色背景，右下角有白色数字“0110544170204083”。随后画面切换至深蓝色背景，出现“Metro-Goldwyn-Mayer Cartoon”标志，下方有“Color by Technicolor”字样。整个画面保持静态，无其他动作或变化。",
    "31. Salt Water Tabby_scene002.mp4": "这是一个米高梅动画片头，蓝色背景上有一个圆形标志，标志内是一只咆哮的狮子，下方写着“A METRO-GOLDWYN-MAYER CARTOON”和“COLOR BY TECHNICOLOR”。狮子在标志内不断咆哮，嘴巴张合，表情生动。画面底部有一串数字“0110544170204083”。",
    "31. Salt Water Tabby_scene003.mp4": "视频展示了米高梅动画公司的标志，随后画面转为黑色，接着出现《猫和老鼠》的标题和角色形象。",
    "31. Salt Water Tabby_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为深绿色，左侧是棕色的小老鼠杰瑞，右侧是灰色的猫汤姆，两者都面带笑容。画面中央是黄色的“TOM and JERRY”字样。随后，画面中间出现“SALT WATER TABBY”字样，下方标注导演为威廉·汉纳和约瑟夫·巴伯拉，同时出现中文字幕“海水玩具鸭”。",
    "31. Salt Water Tabby_scene005.mp4": "视频展示了动画片《Salt Water Tabby》的标题画面，背景为绿色，中央有一个黄色带彩色圆点的橡皮鸭玩具在水中漂浮，上方是红色大字标题“SALT WATER TABBY”，下方是导演名字“Directed by WILLIAM HANNA and JOSEPH BARBERA”，底部有中文翻译“海水玩具鸭”。画面最后出现版权和制作信息。",
    "31. Salt Water Tabby_scene006.mp4": "这是一个动画片的片头，背景为绿色，显示了制作人员名单，包括动画师Ed Barge、Michael Lah和Kenneth Muse，音乐由Scott Bradley负责。片头还显示了制片人Fred Quimby的名字。此外，还有版权信息和批准编号，表明该作品由Loew's Incorporated制作，并通过了国家审查委员会的审查。画面中还出现了一个黄色的玩具鸭子形象，与片名“Salt Water Tabby”相呼应。",
    "31. Salt Water Tabby_scene007.mp4": "夜晚的海滩俱乐部外景，沙滩上有躺椅和遮阳伞，建筑物上有救生圈装饰，门口有两扇橙色门，天空中飘着旗帜。",
    "31. Salt Water Tabby_scene008.mp4": "在海滩俱乐部外，穿着红色泳装的汤姆从门里跑出来，他先是兴奋地跳跃，然后做出各种夸张的姿势，包括单脚站立、高抬腿和旋转，表现出他活泼和顽皮的性格。背景中可以看到沙滩、躺椅和救生圈，营造出轻松愉快的海滩氛围。",
    "31. Salt Water Tabby_scene009.mp4": "在阳光明媚的海滩上，汤姆穿着红色泳衣，从沙滩上跑向海边。他先是向前奔跑，然后跳起，身体在空中翻转，最后头朝下地冲进海里。背景中有彩色的遮阳伞、沙滩球和远处的建筑物。",
    "31. Salt Water Tabby_scene011.mp4": "在沙滩上，一只穿着黄色泳衣、戴着红色太阳镜的白色猫咪正躺在遮阳伞下阅读一本书，旁边放着一个热狗和一瓶饮料。突然，一只穿着红色运动服的灰色猫（汤姆）从伞后跳出来，试图靠近白猫，但白猫没有理会。随后，汤姆从遮阳伞后跑开，白猫继续阅读。镜头转向沙滩上的一个绿色垃圾桶，上面写着“TRASH”，垃圾桶盖子打开，里面装满了垃圾。接着，汤姆从垃圾桶里爬出来，身上沾满了垃圾，他戴着黄色安全帽，露出得意的笑容。",
    "31. Salt Water Tabby_scene012.mp4": "在沙滩上，一只穿着黄色泳衣的白猫坐在遮阳伞下，手里拿着热狗和饮料。一只穿着红色泳衣的灰猫从沙子里爬出来，躺在她旁边，戴着黄色泳帽，手里拿着一个柠檬。灰猫把柠檬举起来，然后扔掉，白猫看着他，表情从惊讶变为不悦。",
    "31. Salt Water Tabby_scene013.mp4": "在沙滩上，一只穿着黄色泳衣的白猫坐在红色遮阳伞下，手里拿着热狗。一只穿着红色运动服的灰猫躺在她旁边，正用吸管喝着饮料。灰猫喝饮料时，饮料突然喷出，溅到了白猫身上。白猫惊讶地看着灰猫，灰猫则笑着伸手去拿白猫手中的热狗。",
    "31. Salt Water Tabby_scene014.mp4": "一只穿着红色衣服的灰色猫正在开心地吃一个热狗，热狗由一只涂着红色指甲油的手拿着。猫的表情从兴奋到满足，最后热狗被拿走，猫露出失望的表情。背景是蓝天白云。",
    "31. Salt Water Tabby_scene015.mp4": "在沙滩上，汤姆和杰瑞在一把遮阳伞下。汤姆穿着红色泳衣，杰瑞穿着黄色泳衣。汤姆一开始躺在地上，随后被杰瑞压在身下。汤姆被杰瑞用香蕉皮和番茄酱攻击，表情痛苦。最后，汤姆拿起铲子，愤怒地冲向野餐篮，准备报复。",
    "31. Salt Water Tabby_scene016.mp4": "一只穿着红色泳裤的小老鼠在厨房里，先是舔食一叠夹着红色酱料的面包片，然后因辣味而皱眉并流口水，最后它拿起一个鸡蛋，开心地吃了起来。",
    "31. Salt Water Tabby_scene017.mp4": "汤姆穿着红色运动服，手持黄色锤子，用力砸向一个木制物体，但锤子反弹，击中他的眼睛，导致他眼睛冒烟。随后，杰瑞从木制物体中跳出，用一根绿色的葱攻击汤姆，汤姆被击中后表情痛苦，最终杰瑞成功逃脱。",
    "31. Salt Water Tabby_scene018.mp4": "汤姆穿着红色泳衣在沙滩上奔跑，追逐着一个红色的小物体。他跑过几块岩石，最后摔倒在沙滩上，靠近一块岩石。",
    "31. Salt Water Tabby_scene019.mp4": "汤姆穿着红色衣服，手里拿着一只绿色的螃蟹。他先是看着螃蟹，然后突然被螃蟹的钳子夹住鼻子，感到疼痛。汤姆捂住脸，随后被螃蟹拖着在沙滩上跑动，最终螃蟹把汤姆拖到了沙地上。",
    "31. Salt Water Tabby_scene020.mp4": "一只绿色的昆虫用它的钳子刮擦一根黑色的羽毛状物体，导致羽毛状物体变得毛茸茸。随后，汤姆穿着红色运动服从空中飞过，撞上一块岩石，然后从岩石后探出头来。",
    "31. Salt Water Tabby_scene021.mp4": "汤姆猫穿着红色运动服，站在岩石上，伸出一只手，手中握着一串纸人，表情兴奋。背景是蓝天白云。",
    "31. Salt Water Tabby_scene022.mp4": "在沙滩上，杰瑞穿着红色泳裤奔跑，汤姆穿着红色泳衣从后面追捕。杰瑞跑过沙滩伞和躺椅，汤姆紧追不舍。杰瑞爬上一把黄色的沙滩伞，汤姆也跟着爬上来，两人在伞上对峙。",
    "31. Salt Water Tabby_scene023.mp4": "汤姆穿着红色衣服，手持一把大伞，试图追赶杰瑞。杰瑞躲在伞下，汤姆用力一拉，伞被扯开，汤姆被甩出，身体像火箭一样飞出去，最后重重地摔在沙滩上，扬起沙尘。",
    "31. Salt Water Tabby_scene024.mp4": "动画片中，一只穿着红色泳裤的老鼠从一个巨大的红色物体上跳下，开始在沙滩上奔跑。途中，它遇到了一只绿色的蝎子，蝎子挥舞着钳子攻击老鼠，但老鼠灵活地躲避并反击，最终蝎子被击退。背景是海滩，有遮阳伞、躺椅和建筑物。",
    "31. Salt Water Tabby_scene025.mp4": "一只穿着红色泳衣的小老鼠在沙滩上奔跑，身后跟着一只绿色的螃蟹，螃蟹表情凶狠，似乎在追赶小老鼠。背景中有沙滩椅、遮阳伞和瞭望塔，天空晴朗。",
    "31. Salt Water Tabby_scene026.mp4": "一只穿着红色衣服的老鼠躺在沙滩上，一只小老鼠从远处跑来，跳到大老鼠的身上，大老鼠的身体开始膨胀，最终爆炸。",
    "31. Salt Water Tabby_scene027.mp4": "一个穿着红色衣服的角色在沙滩上，他将身体倒立插入一个彩色的充气管中，然后被弹射到空中，最后以倒立姿势落地。",
    "31. Salt Water Tabby_scene028.mp4": "一个穿着红色衣服的角色，衣服逐渐被撕开，露出里面的绿色昆虫角色，昆虫角色表情愤怒，随后又迅速缩回衣服里。",
    "31. Salt Water Tabby_scene029.mp4": "视频开始时，一个穿着红色外套、戴着帽子的角色背对着镜头，站在夜晚的天空下。随后画面变黑，接着切换到一个沙滩场景，展示了一个装有望远镜的野餐篮和一个彩色的沙滩球，远处还有一个彩色的遮阳伞。整个场景显得宁静而悠闲。",
    "31. Salt Water Tabby_scene030.mp4": "在沙滩上，杰瑞从一个篮子里探出头，发现了一瓶饮料。他迅速跳出来，拿起瓶子，然后开始奔跑。这时，汤姆穿着红色运动服出现，手里拿着一把刀。汤姆试图用刀打开瓶子，但杰瑞戴着黄色帽子，用瓶子挡住汤姆的攻击。汤姆愤怒地挥舞着拳头，但杰瑞仍然站在那里，毫不退缩。",
    "31. Salt Water Tabby_scene031.mp4": "一只戴着绿色帽子、穿着红色泳裤的老鼠在沙滩上奔跑，背景中有一把彩色的遮阳伞。天空晴朗，有几朵白云飘过。",
    "31. Salt Water Tabby_scene032.mp4": "一个巨大的绿色植物怪物在沙滩上，一只小老鼠跑向它，试图抓住它的叶子。植物怪物用叶子抓住了老鼠，但老鼠成功地从叶子中逃脱，并把叶子当作武器反击，最终植物怪物被击退。",
    "31. Salt Water Tabby_scene033.mp4": "在沙滩上，一个棕色编织野餐篮旁边，一只戴着彩色帽子的小老鼠从篮子后面探出头来，表情狡黠地观察着周围。远处有一把彩色的沙滩伞。",
    "31. Salt Water Tabby_scene034.mp4": "在沙滩上，汤姆穿着红色泳衣，坐在绿色毯子上，旁边有一把红色遮阳伞。他伸手从米奇手中拿走一块三明治，然后开始吃。米奇穿着黄色泳衣，手里拿着一盘三明治，看着汤姆吃。背景是蓝天白云和另一把遮阳伞。",
    "31. Salt Water Tabby_scene035.mp4": "一只穿着红色泳裤的老鼠背着一个大石头在沙滩上奔跑，突然遇到一只巨大的手拿着三明治向他伸来。老鼠奋力将石头塞进三明治里，然后得意地站在三明治旁边。",
    "31. Salt Water Tabby_scene036.mp4": "汤姆穿着红色运动衫，手里拿着一个三明治。他先是开心地笑着，然后张大嘴巴咬了一口三明治，接着表情变得痛苦，似乎被三明治噎住了。最后，他恢复了平静，眼睛睁大，看着前方。",
    "31. Salt Water Tabby_scene037.mp4": "在海滩上，汤姆穿着红色泳衣，手里拿着三明治，坐在一把红色遮阳伞下。他面带微笑，与身旁穿着黄色泳衣的白色猫咪交谈。汤姆的表情从愉悦到略显惊讶，最后变得有些生气。白色猫咪则始终面带微笑，双手放在腰间，似乎在认真倾听汤姆说话。背景是蓝天白云，远处还有另一把遮阳伞。",
    "31. Salt Water Tabby_scene038.mp4": "汤姆猫穿着红色运动衫，手持三明治，表情从愤怒逐渐转变为狂笑，背景是蓝天白云。",
    "31. Salt Water Tabby_scene039.mp4": "在沙滩上，一只小老鼠从一个巨大的冰淇淋桶后面探出头来，然后迅速跑出来，扛起一个装满沙子的红色桶，桶上写着“SAND”。它一边跑一边跳跃，最终跳过一个带有尖刺的箱子，继续向前跑去。背景中有沙滩伞、救生塔和一些沙滩玩具。",
    "31. Salt Water Tabby_scene040.mp4": "汤姆猫穿着红色睡衣坐在沙滩上，用蓝色勺子从糖罐里舀糖，然后撒入一杯咖啡中。他重复这个动作，糖洒出一些在毯子上。背景是蓝天和一把红色遮阳伞，旁边有吐司和一个金属罐。",
    "31. Salt Water Tabby_scene041.mp4": "在户外的草地上，一只小老鼠拿着铲子和装满沙子的桶，试图阻止一只大手用勺子往黄色桶里添加糖和沙子。大手不断搅拌桶里的混合物，而小老鼠则努力用铲子把沙子铲进桶里，试图改变混合物的成分。背景是蓝天白云，场景充满卡通风格的幽默感。",
    "31. Salt Water Tabby_scene042.mp4": "汤姆猫穿着红色衣服，坐在红色遮阳伞下。他先是用勺子舀着食物，然后拿起黄色杯子喝东西，结果食物喷了出来，他被食物喷得满脸都是，表情痛苦。",
    "31. Salt Water Tabby_scene043.mp4": "一只小老鼠背着一个红色的桶在沙滩上奔跑，桶里装满了水。它跑向水边，桶里的水洒了出来，小老鼠被水溅到，继续向前跑。背景是蓝天、沙滩和海水，还有几块岩石和一个木桩。",
    "31. Salt Water Tabby_scene044.mp4": "在沙滩上，汤姆穿着红色泳衣，正在吃东西时被杰瑞用装满水的桶泼了一身。汤姆生气地用桶泼水，但水却泼到了坐在旁边的白猫身上，白猫被淋湿后显得非常生气。汤姆看到后也感到惊讶和害怕。",
    "31. Salt Water Tabby_scene045.mp4": "在沙滩上，一只穿着红色衣服的猫（汤姆）正在追逐一只小老鼠（杰瑞）。汤姆试图用一个绿色的桶和一把铲子挖沙子，但他的动作显得笨拙且失败。他先是用桶挖沙子，然后用铲子挖沙子，但每次都失败了。最后，汤姆被沙子埋了起来，只露出红色的衣服。背景中可以看到一些沙滩伞和一个红白条纹的帐篷。",
    "31. Salt Water Tabby_scene046.mp4": "在海滩上，杰瑞用铲子挖沙堆，然后用铲子当降落伞跳下，落地后变成一把雨伞。这时，汤姆从沙子里钻出来，愤怒地冲向杰瑞，杰瑞吓得逃跑。",
    "31. Salt Water Tabby_scene047.mp4": "在沙滩上，一只穿着红色泳衣的灰色猫（汤姆）从篮子里跳出来，落地后坐下来，表情愤怒。他伸手从篮子里拿出一根香蕉，然后开始吃香蕉。背景中有红色的遮阳伞、沙滩和蓝天白云。",
    "31. Salt Water Tabby_scene048.mp4": "汤姆在伞下剥香蕉，杰瑞突然跳到香蕉上，汤姆大怒，杰瑞趁机爬上伞柄，汤姆追着杰瑞，杰瑞从伞顶滑落，汤姆追不上，杰瑞在空中飞走。",
    "31. Salt Water Tabby_scene049.mp4": "在沙滩上，一只小老鼠杰瑞跳进一个装满饮料的玻璃瓶中，试图喝饮料。这时，猫汤姆出现，他穿着红色运动服，兴奋地抓起瓶子，准备将瓶中的饮料倒掉。随着汤姆倒饮料，瓶中的液体开始冒泡，杰瑞在瓶中挣扎，最终瓶子中的液体喷溅出来，形成了一团泡沫。",
    "31. Salt Water Tabby_scene050.mp4": "一个穿着红色泳裤的卡通狗从沙滩上跳入海中，溅起水花，然后在水中游泳。背景是蓝天、白云、沙滩、救生圈、鞋子、遮阳伞和木桩。",
    "31. Salt Water Tabby_scene051.mp4": "一只穿着红色泳裤的老鼠在海水中游泳，它从水中冒出头来，头顶着一个巨大的贝壳，然后把贝壳扔掉，跑向沙滩。在沙滩上，它捡起一根长长的海藻，把它当作武器挥舞着。",
    "31. Salt Water Tabby_scene052.mp4": "一只穿着红色泳裤的老鼠在海水中游泳，接近一个木桩。它用一支大笔在木桩上画出眼睛，使木桩看起来像一个有表情的生物。老鼠看起来很高兴，似乎在与木桩互动。背景是蓝天和白云。",
    "31. Salt Water Tabby_scene053.mp4": "在沙滩上，穿着红色泳衣的汤姆猫从野餐篮中拿出一块黄油和一根鸡腿，他兴奋地挥舞着鸡腿，然后把鸡腿放进嘴里大口咀嚼，最后满意地舔了舔嘴唇。背景中有沙滩伞、救生塔和一个沙滩球。",
    "31. Salt Water Tabby_scene054.mp4": "在一片蓝色的海洋中，一个长着黄色头发和绿色叶子装饰的木桩角色，表情惊恐，嘴巴大张。一只小老鼠从木桩后探出头来，露出得意的笑容，随后它在水中划动，溅起水花，然后又回到木桩后面，继续露出得意的表情。天空是蓝色的，有几朵白云。",
    "31. Salt Water Tabby_scene055.mp4": "汤姆穿着红色泳衣在海滩上奔跑，他跳过救生塔，然后跳进海里。他落在一个木桩上，接着被海浪卷走。最后，他浮出水面，躺在沙滩上休息。",
    "31. Salt Water Tabby_scene056.mp4": "一只穿着红色泳裤的老鼠在沙滩上奔跑，背景中有几把彩色的遮阳伞和一把躺椅。老鼠突然跳起，然后继续奔跑，最终撞上了一个巨大的黄色充气玩具，这个玩具有着笑脸和红色斑点，旁边还有一个绿色的水桶和一把红白相间的遮阳伞。",
    "31. Salt Water Tabby_scene057.mp4": "汤姆穿着红色泳衣在沙滩上奔跑，背景是蓝天和几把彩色遮阳伞。",
    "31. Salt Water Tabby_scene058.mp4": "在沙滩上，一只小老鼠站在绿色水桶上，用嘴咬住黄色长蛇的鼻子，长蛇喷出水柱，小老鼠被水冲得飞起，掉进水桶里。随后，猫汤姆穿着红色泳衣从远处跑来，被长蛇喷出的水柱击中，身体膨胀成红色气球形状，随后又变成黑色气球形状，在空中翻滚飞行。",
    "31. Salt Water Tabby_scene059.mp4": "一只穿着红色泳裤的小老鼠在沙滩上奔跑，跳到一块红色的沙滩巾上，然后躺下。随后，一只黑猫从空中飞过，小老鼠在沙滩巾下躲藏起来，黑猫飞过之后，小老鼠从沙滩巾下探出头来。",
    "31. Salt Water Tabby_scene060.mp4": "在海滩上，汤姆猫从空中坠落，嘴里叼着一个绿色的物体，表情惊恐。背景中有彩色的遮阳伞、救生圈和一个红色的桶。",
    "31. Salt Water Tabby_scene061.mp4": "一只灰色的猫在空中翻滚，嘴里叼着一个绿色的小物体，随后落在一个充满沙滩玩具和遮阳伞的海滩上。",
    "31. Salt Water Tabby_scene062.mp4": "在海滩上，汤姆从空中跳入海中，激起巨大的水花。随后，海滩上出现了一个洞，汤姆从洞中冒出，坐在一个黄色的充气玩具上。他看起来很惊讶，然后开始在水中挣扎，最终坐稳在充气玩具上，表情显得非常惊恐。",
    "31. Salt Water Tabby_scene063.mp4": "一只小老鼠坐在一个用作船的篮子里，篮子上挂着一件红色的斗篷作为帆，在夕阳下的海面上航行。随着镜头逐渐拉远，小老鼠和篮子越来越小，最终消失在地平线。画面逐渐变暗，最后出现“The End”的字样。",
    "31. Salt Water Tabby_scene064.mp4": "视频展示了经典的动画片《猫和老鼠》的片尾画面，背景为红色，中央是蓝色的“THE END”字样，随后逐渐显示出“An MGM Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”字样。整个画面风格复古，充满怀旧感。",
    "31. Salt Water Tabby_scene065.mp4": "视频开始时显示了“An MGM Tom and Jerry Cartoon MADE IN HOLLYWOOD, U.S.A.”的标题画面，随后画面转为全黑，持续一段时间。"
}