{
    "E72.The.Dog.House_scene001.mp4": "视频展示了米高梅动画片的片头标志，背景为深红色，中央是一个咆哮的狮子形象，下方有“A Metro-Goldwyn-Mayer CARTOON”字样，以及“COLOR BY TECHNICOLOR”的说明。",
    "E72.The.Dog.House_scene002.mp4": "这是一个米高梅动画片的片头标志，背景为红色，中央有一个蓝色边框的圆形图案，里面是一只咆哮的狮子。下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY TECHNICOLOR”。狮子在图案内不断咆哮，表情生动。",
    "E72.The.Dog.House_scene003.mp4": "视频片段展示了米高梅动画公司的经典标志，随后切换到《猫和老鼠》的标题画面，背景为红色，配有卡通猫和老鼠的形象。",
    "E72.The.Dog.House_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为红色渐变圆环，前景是猫汤姆和老鼠杰瑞的卡通形象，下方有黄色的“TOM and JERRY”字样。随后画面淡入淡出，出现“THE DOG HOUSE”和导演名字“WILLIAM HANNA and JOSEPH BARBERA”的字样。",
    "E72.The.Dog.House_scene005.mp4": "视频开始时展示了一个蓝色的建筑图纸，上面写着“THE DOG HOUSE”，并标注了导演William Hanna和Joseph Barbera的名字。图纸上还列出了动画师、音乐师和背景设计师的名单，以及制作公司和版权信息。随后，画面切换到一个夜晚的场景，一只棕色的狗正在用锤子钉木板，似乎在建造一个狗屋。狗戴着红色的项圈，周围是绿色的草地和黑暗的背景。",
    "E72.The.Dog.House_scene006.mp4": "一只棕色的斗牛犬正在户外用锤子敲钉子，固定一个木制狗屋的屋顶。它戴着红色项圈，表情专注。在敲击过程中，它不小心把锤子打歪，钉子没有完全钉入木头。随后，它捡起地上的蓝色布料，似乎准备用它来擦拭或包裹锤子。背景是绿色的草地和灌木丛，天空是蓝色的。",
    "E72.The.Dog.House_scene007.mp4": "视频展示了一张名为“Spike's Dream House”的蓝图，蓝图上最初只有线条草图，随后通过动画效果逐渐填充颜色和细节，最终呈现出一个带有红色屋顶、黄色墙壁的狗屋，狗屋前有两盆花和白色栅栏，屋门上方标有“SPIKE”字样。整个过程由一双卡通风格的手持着蓝图进行展示。",
    "E72.The.Dog.House_scene008.mp4": "一只戴着红色项圈的棕色斗牛犬站在草地上，手里拿着一把锤子和一块蓝色布料，正在修理一个木制狗屋。背景是绿色的灌木丛和蓝天。",
    "E72.The.Dog.House_scene009.mp4": "一只老鼠从蓝色的门前跑出来，门突然被打破，一只猫从门后冲出来追赶老鼠。",
    "E72.The.Dog.House_scene011.mp4": "视频中，一只灰色的猫和一只棕色的狗在户外对峙。狗戴着红色项圈，表情愤怒，不断咆哮并挥舞拳头，似乎在威胁猫。猫则保持冷静，眼神警惕。狗抓住猫的脖子，试图压制它，猫在挣扎中显得有些痛苦。狗继续咆哮，猫则试图挣脱。最终，狗将猫高高举起，猫在空中挣扎。背景是蓝天和绿色灌木丛。",
    "E72.The.Dog.House_scene012.mp4": "猫汤姆从邮箱上跳下，邮箱突然有了眼睛和手脚，开始走路并消失在画面中。",
    "E72.The.Dog.House_scene013.mp4": "汤姆猫站在一个破旧的绿色捕鼠器旁，显得非常沮丧和疲惫。他先是用手捂住脸，然后放下手，看起来很失望。接着，他开始原地打转，似乎在发泄自己的情绪。突然，杰瑞鼠从墙角出现，迅速跑过汤姆面前。汤姆看到杰瑞后，立刻变得兴奋，张开双臂，准备扑过去抓它。然而，他没有成功，反而被杰瑞的突然动作绊倒，重重地摔在地上。汤姆在地上翻滚，最终滚出了画面，而杰瑞则安全地跑开了。",
    "E72.The.Dog.House_scene014.mp4": "一只棕色的小老鼠从车库前跑过，跳进一个木制的狗窝里。随后，一只灰色的猫从空中扑向狗窝，但被泥土溅到，滑倒并翻滚在地。",
    "E72.The.Dog.House_scene015.mp4": "一只棕色的斗牛犬正在用锤子敲钉子，突然一只老鼠从木箱下钻出来，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从木箱下钻出，斗牛犬被吓到，老鼠趁机从",
    "E72.The.Dog.House_scene017.mp4": "一只小老鼠从砖墙后跑出来，沿着小路奔跑。随后，一只猫从墙后跳出，追赶小老鼠。猫跑过小路，小老鼠则跑向远方。",
    "E72.The.Dog.House_scene018.mp4": "杰瑞骑着滑板从墙后跑出来，滑板在地面上滑行。汤姆从墙后冲出来追赶杰瑞，但滑板突然失控，汤姆被甩了出去，摔倒在草地上。",
    "E72.The.Dog.House_scene019.mp4": "一只棕色的斗牛犬正在给狗屋刷红色油漆，不小心把油漆溅到了自己身上。这时，一只灰色的猫汤姆突然从狗屋后面跳出来，被斗牛犬用油漆刷涂满红色。汤姆愤怒地拿起斧头准备反击，但斗牛犬却露出得意的笑容，似乎对汤姆的反击毫不在意。",
    "E72.The.Dog.House_scene020.mp4": "一只棕色的斗牛犬戴着红色项圈，被一只手捏住鼻子。随着捏住鼻子的动作，它的耳朵逐渐变大并张开，表现出痛苦或不适的表情。背景为纯蓝色。",
    "E72.The.Dog.House_scene021.mp4": "在户外的草地上，一只灰色的猫汤姆拿着一把斧头，面对着一只棕色的狗。汤姆用斧头砍向狗，但斧头断裂，汤姆扔掉斧头，狗被吓到后倒在地上，最终被狗屋的木板压住。",
    "E72.The.Dog.House_scene022.mp4": "在一片绿意盎然的庭院中，一只灰色的猫汤姆从空中飞扑下来，靠在墙边，眼睛瞪得大大的，似乎在等待着什么。突然，一只棕色的小老鼠杰瑞从墙角出现，它迈着轻快的步伐，朝着汤姆的方向走去。汤姆看到杰瑞后，立刻从墙边跳下，准备扑向杰瑞，但杰瑞却迅速地跑开了，留下汤姆在原地呆立。",
    "E72.The.Dog.House_scene023.mp4": "一只小老鼠在草地上奔跑，被一只猫追赶。猫试图抓住老鼠，但不小心被一个蓝色的桶绊倒，桶滚动起来，猫被卷入其中，最后被桶甩出画面。",
    "E72.The.Dog.House_scene024.mp4": "一只老鼠在草地上奔跑，后面跟着一只猫，猫用红色的把手拖着一个蓝色的桶追赶老鼠。",
    "E72.The.Dog.House_scene025.mp4": "一只灰色的斗牛犬躺在黄色狗屋前，它先是闭眼休息，随后突然睁开眼睛，显得惊讶，接着它站起来，用前爪推着狗屋的屋顶，似乎在努力移动它。",
    "E72.The.Dog.House_scene026.mp4": "汤姆骑着一个蓝色圆筒在草地上追赶杰瑞，圆筒滚动时扬起尘土和树叶，最终汤姆被尘土遮住。",
    "E72.The.Dog.House_scene027.mp4": "一只棕色的斗牛犬从狗屋中跑出，伸展身体，然后被一只灰色的猫从背后喷出的泡泡击中，被吹得向后倒下，最终躺在地上，泡泡逐渐消失。",
    "E72.The.Dog.House_scene028.mp4": "一只老鼠从房子的洞口跑出来，手里拿着一个点燃的烟花筒。它跑向猫汤姆，汤姆被烟花吓到，捂住耳朵。老鼠把烟花筒扔向汤姆，汤姆被烟花的爆炸声吓飞了。",
    "E72.The.Dog.House_scene029.mp4": "视频中，一个红色的烟花在草地上爆炸，随后一只灰色的猫（汤姆）从远处跑来，停在黄色狗屋前。一只棕色的狗（杰瑞）从狗屋中探出头来，与汤姆对峙。汤姆试图挑衅狗，但狗显得非常凶猛。汤姆跳起来试图攻击狗，但狗迅速躲开并反击，最终汤姆被狗推倒在地。狗则继续表现出愤怒和威胁的姿态。",
    "E72.The.Dog.House_scene030.mp4": "一只棕色的狗在草地上，突然从身后长出黄色的向日葵花瓣，随后向日葵的花盘变成狗的脸，狗坐在地上，周围有黑色的烟雾飘散。",
    "E72.The.Dog.House_scene031.mp4": "一只棕色的小老鼠从砖墙后跑出，爬上一根电线杆。灰色的猫汤姆拿着一把铲子从墙后冲出，试图用铲子击打电线杆，但电线杆被铲子砸断，汤姆被砸得飞了起来，最后他愤怒地用铲子砸向砖墙。",
    "E72.The.Dog.House_scene032.mp4": "镜头从低角度拍摄一根电线杆，电线杆上有多条电线和绿色绝缘子。镜头逐渐向上移动，聚焦于电线杆顶部的横梁和电线连接处。背景是蓝天和几朵白云，画面左下角有绿色树木的顶部。",
    "E72.The.Dog.House_scene033.mp4": "一只棕色的斗牛犬正在用锤子敲打一个黄色狗屋的屋顶。突然，它被自己的动作惊吓到，接着抱着狗屋飞奔而去。",
    "E72.The.Dog.House_scene034.mp4": "一只棕色的猫从画面左侧跑入，背着一个黄色屋顶红色的狗屋，跑向画面右侧。它放下狗屋后，兴奋地大叫，然后开心地摇晃着尾巴。",
    "E72.The.Dog.House_scene035.mp4": "一只棕色的斗牛犬在户外，它先是看着地上的木板，然后镜头切换到它坐在树上，用锤子敲打一个写着“HOME SWEET HOME”的狗屋。它显得很生气，随后它开始跳舞，最后坐在树上，看起来很沮丧。",
    "E72.The.Dog.House_scene036.mp4": "一只小老鼠从树后跑过，一只猫拿着斧头从树后出现，挥斧砍树，树被砍出缺口。",
    "E72.The.Dog.House_scene038.mp4": "一只老鼠坐在狗屋的屋顶上，用一根绳子拉拽着睡在狗屋门口的狗。老鼠用力拉绳，狗被拉得动了一下，但仍然睡得很沉。老鼠在屋顶上跳来跳去，绳子随之晃动，但狗依然没有醒来。",
    "E72.The.Dog.House_scene039.mp4": "汤姆猫用一根绳子从白色栅栏的洞里拉扯，表情愤怒，身体前倾，用力拉扯绳子。",
    "E72.The.Dog.House_scene040.mp4": "一只老鼠在狗屋的红色屋顶上，用一根绳子拉着狗屋的门，试图把一只正在睡觉的斗牛犬从狗屋中拉出来。狗屋是黄色的，屋顶是红色的，背景是绿色的灌木丛和蓝天。老鼠在屋顶上不断拉扯绳子，斗牛犬则一直闭着眼睛，似乎没有被惊醒。",
    "E72.The.Dog.House_scene041.mp4": "汤姆猫用一根绳子试图拉住一个洞，结果被绳子拉得翻了个跟头，最后躺在地上。",
    "E72.The.Dog.House_scene042.mp4": "一只老鼠站在狗屋的屋顶上，挥舞着一根绳子，绳子绕过狗屋的边缘。狗屋前躺着一只狗，闭着眼睛，似乎在睡觉。老鼠挥舞绳子，绳子在空中划出弧线，然后老鼠跳起，绳子缠绕在狗屋上，老鼠落在屋顶上，继续挥舞绳子。",
    "E72.The.Dog.House_scene043.mp4": "汤姆猫躺在地上，被一根绳子绊倒。他迅速起身，抓住绳子，用力拉扯，试图将绳子从墙上的洞中拉出。",
    "E72.The.Dog.House_scene044.mp4": "一只棕色的斗牛犬被一根绳子拴在狗屋上，狗屋被拖着在草地上移动。狗屋撞上白色围栏后破裂，狗从里面爬出来，坐在散落的木板上，绳子仍然拴在围栏的洞里。狗看起来有些困惑和疲惫。",
    "E72.The.Dog.House_scene045.mp4": "汤姆猫用一根绳子拉扯白色栅栏，试图把栅栏拉倒。他表情专注，用力拉扯，栅栏在拉扯中逐渐变形。背景是户外，有树木和蓝天。",
    "E72.The.Dog.House_scene046.mp4": "一只棕色的斗牛犬被一根绳子拴在白色围栏上，它试图挣脱，但每次拉扯都会被拉得翻滚或倒地，表情痛苦。背景是绿色草坪和远处的树与灌木丛。",
    "E72.The.Dog.House_scene048.mp4": "一只灰色的猫正在用锤子和刷子给一个小房子刷漆，过程中不断挥舞工具，导致油漆四处飞溅，房子被涂成红色。",
    "E72.The.Dog.House_scene049.mp4": "动画片《猫和老鼠》的结尾画面，汤姆猫正在用锤子砸一座小房子，房子被砸得满是红色油漆，汤姆猫表情狰狞。随后画面转为黑色，最后出现“THE END”的字样。",
    "E72.The.Dog.House_scene050.mp4": "视频展示了“THE END”字样，随后过渡到“An MGM Tom and Jerry CARTOON”标志，底部标注“MADE IN HOLLYWOOD, U.S.A.”，最后画面变黑。"
}