{
    "S1950E52 - The Flying Sorceress_scene001.mp4": "画面展示了米高梅动画公司的经典标志，背景为深蓝色，标志中央是一个咆哮的狮子头像，周围环绕着“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”的文字。",
    "S1950E52 - The Flying Sorceress_scene002.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面，最后显示了该动画的某一集标题“飞行的女巫”。",
    "S1950E52 - The Flying Sorceress_scene003.mp4": "视频展示了动画片《猫和老鼠》中的一个片段，标题为“The Flying Sorceress”。画面中，一只猫和一只老鼠在绿色背景前出现，随后场景切换到一个夜晚的场景，背景是深蓝色的天空和一轮明亮的满月。画面右侧有一个女巫骑着扫帚飞行，身后留下了一道闪烁的魔法轨迹。左侧是一座尖顶的城堡和枯树的剪影。画面中央是白色的标题文字“The Flying Sorceress”，周围点缀着星星和魔法粒子。最后，画面底部出现了制作人员名单和版权信息。",
    "S1950E52 - The Flying Sorceress_scene005.mp4": "一位穿着围裙的女性站在房间里，看着一只蓝猫。猫面前散落着一些食物碎屑，旁边有一个倒扣的平底锅。女性似乎在责备猫，猫则显得有些无辜。随后，女性拿起扫帚和簸箕，试图清理地面，但猫却拿起扫帚，似乎想自己打扫，女性则跑开。猫继续用扫帚清扫地上的食物碎屑。",
    "S1950E52 - The Flying Sorceress_scene006.mp4": "汤姆猫正在用扫帚和簸箕打扫地上的碎屑，他专注地将碎屑扫进簸箕。突然，一只手指从画面左侧伸出，指向汤姆，汤姆被吓了一跳，扫帚差点掉落。他迅速调整姿势，继续打扫，但眼神中流露出一丝紧张和不安。",
    "S1950E52 - The Flying Sorceress_scene007.mp4": "一只小老鼠从墙角探出头来，它抬起一只前爪，似乎在观察周围环境。",
    "S1950E52 - The Flying Sorceress_scene008.mp4": "汤姆猫拿着扫帚和簸箕清扫地面，他将地上的食物残渣扫进簸箕里。在清扫过程中，他注意到椅子上放着一份报纸，上面有手写的文字。汤姆猫停下动作，低头看了看报纸，然后继续清扫。",
    "S1950E52 - The Flying Sorceress_scene009.mp4": "视频展示了一张报纸的招聘广告，广告内容为“招聘：一只聪明的猫作为年长女士的旅行伴侣——请亲自前往13 Sunnydale Road申请”。背景是布满各种招聘信息的报纸页面。",
    "S1950E52 - The Flying Sorceress_scene010.mp4": "汤姆猫拿着扫帚和簸箕，簸箕里有一些食物残渣。他先是看着报纸，然后把簸箕举过头顶，倒掉食物残渣，接着把报纸卷起来，做出一个手势，似乎在展示他的清洁成果。",
    "S1950E52 - The Flying Sorceress_scene011.mp4": "汤姆猫拿着一个卷起来的纸卷，兴奋地在房间里跳舞，他绕着一把紫色的椅子转圈，表情非常开心。",
    "S1950E52 - The Flying Sorceress_scene012.mp4": "一只棕色的小老鼠从墙角探出头来，随后完全走出墙角，站在地上，双手叉腰，四处张望。",
    "S1950E52 - The Flying Sorceress_scene013.mp4": "视频开始时，一只小老鼠站在墙角，随后画面切换到夜晚的街道，一只猫拿着报纸站在路牌旁阅读。镜头向左移动，展示了一座阴森的古宅，天空中乌云密布，闪电划过，随后开始下雨。整个场景营造出一种神秘和紧张的氛围。",
    "S1950E52 - The Flying Sorceress_scene014.mp4": "雨夜，汤姆猫抱着一个卷起来的纸筒，从画面左侧跑向右侧，经过一个木制阳台。阳台的栏杆和柱子上挂着冰凌，背景中有一棵枯树。",
    "S1950E52 - The Flying Sorceress_scene018.mp4": "在雨夜中，汤姆猫拿着一个卷纸，小心翼翼地走向一扇绿色的门，门牌号是13。他用手指轻轻敲了敲门，然后紧张地等待着回应。",
    "S1950E52 - The Flying Sorceress_scene019.mp4": "一个房间内，门缓缓打开，一只灰色的猫从门后探出头来，随后完全走出，环顾四周，表情紧张，似乎在躲避什么，接着它突然转身，做出惊恐的姿势。",
    "S1950E52 - The Flying Sorceress_scene020.mp4": "一个女巫骑着扫帚从一扇门中飞出，她挥动扫帚，扫帚尾部喷射出蓝色的火花和光束，随后她飞过楼梯，继续向前飞行。",
    "S1950E52 - The Flying Sorceress_scene021.mp4": "在昏暗的房间里，一只灰色的猫站在门口，突然一个女巫骑着扫帚从楼梯上飞下来，用魔法棒击中了猫，猫被击倒在地。女巫飞到猫面前，猫站起来面对女巫。女巫再次挥动魔法棒，猫被击中后倒在地上，然后又站起来面对女巫。",
    "S1950E52 - The Flying Sorceress_scene023.mp4": "一个穿着蓝色长袍、戴着尖顶帽的女巫，手持紫色魔杖，骑着扫帚从窗户飞入。扫帚上躺着一只灰色的猫，猫看起来很疲惫。女巫和猫一起停在窗台上，窗外是一个阴森的墓地，有墓碑和枯树。女巫面带微笑，似乎在和猫说话，猫则显得有些不情愿。",
    "S1950E52 - The Flying Sorceress_scene024.mp4": "画面展示了一个墓地场景，多个墓碑排列在地面上，上面刻有数字和名字，如“1”、“2”、“3 PENNY”、“4 BEANS”、“5 PETE”、“6 TABBY”、“7 BUTCH”和“8”。墓碑前方有一个明显的坑洞，周围环境阴暗，背景中有垂下的藤蔓和树木，整体氛围显得阴森。镜头缓慢向右移动，逐渐聚焦于墓碑上的文字。",
    "S1950E52 - The Flying Sorceress_scene025.mp4": "一个女巫和一只猫坐在扫帚上，女巫面带微笑，猫则显得紧张。女巫挥动扫帚，两人开始飞行，扫帚划过窗户，留下魔法轨迹，飞向墓地。",
    "S1950E52 - The Flying Sorceress_scene026.mp4": "动画片段中，一个穿着巫师服装的猫骑着扫帚从画面左侧飞入，经过一个装饰华丽的壁炉，扫帚尾部拖出蓝色火花轨迹，随后猫消失在画面右侧。",
    "S1950E52 - The Flying Sorceress_scene027.mp4": "画面开始于一座古旧的木制建筑，屋顶复杂，烟囱鲜红。一只蝙蝠从烟囱中飞出，随后一群蝙蝠从烟囱中飞出，向天空飞去。镜头跟随蝙蝠飞向天空，最终聚焦在一轮明亮的月亮上。接着，一位穿着蓝色长袍、戴着尖顶帽的女巫骑着扫帚飞过，扫帚尾部拖着彩色的魔法火花。女巫的扫帚上还坐着一只灰色的小猫，小猫紧抓着扫帚，表情惊恐。女巫面带微笑，显得自信而快乐。背景是深蓝色的夜空，月亮散发着柔和的光芒，云层轻盈飘动。",
    "S1950E52 - The Flying Sorceress_scene028.mp4": "视频中，一个穿着巫师服装的绿色皮肤女巫骑着扫帚在空中飞行，她后面跟着一只灰色的猫。女巫挥舞着扫帚，身后留下了一串彩色的魔法火花。猫紧紧抓住扫帚，表情紧张。女巫突然转身，似乎在与猫互动。随后，猫被甩出，悬挂在扫帚的帽子上，女巫继续飞行，而猫则在空中挣扎。最后，猫被甩出画面，女巫独自继续飞行。",
    "S1950E52 - The Flying Sorceress_scene029.mp4": "从窗户向外看，是一个墓地，墓碑林立，枯树孤零零地矗立在远处。突然，一个穿着巫师服装、手持魔法棒的角色从窗外飞过，魔法棒发出火花，划过墓地。随后，另一个穿着巫师服装的角色也从窗外飞过，同样挥舞着魔法棒，留下火花轨迹。两个角色飞过之后，窗户内侧出现了火花和烟雾的痕迹。",
    "S1950E52 - The Flying Sorceress_scene030.mp4": "一个女巫骑着扫帚飞进房间，猫汤姆被女巫的魔法击中后摔倒在地，女巫离开后，汤姆坐在地上，显得很沮丧。",
    "S1950E52 - The Flying Sorceress_scene031.mp4": "画面中是一个昏暗的房间，中央放置着一个婴儿床，床上铺着蓝色的布。婴儿床两侧各有一根点燃的高烛台，烛光温暖而柔和。左侧可见一段螺旋楼梯，楼梯扶手雕刻精美，整体氛围静谧而庄重。",
    "S1950E52 - The Flying Sorceress_scene032.mp4": "一只灰色的猫坐在门前，看起来很紧张。它用爪子捂住嘴，然后站起来，拿起一把扫帚。它用扫帚在地上扫动，扫帚突然发出火花，接着猫被扫帚带着飞了出去，最后消失在画面中。",
    "S1950E52 - The Flying Sorceress_scene033.mp4": "从窗户向外看，是一个墓地场景，墓碑林立，天空阴沉。随后，汤姆猫从窗外飞入，身体周围有彩色粒子特效，他带着一个黄色的物体，似乎在快速移动或飞行。",
    "S1950E52 - The Flying Sorceress_scene035.mp4": "一只老鼠从门后探出头，被猫用扫帚扫倒在地，老鼠挣扎着站起来继续逃跑。",
    "S1950E52 - The Flying Sorceress_scene036.mp4": "汤姆猫手持扫帚，从门边滑行进入房间，随后在空中翻转，落地后摆出一个姿势，扫帚在地面上旋转并发出魔法般的火花。",
    "S1950E52 - The Flying Sorceress_scene037.mp4": "一只小老鼠在房间内奔跑，经过一扇门和一个红色的家具，然后跑过一个带有彩色光点的装饰物，最后跑向墙壁。",
    "S1950E52 - The Flying Sorceress_scene038.mp4": "一个房间的角落里，有一只老鼠从洞口跑出来，看到一把扫帚后，它试图逃跑，但被扫帚扫中，最后被扫帚扫飞。",
    "S1950E52 - The Flying Sorceress_scene039.mp4": "一只老鼠从天花板上掉落，摔在扫帚上，然后被扫帚扫进簸箕，最后被扔进垃圾桶。",
    "S1950E52 - The Flying Sorceress_scene040.mp4": "一只棕色的小老鼠从一个白色圆柱形物体的绿色盖子后面探出头来，眼睛四处张望。",
    "S1950E52 - The Flying Sorceress_scene041.mp4": "汤姆猫骑着扫帚从门边飞出，经过一片墓地，最终消失在视野中。",
    "S1950E52 - The Flying Sorceress_scene042.mp4": "汤姆骑在扫帚上飞行，被一位女巫抓住扫帚柄，女巫试图拉住汤姆，汤姆则试图挣脱。女巫不断拉扯扫帚，汤姆在空中挣扎，表情紧张。女巫身穿黑色尖帽和蓝色长袍，汤姆则是一只灰色的猫。背景是昏暗的室内，有楼梯和挂钟。",
    "S1950E52 - The Flying Sorceress_scene043.mp4": "一位女巫手持扫帚，扫帚上坐着一只猫，猫被烟雾包围，女巫面带笑容看着猫。",
    "S1950E52 - The Flying Sorceress_scene044.mp4": "一个女巫用扫帚将汤姆猫卷入漩涡，汤姆猫被甩出后坐在扫帚上，女巫则用扫帚将汤姆猫扫向空中，汤姆猫在空中留下一串火花。",
    "S1950E52 - The Flying Sorceress_scene045.mp4": "汤姆猫骑着扫帚在天花板上飞行，扫帚尾部喷出彩色火花。飞行过程中，汤姆猫身体后仰，表情紧张，扫帚突然断裂，汤姆猫被甩出，身体拉长，随后又恢复原状，继续飞行。",
    "S1950E52 - The Flying Sorceress_scene046.mp4": "在布满蜘蛛网的昏暗楼梯间，汤姆猫手持扫帚，从楼梯上方飞驰而下，扫帚尾部拖曳出闪烁的火花。",
    "S1950E52 - The Flying Sorceress_scene047.mp4": "一只灰色的猫在楼梯上滑下，它用爪子抓着扶手，表情显得有些紧张和不安。背景是深紫色的墙壁和楼梯，楼梯扶手是棕色的。猫滑下楼梯的过程中，身体不断晃动，最终停在楼梯中间的一级台阶上。",
    "S1950E52 - The Flying Sorceress_scene048.mp4": "一个扫帚从空中飞过，扫帚上坐着汤姆猫，扫帚飞过楼梯时，汤姆猫被甩了下来，扫帚继续飞走，留下一串火花和烟雾。",
    "S1950E52 - The Flying Sorceress_scene049.mp4": "汤姆猫骑在扫帚上飞驰，撞上桌子后摔倒，随后从桌子上跳下并继续奔跑。",
    "S1950E52 - The Flying Sorceress_scene051.mp4": "在月光下，汤姆从门后飞速冲出，追逐着一只小老鼠杰瑞。杰瑞敏捷地躲闪，最终从门边逃走。一位穿着围裙的女士从门内走出，惊讶地看着窗外的追逐场面，随后转身离开。画面最后出现“THE END”字样，标明这是米高梅公司制作的《猫和老鼠》动画片的结尾。"
}