{
    "E106.Timid.Tabby_scene001.mp4": "视频展示了米高梅动画公司的标志，标志中央是一只咆哮的狮子，周围环绕着“Metro-Goldwyn-Mayer”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”的字样。随后画面转黑，接着出现“Tom and Jerry”的标题画面，左侧是猫汤姆，右侧是老鼠杰瑞。",
    "E106.Timid.Tabby_scene003.mp4": "一个信封从门缝中滑出，掉落在地上。汤姆猫走进房间，捡起信封并打开阅读，表情从疑惑变为开心。",
    "E106.Timid.Tabby_scene004.mp4": "视频展示了一封手写信件，信件内容是写给Tom的，信中提到写信人今天会来拜访Tom，并希望Tom家没有老鼠，因为老鼠会吓到他。信的结尾署名是“Your Cousin George”。整个视频画面保持稳定，没有其他动作或变化。",
    "E106.Timid.Tabby_scene005.mp4": "汤姆猫站在房间里，手里拿着一张纸，表情从专注逐渐变为惊讶，然后又转为思考。背景中有一个落地钟和一扇门。",
    "E106.Timid.Tabby_scene007.mp4": "汤姆猫戴着帽子坐在红色扶手椅上，表情紧张。一只小老鼠从楼梯下出现，汤姆猫惊慌失措，椅子和墙壁随之破裂，汤姆猫被弹出，表情惊恐。",
    "E106.Timid.Tabby_scene008.mp4": "汤姆猫提着一个棕色公文包，从楼梯旁走过，他一边走一边开心地跳舞，脸上洋溢着笑容，显得非常高兴和兴奋。",
    "E106.Timid.Tabby_scene009.mp4": "一个黄色的木制隧道装置在墙角，随着装置的打开，一只老鼠从隧道中探出头来，好奇地观察四周。",
    "E106.Timid.Tabby_scene010.mp4": "镜头从一个房间的全景逐渐缩小，聚焦于一张红色桌子上摆放的彩色水果碗，背景是绿色条纹墙和蓝色扶手椅。最终画面缩小至一个圆形视野，只显示水果碗和部分背景。",
    "E106.Timid.Tabby_scene011.mp4": "杰瑞从一个黄色的拱形通道中探出头来，露出开心的笑容，然后它从通道中走出来，向左跑开。",
    "E106.Timid.Tabby_scene012.mp4": "汤姆猫坐在沙发上，先是用爪子捂住嘴，然后拿起桌上的一个粉红色物体，接着又拿起一个黄色物体。杰瑞鼠从桌子后面出现，拿起了黄色物体，被汤姆猫抓住。汤姆猫把杰瑞鼠举起来，然后松手，杰瑞鼠从沙发上跳下来，最后坐在沙发上。",
    "E106.Timid.Tabby_scene013.mp4": "一只灰色的猫倒挂在墙上，四肢伸展，爪子抓挠墙面，导致墙面出现裂痕和碎屑。猫的表情从痛苦到愤怒，最后墙面被破坏，猫消失。",
    "E106.Timid.Tabby_scene014.mp4": "一只灰色的猫躺在沙发上，眼睛瞪得很大，露出尖牙，看起来非常生气。它突然向左翻滚，身体快速移动，然后消失在画面中，留下一只棕色的小老鼠坐在沙发上，似乎对猫的举动感到惊讶。背景中有一个装满彩色水果的白色碗放在桌子上。",
    "E106.Timid.Tabby_scene015.mp4": "一只灰色的猫在两个颜色不同的墙壁之间疯狂旋转，四肢张开，表情狰狞，似乎在努力保持平衡或试图抓住什么。旋转过程中，猫的身体在空中划出弧线，背景中有模糊的动态线条表现其高速旋转。最后，猫停止旋转，四肢伸展，紧紧抓住墙壁的角落。",
    "E106.Timid.Tabby_scene016.mp4": "一只棕色的小老鼠从画面右侧滚入，停在绿色地面上。它先是皱眉，随后露出开心的笑容，竖起一根手指，似乎在得意地炫耀或庆祝什么。背景是蓝色网格状的围栏。",
    "E106.Timid.Tabby_scene018.mp4": "一只灰色的猫从画面右侧跑入，停在墙角，双手叉腰，随后又做出一个伸展动作。",
    "E106.Timid.Tabby_scene019.mp4": "一只老鼠在桌子上表演杂耍，用三个粉色碗抛接，但不小心让一个碗掉下来砸在自己头上。这时，一只猫从右侧出现，盯着老鼠，表情凶狠。老鼠被吓到，吓得跳了起来，但猫用爪子轻轻一拍，老鼠就被打倒在地，狼狈地爬起来，然后迅速逃跑了。猫则一脸得意地看着老鼠逃跑的方向。",
    "E106.Timid.Tabby_scene020.mp4": "一只棕色的老鼠从一个黄色的拱形通道中跑出来，通道固定在绿色的墙面上。老鼠跑出后，通道恢复原状。",
    "E106.Timid.Tabby_scene021.mp4": "汤姆猫在房间里发现一个黄色的拱形物体，他好奇地靠近并试图用爪子触碰。随后，他将电视机推到墙边，站在电视机旁，表情显得有些不满或困惑，最后转身离开房间。",
    "E106.Timid.Tabby_scene022.mp4": "一个黄色的地板盖子突然打开，露出一只灰色的猫——汤姆，他从洞里探出头来，表情从惊讶变为得意，然后又变得紧张和害怕，最后又恢复得意。",
    "E106.Timid.Tabby_scene023.mp4": "一只老鼠从柜子后面探出头，被突然弹出的柜子吓了一跳，随后它四处张望，小心翼翼地靠近柜子，然后又迅速跑开，最后消失在柜子后面。",
    "E106.Timid.Tabby_scene024.mp4": "一只灰色的猫站在一台老式电视机前，它先是用爪子捂住嘴巴，似乎在思考或惊讶，然后转身走向电视机，用爪子按住电视机的按钮，接着它坐到旁边的红色椅子上，继续注视着电视机。",
    "E106.Timid.Tabby_scene026.mp4": "一只老鼠从窗帘后探出头，然后迅速爬到百叶窗的拉绳上，开始拉绳子试图打开百叶窗。",
    "E106.Timid.Tabby_scene027.mp4": "一只猫坐在窗台上，用爪子遮住眼睛。一只老鼠从窗帘后面爬出来，用尾巴勾住猫的尾巴，把猫拉得像一把扫帚一样竖直。猫被拉得失去平衡，从窗户飞出去，最后消失在窗外。老鼠站在原地，看着猫飞走。",
    "E106.Timid.Tabby_scene028.mp4": "汤姆猫从楼梯后跳出来，张开双臂大叫，然后站在墙角，双手叉腰。杰瑞鼠从墙角跑出来，面对汤姆猫，举起双手，然后被汤姆猫一巴掌打倒在地。杰瑞鼠在地上翻滚，汤姆猫则站在原地，表情愤怒。",
    "E106.Timid.Tabby_scene029.mp4": "一只棕色的小老鼠从绿色的墙角后面探出头来，它先是小心翼翼地观察四周，然后慢慢走出墙角，站在地上，显得非常警觉和好奇。",
    "E106.Timid.Tabby_scene030.mp4": "两个汤姆猫面对面站立，右边的汤姆猫愤怒地挥舞着拳头，左边的汤姆猫则保持冷静。随后，右边的汤姆猫逐渐变得温和，两只猫互相拥抱，表情从愤怒转变为友好。最后，右边的汤姆猫再次变得愤怒，而左边的汤姆猫则显得有些无奈。",
    "E106.Timid.Tabby_scene031.mp4": "一只小老鼠站在墙角，突然一只大灰猫从墙后探出头来，吓了小老鼠一跳。小老鼠惊慌失措地四处张望，然后迅速逃跑，最终消失在画面中。",
    "E106.Timid.Tabby_scene032.mp4": "汤姆猫从门后偷看杰瑞鼠，杰瑞鼠用尾巴把门关上，汤姆猫被夹在门缝里，杰瑞鼠得意地跑开。汤姆猫用扫帚试图抓住杰瑞鼠，但扫帚掉在地上，汤姆猫又试图逃跑，杰瑞鼠再次出现并用尾巴把扫帚扫走。汤姆猫再次被夹在门缝里，杰瑞鼠得意地跑开。",
    "E106.Timid.Tabby_scene033.mp4": "猫汤姆从墙后探出头，表情得意，随后被老鼠杰瑞突然出现吓到，猫迅速后退躲藏。老鼠杰瑞则在墙角处挑衅地摆动身体，似乎在嘲笑猫的胆怯。",
    "E106.Timid.Tabby_scene034.mp4": "一只灰色的猫从墙角探出头，眼睛闪烁着黄色的光芒，嘴巴张开，似乎在说话或发出声音。背景是室内环境，有窗户和窗帘。",
    "E106.Timid.Tabby_scene035.mp4": "一只棕色的小老鼠在墙角处，先是站立不动，随后开始沿着墙角快速奔跑。",
    "E106.Timid.Tabby_scene036.mp4": "一只棕色的小老鼠躲在墙角，突然一只灰色的猫从墙后探出头来，露出凶狠的表情，小老鼠吓得后退几步，猫张开嘴露出舌头，似乎要扑过去抓它，但猫突然消失，只留下一个漩涡状的痕迹，小老鼠则呆呆地站在原地。",
    "E106.Timid.Tabby_scene037.mp4": "视频中，一只棕色的小老鼠在房间角落里观察四周，随后，一只灰色的猫从墙后出现，猫用紫色毯子遮住身体，试图悄悄接近老鼠。老鼠察觉后，猫突然从毯子下跳出来，做出夸张的攻击动作，但最终老鼠迅速逃跑，猫未能抓到它。整个场景充满了卡通式的幽默和紧张感。",
    "E106.Timid.Tabby_scene038.mp4": "汤姆猫从窗帘后探出头，看到杰瑞鼠后惊讶地张开双臂。杰瑞鼠从窗帘后跑出来，汤姆猫愤怒地扑向杰瑞鼠，但被杰瑞鼠用窗帘缠住。汤姆猫被绊倒，杰瑞鼠得意地站在他面前。汤姆猫愤怒地站起来，变成两个头，向杰瑞鼠扑去，但杰瑞鼠迅速逃跑。",
    "E106.Timid.Tabby_scene039.mp4": "在一间装饰有绿色窗帘和木质墙板的房间里，一只棕色的小老鼠从右侧跑入画面，向左前方逃跑。随后，一只灰色的猫从右侧出现，张开双臂，面露狰狞表情，似乎准备追捕小老鼠。猫的表情逐渐放大，最终镜头聚焦于猫的脸部特写，表现出其凶狠的神情。",
    "E106.Timid.Tabby_scene040.mp4": "一只棕色的小老鼠从绿色的门后跑出来，然后迅速跑开。紧接着，两只灰色的猫从门后冲出来，它们张开双臂，兴奋地追逐着小老鼠。",
    "E106.Timid.Tabby_scene041.mp4": "一只棕色的小老鼠在夜晚的户外奔跑，经过一堵墙和一个写着“HOME for MICE WITH NERVOUS BREAKDOWNS”的标志牌，最终跑向远处的一座房子。随后画面变黑，出现“THE END”字样，接着显示“M·G·M CARTOON”和“made in Hollywood, U.S.A.”的字样。",
    "E106.Timid.Tabby_scene042.mp4": "视频开头显示了MGM动画的标志，背景为深蓝色，标志由“an MGM CARTOON”和“made in hollywood, U.S.A.”组成。随后画面转为全黑。"
}