{
    "21. Flirty Birdy_scene001.mp4": "视频开始时显示黑色背景和一串数字“0110544170204083”。随后，画面切换到一个红色背景，显示“Metro-Goldwyn-Mayer CARTOON”字样，上方有一个咆哮的狮子图案，下方标注“COLOR BY TECHNICOLOR”。整个画面保持静态，没有其他动作或变化。",
    "21. Flirty Birdy_scene002.mp4": "视频展示了米高梅动画片的标志，背景为红色，中央是一个咆哮的狮子头像，下方有“A Metro-Goldwyn-Mayer CARTOON”字样，以及“COLOR BY TECHNICOLOR”的说明。狮子在标志中不断张合嘴巴，表现出咆哮的动作。",
    "21. Flirty Birdy_scene003.mp4": "视频展示了米高梅动画的标志，随后切换到《猫和老鼠》的标题画面，其中汤姆猫和杰瑞鼠的形象出现在红色背景上。",
    "21. Flirty Birdy_scene004.mp4": "这是一个《猫和老鼠》动画片头，展示了主角汤姆猫和杰瑞鼠的卡通形象，背景为红色渐变圆环，下方有黄色的“TOM and JERRY”字样。随后画面切换，出现标题“Flirty Birdy”和导演信息“DIRECTED BY WILLIAM HANNA and JOSEPH BARBERA”。",
    "21. Flirty Birdy_scene005.mp4": "视频片段展示了动画片《Tom and Jerry》中的一个短片《Flirty Birdy》的片头。首先，画面呈现了标题“Flirty Birdy”，并注明由William Hanna和Joseph Barbera执导。随后，画面显示了动画师Irven Spence、Kenneth Muse和Ray Patterson的名字，以及音乐由Scott Bradley创作。接着，画面显示该片由Fred Quimby制作。最后，画面逐渐变暗，过渡到下一个场景。整个片头以蓝色背景为主，文字以黄色呈现，具有经典动画风格。",
    "21. Flirty Birdy_scene006.mp4": "视频展示了一只灰色的猫（汤姆）在户外草地上追逐一串奶酪块。猫的黄色眼睛闪烁着兴奋的光芒，它用前爪抓着一块大奶酪，身体前倾，尾巴高高翘起，表现出强烈的捕猎欲望和专注。背景是一堵白色的墙和一些红色的花朵，墙边有一个排水管和一个小洞。猫沿着奶酪块的路径快速奔跑，似乎在追逐前方的奶酪，整个场景充满了动感和幽默感。",
    "21. Flirty Birdy_scene007.mp4": "一只棕色的小老鼠从洞口跑出，手里拿着一块奶酪，沿着地上的奶酪块一路向前奔跑。背景是白色墙壁、金属管道和一株红色花朵的植物。",
    "21. Flirty Birdy_scene008.mp4": "一只老鼠杰瑞被夹在夹子中，夹子被设置在一块面包上，旁边有几块奶酪。杰瑞试图吃奶酪，但夹子突然关闭，将他夹住。猫汤姆从垃圾桶后面出现，用绳子拉紧夹子，然后将夹子和杰瑞一起拿走。汤姆将杰瑞放在面包上，然后用芥末瓶在面包上撒芥末。",
    "21. Flirty Birdy_scene009.mp4": "一只灰色的猫（汤姆）拿着一块面包，面包里藏着一只棕色的小老鼠（杰瑞）。汤姆试图吃掉面包，但杰瑞突然从面包里跳出来，导致汤姆被面包砸到，脸上和身上沾满了面包屑，汤姆愤怒地瞪着杰瑞。",
    "21. Flirty Birdy_scene010.mp4": "一只红色的鸟儿在空中飞翔，怀中抱着一只小老鼠。它飞到一棵树的树枝上，然后用爪子抓住树枝，把小老鼠放在树枝上。接着，它用翅膀遮住小老鼠，然后又把小老鼠抱起来，最后把小老鼠放进树洞里。",
    "21. Flirty Birdy_scene011.mp4": "一只红色的鸟拿着一个三明治，三明治上有一只小老鼠。鸟撒上一些调料，然后张开嘴准备吃三明治，但小老鼠突然从三明治上跳出来，鸟被吓了一跳，三明治也掉了。鸟愤怒地抓起三明治，但三明治碎了，鸟只好吃掉碎屑，最后鸟看起来很生气。",
    "21. Flirty Birdy_scene012.mp4": "一只红鹰和一只猫站在树枝上，猫抱着一个装着老鼠的盒子。红鹰伸手抢走盒子，猫试图夺回，两人争抢中盒子被打开，老鼠露出头来。",
    "21. Flirty Birdy_scene013.mp4": "杰瑞被夹在两片面包中间，被挤压变形，随后被弹出面包片外。",
    "21. Flirty Birdy_scene014.mp4": "一只红白相间的鹰和一只灰猫站在树枝上，鹰手里拿着一个三明治，猫试图抢夺三明治。鹰用翅膀挡住猫，猫被推到一边，最后鹰独自站在树枝上，猫被甩开。",
    "21. Flirty Birdy_scene015.mp4": "汤姆猫躺在地上，突然起身，捡起一块砖头扔向树上，但砖头被树挡住了。汤姆猫再次尝试扔砖头，但还是被树挡住。最后，汤姆猫从树上跳下来，落在地上。",
    "21. Flirty Birdy_scene016.mp4": "一只灰色的猫从树洞中跳出，张大嘴巴，露出红色的舌头，双手举起，表情夸张，似乎在大声喊叫或表现出惊讶。背景是蓝天、绿树和远处的建筑物。",
    "21. Flirty Birdy_scene017.mp4": "一只红色的大鸟正用爪子抓着一块面包，面包上有一只小老鼠。大鸟在树洞前，表情愤怒，似乎在挣扎或试图保护面包。背景是蓝天和一棵大树。",
    "21. Flirty Birdy_scene018.mp4": "汤姆猫在树洞前张大嘴巴，似乎在大声喊叫或惊讶。突然，一个红色的长条物体从树洞中伸出，击中了汤姆的嘴巴，导致他被弹飞出去，最终消失在画面中。背景是户外的草地和树木，天空晴朗。",
    "21. Flirty Birdy_scene019.mp4": "一只红色的鹰试图把一只灰色的猫从树洞里拉出来，猫在树洞里挣扎并大声叫喊，鹰问猫要不要下来，猫最终被鹰拉了出来。",
    "21. Flirty Birdy_scene021.mp4": "一只猫从晾衣绳上跳下，落在一个绿色的桶上。它头上戴着红色头巾，背后有黑色和白色的羽毛，身上披着一条黄色的花裙子。猫手里拿着一串玉米棒子，先是举起玉米棒子，然后开始跳舞，最后甩动身体。",
    "21. Flirty Birdy_scene022.mp4": "汤姆猫穿着黄色花裙子，手持羽毛扇，站在绿色物体上，先是摆出舞蹈姿势，然后穿上裙子，最后跳起离开画面。",
    "21. Flirty Birdy_scene023.mp4": "一只红色的鸟儿坐在树枝上，左手拿着一片面包，右手用勺子从树洞里的芥末罐中舀取芥末，准备涂抹在面包上。背景是蓝天和树叶。",
    "21. Flirty Birdy_scene024.mp4": "一只红色的鸟拿着一片面包，面包上躺着一只小老鼠。鸟用勺子舀起黄油，准备涂抹在面包上，小老鼠伸手试图抢夺黄油，鸟则闭上眼睛享受美食。",
    "21. Flirty Birdy_scene025.mp4": "一只小老鼠坐在一个巨大的三明治上，手里拿着一把刀，正在切三明治。它先切了一刀，然后把刀举起来，接着又切了一刀，最后把刀扔了，从三明治上跳了下来。",
    "21. Flirty Birdy_scene026.mp4": "一只红色的鸟儿拿着一片面包，面包上有一只小老鼠。鸟儿开心地张开嘴，似乎要吃掉面包上的老鼠。接着，鸟儿把面包掰开，发现面包里有黄油，它高兴地举起两片面包，然后又低头看着手中的面包，似乎在思考什么。",
    "21. Flirty Birdy_scene027.mp4": "一只棕色的小老鼠站在树枝上，它先是小心翼翼地向前走，然后停下来看着前方，接着又继续向前走。背景是蓝天和绿色的树叶。",
    "21. Flirty Birdy_scene028.mp4": "一只红棕色的鹰坐在树枝上，手里拿着一块面包。一只小老鼠从左侧跑来，爬上面包，然后被鹰发现。鹰迅速将面包拿开，老鼠被夹在面包里。",
    "21. Flirty Birdy_scene029.mp4": "一只红色的鸟正在吃三明治，突然一只老鼠从三明治里跳出来，站在鸟的喙上。老鼠在鸟的喙上跳来跳去，鸟被吓了一跳，把三明治扔了。老鼠从鸟的喙上跳到鸟的头上，然后跳到鸟的嘴里，鸟被吓了一跳，把老鼠抓在手里。鸟看着老鼠，老鼠也看着鸟。",
    "21. Flirty Birdy_scene030.mp4": "一只灰色的猫从烟囱里探出头来，嘴里叼着一个蓝色的喇叭。它用爪子抓着一只白色的小鸟，然后又把它放回空中。",
    "21. Flirty Birdy_scene031.mp4": "一只红色的啄木鸟，黄色的喙，白色羽毛围脖，背景是蓝色天空。它先是闭着眼睛，然后睁开眼睛，眼睛睁得很大，显得惊讶或震惊。",
    "21. Flirty Birdy_scene032.mp4": "一只戴着蓝色帽子、穿着黄色衣服的猫从烟囱里探出头来，然后爬到屋顶上，一边走一边摆动尾巴，看起来很得意。",
    "21. Flirty Birdy_scene033.mp4": "一只红色的卡通鸟，有着黄色的喙和白色的羽毛装饰，它在蓝色的背景前不断点头和转动头部，表情显得开心和兴奋。",
    "21. Flirty Birdy_scene034.mp4": "一只棕色的小老鼠，眼睛里反射出两个穿着黄色衣服的黑猫形象，表情从惊讶逐渐变为兴奋。背景是红色的毛发和蓝色的天空。",
    "21. Flirty Birdy_scene035.mp4": "一只穿着黄色衣服、戴着蓝色瓶子的猫在屋顶上行走，随后一只红色的大鸟带着一只小动物飞来，鸟与猫在屋顶上互动，鸟显得很激动，猫则保持冷静。",
    "21. Flirty Birdy_scene036.mp4": "在这一动画片段中，一只灰色的猫（汤姆）被一只红色的鸟（啄木鸟伍迪）抓住，伍迪手里还抱着一只小猫（杰瑞）。汤姆戴着一个蓝色的喇叭状物体，看起来非常紧张和痛苦。伍迪似乎在与汤姆对峙，而小猫杰瑞则试图从伍迪的手中挣脱，伸手去拉汤姆的喇叭。整个场景充满了紧张和喜剧的氛围，背景是简单的蓝色天空。",
    "21. Flirty Birdy_scene037.mp4": "一只灰色的猫和一只红色的大鸟在空中对峙，鸟嘴里叼着一只棕色的小老鼠。猫试图用嘴咬住鸟的喙，鸟则用爪子抓向猫。接着，猫用嘴叼住鸟的喙，鸟被猫的攻击逼退。随后，猫将鸟的喙从嘴里拔出，鸟被弹飞，小老鼠被甩出。猫随后将鸟的喙重新叼住，鸟再次被逼退。最后，猫和鸟再次对峙，猫用爪子抓向鸟，鸟则用喙啄向猫。",
    "21. Flirty Birdy_scene038.mp4": "一只戴着蓝色鼻子的猫，穿着黄色花裤子，正用爪子抚摸着藏在裤子口袋里的小老鼠。旁边有一只黄色喙的红色鸟在旁观看。",
    "21. Flirty Birdy_scene039.mp4": "一只小老鼠从一只大鸟的尾羽中探出头来，手里拿着一根绿色的棒棒糖，然后慢慢爬到尾羽顶端，握紧棒棒糖。",
    "21. Flirty Birdy_scene040.mp4": "一只猫戴着蓝色的喇叭，抱着一只红色的鸟，猫的嘴里叼着一个绿色的烟斗，烟斗里冒出烟。猫突然松开鸟，自己飞走了，鸟张开双臂，看着猫飞走的方向。",
    "21. Flirty Birdy_scene041.mp4": "汤姆猫穿着黄色衣服，手持蓝色瓶子，与一只红色大鸟在屋顶上追逐。大鸟试图抓住汤姆，但汤姆躲进烟囱，大鸟也跟着钻进去，最终大鸟被卡在烟囱里，汤姆则安全地从烟囱里出来。",
    "21. Flirty Birdy_scene042.mp4": "动画片段中，汤姆穿着黄色背心，嘴里叼着蓝色玩具，怀里抱着杰瑞，从屋顶飞奔而来。他撞上砖砌烟囱，砖块掉落。一只红羽毛大鸟出现，愤怒地啄向烟囱，砖块四溅。汤姆躲到烟囱后，大鸟停止攻击，汤姆从烟囱后探出头，继续躲藏。",
    "21. Flirty Birdy_scene043.mp4": "一只灰色的猫从砖墙后探出头来，眼睛紧盯着前方，然后迅速缩回墙后。",
    "21. Flirty Birdy_scene044.mp4": "一只红色的卡通鸟，张大嘴巴，露出惊讶或兴奋的表情，背景是蓝色的天空。",
    "21. Flirty Birdy_scene045.mp4": "汤姆猫站在烟囱上，嘴里叼着一个蓝色的管子，怀里抱着杰瑞。一只红头黄嘴的鸟飞到烟囱旁，对汤姆说“嘿！”，然后汤姆把鸟推了出去。鸟撞在烟囱上，汤姆则说“那个女孩喜欢我！”，随后鸟重新飞回来，站在汤姆面前。",
    "21. Flirty Birdy_scene046.mp4": "一只红色的鹦鹉和一只灰色的猫站在砖墙旁，鹦鹉用嘴叼着一个蓝色的喇叭，猫也用嘴叼着同样的喇叭。鹦鹉吹响喇叭，猫被吹得向后退，随后猫也吹响喇叭，鹦鹉被吹得向后退。两人互相吹喇叭，彼此对抗。",
    "21. Flirty Birdy_scene047.mp4": "一只红色的鸟站在屋顶上，旁边是一只穿着黄色衣服、戴着蓝色帽子的猫。鸟先是张开双臂，然后转身面向猫，似乎在与猫互动。猫则站在砖墙边，看起来有些惊讶或困惑。鸟的动作表现出一种夸张的表演或舞蹈，而猫则保持相对静止的状态。",
    "21. Flirty Birdy_scene048.mp4": "一只穿着黄色背心和蓝色裤子的猫从屋顶上跳起，然后从屋顶边缘滑落，最终消失在画面中。背景是一栋白色房子和蓝天绿树。",
    "21. Flirty Birdy_scene049.mp4": "动画片段中，汤姆猫被一个红色的鸟形角色用脚踩住，鸟形角色踩着汤姆猫，随后汤姆猫被鸟形角色踢开，鸟形角色在地上翻滚，最后鸟形角色站起来并转身离开。",
    "21. Flirty Birdy_scene050.mp4": "汤姆穿着黄色衣服，手里拿着杰瑞，从树后跑向一个木桶。他跳上木桶，木桶里突然冒出啄木鸟伍迪。汤姆和伍迪在木桶上对峙，伍迪用翅膀拍打汤姆，汤姆则试图用杰瑞威胁伍迪。最后，伍迪抱头蹲在木桶上，显得非常惊讶和困惑。",
    "21. Flirty Birdy_scene051.mp4": "汤姆穿着黄色背心，从地洞中爬出，手里拿着一个蓝色瓶子，他站在房屋外，用瓶子喝水，同时拿着一个棕色小动物。背景是房屋外墙和一些园艺工具。",
    "21. Flirty Birdy_scene052.mp4": "猫用夹子夹住老鼠，老鼠被吊在空中，猫喝着蓝色饮料，表情得意。",
    "21. Flirty Birdy_scene053.mp4": "汤姆穿着黄色围裙，嘴里叼着蓝色管子，正在院子里用绿色耙子除草。突然，一只红色的鸟飞来，用脚踩住了耙子，汤姆被吓了一跳。鸟站在汤姆面前，汤姆则做出夸张的舞蹈动作。随后，鸟被汤姆的舞蹈动作吓到，飞走了，汤姆的舞蹈动作也停止了。鸟飞走后，汤姆的舞蹈动作停止了，他转过身，看着地上的工具。",
    "21. Flirty Birdy_scene054.mp4": "杰瑞在电线杆上滑行，被汤姆用滑稽的长鼻子追逐。汤姆穿着黄色背心，戴着蓝色长鼻子，试图抓住杰瑞。杰瑞滑到电线杆顶端，汤姆也跟着爬上去，但杰瑞在电线杆上灵活地躲避。汤姆用长鼻子试图抓住杰瑞，但杰瑞敏捷地避开，最终汤姆只能无奈地看着杰瑞。",
    "21. Flirty Birdy_scene055.mp4": "汤姆穿着印第安服装，戴着蓝色锥形帽，正在草地上奔跑。突然，一个红色的鸟从天而降，抓住了汤姆。汤姆被鸟压在地上，鸟用翅膀拍打汤姆，汤姆挣扎着试图摆脱鸟的控制。最终，汤姆成功挣脱了鸟的控制，鸟倒在地上。此时，杰瑞从远处跑来，汤姆看到杰瑞后，愤怒地冲向杰瑞，试图抓住他。杰瑞看到汤姆后，吓得四处逃跑。汤姆追赶杰瑞，但最终没有抓住他。汤姆和鸟都躺在地上，汤姆看起来很生气，而鸟则显得很无奈。",
    "21. Flirty Birdy_scene056.mp4": "一只老鼠从木栅栏旁跑过，随后一只穿着黄色背心、戴着蓝色管子的猫从栅栏后跳出来，试图抓住老鼠，但最终摔倒在地。猫站起身，再次尝试攀爬栅栏，但似乎没有成功。",
    "21. Flirty Birdy_scene057.mp4": "一只棕色的小猫正用尽全力拉扯一根蓝色的管子，试图将它从木栅栏的另一侧拉过来。栅栏上方，一只灰色的猫探出头，眼睛瞪得很大，嘴里叼着管子的一端，似乎在与小猫对峙。背景是绿色的草地和一些石头小径，旁边还有几片树叶。",
    "21. Flirty Birdy_scene058.mp4": "一只穿着黄色衣服、戴着蓝色鼻子的猫从木栅栏上跳下，落地后捡起一块木板，然后用木板抵住栅栏柱子，似乎在试图加固或修理栅栏。",
    "21. Flirty Birdy_scene059.mp4": "杰瑞举着一个蓝色管子，被一只手从上方拿走，他惊慌失措地跳起来，然后摔倒在地。",
    "21. Flirty Birdy_scene060.mp4": "一只红色的大鸟手持蓝色棍子，站在木墙旁，对一只小老鼠做出各种手势和动作，包括指指点点、张开双臂、弯腰等，小老鼠则站在一旁，似乎在回应或观察大鸟的动作。",
    "21. Flirty Birdy_scene061.mp4": "一只穿着黄色衣服、戴着蓝色鼻子的灰色猫，正用一根木棍试图击打从栅栏后探出头来的红色鸟。猫挥动木棍击中了鸟，导致鸟被击倒在地。猫随后惊讶地看着倒地的鸟，接着又惊慌地后退。",
    "21. Flirty Birdy_scene062.mp4": "一只小老鼠拿着一个蓝色管子，对着躲在木柱后的一只猫喷射。猫被喷中后倒地，小老鼠趁机逃跑。",
    "21. Flirty Birdy_scene063.mp4": "一只棕色的小老鼠从房子旁边跑过，突然被一只灰色的猫抓住。猫戴着一个蓝色的喇叭，似乎在吹奏。随后，一只红色的鸟出现，抓住猫的喇叭，猫的表情变得惊讶。",
    "21. Flirty Birdy_scene064.mp4": "汤姆穿着黄色背心，手里拿着一个蓝色的喇叭，正试图用喇叭对着杰瑞的耳朵吹气。杰瑞被汤姆抓住，显得非常惊恐，试图躲避汤姆的喇叭。汤姆则一脸得意，似乎在享受这个过程。背景是户外的草地和木栅栏。",
    "21. Flirty Birdy_scene065.mp4": "一只戴着蓝色锥形帽的灰色猫，正坐在地上，手里拿着一只棕色的小老鼠。猫的旁边站着一只红色的鸟，它先是愤怒地挥舞着翅膀，然后跳起来，试图从猫手中抢走老鼠。猫则努力地保护着老鼠，不让鸟抢走。",
    "21. Flirty Birdy_scene066.mp4": "一只红色的鸟用爪子抱着一只棕色的小猫，鸟的喙轻轻触碰小猫的脸，小猫表情从不满变为惊讶。",
    "21. Flirty Birdy_scene067.mp4": "一只棕色的小老鼠被一只巨大的手紧紧抓住，它在挣扎中露出痛苦和恐惧的表情，随后又显得有些无奈和疲惫。",
    "21. Flirty Birdy_scene068.mp4": "一只红色的大鸟用爪子抱着一只小猫，大鸟的表情从惊讶变为开心，小猫则一直眯着眼睛。",
    "21. Flirty Birdy_scene069.mp4": "在“接吻亭”前，汤姆猫戴着厨师帽，手持勺子，准备迎接顾客。啄木鸟伍迪突然出现，手里拿着一只小老鼠，声称每次只能吻一只老鼠。汤姆猫先是惊讶，随后拿起勺子准备反击，但伍迪迅速用勺子将汤姆猫击飞，汤姆猫在空中翻滚后落地，伍迪得意地站在一旁。",
    "21. Flirty Birdy_scene070.mp4": "汤姆猫站在一个标有“KISSING BOOTH”的拱门下，他戴着蓝色的长鼻子道具，穿着黄色背心，表情兴奋，似乎在等待或准备进行亲吻活动。周围有花卉装饰，背景是晴朗的天空。",
    "21. Flirty Birdy_scene071.mp4": "一只老鼠从房子旁边跑过，随后一只穿着飞行服的猫从房子后面冲出来追赶老鼠，猫在空中飞行并撞上了一棵树，最后消失在画面中。",
    "21. Flirty Birdy_scene072.mp4": "一只穿着黄色衣服的猫在草地上奔跑，嘴里叼着一个蓝色的瓶子。它跑向一栋房子，突然被一只红色的鸟从侧面撞倒。猫摔倒在地，鸟站在它旁边，似乎在与它对峙。",
    "21. Flirty Birdy_scene073.mp4": "一只红色的鸟和一只灰色的猫在房屋前互动。鸟用爪子抓住猫的鼻子，猫试图用爪子推开鸟。随后，鸟拿出一个蓝色的盒子递给猫，猫继续用爪子挡住盒子。",
    "21. Flirty Birdy_scene074.mp4": "一只手打开蓝色盒子，里面有一只小老鼠，手将老鼠提起来。",
    "21. Flirty Birdy_scene075.mp4": "一只穿着红色衣服的鸟拿着一只小老鼠，递给一只穿着黄色围裙、鼻子被涂成蓝色的猫。猫接住老鼠后，鸟显得有些惊讶，而猫则表现出高兴和兴奋的表情。",
    "21. Flirty Birdy_scene076.mp4": "一只戴着蓝色长鼻子的猫，穿着黄色围裙，手里拿着一只小老鼠。猫的表情从惊讶变为得意，然后又变回惊讶。小老鼠坐在猫的手上，表情从害怕变为得意。背景是白色的墙壁和绿色的门。",
    "21. Flirty Birdy_scene077.mp4": "汤姆穿着黄色围裙，嘴里叼着蓝色的管子，手里抱着一只小老鼠，正与一只红色的鸟对峙。汤姆试图用管子吹气，鸟儿被吹得后退，随后鸟儿撞到窗户上，窗户破碎。汤姆趁机扑向鸟儿，鸟儿倒地，汤姆则挂在窗框上，最后倒在地上，与鸟儿一同躺在地上。",
    "21. Flirty Birdy_scene078.mp4": "一只小老鼠从一只大猫的脚边跳起，然后用绳子缠住大猫的脚，接着爬到大猫的肚子上，用大猫的喇叭吹气。",
    "21. Flirty Birdy_scene079.mp4": "汤姆猫被一个红色的鸟用蓝色的管子堵住嘴巴，鸟在说话，汤姆猫表情痛苦。随后，鸟把管子从汤姆猫嘴里拿出来，汤姆猫张大嘴巴，眼睛瞪得很大，看起来很惊讶。",
    "21. Flirty Birdy_scene080.mp4": "一只穿着红色衣服的鸟和一只小老鼠在户外，鸟用绳子拉住老鼠，老鼠则试图挣脱。背景是一栋房子的外墙和窗户。",
    "21. Flirty Birdy_scene081.mp4": "汤姆穿着黄色衣服，被一根绳子拖拽着在草地上飞驰，最终摔倒在地。",
    "21. Flirty Birdy_scene082.mp4": "一只红色的鸟用绳子牵着一只小老鼠，两者在房屋外的草地上拉扯绳子。鸟用力拉扯，老鼠则奋力抵抗，双方表情夸张，动作充满喜剧效果。",
    "21. Flirty Birdy_scene083.mp4": "一只红色的鸟正在用力拉一根绳子，它表情专注，身体前倾，显示出极大的力量和决心。背景是一栋房子的外墙和绿色的百叶窗。",
    "21. Flirty Birdy_scene084.mp4": "视频中，一只穿着黄色衣服、戴着羽毛头饰的猫躺在草地上，嘴里叼着一个蓝色的管子。一只小老鼠拿着一束花跑过来，猫用管子喷出一股气流，把花吹走了。小老鼠被吹得飞了起来，然后落地。接着，画面切换到一只红色的鸟坐在树上，它挥舞着手臂，似乎在打招呼。最后，猫出现在一个鸟巢里，手里拿着一个蛋，它把蛋放在鸟巢里，然后又拿起另一个蛋。",
    "21. Flirty Birdy_scene085.mp4": "一只猫坐在鸟巢里，嘴里叼着一个瓶子，手里拿着一个蛋。它把蛋放在巢里，然后开始用毛线和针编织一件衣服。它专注地编织着，背景是温暖的黄色天空。最后，画面变黑，出现“THE END”的字样。",
    "21. Flirty Birdy_scene086.mp4": "视频开始时显示“THE END”字样，背景为红色渐变至黄色。随后，文字逐渐变化，显示出“An MGM Tom and Jerry CARTOON”字样，下方标注“MADE IN HOLLYWOOD, U.S.A.”。整个画面保持静态，没有其他动作或场景变化。",
    "21. Flirty Birdy_scene087.mp4": "视频片段显示的是一个黑色背景，上面有“An MGM Tom and Jerry Cartoon MADE IN HOLLYWOOD, U.S.A.”的字样。这似乎是动画片《猫和老鼠》的片头或片尾画面。"
}