{
    "14. The Million Dollar Cat_scene001.mp4": "视频开始时显示一个黑色背景，底部有数字“0110544170204083”。随后，画面逐渐出现“Metro Goldwyn Mayer Cartoon”的标志，标志中央是一只咆哮的狮子，周围环绕着“ARS GRATIA ARTIS”字样。狮子咆哮后，标志逐渐淡出。最后，画面转为黑色，然后出现“TOM and JERRY”的标题，背景为红色圆形图案，左侧是猫汤姆的头像，右侧是老鼠杰瑞的头像。",
    "14. The Million Dollar Cat_scene002.mp4": "这是一个《猫和老鼠》动画片的片头，展示了标题“百万富翁猫猫”以及导演、动画师、音乐制作人和制片人的名字。背景为红色，文字为黄色和白色，风格复古。",
    "14. The Million Dollar Cat_scene003.mp4": "视频开头显示“Produced by FRED QUIMBY”的字样，随后画面转为黑色，最后出现一只卡通猫坐在沙发上，手里拿着鱼，面带微笑。",
    "14. The Million Dollar Cat_scene004.mp4": "汤姆猫坐在沙发上，手里拿着一束花，他把一朵花放在头顶，开心地笑着，然后又把花拿下来，继续欣赏手中的花束。",
    "14. The Million Dollar Cat_scene005.mp4": "一只小老鼠站在一个靶子前，靶子上插着一支箭，旁边有一个红苹果。小老鼠试图用苹果挡住箭，但箭击中了苹果，苹果破裂，小老鼠被苹果盖住，最后从苹果中探出头来。",
    "14. The Million Dollar Cat_scene006.mp4": "一只灰白相间的猫坐在粉色沙发上，它用前爪捂住眼睛，然后突然放下爪子，露出开心的笑容，接着它用爪子拿起一支黄色的笔，开始在沙发上做各种滑稽的动作，包括翻滚和倒立。",
    "14. The Million Dollar Cat_scene007.mp4": "一只小老鼠从一个红色苹果里探出头来，苹果被箭射中后破裂，小老鼠从破裂的苹果中跳出并爬到靶子上。",
    "14. The Million Dollar Cat_scene008.mp4": "一只灰白相间的猫坐在粉色沙发上，头上缠着绷带。它先是用爪子拉扯绷带，然后慢慢将绷带从头上扯下，露出惊讶的表情。",
    "14. The Million Dollar Cat_scene009.mp4": "一个猫从门后跳出来，捡起地上的一张纸，仔细阅读后露出开心的表情。",
    "14. The Million Dollar Cat_scene010.mp4": "视频展示了一封电报，内容是根据一位古怪的姨妈哈里特的遗愿，收件人的猫托马斯继承了一百万美元。电报上显示日期为1910年1月10日，地点为纽约市。画面下方有中文字幕翻译电报内容。",
    "14. The Million Dollar Cat_scene011.mp4": "汤姆猫坐在地上，手里拿着一封电报，他先是仔细阅读，然后显得非常兴奋，接着他站起来，开始跳舞庆祝，最后又坐下来继续看电报。",
    "14. The Million Dollar Cat_scene012.mp4": "一只灰色的猫坐在门前，手里拿着一张黄色的电报，它先是仔细阅读，然后露出非常开心的表情，眼睛变成了两个装满钱的袋子，最后它高兴地跳起来，把电报扔在了门上。",
    "14. The Million Dollar Cat_scene013.mp4": "一只黑猫在客厅里兴奋地跳舞，随后它扑向鱼缸，抓起鱼并将其抛向空中。接着，它拿起一串柠檬，继续在房间里欢快地跳跃和旋转。",
    "14. The Million Dollar Cat_scene014.mp4": "一只棕色的小老鼠站在一个飞镖盘前，它先是用爪子挠了挠头，然后兴奋地跳了起来，最后从飞镖盘前跑开。",
    "14. The Million Dollar Cat_scene015.mp4": "一只小老鼠跑进房间，看到地上有一封电报。它兴奋地捡起电报，读完后高兴地跳了起来，然后开始在房间里跳舞庆祝。",
    "14. The Million Dollar Cat_scene016.mp4": "一只灰色的猫和一只棕色的小老鼠在室内地板上互动。猫先是蹲着，表情凶狠，似乎在准备扑捉老鼠。老鼠则表现出挑衅和勇敢的姿态，不断向猫靠近并做出攻击动作。猫被老鼠的举动激怒，试图抓住它，但老鼠灵活地躲避。猫最终被激怒，扑向老鼠，但老鼠成功逃脱。整个过程充满了紧张和幽默的气氛，展现了猫鼠之间的追逐和对抗。",
    "14. The Million Dollar Cat_scene017.mp4": "一只小老鼠从门边跑过，捡起一张黄色的电报，上面写着“TELEGRAM”和“EVEN A MOUSE”。它兴奋地展示给一只灰猫看，灰猫扑过来抢电报，小老鼠则得意地站在一旁。灰猫最终拿到电报，表情变得严肃。",
    "14. The Million Dollar Cat_scene018.mp4": "视频展示了一封电报的内容，电报上写着：根据你古怪的姨妈哈丽特的遗愿，你的猫托马斯被留下了一百万美元。遗嘱条款规定，如果这只猫对任何活着的生物造成伤害，包括老鼠，所有收益将立即终止。画面下方有中文字幕解释遗嘱条款。",
    "14. The Million Dollar Cat_scene019.mp4": "汤姆猫拿着一张黄色的纸，表情从疑惑变为愤怒，随后用力撕扯纸张。",
    "14. The Million Dollar Cat_scene020.mp4": "一只棕色的小老鼠站在墙边，双臂张开，似乎在跳舞或庆祝。它先是双手握拳，然后慢慢展开双臂，脸上带着微笑。随后，一张报纸从上方飘落，上面印有小老鼠的图案和“TYRONE MOUSE”的字样。",
    "14. The Million Dollar Cat_scene022.mp4": "视频展示了两则关于猫的漫画报道。第一则标题为“FELINE INHERITS FORTUNE”，画面中一只猫坐在金币和钱袋上，象征继承财富。第二则标题为“RICH CAT BATHES IN CREAM”，画面中猫在浴缸中用奶油洗澡，边洗边吃，周围散落着牛奶瓶。",
    "14. The Million Dollar Cat_scene023.mp4": "视频片段展示了一则关于“猫猫加入上流社会”的新闻报道，随后镜头切换到“1 PARK AVE.”的豪华住宅门前。新闻标题包括“CAT CRASHES SOCIETY”和“MOVES TO PARK AVE!”，并提到猫猫加入骑马兴趣小组和挥霍金钱。画面最后定格在豪宅门口，强调其奢华与地位。",
    "14. The Million Dollar Cat_scene024.mp4": "一只穿着西装、戴着礼帽和红色领结的猫从一扇门后走出，手持拐杖，摆出优雅的姿势。它在门前的红地毯上踱步，随后弯腰，似乎在检查或调整拐杖。接着，它转身向右走去，镜头跟随它移动，最终停留在一个写着“1/2 PARK AVE”的小亭子下，那里有一只狗在休息。",
    "14. The Million Dollar Cat_scene025.mp4": "一只穿着礼帽和手持手杖的棕色老鼠从标有“1/2 PARK AVE.”的洞穴中走出，他先是抱着一个白色物体，随后放下物体，挺直身体，用右手敬礼，左手拿着手杖，面带微笑地站在洞穴前。洞穴两侧各有一盆绿色盆栽，左侧还有一个大型蓝色花瓶。",
    "14. The Million Dollar Cat_scene026.mp4": "一只穿着西装、戴着礼帽和红色领结的灰色猫，手持拐杖，在红色地毯上滑行，随后摔倒在地。",
    "14. The Million Dollar Cat_scene028.mp4": "汤姆猫和杰瑞鼠穿着礼服，汤姆猫手持杰瑞鼠，杰瑞鼠举着一份电报，电报上写着“即使是老鼠也不行”。汤姆猫看着电报，露出得意的笑容，随后亲吻杰瑞鼠。",
    "14. The Million Dollar Cat_scene029.mp4": "汤姆猫穿着礼服，戴着礼帽，与杰瑞老鼠在“半公园大道”标志牌前互动。汤姆猫先是伸手与杰瑞握手，随后兴奋地跳起，表现出愉快和得意的神情。杰瑞则手持拐杖，穿着礼服和礼帽，站在一旁，显得自信而从容。背景中有蓝色花盆和绿色植物。",
    "14. The Million Dollar Cat_scene030.mp4": "一辆黑色轿车从路边驶过，车门打开，一只猫从车里跳出来，随后轿车迅速驶离，留下一串黑色烟雾。",
    "14. The Million Dollar Cat_scene031.mp4": "在豪华的汽车内，穿着礼服的汤姆猫悠闲地坐在座椅上，戴着小礼帽，系着红色领结，脚上穿着黄色拖鞋。他先是伸展身体，随后拿起一支雪茄，悠然自得地抽了起来。与此同时，车窗外的小老鼠杰瑞戴着小礼帽，坐在车窗边，模仿汤姆猫的动作，也拿起一支雪茄，对着汤姆猫吹烟。汤姆猫被杰瑞的行为逗乐，但突然杰瑞的雪茄冒出的烟雾让汤姆猫惊慌失措，他张大嘴巴，显得非常惊讶和害怕。",
    "14. The Million Dollar Cat_scene032.mp4": "一只穿着礼帽和手套的小老鼠站在一个圆形的镜子前，手持指挥棒，似乎在指挥或表演。一只穿着礼帽和领结的灰色猫从右侧出现，注视着小老鼠。镜子上贴着一张电报，上面写着“EVEN A MOUSE”。小老鼠突然从镜子中跳出来，撞到了猫，猫被撞得后退并转圈，显得非常生气。猫最终恢复站立，表情愤怒，双手握拳，似乎准备反击。",
    "14. The Million Dollar Cat_scene033.mp4": "汤姆猫从车窗探出头，做出各种表情和动作，随后爬到路灯杆上。",
    "14. The Million Dollar Cat_scene034.mp4": "一只穿着礼服的黑猫从灯柱上滑落，随后它从地上站起来，显得有些狼狈，接着它突然跃起，飞向空中，最后消失在画面中。",
    "14. The Million Dollar Cat_scene037.mp4": "视频开始于一个空旷的走廊，电梯门打开，一只穿着西装、戴着礼帽的猫从电梯里飞奔而出，撞上一扇门，摔倒在地。猫坐在地上，表情惊恐，随后站起，整理自己的帽子和西装，显得有些狼狈。它抬头看向前方，似乎在思考或等待什么，然后突然露出得意的笑容，帽子也从头上飞了出去。",
    "14. The Million Dollar Cat_scene038.mp4": "一只穿着西装的猫坐在桌子旁，桌上放着一个装饰精美的蛋糕。猫先是兴奋地盯着蛋糕，然后用舌头舔蛋糕，接着又用爪子抓蛋糕，最后用鼻子嗅蛋糕，表现出对蛋糕的渴望和享受。",
    "14. The Million Dollar Cat_scene039.mp4": "镜头从左向右平移，展示了一个装饰典雅的房间。房间内有一张长桌，桌上铺着白色桌布。房间墙壁为淡黄色，配有粉色窗帘和木质家具。天花板上悬挂着一盏华丽的吊灯，房间尽头有一扇白色双开门。",
    "14. The Million Dollar Cat_scene040.mp4": "一只小老鼠坐在桌子上的书堆上，它举起一只前爪，似乎在打招呼或示意。随后，它从书堆上跳下，爬过桌布，最终停在书堆旁。桌布在它爬行时被掀动，形成波浪状。桌面上还摆放着餐具，背景是窗帘和墙壁。",
    "14. The Million Dollar Cat_scene041.mp4": "镜头从床铺的被子开始，逐渐向上移动，展示了一个摆放着水果盘、台灯和茶具的木制柜子。",
    "14. The Million Dollar Cat_scene042.mp4": "汤姆猫坐在椅子上，面前的桌子上放着一个装饰精美的蛋糕。他用爪子轻轻触碰蛋糕，随后蛋糕被一块白色的布覆盖，汤姆猫露出惊讶的表情。布被揭开后，蛋糕被推到桌子的另一端，汤姆猫继续盯着蛋糕，显得非常期待。",
    "14. The Million Dollar Cat_scene043.mp4": "杰瑞偷吃蛋糕，被汤姆发现，汤姆用勺子打杰瑞，杰瑞用勺子反击汤姆，汤姆被击中后，杰瑞成功逃脱。",
    "14. The Million Dollar Cat_scene044.mp4": "一只灰色的猫穿着白色衬衫和红色领结，仰头看着空中的一颗草莓。一只棕色的小老鼠拿着叉子，叉着草莓，从猫的右侧飞过来，把草莓递到猫的嘴边。猫张大嘴巴，试图吃草莓，但草莓被老鼠拉远了。猫的表情从期待变为失望。",
    "14. The Million Dollar Cat_scene045.mp4": "汤姆猫穿着西装，坐在桌子旁，看着碗里的杰瑞老鼠。杰瑞手里拿着一个草莓，开心地吃着。汤姆猫生气地把碗扣在杰瑞头上，然后用力挤压碗，把杰瑞压扁了。汤姆猫得意地拍手，然后离开了。",
    "14. The Million Dollar Cat_scene046.mp4": "汤姆猫在房间里翻滚、撞到家具后，最终疲惫地爬上床，盖上被子，躺下休息。",
    "14. The Million Dollar Cat_scene047.mp4": "一只灰猫在床上醒来，伸了个懒腰，然后发现床边有一只戴着蓝色帽子的小老鼠。",
    "14. The Million Dollar Cat_scene048.mp4": "一只戴着蓝色睡帽的小猫在雪地上，它先是打了个哈欠，然后伸了个懒腰，接着用爪子抓了抓脸，最后被一只黑色的动物从背后抱住。",
    "14. The Million Dollar Cat_scene050.mp4": "一只灰色的猫站在房间里，手里拿着一条浅绿色的毛巾和一把粉色的梳子。它用梳子梳理自己的毛发，同时用毛巾包裹住身体，看起来正在整理仪容。背景是一扇白色的门和一些家具，包括床和柜子。",
    "14. The Million Dollar Cat_scene051.mp4": "汤姆猫正在刷牙，杰瑞鼠突然从门缝中探出头来，汤姆猫被吓了一跳，把牙刷和毛巾扔掉，然后用爪子抓住门把手，试图把杰瑞鼠关在门外。",
    "14. The Million Dollar Cat_scene052.mp4": "一个茶几上摆放着热茶、盖碗、柠檬片和黄油，蒸汽袅袅升起，背景是浅绿色沙发和窗帘。",
    "14. The Million Dollar Cat_scene053.mp4": "一只灰猫汤姆正试图打开一扇门，他先是用力拉门把手，然后露出得意的笑容，接着他开始思考如何进入房间，脑海中浮现出毒药、刀、绳索、炸弹和斧头等杀人工具的念头。最后，他成功地打开了门，露出得意的笑容，并迅速从门后跳了出去。",
    "14. The Million Dollar Cat_scene054.mp4": "汤姆猫穿着西装，从窗帘后探出头，然后迅速拉开窗帘，身体前倾，似乎在观察或准备行动。",
    "14. The Million Dollar Cat_scene055.mp4": "视频展示了一幅城市建筑的俯视图，画面中有多栋高楼大厦，建筑风格现代，窗户排列整齐，颜色以米色和白色为主。镜头从模糊逐渐变得清晰，呈现出建筑物的细节。画面左下角有一部分红色物体，可能是书页或画框边缘。整体氛围宁静，展现了城市建筑的宏伟与秩序。",
    "14. The Million Dollar Cat_scene056.mp4": "一只灰色的猫（汤姆）在室内，用爪子抓住门把手，试图打开一扇门。门上挂着一个写有“FIRE EXIT”的标志，猫成功将标志挂好后，门被打开，猫消失在门后。",
    "14. The Million Dollar Cat_scene057.mp4": "汤姆猫在房间里点燃了一堆纸，火势迅速蔓延，产生大量黑烟和火焰。汤姆猫惊慌失措，试图扑灭火焰，但无济于事。杰瑞鼠从柜子后面出现，被烟熏得咳嗽，随后跑开。汤姆猫继续惊慌地试图应对火灾。",
    "14. The Million Dollar Cat_scene058.mp4": "一只穿着绿色斗篷的老鼠从桌子下跑出来，冲向窗户，撞上窗户后，窗户玻璃碎裂，窗户上的“FIRE EXIT”标志被撞得歪斜。",
    "14. The Million Dollar Cat_scene059.mp4": "一只灰色的猫坐在粉色沙发上，张大嘴巴兴奋地欢呼，随后从沙发上跳起并向上跃起。",
    "14. The Million Dollar Cat_scene060.mp4": "一只穿着西装打着领结的猫从椅子上跳起，在房间里跳舞，然后跳到茶几上，茶几上有茶杯、黄油和盖着盖子的盘子。猫在茶几上跳舞，茶杯里的茶冒着热气，猫看起来很开心。",
    "14. The Million Dollar Cat_scene061.mp4": "汤姆猫穿着正式的礼服坐在餐桌前，面前摆放着盖着盖子的餐盘和茶杯。他好奇地揭开盖子，发现餐盘里有食物。这时，杰瑞鼠突然从餐巾后跳出来，手里拿着刀，对汤姆猫露出得意的笑容。汤姆猫惊讶地张大嘴巴，而杰瑞鼠则开心地大笑。",
    "14. The Million Dollar Cat_scene062.mp4": "一只老鼠坐在餐桌前，面前摆放着早餐。它先拿起刀叉吃煎蛋，接着吃培根，然后吃吐司，最后喝咖啡。在它吃早餐的过程中，它还读了一封电报，电报上写着“即使是老鼠也不行”。",
    "14. The Million Dollar Cat_scene063.mp4": "汤姆猫坐在沙发上，面前的桌子上放着茶杯、盘子和一个柠檬碗。杰瑞鼠在桌子旁，用爪子拨弄柠檬碗。突然，汤姆猫被柠檬汁喷到脸上，表情惊讶。杰瑞鼠则开心地大笑。",
    "14. The Million Dollar Cat_scene064.mp4": "一只老鼠在餐桌前兴奋地跳跃，桌上放着咖啡杯、柠檬片、黄油和刀，旁边有一张电报，上面写着“连老鼠都能做到”。老鼠突然被刀刺中，表情痛苦。",
    "14. The Million Dollar Cat_scene065.mp4": "一只戴着红色领结的黑猫坐在沙发上，脸上贴着一块黄色的布，表情显得有些无奈或疲惫。",
    "14. The Million Dollar Cat_scene066.mp4": "在餐厅里，汤姆猫突然出现，试图偷吃杰瑞老鼠面前的橙子。杰瑞迅速反应，用橙子砸向汤姆，汤姆被砸得后退，橙子滚落。杰瑞得意地站在原地，看着汤姆狼狈的样子。",
    "14. The Million Dollar Cat_scene067.mp4": "一只黑猫躺在沙发上，嘴里叼着一个卷纸。它先是眯着眼睛，露出满足的微笑，然后突然睁开眼睛，露出凶狠的表情。接着，它的脸逐渐变红，最后变成红色，看起来非常愤怒。背景中出现了烟雾，黑猫的表情在愤怒和冷静之间切换。",
    "14. The Million Dollar Cat_scene068.mp4": "一只戴着墨镜的老鼠站在餐桌旁，手里拿着一个杯子，旁边有一张电报，电报上写着“即使是一只老鼠”。背景中有一个切开的柠檬和一些餐具。老鼠看起来很得意，似乎在享受自己的时刻。",
    "14. The Million Dollar Cat_scene069.mp4": "汤姆猫坐在沙发上，面前的桌子上放着一杯茶和几个盘子。他看到桌上的电报，表情变得愤怒，挥舞着拳头，似乎对电报的内容感到非常不满。杰瑞老鼠站在电报旁边，看起来很得意。",
    "14. The Million Dollar Cat_scene070.mp4": "汤姆猫坐在沙发上，手里拿着一份电报，上面写着“EVEN A MOUSE”。他愤怒地撕碎电报，纸片四散飞舞。杰瑞鼠站在茶几上，看着汤姆的举动。汤姆最终把撕碎的纸片扔在盘子上，显得非常生气。",
    "14. The Million Dollar Cat_scene071.mp4": "在餐厅的桌旁，一只小老鼠杰瑞正在偷吃盘子里的奶酪。它把奶酪撕成碎片，然后用碎片拼出“EVEN A MOUSE”的字样。这时，猫汤姆突然出现，一把抓住杰瑞，用奶酪包裹住它，然后得意地笑着。杰瑞被奶酪裹住，显得非常狼狈。",
    "14. The Million Dollar Cat_scene072.mp4": "在客厅里，猫汤姆追逐老鼠杰瑞，杰瑞在桌子上吃东西，汤姆扑过去抓它，结果打翻了桌子上的盘子和杯子，然后汤姆又把桌子砸烂，最后汤姆坐在沙发上，看着被砸烂的桌子和躲在碎片中的杰瑞，显得非常沮丧。",
    "14. The Million Dollar Cat_scene073.mp4": "一只穿着西装打着领结的灰色猫坐在沙发上，一开始表情沮丧，似乎在抱怨失去了一百万，随后情绪转变，变得非常开心和兴奋，举起双臂欢呼。",
    "14. The Million Dollar Cat_scene074.mp4": "汤姆猫坐在沙发上，看到杰瑞鼠在茶几上，愤怒地拿起茶几上的书本砸向杰瑞，杰瑞在躲避中被书本击中，汤姆猫继续追击并用书本攻击杰瑞。",
    "14. The Million Dollar Cat_scene075.mp4": "一只黑猫手持木棍，正准备攻击一只在沙发上的小红猫。黑猫挥舞木棍，小红猫惊慌逃窜。随后画面变黑，出现“The End”字样。",
    "14. The Million Dollar Cat_scene076.mp4": "视频开始时显示红色背景上的白色文字“The End”，随后文字逐渐淡出，出现“An M·G·M Tom and Jerry CARTOON”字样，下方标注“MADE IN HOLLYWOOD, U.S.A.”，整个画面保持静态展示。",
    "14. The Million Dollar Cat_scene077.mp4": "视频开始时显示了“An MGM Tom and Jerry Cartoon”标题，背景为深红色，文字为白色并带有阴影效果。随后画面转为全黑，持续数秒。整个片段仅包含标题画面和黑屏，没有其他视觉内容或动作。"
}