{
    "S1950E24 - Push-Button Kitty_scene001.mp4": "画面从全黑开始，逐渐出现米高梅动画的标志，标志中央是一只咆哮的狮子，下方有“A Metro-Goldwyn-Mayer CARTOON”字样，以及“COLOR BY TECHNICOLOR”的文字。背景为深红色，整体风格复古。",
    "S1950E24 - Push-Button Kitty_scene002.mp4": "这是一个米高梅动画片头，背景为深红色，中央有一个蓝色边框的圆形图案，里面是一只咆哮的狮子。下方有白色文字“A Metro-Goldwyn-Mayer CARTOON”，以及蓝色文字“COLOR BY TECHNICOLOR”。狮子在圆形图案内不断张合嘴巴，表现出咆哮的动作。",
    "S1950E24 - Push-Button Kitty_scene003.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面。",
    "S1950E24 - Push-Button Kitty_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头，先是出现“TOM and JERRY”的标志，随后显示了该集的标题“Push-Button Kitty”以及导演William Hanna和Joseph Barbera的名字。接着，画面中出现了动画师、音乐制作人和制片人的名字，最后以制片人Fred Quimby的名字结束。整个片头背景为红色，文字以黄色和蓝色呈现，具有复古风格。",
    "S1950E24 - Push-Button Kitty_scene005.mp4": "一位穿着蓝色围裙的女仆正在扫地，她扫到一个躺在地上的猫，猫穿着红色披风，悠闲地躺着，女仆扫到猫的脚，猫抬起脚，女仆继续扫地。",
    "S1950E24 - Push-Button Kitty_scene007.mp4": "一个穿着蓝色裙子和白色围裙的女性角色，手持一把扫帚，正在室内清扫地面。她从画面左侧走向右侧，步伐稳健，扫帚随着她的移动轻轻摆动。背景是简单的室内环境，墙壁为蓝色，地板为绿色，旁边有门和窗户。",
    "S1950E24 - Push-Button Kitty_scene008.mp4": "一位穿着蓝色围裙的女性从门后探出头，然后拿出一个包裹，打开后发现里面是一个红色的机器人猫。她拿起一张纸，似乎在阅读说明书或操作指南。",
    "S1950E24 - Push-Button Kitty_scene009.mp4": "视频展示了一张宣传海报，海报上写着“MECHANO The CAT OF TOMORROW”，并列出了它的特点：“NO FEEDING, NO FUSSING, NO FUR”，以及“CLEAN · EFFICIENT · DEPENDABLE”。海报上方有一个红色机械猫的卡通形象，海报被两只手拿着。背景为橙色。",
    "S1950E24 - Push-Button Kitty_scene010.mp4": "一只蓝色的猫躺在红色的垫子上，眼睛半睁半闭，似乎在打盹。它偶尔会动一下耳朵和眼睛，但整体保持静止状态。背景是简单的室内场景，有墙壁和一个小洞。",
    "S1950E24 - Push-Button Kitty_scene011.mp4": "在一个室内场景中，一只蓝色的猫（汤姆）站在一个红色机器人猫旁边，显得非常兴奋和激动，它张开双臂，然后指向机器人猫，似乎在与它互动或展示它。背景中，一个穿着蓝色围裙的女性角色（可能是管家或家庭成员）站在一张桌子旁，桌上有一个绿色的设备。她似乎对汤姆的行为感到惊讶或困惑，她的手放在腰间，然后指向汤姆，可能是在责备或询问他。整个场景充满了卡通式的夸张表情和动作，显示出一种幽默和戏剧性的氛围。",
    "S1950E24 - Push-Button Kitty_scene012.mp4": "一只棕色的小老鼠站在绿色的地面上，靠近一个洞口。它先是兴奋地跳跃，然后用前爪捂住脸，接着又张开双臂，似乎在表达喜悦或惊讶。它的表情和动作充满活力。地面上有一个红色的物体，形状像一个倒置的梯形。",
    "S1950E24 - Push-Button Kitty_scene013.mp4": "在室内，汤姆猫站在一个红色机器人猫旁边，机器人猫有黄色的腿和轮子，看起来像玩具。汤姆猫举起一只手，面带微笑，似乎在向机器人猫打招呼或展示它。背景中，一个穿着蓝色衣服和白色围裙的女性角色站在一张桌子旁，桌子上放着一个绿色的盒子，她似乎正在操作或观察机器人猫。整个场景充满了卡通风格的幽默和轻松氛围。",
    "S1950E24 - Push-Button Kitty_scene015.mp4": "一个红色的机械猫玩具在地板上，尾巴末端有一个黄色的球。球突然变成红色并发出火花，随后机械猫向前冲去，消失在画面中。",
    "S1950E24 - Push-Button Kitty_scene016.mp4": "一只小老鼠站在墙边，一个红色机器人猫从墙后出现，用锤子击打老鼠，接着用吸尘器吸走老鼠，最后机器人猫转身离开。",
    "S1950E24 - Push-Button Kitty_scene017.mp4": "一个红色的机械猫从窗户内出现，它有黄色的腿和蓝色的脚垫。一只小老鼠从窗外出现，用一根长杆子试图用夹子夹住机械猫的尾巴，但夹子没有夹住，反而被机械猫的尾巴弹开。机械猫的尾巴末端有一个黄色的球。",
    "S1950E24 - Push-Button Kitty_scene019.mp4": "一只蓝色的猫背着一个红色的袋子，沿着一条小路走着，然后跑向远处的门，最后消失在门后。",
    "S1950E24 - Push-Button Kitty_scene020.mp4": "一个穿着蓝色围裙和白色围裙的女仆走进房间，站在一个红色的机器人猫旁边。机器人猫连接着一个绿色的电源装置，女仆似乎在检查或操作它。机器人猫的尾巴末端有一个黄色的球，随着女仆的动作，球在空中轻轻晃动。女仆转身离开，机器人猫保持静止状态。",
    "S1950E24 - Push-Button Kitty_scene021.mp4": "一个信封从邮箱中滑出，随后信封长出手臂，从邮箱中取出信封并站立在地面上。",
    "S1950E24 - Push-Button Kitty_scene022.mp4": "一个红色的机器人猫在地板上，它的尾巴末端突然发出火花，显示出某种能量或机械活动。",
    "S1950E24 - Push-Button Kitty_scene023.mp4": "视频中，一只小老鼠从信封后面探出头来，然后迅速跑开。一只穿着红色服装、装备着网球拍的机器人猫紧随其后，用网球拍试图捕捉小老鼠。小老鼠躲进窗户下的洞里，机器人猫用网球拍将小老鼠拍出洞外，小老鼠飞出窗外。",
    "S1950E24 - Push-Button Kitty_scene024.mp4": "一个红色的卡通猫拿着网球拍站在窗边，窗外是夜晚的景色。随后画面转黑，接着出现一只小老鼠从窗户爬出，窗外有绿色的水管和植物。",
    "S1950E24 - Push-Button Kitty_scene025.mp4": "一只小老鼠正沿着一根绿色的水管爬行，水管从窗户下方延伸出来。小老鼠小心翼翼地向前移动，似乎在探索或寻找什么。窗户内可以看到房间的一部分，包括一个沙发和地毯。窗外有蓝色和紫色的花朵，增添了场景的色彩。",
    "S1950E24 - Push-Button Kitty_scene026.mp4": "一根绿色的软管从画面左侧伸入，逐渐弯曲并插入墙角的一个圆形孔洞中。",
    "S1950E24 - Push-Button Kitty_scene027.mp4": "一只小老鼠站在绿色水管上，水管突然喷水，小老鼠被冲走，水管空留原地。",
    "S1950E24 - Push-Button Kitty_scene028.mp4": "一个红色的机器人猫从桌子后面出现，它手持一把斧头，斧头砍向一根绿色的管子，管子被砍断并喷出绿色的液体。",
    "S1950E24 - Push-Button Kitty_scene029.mp4": "一个绿色的管道被一个紫色的工具切断，管道破裂后，一只穿着绿色衣服的小老鼠从管道中滑出，躺在地板上。",
    "S1950E24 - Push-Button Kitty_scene030.mp4": "一个绿色的瓶子从门缝下滚出，瓶子里的小老鼠探出头来，接着被一只穿着紫色裤子的脚踩扁，瓶子破裂成两半。",
    "S1950E24 - Push-Button Kitty_scene031.mp4": "视频开始时展示了一扇绿色的门，门上有一个金色的门牌，门下地板上放着一双绿色的拖鞋。随后画面转为全黑，接着出现了一棵树的剪影，树上挂着一个红色的物体，背景是深蓝色的夜空。",
    "S1950E24 - Push-Button Kitty_scene032.mp4": "视频展示了一只老鼠在灯柱上用绳子拉扯一个红色的长条物体，背景是蓝天和白色栅栏。",
    "S1950E24 - Push-Button Kitty_scene033.mp4": "镜头从一棵树的红色吊床开始，逐渐推近，最终聚焦于一扇窗户内的房间。房间内有一张红色沙发和一个圆形木制桌子，墙壁为浅绿色，窗户边框为蓝色。整个画面呈现出卡通风格，色调柔和。",
    "S1950E24 - Push-Button Kitty_scene034.mp4": "一只棕色的小老鼠正攀附在一根红色的长条上，它用牙齿咬住一条白色的绳子，绳子缠绕在路灯杆上。小老鼠用力拉扯绳子，绳子被拉直后，小老鼠被甩了出去，最终从画面右侧飞出。路灯杆上装有一个灯泡，背景是蓝天。",
    "S1950E24 - Push-Button Kitty_scene035.mp4": "一个红色的小机器人从门口走进房间，它伸出一根绿色的长管，将一只老鼠吸入管中并弹射出去。老鼠被弹射后消失在画面中，机器人则继续留在原地。",
    "S1950E24 - Push-Button Kitty_scene036.mp4": "视频开始时，一个红色的机械猫出现在窗户内，它装备着绿色的炮管。随后，一只老鼠出现，将机械猫的炮管点燃，机械猫发射出一道黄色的光束。接着，画面切换到一个房间内，一只棕色的老鼠正在一个标有“SQUEEKY WIND HIM AND HE GOES”的纸箱上，它从纸箱中拉出一只蓝色的老鼠，然后又拉出一只黄色的老鼠。",
    "S1950E24 - Push-Button Kitty_scene037.mp4": "视频展示了一只机械猫在追逐老鼠的场景。一开始，几只不同颜色的老鼠在地板上快速跑动。随后，一只红色的机械猫从右侧进入画面，它装备有武器，包括一个喷射装置和一把旋转的刀。机械猫开始追逐老鼠，喷射装置喷出烟雾，同时旋转的刀也旋转起来。机械猫继续追赶，最终用斧头攻击老鼠，但老鼠成功逃脱。整个场景充满动感和幽默感。",
    "S1950E24 - Push-Button Kitty_scene038.mp4": "一个红色的机械猫玩具在房间里，它被一个蓝色的小老鼠吸引，然后迅速追击老鼠，最终爆炸成一团火焰和烟雾。",
    "S1950E24 - Push-Button Kitty_scene039.mp4": "四只彩色小老鼠悄悄溜进房间，沿着钢琴边缘爬行。突然，一只红色机器人猫出现，挥舞着锤子砸向钢琴，将钢琴砸得粉碎。机器人猫随后转身，从背部的炮口喷射出火焰，将房间里的家具烧毁。",
    "S1950E24 - Push-Button Kitty_scene040.mp4": "一只黄色小老鼠在木制架子上从左向右移动，它经过的盘子和器皿相继破碎，碎片四溅，小老鼠继续向前，最终消失在画面右侧。",
    "S1950E24 - Push-Button Kitty_scene041.mp4": "一个黄色小鸭玩具在红色桌子上滚动，随后一个红色机器人从桌子下钻出，用吸尘器吸走小鸭，接着桌子开始变形并最终断裂成两半。",
    "S1950E24 - Push-Button Kitty_scene042.mp4": "一只紫色的小老鼠在地面上行走，随后一只红色的机械猫从右侧出现，追逐小老鼠。机械猫在追逐过程中翻转身体，最终撞到一扇门，门后出现了一捆正在燃烧的炸药，炸药的引线点燃并爆炸，火花四溅。",
    "S1950E24 - Push-Button Kitty_scene043.mp4": "一个紫色的老鼠从墙角的洞里钻出来，然后被一个红色的炸弹炸飞。",
    "S1950E24 - Push-Button Kitty_scene044.mp4": "画面开始时是一个爆炸效果，随后烟雾散去，露出一个房间的内部场景。房间的墙壁和地板有明显的破损，地板上散落着蓝色的碎片，墙壁上有裂痕，整体场景显得凌乱和破坏严重。",
    "S1950E24 - Push-Button Kitty_scene045.mp4": "一个穿着蓝色围裙的女仆在房间里，地上散落着玻璃碎片。她惊慌失措地四处张望，似乎在寻找什么。突然，一只老鼠从墙洞中钻出，女仆吓得后退。接着，一个红色的机器人从墙洞中爬出，女仆更加惊恐。机器人四处走动，女仆则紧张地站在原地，不敢动弹。机器人似乎在寻找什么，最终它离开，女仆松了一口气。",
    "S1950E24 - Push-Button Kitty_scene046.mp4": "一只黑色的猫从白色栅栏后探出头来，然后迅速翻越栅栏，消失在画面中。",
    "S1950E24 - Push-Button Kitty_scene047.mp4": "汤姆猫从窗外跳进房间，落地后兴奋地在地毯上奔跑，随后停下，警觉地四处张望。",
    "S1950E24 - Push-Button Kitty_scene048.mp4": "一个穿着蓝色衣服和白色围裙的女仆从房间里跑出来，一只黄色小老鼠在她脚边。女仆跑出房间后，一只红色的猫从门后冲出来，撞到了门上，门被撞碎，猫也摔倒在地。小老鼠跑过来，猫试图追它，但猫被门碎片挡住，最终摔倒在地。",
    "S1950E24 - Push-Button Kitty_scene049.mp4": "一只蓝色的老鼠在房间里跑动，突然一个红色的机器人从柜子后面出现，它由各种零件组成，看起来非常笨拙。机器人开始在地板上移动，但它的零件不断脱落，最终它爆炸了，碎片四散。随后，一只黄色的老鼠出现，机器人重新组装并开始移动，但很快又爆炸了，碎片再次四散。最后，机器人完全崩溃，只剩下一些零件散落在地上。",
    "S1950E24 - Push-Button Kitty_scene050.mp4": "一个红色的机器人玩具在房间里，它的两个手臂正在冒火花。一只黄色的小老鼠在它旁边。机器人突然爆炸，零件四散飞溅，最后散落在地上。",
    "S1950E24 - Push-Button Kitty_scene051.mp4": "一个红色的小火箭从灯罩上发射出去，在空中飞行并留下红色尾迹，同时伴有火花和电弧。",
    "S1950E24 - Push-Button Kitty_scene052.mp4": "动画片中，汤姆猫在客厅里被静电击中后，身体被拉长并摔倒在地。随后，一位穿着蓝色围裙的女仆走进来，与汤姆猫握手并和他跳舞，汤姆猫显得非常开心。",
    "S1950E24 - Push-Button Kitty_scene053.mp4": "一只老鼠站在一个标有“REMOTE CONTROL”的绿色遥控器上，用爪子转动旋钮。旋钮从“OFF”位置转动到“ON”位置时，遥控器发出火花。",
    "S1950E24 - Push-Button Kitty_scene054.mp4": "一只蓝猫被一个穿着围裙的女人抓住尾巴，猫试图挣脱，但失败了。猫的尾巴上绑着一个点燃的烟花，烟花在猫的尾巴上燃烧，猫被吓了一跳。女人松开猫，猫迅速跑开，但烟花在猫的尾巴上继续燃烧。猫试图用爪子扑灭烟花，但没有成功。猫最终被烟花的爆炸声吓到，跑出了画面。",
    "S1950E24 - Push-Button Kitty_scene055.mp4": "一位穿着蓝色围裙的女仆在房间里打扫，她用扫帚扫地，然后用拖把拖地，最后用抹布擦拭地面。",
    "S1950E24 - Push-Button Kitty_scene056.mp4": "一位穿着蓝色围裙的女仆在房间里走动，她不小心撞倒了椅子、桌子和花瓶，还踩到了一只老鼠。她继续走动，又撞倒了其他物品，包括一个装有液体的瓶子和一个盒子。最后，她再次撞倒了一个瓶子，液体洒了出来。",
    "S1950E24 - Push-Button Kitty_scene057.mp4": "一只蓝色的猫在房间里追逐一只黄色的小老鼠，过程中撞倒了多个家具，包括沙发、桌子和台灯，最后猫被撞飞，画面转黑，显示“The End”。",
    "S1950E24 - Push-Button Kitty_scene058.mp4": "视频显示了“THE END”字样，随后出现“An MGM Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色。"
}