{
    "S1950E59 - Tops With Pops_scene001.mp4": "视频展示了米高梅卡通的标志，背景为深蓝色，标志中央是狮子头像，上方有“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样。",
    "S1950E59 - Tops With Pops_scene002.mp4": "视频展示了米高梅动画公司的标志，狮子咆哮，随后画面转黑，接着出现《猫和老鼠》的标题画面，左侧是猫汤姆，右侧是老鼠杰瑞。",
    "S1950E59 - Tops With Pops_scene003.mp4": "视频展示了《猫和老鼠》的标题画面，左侧是猫汤姆的图像，中间是“TOM and JERRY”的标题，右侧是老鼠杰瑞的图像。背景为蓝色，随后画面出现彩色几何图案和“IN CINEMASCOPE”字样。",
    "S1950E59 - Tops With Pops_scene004.mp4": "这是一个动画片的片头，背景由多个彩色菱形组成，主要角色是一只大狗和一只小狗，大狗举着小狗，旁边有“TOPS with POPS”的字样。画面下方有“IN CINEMASCOPE”的标识，随后出现制作人员名单和版权信息。",
    "S1950E59 - Tops With Pops_scene005.mp4": "这是一个动画片的片尾字幕，展示了制作团队的名单，包括动画师、布局师、背景画家和音乐师等，最后是制片人和导演的名字：William Hanna 和 Joseph Barbera。背景是彩色的菱形图案。",
    "S1950E59 - Tops With Pops_scene006.mp4": "视频开始时，画面展示了由威廉·汉纳和约瑟夫·巴伯拉制作和导演的标题。随后，场景切换到一个夜晚的户外，一只名为“SPIKE”的斗牛犬正躺在绿色狗屋前，狗屋上挂着“SPIKE”的牌子。它戴着红色项圈，项圈上有黄色的装饰物，旁边有一个装着大骨头的蓝色碗。斗牛犬看起来很放松，眼睛半闭，嘴巴微张，似乎在打盹。随着镜头慢慢向右移动，可以看到另一只名为“TYKE”的斗牛犬在远处的白色狗屋前，狗屋上挂着“TYKE”的牌子。TYKE也戴着红色项圈，项圈上有黄色的装饰物，旁边有一个装着食物的碗。TYKE同样在打盹，看起来很安详。整个场景宁静而温馨，两只狗都在享受夜晚的宁静。",
    "S1950E59 - Tops With Pops_scene007.mp4": "一只棕色的斗牛犬躺在草地上，戴着红色项圈，闭着眼睛，嘴巴张开，似乎在打呼噜或睡觉。它的狗屋在背景中，上面写着“TYKE”，旁边有一个粉色的碗，里面放着一个骨头。周围有一些植物和花朵。",
    "S1950E59 - Tops With Pops_scene008.mp4": "一只名叫Spike的斗牛犬从狗屋中醒来，表情从困倦变为兴奋。它看到旁边狗屋里的另一只小狗Tyke，便兴奋地跑过去，用爪子轻轻拍打Tyke，似乎在和它玩耍或打招呼。背景是户外的草地和狗屋，氛围轻松愉快。",
    "S1950E59 - Tops With Pops_scene009.mp4": "一只成年狗抱着一只小狗，温柔地与它互动。成年狗用奶瓶喂小狗喝奶，小狗喝得非常开心，奶水从它的嘴角流出来。成年狗看着小狗，脸上露出幸福的笑容。",
    "S1950E59 - Tops With Pops_scene010.mp4": "一只大狗Spike和一只小狗Tyke在各自的狗屋前互动。Spike先是抱着Tyke，然后放下它，接着Spike躺下，Tyke也躺下，两者都显得很放松和开心。背景中有绿色的草地、狗屋和一些植物。",
    "S1950E59 - Tops With Pops_scene011.mp4": "一只小老鼠从门后跑出，穿过花园，然后消失在画面中。紧接着，一只猫从门后冲出来，撞在门上，门上留下了一个猫的影子。猫摔倒在地，随后迅速爬起，继续追赶小老鼠。",
    "S1950E59 - Tops With Pops_scene012.mp4": "一只老鼠杰瑞在院子里奔跑，不小心撞到了铲子和耙子，被弹飞到墙边。随后，猫汤姆从墙后跳出来，追赶杰瑞。汤姆试图用铲子和耙子抓住杰瑞，但被工具绊倒，最后被铲子夹住。",
    "S1950E59 - Tops With Pops_scene014.mp4": "一只棕色的斗牛犬用嘴咬住一只灰色猫的胡须，猫张开嘴巴，看起来很痛苦。斗牛犬不断张嘴咬合，猫的胡须被拉扯，猫的表情痛苦。背景是蓝色的。",
    "S1950E59 - Tops With Pops_scene015.mp4": "一只大狗抱着一只小狗，用狗绳拉扯着汤姆猫，汤姆猫被拉得飞出去，大狗松开绳子后低头看着小狗。",
    "S1950E59 - Tops With Pops_scene016.mp4": "汤姆猫在户外奔跑，途中撞到树、飞盘、电线杆，最后被扔进垃圾桶，最后从垃圾桶里探出头来。",
    "S1950E59 - Tops With Pops_scene017.mp4": "画面中，一只名为Spike的棕色斗牛犬躺在绿色狗屋前，表情满足而放松，旁边是一只名叫Tyke的小狗，同样躺在红色狗屋前。两只狗都显得非常安详，背景是充满卡通风格的花园，有花草和树木。随着镜头缓慢向右移动，可以看到更多的花园景色，包括盛开的花朵和植物。两只狗在画面中保持静止，没有明显的动作变化，整体氛围宁静而温馨。",
    "S1950E59 - Tops With Pops_scene018.mp4": "一只棕色的小狗在草地上睡觉，一只棕色的小老鼠从狗的背上跳下来，然后跑向远处的花丛。小狗一直睡着，没有醒来。小老鼠在花丛前停下，张开双臂，然后跳了起来，又落回地上，继续向前跑。最后，小老鼠跑出了画面。",
    "S1950E59 - Tops With Pops_scene019.mp4": "视频中，一只棕色的斗牛犬Spike躺在狗窝前的草地上，戴着红色项圈，眼睛半闭，显得非常放松。一只小老鼠从画面左侧跑过，引起Spike的注意，它睁开眼睛，露出红色的眼睛，显得有些警觉。随后，一只灰色的猫Tom从画面左侧跳出来，站在Spike面前，看起来很紧张，双手捂着脸。Spike则继续躺着，张大嘴巴，似乎在打哈欠或者发出声音。Tom慢慢靠近Spike，伸出爪子，似乎想和Spike互动，Spike则张大嘴巴，露出牙齿，似乎在回应Tom。Tom继续靠近，最终将爪子伸进Spike的嘴里，Spike则张大嘴巴，似乎在配合Tom的动作。整个场景发生在户外的草地上，背景是棕色的墙壁和蓝色的狗窝，狗窝上写着“SPIKE”。",
    "S1950E59 - Tops With Pops_scene020.mp4": "一只棕色的斗牛犬张大嘴巴，露出锋利的牙齿，嘴里有一把灰色的锯子。一只棕色的小老鼠从狗的嘴里爬出来，它试图躲避锯子，但被狗的牙齿夹住。狗咬紧牙齿，锯子在狗的嘴里来回移动，老鼠被夹在狗的牙齿之间，显得非常惊恐。",
    "S1950E59 - Tops With Pops_scene021.mp4": "汤姆和一只斗牛犬在草地上对峙，汤姆被斗牛犬咬住尾巴，随后汤姆用牙齿咬住斗牛犬的牙齿，斗牛犬松开汤姆。汤姆得意地举起斗牛犬的牙齿，然后将牙齿放在一个桶上，最后汤姆和斗牛犬都睡着了。",
    "S1950E59 - Tops With Pops_scene022.mp4": "画面中，两只狗在草地上安静地躺着，似乎在休息或睡觉。一只小老鼠从右侧跑入画面，它看起来非常活泼，兴奋地在狗的身边跳跃和玩耍。小老鼠先是靠近较大的狗，然后又转向较小的狗，似乎在与它们互动。背景中可以看到两个狗屋，其中一个狗屋上写着“TYK”。整个场景充满了轻松和欢乐的氛围。",
    "S1950E59 - Tops With Pops_scene023.mp4": "视频展示了一个动画场景，其中有一只猫（汤姆）从狗屋的树后探出头来，观察着前方。狗屋上写着“TYKE”，旁边还有一只狗在睡觉。随后，一只小老鼠（杰瑞）从狗屋前跑过，猫伸出爪子试图抓住它，但小老鼠灵活地躲避了。猫最终没有成功抓住小老鼠，小老鼠继续向前跑。整个场景充满了卡通风格的幽默和紧张感。",
    "S1950E59 - Tops With Pops_scene024.mp4": "汤姆猫在草地上奔跑，手里抓着一只棕色的小老鼠。他跑过几棵树和灌木丛，最后停在一个有花的草丛旁，把老鼠放下。汤姆猫看起来很得意，但随后他突然变得惊讶和困惑，似乎对老鼠的反应感到意外。",
    "S1950E59 - Tops With Pops_scene025.mp4": "一只戴着红色项圈的棕色斗牛犬躺在绿色草地上，眼睛半睁，显得很疲倦或困倦。它的前爪微微抬起，身体放松，背景是一个带有红色门的狗屋。",
    "S1950E59 - Tops With Pops_scene026.mp4": "汤姆猫在草地上愤怒地挥舞着爪子，随后迅速跑开，消失在画面中。旁边有一只棕色的小动物蹲在草丛旁。",
    "S1950E59 - Tops With Pops_scene027.mp4": "一只棕色的斗牛犬戴着红色项圈，躺在草地上，旁边是一只灰色的猫汤姆。斗牛犬先是闭着眼睛，然后睁开眼睛，用爪子轻轻抚摸汤姆的头，接着用嘴亲吻汤姆的脸，最后闭上眼睛，看起来非常开心和满足。汤姆则一直闭着眼睛，似乎在享受斗牛犬的爱抚。背景中可以看到一个狗屋。",
    "S1950E59 - Tops With Pops_scene028.mp4": "一只老鼠从狗窝里探出头，看到躺在地上的猫，它高兴地跑出来，踩着猫的尾巴，然后跳到狗窝的屋顶上。",
    "S1950E59 - Tops With Pops_scene029.mp4": "视频中，一只棕色的狗（Spike）和一只灰色的猫（Tom）在户外。起初，狗和猫躺在草地上，狗的头靠在猫身上。随后，狗突然起身，将猫抱在怀里，猫显得惊讶。狗抱着猫，表情从惊讶转为开心，接着又变得严肃。在狗抱着猫的过程中，一只小幼犬从画面下方出现，走向狗和猫。背景中有一个狗屋，上面写着“SPIKE”，旁边有一盆骨头。整个场景色彩鲜艳，充满卡通风格。",
    "S1950E59 - Tops With Pops_scene030.mp4": "一只戴着红色项圈的小狗在草地上，它先是低头看着地面，然后抬头四处张望。背景是绿色的草地和红色的天空，草地上有几朵小白花。",
    "S1950E59 - Tops With Pops_scene031.mp4": "一只棕色的狗用双臂紧紧抱住一只灰色的猫，猫的表情从惊讶逐渐变为微笑，狗则一直注视着猫，背景是蓝色的。",
    "S1950E59 - Tops With Pops_scene032.mp4": "一只戴着红色项圈的小狗在草地上，先是皱眉，然后张嘴发出声音，接着又恢复原状。",
    "S1950E59 - Tops With Pops_scene033.mp4": "一只棕色的狗紧紧抱住一只灰色的猫，猫张开嘴巴似乎在说话，狗的表情从惊讶变为愤怒，随后又恢复平静。背景是蓝色的。",
    "S1950E59 - Tops With Pops_scene034.mp4": "一只戴着红色项圈的小狗在草地上，表情从好奇变为愤怒，张开嘴巴露出牙齿，似乎在咆哮或威胁。背景是绿色草地和红色天空，点缀着几朵小花。",
    "S1950E59 - Tops With Pops_scene035.mp4": "一只棕色的狗紧紧抓住一只灰色的猫，两者互相瞪视并发出威胁的叫声。随后，狗和猫突然同时大叫，画面中出现闪电效果，狗被击退，猫则被弹飞出去。",
    "S1950E59 - Tops With Pops_scene036.mp4": "视频中，汤姆猫在院子里看到一把耙子，他试图用它来对付某人，但被一个突然出现的狗吓了一跳。汤姆猫惊慌失措地逃跑，然后又捡起耙子，试图用它来攻击，结果被耙子绊倒，最终躺在地上不动了。整个过程充满了滑稽和夸张的动作。",
    "S1950E59 - Tops With Pops_scene037.mp4": "一只灰色的猫躺在草地上，脚边有一把红色的耙子。随后画面变暗，接着出现一块肉挂在绳子上。",
    "S1950E59 - Tops With Pops_scene038.mp4": "一块肉挂在晾衣绳上，背景是蓝色的水面。肉块呈红色，边缘有黄色脂肪，表面有两个圆形的白色斑点。晾衣绳上有两个固定点，肉块在绳子上轻微晃动。",
    "S1950E59 - Tops With Pops_scene039.mp4": "汤姆猫正用双手紧握一根绳子，身体悬挂在空中，舌头伸出，表情显得非常兴奋和专注。背景是蓝天和黄色的墙壁。",
    "S1950E59 - Tops With Pops_scene040.mp4": "一只棕色的斗牛犬坐在草地上，手里拿着一根蓝色的棍子，眼睛盯着上方悬挂的一块肉。它先是舔了舔鼻子，然后站起身，伸长脖子，试图够到那块肉。背景中可以看到一个写着“TYKE”的狗屋和一棵树。",
    "S1950E59 - Tops With Pops_scene041.mp4": "汤姆猫站在一个蓝色的物体上，双手紧握一根横跨画面的绳子，表情兴奋，眼睛闪烁着绿色的光芒，嘴巴张开露出牙齿，似乎在用力拉扯绳子。背景是蓝天和黄色的墙壁。",
    "S1950E59 - Tops With Pops_scene042.mp4": "一只小老鼠杰瑞用绳子绑住了一只正在睡觉的大狗泰克，然后得意地站在狗身上。",
    "S1950E59 - Tops With Pops_scene043.mp4": "一只棕色的狗戴着红色项圈，正专注地盯着悬挂在空中的肉块，眼睛紧闭，似乎在享受着肉的香气。在狗的前方，一只棕色的小老鼠正在草地上快速奔跑，它看起来非常兴奋和开心，似乎在追逐着什么或者在玩耍。背景是绿色的草地和棕色的泥土，远处有一些植物和花朵。整个画面充满了欢乐和活力。",
    "S1950E59 - Tops With Pops_scene044.mp4": "一只小老鼠被一只大猫的尾巴拖拽着，它奋力抓住一根蓝色的水管，最终爬到了水管的顶部。",
    "S1950E59 - Tops With Pops_scene045.mp4": "一只小老鼠在草地上奔跑，试图躲避一只大型动物的脚。小老鼠从大型动物的脚边跑过，继续向前奔跑，最终跑到了灌木丛后面。",
    "S1950E59 - Tops With Pops_scene046.mp4": "一只棕色的小老鼠站在一只大狗的鼻子上，大狗闭着眼睛，似乎在睡觉。小老鼠抓住大狗的耳朵，试图把大狗拉起来，但大狗没有反应。小老鼠在大狗的鼻子上跳来跳去，最后从大狗的鼻子上跳了下来。背景是一块红色的肉，挂在一根白色的绳子上。",
    "S1950E59 - Tops With Pops_scene047.mp4": "一只棕色的小老鼠站在一只大狗的鼻子上，它用爪子抓着狗的耳朵，然后用力拉扯，狗的眼睛睁得很大，最后小老鼠被甩飞了出去。",
    "S1950E59 - Tops With Pops_scene048.mp4": "一只老鼠在绿色的地面上奔跑，躲避一只大脚的踩踏。大脚从画面左侧出现，老鼠在脚边惊慌地跳跃和奔跑，最终被踩扁在地上。随后，老鼠从被踩扁的状态中弹起，继续奔跑。",
    "S1950E59 - Tops With Pops_scene049.mp4": "汤姆猫站在蓝色桶上，用绳子吊着一块肉，引诱小狗靠近。小狗兴奋地扑向肉块，汤姆趁机将肉拉高，小狗被吊起后挣扎着试图够到肉。最终，汤姆松开绳子，小狗摔进狗屋，汤姆则得意地大笑，狗屋门突然打开，喷出大量白色泡沫，汤姆被泡沫包围，继续大笑。",
    "S1950E59 - Tops With Pops_scene050.mp4": "一只棕色的小老鼠在绿色草地上奔跑，背景有紫色树干和白色小花。突然，一只灰色的猫从画面右侧快速冲出，追逐小老鼠，留下一道模糊的轨迹。小老鼠被追得飞起，最后消失在画面中，猫也消失在画面右侧。",
    "S1950E59 - Tops With Pops_scene051.mp4": "一只棕色的小老鼠在草地上奔跑，突然钻进一个紫色的桶里。一只灰色的猫汤姆追了过来，他先是用爪子试图抓住桶，然后爬上桶，拿起一把铲子，开始用铲子挖掘，似乎在寻找老鼠。",
    "S1950E59 - Tops With Pops_scene052.mp4": "一只老鼠从紫色的帐篷里探出头，然后迅速跑出来。一只大狗突然出现，追逐老鼠。老鼠拼命逃跑，狗紧追不舍，最终老鼠躲进帐篷里，狗也跟着进去。老鼠再次跑出来，狗再次追击，老鼠在帐篷外跑动，狗在后面追赶。",
    "S1950E59 - Tops With Pops_scene053.mp4": "一个棕色的斗牛犬从木屋中冲出，周围弥漫着白色烟雾。它在木板路上奔跑，随后跳起并消失在画面中，留下空荡的院子。",
    "S1950E59 - Tops With Pops_scene054.mp4": "汤姆猫站在一个紫色的桶上，手里拿着一把铲子，看起来很生气。一只棕色的狗突然出现，试图抢走汤姆手中的铲子。汤姆猫与狗对峙，狗大声咆哮，汤姆猫则显得有些害怕。随后，汤姆猫试图爬上桶，但狗仍然紧盯着他。最后，镜头转向围栏，杰瑞老鼠出现在围栏上，似乎在观察这一幕。",
    "S1950E59 - Tops With Pops_scene055.mp4": "一只灰色的猫汤姆和一只棕色的斗牛犬在户外对峙，汤姆试图用一个紫色的桶来对付斗牛犬，但斗牛犬抢走了桶，汤姆被激怒并逃跑，斗牛犬则抱着桶站在原地。",
    "S1950E59 - Tops With Pops_scene056.mp4": "汤姆猫在户外奔跑，撞上树干后被弹开，接着被一个飞盘击中，又撞上电线杆。随后，他遇到一只狗，被狗追打并击退。最后，汤姆猫被击飞，画面中出现烟雾，最终他出现在一个木桶里，手持球棒，准备反击。",
    "S1950E59 - Tops With Pops_scene057.mp4": "夜晚，汤姆猫穿着红色衣服，抱着一个木桶，手里拿着一根棒球棒，站在院子里。他先是警惕地环顾四周，然后转身跑开。镜头切换到院子里，一只名叫Tyke的斗牛犬和一只小狗正躺在狗窝前的毯子上睡觉。",
    "S1950E59 - Tops With Pops_scene058.mp4": "视频中，两只狗正在睡觉，一只小老鼠悄悄地靠近，把一个“请勿打扰”的牌子放在它们的鼻子上，然后自己也躺下睡着了。最后画面变黑，出现“THE END”的字样。",
    "S1950E59 - Tops With Pops_scene059.mp4": "画面展示了三个彩色矩形框，左侧框内是灰色猫汤姆，中间框内写着“THE END”，右侧框内是棕色老鼠杰瑞。随后，画面中间出现“ANIMATION CARTOON”字样，右侧框内出现“made in hollywood U.S.A.”字样。",
    "S1950E59 - Tops With Pops_scene060.mp4": "这是一个M·G·M动画片的片尾画面，背景为蓝色，中央有黄色横幅写着“M·G·M CARTOON”，左上角粉色方块内有“an”，右下角绿色方块内有“made in hollywood, U·S·A.”。画面中还出现了卡通猫和老鼠的形象。"
}