{
    "E66.Smitten.Kitten_scene001.mp4": "画面从全黑开始，随后出现米高梅卡通的标志，标志中央是一只咆哮的狮子，下方有“A Metro-Goldwyn-Mayer CARTOON COLOR BY Technicolor”的字样。",
    "E66.Smitten.Kitten_scene002.mp4": "这是一个米高梅动画片的开场标志，画面中央是一个咆哮的狮子头像，周围环绕着红色装饰图案。下方有文字“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY Technicolor”，背景为红色纹理。狮子在画面中不断张合嘴巴，做出咆哮的动作。",
    "E66.Smitten.Kitten_scene003.mp4": "视频展示了米高梅动画片《猫和老鼠》的片头，首先出现的是米高梅的标志，接着是《猫和老鼠》的标题，最后是主角汤姆和杰瑞的卡通形象。",
    "E66.Smitten.Kitten_scene005.mp4": "一只小老鼠拿着一把大剪刀在房屋外的走廊上奔跑，被猫汤姆从后面追上并抓住。汤姆用剪刀夹住老鼠，将老鼠悬在空中，然后得意地展示自己的胜利。",
    "E66.Smitten.Kitten_scene006.mp4": "一只老鼠坐在户外的红色躺椅上，穿着蓝色上衣和白色短裤，正在专心阅读一本黄色封面的书。背景是一栋黄色的房子，配有白色栅栏和绿色草坪，周围有树木和灌木丛，环境宁静祥和。",
    "E66.Smitten.Kitten_scene007.mp4": "汤姆猫手持剪刀，试图剪断杰瑞鼠的尾巴，但杰瑞鼠迅速逃跑。汤姆猫追赶杰瑞鼠，最终抓住一根柱子，悬挂在空中，表情从兴奋变为惊讶。",
    "E66.Smitten.Kitten_scene008.mp4": "一只穿着蓝色上衣和白色短裙的灰色猫坐在红色躺椅上，正在阅读一本黄色封面的书。她先是专注地看着书，随后露出微笑，将书抱在胸前，继续享受阅读时光。背景是一面黄色的墙壁和绿色的植物，环境宁静舒适。",
    "E66.Smitten.Kitten_scene009.mp4": "汤姆猫紧紧抓住一根柱子，舌头伸出来，表情紧张。随后他用力一扭，身体翻转，最终从柱子上滑落消失。",
    "E66.Smitten.Kitten_scene010.mp4": "在户外的花园里，一只穿着蓝色上衣和白色短裤的灰色猫正躺在红色躺椅上阅读黄色书籍。突然，一只黑色的猫从右侧跳入画面，它张大嘴巴，舌头伸出，似乎在对灰猫说话或表达某种情绪。灰猫先是惊讶地抬头，随后露出微笑，继续阅读书籍。背景是黄色的房屋和绿色的草坪，环境宁静。",
    "E66.Smitten.Kitten_scene012.mp4": "动画片段中，一只棕色猫和一只绿色小猫在红色砖墙上对峙，周围有向日葵。随后画面转至夜晚，一只戴着红色墨镜、穿着黄色泳衣的猫躺在沙滩上，旁边有遮阳伞和热狗，一只穿着红色衣服的猫从左侧跑过。",
    "E66.Smitten.Kitten_scene013.mp4": "在沙滩上，一只穿着黄色泳衣、戴着红色太阳镜的白猫正悠闲地躺着看书，旁边放着热狗和饮料。一只穿着红色泳衣的灰猫从伞后跳出来，试图偷袭白猫，但白猫迅速戴上太阳镜，轻松地躲开了。随后，镜头转向一个绿色的垃圾桶，上面写着“TRASH”，随着风车转动，垃圾桶突然打开，里面滚出一堆垃圾，灰猫从垃圾堆中爬出来，显得非常狼狈。",
    "E66.Smitten.Kitten_scene014.mp4": "在沙滩上，一只穿着黄色泳衣的白猫坐在红色遮阳伞下，手里拿着热狗和饮料。一只穿着红色泳衣的灰猫从沙子里爬出来，躺在她旁边，手里拿着一个柠檬。灰猫把柠檬挤进饮料里，白猫看着他，然后喝了一口饮料，表情变得不悦。灰猫随后把柠檬扔了。",
    "E66.Smitten.Kitten_scene015.mp4": "在沙滩上，一只穿着黄色泳衣的白猫坐着，手里拿着热狗，另一只穿着红色衣服的灰猫躺在她旁边，用吸管喝饮料。灰猫喝饮料时突然喷出，白猫惊讶地看着他，随后灰猫伸手拿过热狗并开始吃。",
    "E66.Smitten.Kitten_scene016.mp4": "一只穿着红色衣服的猫正开心地吃着一个热狗，热狗由一只手拿着，背景是蓝天白云。",
    "E66.Smitten.Kitten_scene017.mp4": "在沙滩上，一只穿着黄色泳衣的白猫和一只穿着红色泳衣的灰猫在遮阳伞下。白猫拿着面包，灰猫先是躺在地上，然后被白猫压住。白猫用面包砸灰猫，灰猫脸上出现红色的痕迹。接着，灰猫头上长出香蕉，白猫继续用面包砸他。灰猫生气地站起来，拿着铲子冲向一个野餐篮，试图把里面的东西挖出来。",
    "E66.Smitten.Kitten_scene018.mp4": "一只小老鼠在厨房里偷吃奶酪，它先是用爪子抓起一块奶酪，然后又拿起一个鸡蛋，看起来非常开心。",
    "E66.Smitten.Kitten_scene019.mp4": "汤姆穿着红色运动衫，手持黄色锤子，用力砸向一个木制物体，结果锤子反弹，他被砸得眼冒金星，表情痛苦。随后，他恢复清醒，发现杰瑞正用一根大葱缠住他的鼻子，杰瑞在大葱上开心地笑着，而汤姆则显得非常惊讶和无奈。",
    "E66.Smitten.Kitten_scene020.mp4": "在沙滩上，一只小老鼠杰瑞从空中跳入一个装满饮料的玻璃瓶中，稳稳地站在瓶口。他先是得意地转圈，然后开始做各种滑稽的动作。这时，穿着红色运动服的猫汤姆突然从右侧冲出，愤怒地扑向杰瑞，试图抓住他。",
    "E66.Smitten.Kitten_scene021.mp4": "汤姆穿着红色运动衫，手里拿着一个装有杰瑞的瓶子。他先是看着杰瑞，然后举起瓶子，倒出瓶中的液体，液体喷洒出来，杰瑞在瓶子里挣扎。汤姆露出得意的笑容，继续摇晃瓶子，杰瑞在瓶子里翻滚。",
    "E66.Smitten.Kitten_scene022.mp4": "一只老鼠被困在一个装有气泡液体的玻璃瓶中，被一只手握着。老鼠在瓶内挣扎，随后瓶子被倒置，气泡液体喷出，老鼠被甩出瓶外。",
    "E66.Smitten.Kitten_scene023.mp4": "动画片段展示了一个海滩场景，一只穿着红色泳衣的卡通狗从空中跳入海中，溅起水花。背景中有救生员塔、沙滩椅、救生圈和鞋子等物品。狗入水后，画面逐渐聚焦于它在水中游泳的情景，周围是蓝色的海水和木桩。天空晴朗，有几朵白云。",
    "E66.Smitten.Kitten_scene024.mp4": "一只穿着红色衣服的老鼠站在海水中，突然被水花溅起，接着一个巨大的贝壳从水中升起，包裹住老鼠。场景切换到夜晚，老鼠和一只绿色的小猫站在墙头，周围有向日葵。",
    "E66.Smitten.Kitten_scene025.mp4": "视频中，一只绿色的小猫和一只棕色的老鼠站在红色的围墙上，背景是灰色的天空和一些黄色的向日葵。小猫显得非常兴奋和激动，不断挥舞着双臂，嘴巴张开似乎在大声说话或唱歌。老鼠则站在一旁，表情略显惊讶和困惑，看着小猫的动作。整个场景充满了卡通风格的幽默和活力。",
    "E66.Smitten.Kitten_scene026.mp4": "视频片段中，首先出现一只绿色的小猫和一只棕色的小老鼠站在红色的墙头上，背景是夜晚和黄色的向日葵。随后画面变黑，接着切换到一个室内场景，棕色的小老鼠正在吃一盘食物，旁边有餐具和烛台。",
    "E66.Smitten.Kitten_scene027.mp4": "一只老鼠正在吃奶酪，被猫发现后，猫拿着勺子威胁老鼠，老鼠吓得倒在地上。",
    "E66.Smitten.Kitten_scene029.mp4": "在昏暗的房间里，一只穿着礼服的黑猫坐在餐桌旁，手里拿着一只小老鼠，脸上带着得意的笑容。桌上摆放着酒杯和橄榄。",
    "E66.Smitten.Kitten_scene030.mp4": "在餐桌旁，穿着西装打着领结的猫汤姆用绳子牵着一只戴着厨师帽的老鼠杰瑞。汤姆先是用绳子拉扯杰瑞，然后给杰瑞戴上厨师帽，接着让杰瑞端着一盘橄榄。汤姆用叉子挑起橄榄，杰瑞努力保持平衡，但最终橄榄洒落。汤姆则在一旁得意地看着。",
    "E66.Smitten.Kitten_scene031.mp4": "在餐厅里，一只戴着蓝色蝴蝶结的黄色猫坐在桌旁，面前摆放着餐具和一碗食物。她面前有一只小老鼠，正用头顶着一个装满绿色水果的盘子。猫看着老鼠，先是惊讶地张大嘴巴，然后用手指指向盘子，接着拿起一个水果放进嘴里，表情显得非常满意。",
    "E66.Smitten.Kitten_scene032.mp4": "汤姆猫坐在餐桌前，面前有一碗汤和一杯红色饮料。他先是悠闲地坐着，然后用爪子拿起勺子，开始喝汤。这时，杰瑞老鼠突然出现，戴着厨师帽，手里端着一盘绿色的蔬菜。杰瑞试图用勺子把汤推到汤姆面前，但汤姆却继续享受他的汤，显得非常满意。整个场景充满了幽默和轻松的气氛。",
    "E66.Smitten.Kitten_scene033.mp4": "一只戴着厨师帽的老鼠站在厨房里，看着一勺热气腾腾的红色汤。它先是惊讶地张大眼睛，然后露出得意的笑容，接着又变得愤怒，最后用爪子抓起勺子，把汤泼向空中。",
    "E66.Smitten.Kitten_scene034.mp4": "汤姆猫坐在餐桌前，戴着红色领结，用勺子舀起汤品尝，表情享受，随后放下勺子，继续用餐。",
    "E66.Smitten.Kitten_scene035.mp4": "一只戴着厨师帽的老鼠站在厨房里，看着一勺热汤。它先是惊讶，然后兴奋地跳起来，用爪子抓着勺子，最后跳进勺子里，仿佛在勺子里跳舞。",
    "E66.Smitten.Kitten_scene036.mp4": "汤姆猫坐在椅子上，手里拿着一把勺子，勺子上站着一只戴着厨师帽的老鼠杰瑞。杰瑞突然向汤姆的脸上喷洒液体，导致汤姆满脸都是液体，表情痛苦。汤姆试图用手擦脸，但杰瑞继续在勺子上摆弄，显得得意洋洋。",
    "E66.Smitten.Kitten_scene037.mp4": "一只戴着厨师帽的老鼠坐在勺子上，被一只戴着白手套的手用勺子舀起，同时勺子下方的蜡烛火焰被点燃，老鼠被火焰包围，表情惊恐。",
    "E66.Smitten.Kitten_scene038.mp4": "一只戴着厨师帽的老鼠站在燃烧的蜡烛上，被一只戴着手套的手拿着的刀子威胁。老鼠惊恐地尖叫，试图保持平衡，但最终被火焰烧伤并从蜡烛上掉落。",
    "E66.Smitten.Kitten_scene039.mp4": "一只老鼠从空中跳到一块黄色的奶酪上，奶酪开始融化，老鼠坐在上面享受融化的奶酪。",
    "E66.Smitten.Kitten_scene040.mp4": "一只棕色的小老鼠坐在一块黄色的奶酪上，周围有烛台和酒杯。画面突然变黑，随后小老鼠出现在户外的砖墙上，旁边有一朵向日葵，它正看着一个绿色的小怪物。",
    "E66.Smitten.Kitten_scene041.mp4": "一只绿色的小恶魔和一只棕色的小老鼠站在墙头上，小恶魔兴奋地跳动并张嘴说话，小老鼠则表情逐渐变得愤怒，双手叉腰，与小恶魔对峙。背景是灰色的墙和几朵向日葵。",
    "E66.Smitten.Kitten_scene042.mp4": "一只绿色的猫在灰色背景前跳舞，它不断变换姿势，表情开心，时而张嘴大笑，时而指向前方，动作活泼。",
    "E66.Smitten.Kitten_scene043.mp4": "一个绿色的猫角色在黑暗中大笑，随后画面变黑。接着，一个穿着牛仔服装的猫角色坐在木制长椅上，手持一个黄色的物体，背景是夜晚的户外场景。",
    "E66.Smitten.Kitten_scene044.mp4": "一只穿着牛仔服装的猫坐在长椅上，手持化妆镜和口红，正在给自己涂口红。背景是户外的木屋和远处的山丘。",
    "E66.Smitten.Kitten_scene045.mp4": "穿着牛仔服装的汤姆猫在户外跳舞，他戴着白色牛仔帽、绿色围巾，穿着黄色牛仔裤和带星形马刺的红色靴子，手里拿着绳索，不断扭动身体，做出各种牛仔舞步。背景是木栅栏和一座木屋，远处有山脉。",
    "E66.Smitten.Kitten_scene046.mp4": "在西部风格的场景中，一只穿着牛仔服装的白色猫坐在长椅上，另一只穿着牛仔服装的灰色猫从右侧进入画面，坐在长椅上与白色猫交谈。灰色猫做出各种手势和表情，似乎在讲述或表演某事，而白色猫则专注地倾听。背景是开阔的荒野和蓝天。",
    "E66.Smitten.Kitten_scene047.mp4": "汤姆穿着牛仔服装，戴着牛仔帽，系着绿色围巾，手上戴着有红色星星的绿色手套。他先是用一个卷起来的纸筒往里面倒出一些棕色颗粒，然后用纸筒的另一端吸住颗粒，接着他把纸筒放在嘴里，像吸烟一样吸了一口，然后吐出一些白色颗粒。随后，他把纸筒放在嘴里，像吸烟一样吸了一口，然后吐出一些白色颗粒。最后，他把纸筒放在嘴里，像吸烟一样吸了一口，然后吐出一些白色颗粒。",
    "E66.Smitten.Kitten_scene048.mp4": "在西部风格的场景中，穿着牛仔服装的汤姆和杰瑞正在交谈。汤姆向杰瑞打招呼，说“HOWDY”，随后画面变暗，场景切换到一个昏暗的室内，杰瑞和一个绿色的小怪物在台阶上行走。",
    "E66.Smitten.Kitten_scene049.mp4": "一只绿色的小猫和一只棕色的老鼠在户外的台阶上对峙。小猫显得愤怒和威胁，不断做出攻击性的动作，而老鼠则紧贴着柱子，显得害怕和防御。小猫试图吓唬老鼠，但老鼠保持警惕，最终小猫的威胁似乎没有奏效，老鼠仍然保持防御姿态。背景中有几朵向日葵，增添了场景的色彩。",
    "E66.Smitten.Kitten_scene050.mp4": "在花园的喷泉边，汤姆猫坐在喷泉边缘，靠近穿着蓝色上衣和白色短裤的杰瑞鼠。汤姆猫先是靠近杰瑞鼠，然后用爪子轻拍杰瑞鼠的脸，杰瑞鼠显得有些惊讶和不悦，随后汤姆猫继续靠近并试图与杰瑞鼠互动。背景是绿树和花卉，环境宁静。",
    "E66.Smitten.Kitten_scene051.mp4": "一只绿色的小猫和一只棕色的老鼠在台阶上对峙。绿色小猫表情凶狠，不断挥舞手臂并指向老鼠，似乎在威胁或挑衅。老鼠则保持警惕，身体后仰，眼神警惕，最后转为愤怒，摆出防御姿态。背景是台阶和几朵向日葵。",
    "E66.Smitten.Kitten_scene052.mp4": "一个绿色的小恶魔猫站在红色的木板地上，它先是张开双臂，然后举起一只拳头，随着节奏左右摇摆身体，同时张嘴大笑，显得非常开心和兴奋。",
    "E66.Smitten.Kitten_scene053.mp4": "一个绿色的小猫在红色地板上跳舞，随后画面变黑，接着出现一个穿着黑色斗篷、手持大提琴的猫在夜晚的户外演奏。",
    "E66.Smitten.Kitten_scene054.mp4": "汤姆猫在户外弹奏大提琴，表情投入，动作夸张。背景是花园，有砖墙、植物和一个圆形围栏。",
    "E66.Smitten.Kitten_scene056.mp4": "夜晚，汤姆猫在户外拿着大提琴，表情夸张地拉奏，嘴巴张开，看起来非常投入和享受。背景是白色的墙和一些树木，天空中有星星。",
    "E66.Smitten.Kitten_scene058.mp4": "在昏暗的房间里，一只老鼠躺在地上，头上顶着一朵花，周围散落着红色碎片。随后画面变黑，接着出现两只老鼠站在墙头，一只棕色，一只绿色，旁边有向日葵和一个黄色的邮箱。",
    "E66.Smitten.Kitten_scene059.mp4": "一只棕色老鼠和一只绿色小猫在墙头行走，老鼠背着红色背包，小猫拿着黄色桶和蓝色球。他们互相交流后，小猫用球和老鼠互动，老鼠把球放进桶里。随后，老鼠用球和小猫玩闹，小猫显得很生气。最后，老鼠离开，小猫独自站在墙头，表情从愤怒变为得意。",
    "E66.Smitten.Kitten_scene060.mp4": "一只背着黄色袋子、手持长矛和红色工具的老鼠在草地上行走，遇到另一只坐在台阶上的老鼠，后者注视着它。随后，背着袋子的老鼠继续前行，而另一只老鼠则从台阶上下来，跟在后面。",
    "E66.Smitten.Kitten_scene061.mp4": "一只穿着蓝色裙子的小老鼠坐在墙角的台阶上，看起来有些悲伤。随后，一只棕色的小狗从左侧跑来，伸出舌头，似乎在和小老鼠互动。小老鼠看着小狗，表情从悲伤转为好奇和兴趣。",
    "E66.Smitten.Kitten_scene062.mp4": "一个绿色的小恶魔在红色地板上跳舞，它先是兴奋地转圈，然后走到墙角，看到镜子里的自己，惊讶地跳了起来。接着它继续跳舞，最后开心地转圈，消失在画面中。",
    "E66.Smitten.Kitten_scene063.mp4": "视频中，一只绿色的猫和一只绿色的龙在红色地板上对峙。猫坐在墙角，龙则伸出舌头，显得非常兴奋。随后，画面逐渐变暗，最终显示“THE END”字样。",
    "E66.Smitten.Kitten_scene064.mp4": "视频开始时显示“THE END”字样，背景为红色，文字为白色并带有蓝色轮廓。随后，画面逐渐过渡，显示出“An MGM Tom and Jerry Cartoon”字样，下方标注“MADE IN HOLLYWOOD, U.S.A.”，背景仍为红色，文字为白色并带有蓝色轮廓。整个画面保持静态，没有其他动作或变化。"
}