{
    "E80.Puppy.Tale_scene001.mp4": "视频展示了米高梅动画的标志，背景为深蓝色，标志中央是一只咆哮的狮子，上方写着“A METRO-GOLDWYN-MAYER”，下方是“CARTOON”和“COLOR BY TECHNICOLOR”。",
    "E80.Puppy.Tale_scene002.mp4": "视频展示了米高梅动画公司的标志，背景为深蓝色，中间有一只咆哮的狮子，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。随后画面转黑，接着出现“Tom and Jerry”的标题，配以卡通猫和老鼠的形象。",
    "E80.Puppy.Tale_scene003.mp4": "视频展示了经典动画《猫和老鼠》的标题画面，背景为深蓝色，黄色字体写着“TOM and JERRY”，左侧是老鼠杰瑞，右侧是猫汤姆，两者都面带笑容。随后画面过渡到一个书本封面，上面写着“PUPPY TALE”，并注明由威廉·汉纳和约瑟夫·巴伯拉执导。",
    "E80.Puppy.Tale_scene004.mp4": "这是一个动画片的片头，画面展示了一本名为《PUPPY TALE》的书，封面是黄色的，书名用绿色字体，下方有导演William Hanna和Joseph Barbera的名字，以及六个卡通小狗图案。书的左侧有紫色花纹装饰，右侧是红色的书脊。背景是深蓝色。画面中逐渐出现制作人员名单，包括动画师、背景绘制师和音乐师等。最后显示了版权信息和批准编号。",
    "E80.Puppy.Tale_scene005.mp4": "视频开始展示了一本打开的书，书页上列出了动画制作团队的名单，包括动画师、背景绘制师和音乐作曲家。随后，画面过渡到一个深蓝色背景，显示“Produced by Fred Quimby”的字样。最后，画面转暗，出现一个夜晚的场景，一扇绿色的门在昏暗的灯光下显得格外醒目。",
    "E80.Puppy.Tale_scene006.mp4": "夜晚，一扇黄色的门在灯光下显得格外醒目。一只棕色的小老鼠从门后探出头来，手里拿着一个瓶子和一张纸。它将纸放入瓶中，然后兴奋地挥舞着双臂，似乎在庆祝或表达喜悦。随后，它转身跑开，留下瓶子在门前。",
    "E80.Puppy.Tale_scene007.mp4": "夜晚，一辆蓝色汽车驶过一座石桥，车后抛出一个棕色物体，落入水中并漂浮。",
    "E80.Puppy.Tale_scene009.mp4": "在夜晚的悬崖边，一只小白兔从悬崖上跳下，试图抓住一只小老鼠。小老鼠在空中翻滚，小白兔也跟着翻滚，最终小白兔抓住了小老鼠，但小老鼠又挣脱了。小白兔继续在空中翻滚，小老鼠则在悬崖上奔跑。",
    "E80.Puppy.Tale_scene011.mp4": "一只蓝色的猫躺在壁炉前的篮子里，盖着绿色的毯子，旁边放着一个红色的碗。房间内有沙发、台灯和壁炉，整体氛围温馨。",
    "E80.Puppy.Tale_scene012.mp4": "一只小老鼠从门后探出头，小心翼翼地走出来，随后一只小狗从门后跑出来，追着小老鼠跑。小狗追到小老鼠后，小老鼠躲到桌子底下，小狗也跟着躲到桌子底下。",
    "E80.Puppy.Tale_scene013.mp4": "一只小老鼠从墙角爬出来，躲在家具后面，然后小心翼翼地探出头来观察四周。",
    "E80.Puppy.Tale_scene014.mp4": "一只小奶狗在红色碗里开心地喝奶，旁边躺着一只猫，猫从篮子里探出头来，看着小狗，然后伸展身体，似乎在打盹。",
    "E80.Puppy.Tale_scene015.mp4": "一只棕色的小老鼠从窗帘后跑出来，看到一只白色的小狗正趴在红色的碗边吃东西。小老鼠靠近小狗，小狗抬头看着它，然后小老鼠又跑开了，小狗也跟着它跑。",
    "E80.Puppy.Tale_scene016.mp4": "一只灰色的猫从篮子里探出头，盯着前方红色碗里的牛奶。一只棕色的小老鼠在碗边犹豫片刻，然后跳进碗里喝牛奶，接着迅速跑开，消失在沙发后面。猫的表情从好奇变为愤怒，紧盯着老鼠消失的方向。",
    "E80.Puppy.Tale_scene017.mp4": "视频展示了一个室内场景，地板是紫色的，墙壁是木质的，有一扇窗户和一个红色的沙发。一只小老鼠从画面左侧跑过，随后一只蓝猫从左侧进入画面，它先是蹲下，然后站起，用爪子捂住额头，看起来很困惑或沮丧，接着它用爪子指着前方，似乎在思考或表达不满。",
    "E80.Puppy.Tale_scene018.mp4": "视频中，一只小奶狗正在地板上舔食红色碗中的食物，突然一只蓝猫（汤姆）从画面右侧跳入，用爪子抢走碗并迅速将小奶狗拖到房间角落。汤姆用爪子抓住小奶狗，将其举过头顶，随后又将小奶狗放在地上，用爪子轻轻拍打它的头部。接着，汤姆抱着小奶狗走出房间，将它放在门外，自己则转身离开。小奶狗独自坐在门外，先是低头看着地面，然后抬头望向屋内，最后又低头继续看着地面，显得有些无助和困惑。",
    "E80.Puppy.Tale_scene019.mp4": "一只小老鼠站在窗台上，用一根长杆子试图够到窗外的东西。它先是用前爪抓着杆子，然后用力拉扯，杆子逐渐被拉长，最终小老鼠被拉得悬在半空中。",
    "E80.Puppy.Tale_scene020.mp4": "夜晚，一只小狗在房子外的地上，被一个长柄工具拖着纸飞机滑行，小狗表情从惊讶到开心，最后被拖到门口。",
    "E80.Puppy.Tale_scene021.mp4": "一只棕色小老鼠站在绿色台面上，用一根长杆子拉扯着一个红色的香肠。随后，一只白色小狗从窗外爬进来，也用一根长杆子拉扯香肠，与小老鼠展开了一场争夺战。两只小动物在台面上来回拉扯，香肠在它们之间来回移动。",
    "E80.Puppy.Tale_scene022.mp4": "一只小狗从橱柜的抽屉里被用铲子铲出来，然后被铲子铲进抽屉里，最后铲子离开画面。",
    "E80.Puppy.Tale_scene023.mp4": "一只小老鼠在厨房的绿色台面上，用一根长棍子推动自己向前滑行，然后从台面跳下并跑出画面。",
    "E80.Puppy.Tale_scene024.mp4": "一只棕色的小老鼠从画面右侧跑入，停在一个打开的白色抽屉前，它用前爪按住抽屉上的绿色把手，似乎在试图把抽屉关上。",
    "E80.Puppy.Tale_scene026.mp4": "在一间布置温馨的房间里，汤姆猫拿着一个绿色的袋子，走到窗边，把袋子扔了出去，然后站在窗边，似乎在观察袋子的去向。",
    "E80.Puppy.Tale_scene027.mp4": "夜晚，一只白色的小狗从蓝色房子的屋檐上跳下，向画面左下方飞去。",
    "E80.Puppy.Tale_scene028.mp4": "夜晚，一只小狗从玻璃瓶中探出头来，表情惊讶。",
    "E80.Puppy.Tale_scene029.mp4": "汤姆猫在窗台上用绿色布料遮挡自己，随后迅速将布料拉下并躲藏起来。杰瑞鼠从窗帘后探出头来，小心翼翼地走到窗台上，四处张望，似乎在寻找什么。",
    "E80.Puppy.Tale_scene030.mp4": "夜晚，一个拟人化的牛奶瓶站在砖墙边，表情开心。突然，几根绳子从右侧飞来，缠绕在牛奶瓶的脖子上，牛奶瓶被拉扯着向右倾斜。",
    "E80.Puppy.Tale_scene031.mp4": "一只小老鼠拉着一根绳子，绳子的另一端连接着一只小狗。小狗被拉过来后，小老鼠被小狗叼住并拖走。随后，一只大猫出现，看到小狗叼着小老鼠，便生气地扑过去，结果被小狗用鼻子顶了一下，大猫只好捂住脸。小狗则把小老鼠放下来，然后跑开了。",
    "E80.Puppy.Tale_scene032.mp4": "在厨房里，汤姆猫追逐杰瑞鼠。杰瑞鼠从门后跑出来，汤姆猫紧随其后。汤姆猫追到水槽边，抓起一块肥皂，但杰瑞鼠撞上肥皂，摔倒在地。汤姆猫看到后，高兴地跳了起来。",
    "E80.Puppy.Tale_scene033.mp4": "汤姆猫从门外探头张望，发现杰瑞鼠在门后。汤姆猫试图关门，但杰瑞鼠迅速躲开，汤姆猫愤怒地踢门。随后，汤姆猫在客厅里躺在蓝色枕头上，表情放松。突然，汤姆猫被惊醒，惊慌失措地翻滚，最终坐起，表情惊恐。",
    "E80.Puppy.Tale_scene035.mp4": "视频展示了一个室内场景，窗外是夜晚的雷雨天气，闪电不断划过天空。室内有一扇大窗户，窗户两侧挂着粉红色的窗帘，窗台上摆放着几个彩色的靠垫。房间左侧有一把绿色的扶手椅，背景中可以看到书架上排列着书籍。整个画面氛围宁静而略带紧张，因为窗外的雷雨天气。",
    "E80.Puppy.Tale_scene036.mp4": "一只灰色的猫躺在紫色地毯上，用蓝色枕头垫着头，先是闭眼休息，随后睁开眼睛，显得有些疲惫或无聊。背景是一个装饰典雅的房间，有楼梯、扶手椅和一盏紫色台灯。",
    "E80.Puppy.Tale_scene041.mp4": "一只小狗在雨夜中睡在车里，被雨声惊醒后，它睁开眼睛，发现一只小老鼠在它身边。小狗惊慌地醒来，抱起小老鼠，然后小心翼翼地爬起来，把小老鼠放在地上，自己也站了起来。",
    "E80.Puppy.Tale_scene042.mp4": "夜晚，雨中，一个角色撑着伞走在石桥上。",
    "E80.Puppy.Tale_scene044.mp4": "在雨夜中，汤姆撑着伞走在石桥上，突然被蝙蝠袭击，他惊慌失措地跳入水中，伞也掉进了水里，最终消失在雨幕中。",
    "E80.Puppy.Tale_scene046.mp4": "夜晚，雨中，一只小动物在桥下的水中挣扎，溅起水花。",
    "E80.Puppy.Tale_scene047.mp4": "在雨夜中，一只白色小狗和一只棕色小老鼠在屋檐下相遇。小狗温柔地看着小老鼠，随后小老鼠跑开，小狗则开心地追逐，最后小老鼠消失在雨幕中，小狗也慢慢退回到屋檐下。",
    "E80.Puppy.Tale_scene049.mp4": "一只小狗从门后探出头，随后一群小狗从门后跑出来，最后只留下一只小狗在原地。",
    "E80.Puppy.Tale_scene050.mp4": "在室内场景中，汤姆猫站在一群小狗旁边，显得有些惊讶和困惑。小狗们围绕着一个红色的碗，似乎在争抢食物。杰瑞老鼠则在背景中观察着这一切。汤姆猫随后伸出手，似乎想要干预或制止小狗们的争抢。最后，画面逐渐变暗，出现“THE END”的字样，标志着这个片段的结束。",
    "E80.Puppy.Tale_scene051.mp4": "视频片段展示了经典的动画片《猫和老鼠》的片尾画面。画面中央是蓝色字体的“The End”字样，背景为红色渐变色。随后，画面逐渐过渡到“An MGM Tom and Jerry Cartoon”字样，下方标注“MADE IN HOLLYWOOD, U.S.A.”，表明该动画由米高梅公司制作，产地为美国好莱坞。整个画面风格复古，具有经典动画片的标志性特征。"
}