{
    "E88.Pet.Peeve_scene001.mp4": "画面显示了米高梅动画的标志，背景为深蓝色，标志中央是一只咆哮的狮子，上方有“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样。",
    "E88.Pet.Peeve_scene002.mp4": "视频展示了米高梅动画公司的标志，标志中央是一只咆哮的狮子，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。随后画面转黑，接着出现“Tom and Jerry”的标题，旁边是汤姆猫的卡通形象。",
    "E88.Pet.Peeve_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为蓝绿色，黄色大字“Tom and Jerry”醒目地显示在画面中央。左侧是杰瑞，一只棕色的小老鼠，正从一个角落探出头来，右手举起，面带笑容。右侧是汤姆，一只灰色的猫，同样面带笑容，眼睛睁得大大的，嘴巴张开，露出舌头，显得非常开心。整个画面充满了欢乐和动感，传达出这部动画片轻松幽默的风格。",
    "E88.Pet.Peeve_scene004.mp4": "该视频片段展示了动画片《猫和老鼠》中的一个场景。画面中，一只棕色的狗正坐在桌子旁，面前摆放着食物，它似乎正在享受美食。背景是一个昏暗的房间，有橱柜和一些家具，营造出一种温馨的氛围。狗的表情显得非常满足和惬意，它用前爪抓着食物，似乎在慢慢品尝。整个画面充满了卡通风格的幽默感，展现了这只狗在享受美食时的满足和快乐。",
    "E88.Pet.Peeve_scene006.mp4": "一只老鼠从柜子的洞里探出头，看到地上的面包后，它迅速跑出来，抓住面包并试图拖走。这时，一只猫的手从画面左侧伸出来，抓住了老鼠的尾巴，将它拖回柜子洞里。老鼠被拖走后，猫的手还留在画面中。",
    "E88.Pet.Peeve_scene007.mp4": "汤姆在厨房里制作三明治，他先将一片面包放在一个红色的罐子上，然后在上面放上另一片面包，接着他从盘子里拿起两颗橄榄，用牙签串起来，放在三明治的顶部。他满意地看着自己的作品，然后张开嘴咬了一口，但突然被橄榄卡住，导致他喷出水花。汤姆显得非常惊讶和困惑，他伸长脖子，试图弄清楚发生了什么，然后他转过身，似乎在思考下一步该怎么办。",
    "E88.Pet.Peeve_scene009.mp4": "视频通过钥匙孔视角展示两个场景：首先是一个人坐在桌前翻阅大量文件，接着镜头切换到一个女人坐在椅子上编织粉色毛线。",
    "E88.Pet.Peeve_scene010.mp4": "汤姆猫拿着一瓶牛奶站在门口，旁边是一只穿着红色短裤的棕色斗牛犬。汤姆猫先是用瓶子碰了碰门把手，然后开始喝牛奶，喝得非常开心，牛奶从瓶子里溅出来。斗牛犬看着汤姆猫喝牛奶，先是惊讶，然后也笑了。",
    "E88.Pet.Peeve_scene011.mp4": "一只橙色的小猫从木柜底部的圆形洞口探出头来，眼睛睁得大大的，表情显得好奇或警惕。",
    "E88.Pet.Peeve_scene012.mp4": "汤姆猫拿着一瓶牛奶，站在门口，旁边是一只棕色的狗。汤姆突然把牛奶喷出来，狗被吓到，拿着一块肉，汤姆则拿着牛奶瓶逃跑，狗追着汤姆。汤姆跑出门，狗也跟着跑出门。",
    "E88.Pet.Peeve_scene013.mp4": "一只棕色的狗拿着一个红色的喷壶，给一盆黄色的花浇水。它先将花从花盆中取出，然后将喷壶中的水倒入花盆中，最后将花重新放回花盆中。",
    "E88.Pet.Peeve_scene014.mp4": "汤姆猫正在用一个瓶子从一个装置中接水，水突然喷出，他被水溅到后向后退去。",
    "E88.Pet.Peeve_scene015.mp4": "视频中，一只棕色的狗站在门前，表情紧张。一只灰色的猫突然从门后冲出来，撞到狗身上，两人开始扭打。狗用爪子抓住猫的尾巴，将猫提起来，猫则试图反击，抓住狗的项圈。两人在空中互相拉扯，表情各异，狗显得得意，猫则显得愤怒。背景是室内环境，有门和橱柜。",
    "E88.Pet.Peeve_scene016.mp4": "汤姆猫抓住一只狗的项圈，被狗拖着飞出门口，最后挂在门上。",
    "E88.Pet.Peeve_scene017.mp4": "一位女士坐在椅子上织毛衣，旁边有一只猫。猫被毛线吸引，开始玩弄毛线球，导致毛线散乱。猫最终抓起一个毛线球，躺在地上玩耍。",
    "E88.Pet.Peeve_scene018.mp4": "一个穿着紫色西装的男人坐在椅子上，面前有一张堆满文件的桌子。他正在用手势说话，突然一只狗从桌子底下钻出来，咬住他的脚踝，把他拉倒在地上。狗继续咬着他的脚踝，男人试图挣脱，但狗紧紧咬住不放。镜头逐渐拉远，显示出房间的更多部分，包括一盏台灯和楼梯。",
    "E88.Pet.Peeve_scene019.mp4": "一位女士坐在椅子上织毛衣，旁边放着一个装有毛线球的篮子。镜头切换到一只穿着围裙和帽子的猫，它同时拿着扫帚和吸尘器，正在打扫房间。",
    "E88.Pet.Peeve_scene020.mp4": "一只穿着绿色围裙的棕色狗正在熨衣服，它从篮子里拿出一件衣服，然后开始熨烫。在狗熨衣服的时候，一只小老鼠从柜子上跳下来，偷走了狗刚熨好的衣服。小老鼠拿着衣服，开心地跑开了。",
    "E88.Pet.Peeve_scene021.mp4": "汤姆猫穿着粉色围裙和头巾，手持扫帚和吸尘器，正在打扫房间。这时，一只穿着绿色围裙的棕色狗从旁边走进来，汤姆猫转头看着它，狗则站在一旁，似乎在和汤姆猫交谈。背景中可以看到楼梯和一盏台灯。",
    "E88.Pet.Peeve_scene022.mp4": "一只棕色的小老鼠坐在厨房台面上，旁边有一个绿色的罐子和一个绿色的碗。小老鼠正用前爪拿着一块食物，似乎在享受它的美味。背景是木质的橱柜和紫色的墙壁。",
    "E88.Pet.Peeve_scene023.mp4": "在室内，一只穿着粉色围裙和帽子的猫和一只穿着绿色围裙的狗正在打扫卫生。猫拿着扫帚，狗拿着吸尘器。狗在使用吸尘器时，突然被吸尘器吸住，身体被吸尘器吸走，最后消失在画面中。",
    "E88.Pet.Peeve_scene024.mp4": "一只灰色的猫从门后跳出，追逐一只棕色的小老鼠。猫成功抓住老鼠，但被一只棕色的狗打断，狗夺走了老鼠。猫被狗拉长身体，表情痛苦。",
    "E88.Pet.Peeve_scene025.mp4": "一只棕色的狗戴着红色项圈，右手抓着一只棕色的小老鼠，正在向前奔跑。背景是简单的白色墙壁和绿色地面。",
    "E88.Pet.Peeve_scene026.mp4": "汤姆猫从门后跳出，然后站在门口，一只手扶着门，另一只手放在耳边，似乎在倾听什么。随后，他身体前倾，做出一个夸张的伸展动作。",
    "E88.Pet.Peeve_scene027.mp4": "一只猫从门后伸出的手上抓起一只老鼠，然后迅速跑开。",
    "E88.Pet.Peeve_scene028.mp4": "汤姆抱着杰瑞在房间里跑动，经过一盏台灯。",
    "E88.Pet.Peeve_scene030.mp4": "一只灰色的猫从楼梯间跑出来，然后消失在画面中。",
    "E88.Pet.Peeve_scene031.mp4": "汤姆抱着杰瑞从楼梯上跳下来，走到沙发前，沙发后面突然冒出一只狗，汤姆把杰瑞递给狗，狗接过杰瑞后，汤姆拿出一个红袋子，狗拿着杰瑞，汤姆拿着袋子离开。",
    "E88.Pet.Peeve_scene032.mp4": "汤姆猫拿着一根棍子，棍子上绑着一个红白波点的袋子，他站在门口，一只棕色的狗拿着一个玩具老鼠出现，狗和汤姆猫握手，然后汤姆猫把玩具老鼠递给狗，狗把袋子挂在门把手上，汤姆猫和狗一起离开了。",
    "E88.Pet.Peeve_scene033.mp4": "一只棕色的狗拿着一根绑着红布袋的棍子，走在绿树成荫的小路上。突然，狗的头部变成了兔子的头部，它继续拿着棍子。随后，狗又变回原样，愤怒地挥舞着棍子，最终棍子飞出去，击中了树干，树干上出现了火花。",
    "E88.Pet.Peeve_scene034.mp4": "汤姆猫抓到杰瑞鼠后，兴奋地跳起来庆祝，但杰瑞鼠突然从门后跑出来，汤姆猫被绊倒，门被撞开，杰瑞鼠逃跑了。汤姆猫躺在地上，门被撞开后，汤姆猫试图抓住门把手，但门把手被杰瑞鼠撞飞。汤姆猫躺在地上，门被撞开后，汤姆猫试图抓住门把手，但门把手被杰瑞鼠撞飞。汤姆猫躺在地上，门被撞开后，汤姆猫试图抓住门把手，但门把手被杰瑞鼠撞飞。",
    "E88.Pet.Peeve_scene035.mp4": "一只棕色的小老鼠在墙角奔跑，被一只戴着红色项圈的棕色大狗抓住。大狗兴奋地举起小老鼠，但这时，一只灰色的猫从旁边冲过来，将大狗撞倒在地。猫得意地跳起，抓起小老鼠，然后迅速跑开，留下大狗躺在地上。",
    "E88.Pet.Peeve_scene036.mp4": "汤姆从壁炉旁跑出，手里拿着一把剑和一只老鼠。他与一只拿着剑的棕色狗对峙，两人开始用剑互相攻击。在战斗过程中，汤姆用剑击中了狗的灯，灯被击碎，狗被击中后倒地。",
    "E88.Pet.Peeve_scene037.mp4": "汤姆猫手持剑和一块肉，与一只狗对峙。狗用剑攻击汤姆，汤姆被击退并躲进一个红木柜子。狗继续用剑攻击柜子，试图抓住汤姆。最终，汤姆从柜子中探出头来，而狗则站在柜子前，剑指向汤姆。",
    "E88.Pet.Peeve_scene038.mp4": "一只老鼠从门后跑出，猫汤姆从门后跳出来追赶，但被一只大狗撞倒，随后汤姆和狗一起被绿色地毯卷起，最后落在木地板上。",
    "E88.Pet.Peeve_scene039.mp4": "一只小老鼠在绿色地毯上奔跑，突然被卷入地毯卷中。随后，汤姆和杰瑞拿着锯子试图锯开地毯，但被一个穿着紫色长袍的人阻止。最后，汤姆和杰瑞被吓跑，小老鼠从地毯卷中探出头来。",
    "E88.Pet.Peeve_scene040.mp4": "一只棕色的小老鼠站在洞口，手里拿着一块黄色的奶酪，它先是看着奶酪，然后抬头望向洞口上方，接着又低头看着奶酪，最后转身向洞口外走去。洞口外是一些食物，包括罐头、水果和蔬菜等。",
    "E88.Pet.Peeve_scene041.mp4": "一只猫和一只狗从厨房门口探出头，随后一起拖着一个冰箱走出厨房。猫在前面，狗在后面，两人合力将冰箱拖到房间的另一侧。",
    "E88.Pet.Peeve_scene042.mp4": "一只猫和一只狗从房子里搬出一个冰箱，沿着小路奔跑，最终消失在视野中。",
    "E88.Pet.Peeve_scene043.mp4": "视频显示了“The End”字样，背景为橙红色渐变，字体为白色带蓝色边框。随后，画面逐渐出现“An MGM Tom and Jerry Cartoon”和“MADE IN HOLLYWOOD, U.S.A.”字样，表明这是米高梅公司制作的《猫和老鼠》动画片的片尾。",
    "E88.Pet.Peeve_scene044.mp4": "这是一个M·G·M出品的《猫和老鼠》动画片头，背景为橙红色渐变，文字以蓝色和白色呈现，显示“An M·G·M Tom and Jerry CARTOON”以及“MADE IN HOLLYWOOD, U.S.A.”。画面静态，无角色或动作出现。"
}