{
    "E81.Posse.Cat_scene001.mp4": "视频展示了米高梅动画的标志，背景为深蓝色，标志中央有一只咆哮的狮子，上方写着“A METRO-GOLDWYN-MAYER”，下方是“CARTOON”和“COLOR BY TECHNICOLOR”。",
    "E81.Posse.Cat_scene002.mp4": "这是一个米高梅卡通片头，背景为深蓝色，中央有一个圆形标志，标志内是一只咆哮的狮子。标志下方有金色的“CARTOON”字样，再下方是红色的“COLOR BY TECHNICOLOR”字样。狮子在标志内不断咆哮，表情生动。",
    "E81.Posse.Cat_scene003.mp4": "视频展示了米高梅动画片的片头，先是米高梅的标志和“CARTOON”字样，接着是“Tom and Jerry”的标题，最后画面转为黑色。",
    "E81.Posse.Cat_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为蓝色，左侧是棕色的小老鼠杰瑞，右侧是灰色的猫汤姆，两者都面带笑容。画面中央是黄色的“TOM and JERRY”字样，随着画面推进，出现了“POSE CAT”字样和导演信息“Directed by WILLIAM HANNA and JOSEPH BARBERA”。",
    "E81.Posse.Cat_scene005.mp4": "这是一个《猫和老鼠》动画片的片头，标题为“Posse Cat”，由威廉·汉纳和约瑟夫·巴伯拉执导。画面中展示了动画制作人员名单，包括动画师、背景绘制师和音乐制作人，以及制作公司和版权信息。最后显示了制片人Fred Quimby的名字。整个画面背景为蓝色，配有简单的卡通风格装饰，如太阳、山脉和骑马的人物图案。",
    "E81.Posse.Cat_scene006.mp4": "视频开始时显示“Produced by FRED QUIMBY”的字样，随后画面转为黑色，最后展示了一幅宁静的乡村景色，远处是覆盖着积雪的山脉，近处是绿色的田野和几座红色的农舍。",
    "E81.Posse.Cat_scene008.mp4": "一个穿着牛仔服装、系着围裙的角色在厨房里，用绳子拴住一根香肠，然后用勺子舀起香肠，接着拿起一把手枪，将香肠扔进水盆里，导致水盆翻倒，水和碗碟散落一地。",
    "E81.Posse.Cat_scene009.mp4": "动画片段中，汤姆猫戴着牛仔帽和粉色围巾，躺在地上，嘴里叼着一根绳子。他先是被飞来的蓝色盘子砸中，盘子碎裂，随后他被一根红色的棍子击中，棍子从他口中滑落。汤姆猫随后露出得意的笑容，用手比划着，似乎在炫耀自己的“胜利”。最后，他躺下，闭上眼睛，显得非常满足和放松。",
    "E81.Posse.Cat_scene010.mp4": "一个穿着围裙的卡通角色站在绿色桌子旁，桌上放着一个蓝色碗和几个杯子。角色先是双手放在腰间，然后从腰间掏出一个三角铁和一把勺子。接着，一只戴着牛仔帽、系着粉红色领巾的猫突然出现，手里拿着一个空盘子和一把叉子，站在桌子旁等待。角色继续摆弄手中的三角铁和勺子，猫则保持着等待的姿态。背景是木质墙壁，整个场景充满卡通风格。",
    "E81.Posse.Cat_scene011.mp4": "汤姆戴着牛仔帽，系着粉色围巾，手持餐具和盘子，表情愉悦。有人递给他一只鸡腿，他开心地接过来。接着，有人用勺子给他加了奶油和酱汁，他继续享受美食，脸上露出满足的笑容。",
    "E81.Posse.Cat_scene012.mp4": "在一个厨房里，穿着围裙的汤姆猫拿着一盘食物，站在桌子旁。他先是用叉子和刀切食物，然后放下刀叉，把食物递给一个戴着牛仔帽、系着粉色领巾的猫。接着，汤姆猫用绳子把辣椒绑起来，放在桌子上，然后指着猫，似乎在训斥它。",
    "E81.Posse.Cat_scene013.mp4": "一只戴着帽子的老鼠从墙洞中探出头，拉着一根绳子，绳子的另一端连接着一个红色香肠。老鼠用力拉扯，香肠被拉出洞外，随后老鼠被香肠拖拽着，最终消失在洞中。",
    "E81.Posse.Cat_scene014.mp4": "一个穿着牛仔服装的猫站在桌子旁，面对着一个穿着牛仔服装的猫。穿着牛仔服装的猫用手指着猫，然后从腰间掏出一把枪，向猫开了一枪。猫被击中后，向后退去，然后开始奔跑，同时身后留下了一串烟雾。",
    "E81.Posse.Cat_scene015.mp4": "动画片中，戴着牛仔帽和粉色围巾的汤姆从窗户跳出，落地后站在窗边，表情紧张地四处张望，似乎在寻找什么或躲避什么。",
    "E81.Posse.Cat_scene016.mp4": "一个穿着黄色衣服、戴着蓝色帽子的小猴子从墙角的洞里探出头来，手里拿着一个红色的物体，似乎在观察周围环境。背景是黄色的墙板和灰色的地面。",
    "E81.Posse.Cat_scene017.mp4": "一只戴着牛仔帽和粉色围巾的灰色猫站在窗边，用刷子蘸取红色液体涂抹在窗台上，然后将一块红色物体放入窗台上的盘子中，最后将手伸进盘子。",
    "E81.Posse.Cat_scene018.mp4": "一只戴着帽子、拿着鞭子的小老鼠从墙角的洞里探出头来，警惕地观察四周。",
    "E81.Posse.Cat_scene019.mp4": "画面中是一个厨房角落，绿色的桌子上有蓝色的盘子，盘子旁边有一块红色的物体。背景是黄色的橱柜和墙壁，橱柜上放着一些物品，包括一个黄色的杯子和一个红色的物体。整个画面静止不动，没有人物或动作出现。",
    "E81.Posse.Cat_scene020.mp4": "一只戴着帽子的卡通老鼠从墙洞中探出，手持绳索，用力拉扯，绳索逐渐变长并延伸至画面右侧。",
    "E81.Posse.Cat_scene021.mp4": "一根白色的线从画面左侧出现，连接到一个蓝色的盘子上。线的另一端连接着一个红色的物体，该物体从画面右侧伸出，然后被拉向左侧，最终线被拉直，红色物体停在盘子旁边。",
    "E81.Posse.Cat_scene022.mp4": "一只戴着牛仔帽、系着粉色围巾的灰色猫（汤姆）正试图从窗外偷吃盘子里的食物。他伸长身体，用爪子抓取食物，但突然失去平衡，向后翻倒，最终从窗台上摔落，消失在画面中。",
    "E81.Posse.Cat_scene023.mp4": "动画片段中，汤姆猫戴着牛仔帽和粉色领巾，从墙洞中滑出，摔倒在地，随后又弹起并倒立在墙角。",
    "E81.Posse.Cat_scene024.mp4": "猫穿着白色帽子和粉色领结，趴在地板上，手里拿着红色电话听筒。老鼠戴着黑色帽子，拿着电话线，正在打电话。老鼠突然被电话线绊倒，摔倒在地。",
    "E81.Posse.Cat_scene025.mp4": "一只小老鼠从黄色的木墙后探出头，突然墙板破裂，小老鼠惊慌逃跑。紧接着，戴着牛仔帽的猫汤姆从墙洞中冲出，追赶小老鼠，但最终摔倒在地。",
    "E81.Posse.Cat_scene026.mp4": "视频中，一只戴着黑色牛仔帽的小老鼠从画面左侧跑入，停在一把红色手柄的耙子旁边。随后，一只穿着牛仔装扮的猫从左侧跑入，抓起小老鼠，将其举在眼前，似乎在欣赏或炫耀自己的战利品。背景是一面黄色的木板墙和一根白色的排水管。",
    "E81.Posse.Cat_scene027.mp4": "一把红色手柄的蓝色耙子靠在黄色的木墙上，镜头向右平移，露出一个挂在窗户上的蓝色三角铁，耙子的齿部轻轻触碰三角铁，三角铁随之晃动。",
    "E81.Posse.Cat_scene028.mp4": "汤姆戴着牛仔帽，脖子上系着粉红色围巾，手里拿着杰瑞，站在黄色木墙前。他先是得意地笑着，然后突然被杰瑞从手中挣脱，杰瑞跳到墙上。汤姆惊慌失措地向后退去，最终摔倒在地，消失在画面中。",
    "E81.Posse.Cat_scene029.mp4": "一个穿着围裙的男人站在绿色桌子旁，桌上放着蓝色盘子和叠在一起的杯子。一只戴着牛仔帽、系着粉色领巾的灰色猫突然冲进来，手里拿着盘子和刀叉，看起来很兴奋。男人似乎在准备食物，但猫的出现让他感到惊讶。猫试图用刀叉从男人手中抢盘子，男人则试图阻止它。接着，男人从腰间掏出一把左轮手枪，朝猫开了一枪，猫被吓得向后退去，还被击中了。猫在后退过程中摔倒，但仍然保持着惊恐的表情。男人则拿着枪，看起来很生气。",
    "E81.Posse.Cat_scene030.mp4": "视频展示了一个西部风格的场景，汤姆猫从木屋窗户中跳出，戴着牛仔帽和粉色围巾，表情兴奋。他落地后，看到杰瑞老鼠也戴着牛仔帽，从远处跑来。汤姆猫迅速从地上捡起一根绳子，摆出套索姿势，准备捕捉杰瑞老鼠。整个场景充满西部牛仔的幽默感和追逐的紧张气氛。",
    "E81.Posse.Cat_scene031.mp4": "一只戴着牛仔帽的棕色小老鼠在厨房水槽边缘奔跑，突然被一根绳子绊倒，摔倒在水槽里。",
    "E81.Posse.Cat_scene032.mp4": "一个穿着围裙、腰间别着枪套的人物站在厨房里，用勺子和一根绳子将一只烤鸡绑住，然后将鸡从烤盘上提起。",
    "E81.Posse.Cat_scene034.mp4": "一个穿着蓝色衣服和白色围裙的人躺在绿色的桌子上，脚放在一个木凳上，似乎在睡觉。桌上有一盘三明治和一碗番茄。一只戴着黑色帽子的小老鼠从桌子底下爬出来，它先是靠近三明治，然后把三明治叠起来，接着又把番茄放在三明治上，最后老鼠跑开了。",
    "E81.Posse.Cat_scene035.mp4": "一只戴着帽子的老鼠拿着勺子，小心翼翼地靠近一个悬挂的蓝色三角铁，准备用勺子敲击它。",
    "E81.Posse.Cat_scene036.mp4": "汤姆猫戴着牛仔帽，从柜子后面探出头，伸出舌头，然后突然跳起来，消失在画面中。",
    "E81.Posse.Cat_scene037.mp4": "一个穿着牛仔帽和粉色围巾的猫从桌子底下跳出来，伸手拿走了一盘三明治。它咬了一口后，被突然惊醒的男子抓住了手。猫迅速逃跑，摔倒在地，然后坐在地上，看起来很得意。",
    "E81.Posse.Cat_scene038.mp4": "一只蓝色的猫从窗户飞出，被一根黄色的棍子击中后向前飞去，身后留下蓝色的烟雾。",
    "E81.Posse.Cat_scene039.mp4": "动画片中，汤姆猫穿着牛仔帽和粉色领巾，从树后跑出来，他先是惊讶地四处张望，然后用勺子从水桶里舀水，一边倒水一边开心地跳舞，最后他停止跳舞，握紧拳头，表情变得严肃。",
    "E81.Posse.Cat_scene040.mp4": "一个穿着牛仔帽的卡通角色从窗户探出头，手里拿着一个巨大的法棍面包。他先是小心翼翼地探出头，然后将面包举过头顶，接着又将面包放下，最后从画面中消失。背景是一个乡村场景，有木栅栏和远处的房屋。",
    "E81.Posse.Cat_scene041.mp4": "一只戴着帽子的小狗从白色栅栏后探出头，手里拿着一个巨大的法棍面包。它走到一张木制长凳旁，把面包放在长凳上，然后自己跳上去，躺在面包上，看起来非常满足。背景中有一头红色的牛站在栅栏后面，但没有参与互动。",
    "E81.Posse.Cat_scene042.mp4": "动画片中的猫汤姆戴着牛仔帽，从木栅栏后跑出来，兴奋地跑向一个长凳，长凳上放着一个面包。汤姆高兴地拿起面包，开心地咬了一口，然后被面包的尾巴拉得飞了出去，帽子和围巾也飞走了。",
    "E81.Posse.Cat_scene043.mp4": "一只红色的公牛在草原上奔跑，表情愤怒。随后，一只戴着牛仔帽、系着粉色围巾的猫从公牛尾巴上跳起，挂在尾巴上，公牛继续奔跑，猫则在空中摆出得意的姿势。公牛停下脚步，猫从尾巴上滑落，公牛转过身，表情变得愤怒。",
    "E81.Posse.Cat_scene044.mp4": "汤姆从空中跳下，撞到一张桌子上，导致桌子翻倒。他头上戴着一个蓝色的桶，表情惊讶。随后，他坐在地上，用爪子调整桶的位置，显得有些困惑和不满。",
    "E81.Posse.Cat_scene045.mp4": "一只穿着牛仔服的小老鼠站在木门前，手里拿着一张纸。一只戴着粉色领巾的蓝猫从门后跳出来，愤怒地扑向小老鼠，但被小老鼠用纸挡住。猫愤怒地抓起纸，仔细阅读后，表情更加愤怒。",
    "E81.Posse.Cat_scene046.mp4": "视频展示了一张纸，上面写着：“作为对杰瑞老鼠合作的回报，我同意从现在起分享我的晚餐，50-50，签署……汤姆猫。”纸张被两只手拿着，背景是绿色的。",
    "E81.Posse.Cat_scene047.mp4": "一只戴着牛仔帽的老鼠站在木门前，面对着一只拿着纸张的猫。猫一开始表情严肃，随后弯下身子，似乎在与老鼠互动。老鼠伸出手，猫也伸出手，似乎在握手。背景是绿色的草地和木栅栏。",
    "E81.Posse.Cat_scene048.mp4": "视频中，一只穿着牛仔服装的猫正在追捕一只小老鼠。猫手持两把蓝色的左轮手枪，不断射击，但子弹却总是打空。小老鼠则在地面上快速奔跑，躲避猫的攻击。整个场景充满了西部牛仔风格的元素，如牛仔帽、枪支和西部背景。",
    "E81.Posse.Cat_scene050.mp4": "一只戴着帽子的老鼠从门后探出头，手里拿着一张纸，纸上写着“为杰瑞·马克的50-50合作，今晚”。突然，纸被子弹击中，上面出现多个弹孔，老鼠惊恐地后退。",
    "E81.Posse.Cat_scene051.mp4": "视频中，猫汤姆戴着牛仔帽和粉色围巾，坐在长凳上，手里拿着一把蓝色手枪，面前放着一盘奶油蛋糕。他先是开枪，然后表情变得愤怒。老鼠杰瑞戴着牛仔帽，从左侧出现，靠近蛋糕。杰瑞突然用爪子抓起蛋糕，汤姆被奶油溅了一身，愤怒地跳起来追赶杰瑞。汤姆在追逐过程中，用一根棍子挑起一个燃烧的火圈，试图用它来对付杰瑞。",
    "E81.Posse.Cat_scene052.mp4": "一只小老鼠背着一个黑色的物体，在草地上奔跑，跑向一扇门，撞上门后被弹回，挂在门上。",
    "E81.Posse.Cat_scene053.mp4": "汤姆穿着粉色披风，手持一根长杆，杆子前端有一个燃烧的轮子，他正在草地上快速奔跑，背景是紫色的山丘和绿色的田野。",
    "E81.Posse.Cat_scene054.mp4": "一只戴着帽子的小老鼠从一扇门后探出头来，然后迅速跑开。接着，一只蓝色的猫从门后冲出来，追逐小老鼠，但最终只留下空荡荡的门口。背景是乡村景色，有栅栏和远处的建筑物。",
    "E81.Posse.Cat_scene055.mp4": "一个穿着蓝色裤子和棕色靴子的角色正在桌子旁切东西，突然一只戴着粉色围巾的猫从右侧冲进来，用一根棍子击打角色的臀部，导致角色被击飞并摔倒在地。猫继续挥舞棍子，棍子末端发出火花，角色的靴子掉落在地上。",
    "E81.Posse.Cat_scene056.mp4": "视频展示了一个西部风格的场景，从一个房间的门口向外看去，可以看到广阔的草原和远处的山脉，天空呈现出绚丽的晚霞色彩。首先，一个黄色的激光束从左侧射出，击中远处的地面，随后一只蓝色的猫从门内冲出，被激光击中后飞向远方。接着，一个穿着蓝色衣服、戴着白色帽子的牛仔从门内冲出，手持两把枪，向远处射击，子弹在空中留下轨迹。随后，一个戴着黑色帽子、手持红色锤子的小男孩从门内出现，他小心翼翼地靠近门口，似乎在观察外面的情况。最后，画面逐渐变暗，最终显示“THE END”的字样。",
    "E81.Posse.Cat_scene057.mp4": "视频显示了“THE END”字样，随后逐渐显示出“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题，背景为红色，文字为蓝色和白色，具有复古卡通风格。"
}