{
    "S1950E43 - Touché, Pussy Cat!_scene001.mp4": "画面从全黑逐渐过渡，出现米高梅卡通的标志，标志中央是狮子头像，下方有“CARTOON”和“COLOR BY TECHNICOLOR”字样，背景为深蓝色。",
    "S1950E43 - Touché, Pussy Cat!_scene002.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面。",
    "S1950E43 - Touché, Pussy Cat!_scene003.mp4": "视频开始时展示了《Tom and Jerry》的标题画面，随后切换到该动画短片《Touche, Pussy Cat!》的制作人员名单，包括导演、动画师、背景绘制师、音乐制作人等。最后，画面转为黑色，接着出现一个戴着黄色帽子、手持剑的小老鼠角色在夜晚的屋顶上奔跑。",
    "S1950E43 - Touché, Pussy Cat!_scene005.mp4": "在夜晚的户外，一只穿着蓝色衣服、戴着紫色帽子的老鼠从左侧跑入画面，停在一只绿色的茶壶前。茶壶里伸出一只手，手里拿着一张纸。老鼠用爪子接过纸，展开后仔细阅读。",
    "S1950E43 - Touché, Pussy Cat!_scene006.mp4": "视频展示了一封手写的信件，信件内容为：“亲爱的杰瑞船长：这是我的儿子，你答应要让他成为一只小老鼠。谢谢你，你的老朋友，弗朗索瓦·老鼠。” 信件被一只手拿着，背景是蓝色的布料。镜头逐渐拉远，完整展示信件内容。",
    "S1950E43 - Touché, Pussy Cat!_scene008.mp4": "一只穿着红色连衣裙和紫色头饰的老鼠坐在地上，背景是深色的地面和岩石。老鼠的表情显得有些悲伤或沉思，眼睛微微闭合，似乎在思考或感到难过。整个画面给人一种安静、忧郁的氛围。",
    "S1950E43 - Touché, Pussy Cat!_scene010.mp4": "一只穿着红色斗篷、戴着黑色帽子的灰色猫，手持一把剑，自信地在夜晚的街道上行走。背景是石砌建筑和楼梯，天空中有星星闪烁。猫的步伐稳健，表情得意，似乎在巡视或准备执行某项任务。",
    "S1950E43 - Touché, Pussy Cat!_scene011.mp4": "两个穿着斗篷、戴着帽子的老鼠在深色的背景下进行剑术对决。较大的棕色老鼠挥舞着剑，较小的灰色老鼠则紧随其后，也挥舞着剑。它们在移动中进行对战，棕色老鼠逐渐将灰色老鼠逼退，最终灰色老鼠被击退到画面边缘。",
    "S1950E43 - Touché, Pussy Cat!_scene012.mp4": "在夜晚的河边，穿着红色背心和黑色帽子的猫汤姆与站在木桶上的小老鼠杰瑞对峙。杰瑞戴着黄色帽子，手持一把小剑，显得非常自信。汤姆则摆出一副准备战斗的姿态，两人目光对视，气氛紧张。随后，汤姆挥舞着剑，杰瑞则用剑抵挡，两人开始了一场剑术对决。杰瑞的剑被汤姆的剑击中，剑身弯曲，杰瑞显得有些惊讶。汤姆则露出得意的笑容，似乎占据了上风。背景是夜晚的河流和远处的房屋，整个场景充满了紧张和幽默的氛围。",
    "S1950E43 - Touché, Pussy Cat!_scene013.mp4": "一个穿着紫色帽子和蓝色背心的小老鼠，手持一把剑，从画面右侧跑向左侧。背景是一面由许多圆形洞口组成的墙壁。小老鼠跑动时，剑尖划过地面，最终停在墙前，剑尖指向地面。",
    "S1950E43 - Touché, Pussy Cat!_scene014.mp4": "视频中，一只穿着红色背心、戴着黑色帽子的猫（汤姆）手持剑，与一只戴着黄色帽子、穿着白色裤子的小老鼠（杰瑞）对峙。背景是夜晚的城堡和桥梁，氛围紧张。随后，场景切换到室内，一只戴着紫色帽子的老鼠正在用羽毛笔书写文件，旁边站着另一只老鼠，似乎在等待或观察。室内有烛光照明，营造出神秘的氛围。",
    "S1950E43 - Touché, Pussy Cat!_scene015.mp4": "视频展示了一封手写信件，信件内容为：“Dear Francois, It is with deep regret that I must inform you that your son will never make a houseketeer.” 信件的结尾是“Sincerely”，并且“never”一词被划线强调。镜头逐渐向下移动，最后出现了一个模糊的徽章图案，上面有“KING HOUSEKETEER”字样。",
    "S1950E43 - Touché, Pussy Cat!_scene016.mp4": "视频展示了一个动画场景，背景是“国王的鼠骑士总部”，两个穿着鼠骑士服装的老鼠出现在门口。一个棕色老鼠手持卷轴，向一个灰老鼠传达信息，灰老鼠拿着剑，表情失落，随后转身离开，沿着黑暗的街道走去。",
    "S1950E43 - Touché, Pussy Cat!_scene017.mp4": "一只穿着蓝色制服、戴着紫色帽子的老鼠站在“国王的鼠兵团总部”门前，双臂交叉，表情严肃。",
    "S1950E43 - Touché, Pussy Cat!_scene018.mp4": "一只戴着黄色帽子、披着紫色披风的老鼠，手持一把剑，在夜晚的洞穴中行走。它从洞穴深处慢慢走出，洞外是星空下的古老建筑。老鼠在行走过程中，突然转身，挥舞着剑，似乎在警惕或准备战斗。",
    "S1950E43 - Touché, Pussy Cat!_scene019.mp4": "在一座城堡的庭院中，穿着骑士服装的汤姆和杰瑞正在进行一场剑术对决。汤姆挥舞着剑，杰瑞则灵活地躲避并反击。两人的剑锋相交时，会产生火花四溅的效果，显示出激烈的战斗场面。背景是古老的石墙和城堡建筑，营造出一种中世纪的氛围。",
    "S1950E43 - Touché, Pussy Cat!_scene020.mp4": "视频中，一只穿着黄色帽子和紫色裙子的小老鼠手持一把剑，在石板地上奔跑。它突然被一只穿着红色斗篷、戴着黑色帽子的大猫用剑刺中，倒在地上。大猫随后转身，露出背影，可以看到它穿着一件紫色的裙子，而小老鼠则从它的脚边爬过。整个场景发生在一个夜晚的石板地上，背景中有树木和星星。",
    "S1950E43 - Touché, Pussy Cat!_scene021.mp4": "两个穿着盔甲的小老鼠在石板路上奔跑，随后被一只穿着红色斗篷、戴着黑色帽子的猫用剑击中，小老鼠被击倒在地。猫继续挥剑，小老鼠试图反击但被击退。猫得意地摆出姿势，小老鼠则在地上挣扎。",
    "S1950E43 - Touché, Pussy Cat!_scene022.mp4": "一只老鼠从木头洞里探出头，被一只猫的爪子抓住，随后被拉进洞里。",
    "S1950E43 - Touché, Pussy Cat!_scene023.mp4": "动画片中的猫汤姆穿着红色和黄色的斗篷，戴着黑色帽子，手持一把黄色的剑。他先是站立，随后转身并做出挥剑的动作，最后倒在地上。场景背景是夜晚的街道，有石板路和木桶。",
    "S1950E43 - Touché, Pussy Cat!_scene025.mp4": "一只穿着黄色帽子和白色裤子的小老鼠，手持一把剑，在石质地面上奔跑。它从左侧跑向右侧，途中遇到几个喷水口，水柱喷出，溅起水花。小老鼠继续向前奔跑，似乎在躲避水柱。",
    "S1950E43 - Touché, Pussy Cat!_scene026.mp4": "一个穿着超级英雄服装的猫角色，戴着帽子，表情严肃。随后他摔倒在地，帽子掉落，镜头聚焦于地面的裂缝。",
    "S1950E43 - Touché, Pussy Cat!_scene027.mp4": "一只小老鼠在管道间奔跑，管道中喷出水流，小老鼠用尾巴卷住一个黄色的球，躲避水流冲击。",
    "S1950E43 - Touché, Pussy Cat!_scene028.mp4": "动画片中的猫汤姆穿着红色斗篷和黑色帽子，手持一把剑，正在奔跑。他表情严肃，似乎在执行某个任务。随着他的奔跑，剑尖划过空气，留下一道白色的轨迹。背景是模糊的蓝色墙壁，上面有一些棕色的装饰物。汤姆的斗篷随风飘扬，显示出他奔跑的速度。",
    "S1950E43 - Touché, Pussy Cat!_scene029.mp4": "夜晚，一只穿着红色斗篷、戴着黑色帽子的猫从一扇木门后走出，随后被一扇蓝色铁栅门挡住，猫试图从门下钻过，但最终被门挡住了去路。",
    "S1950E43 - Touché, Pussy Cat!_scene030.mp4": "一只戴着黄色帽子、手持长剑的小老鼠在昏暗的房间里奔跑，它挥舞着剑击打一扇木门，导致门上溅出大量粉红色液体。",
    "S1950E43 - Touché, Pussy Cat!_scene031.mp4": "一个黄色头发的小人被紫色的液体包围，液体中有气泡，小人似乎在挣扎。镜头逐渐拉远，显示出液体覆盖了整个画面，小人的身影越来越小。",
    "S1950E43 - Touché, Pussy Cat!_scene032.mp4": "动画片中的汤姆猫穿着红色斗篷和黑色帽子，手持一把剑，在灰暗的背景下奔跑。他的表情显得兴奋和自信，斗篷在奔跑中飘扬，剑在身后拖曳出一条线。背景是模糊的灰色地面和天空，营造出一种紧张而充满动感的氛围。",
    "S1950E43 - Touché, Pussy Cat!_scene033.mp4": "动画片中，汤姆穿着红色斗篷和黑色帽子，从街道上飞奔而来，突然被一股紫色液体淹没。液体中，杰瑞戴着黄色帽子，从液体中浮出，游到街道边，爬上台阶，然后躲在角落里。",
    "S1950E43 - Touché, Pussy Cat!_scene034.mp4": "画面中，一个蓝色的生物在粉红色的液体中游动，它的尾巴上有白色条纹。液体表面漂浮着几个绿色的瓶子和一个棕色的圆柱形物体。背景是一个灰色的洞穴或房间，有一个方形的开口。生物游向洞穴开口，然后消失在其中。液体表面泛起涟漪，瓶子和圆柱形物体随波逐流。",
    "S1950E43 - Touché, Pussy Cat!_scene036.mp4": "视频中，一只穿着蓝色衣服、戴着紫色帽子的棕色老鼠正用剑指着一只戴着黄色帽子、紫色发饰的灰色老鼠。灰色老鼠看起来很害怕，但随后它开始微笑并向前爬行。镜头逐渐缩小，最终只剩下灰色老鼠的脸部特写，然后画面变黑，出现“The End”的字样。",
    "S1950E43 - Touché, Pussy Cat!_scene037.mp4": "视频显示了“THE END”的字样，随后逐渐显示出“An MGM Tom and Jerry Cartoon MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。最后画面变黑。"
}