{
    "E74.Jerry.and.Jumbo_scene001.mp4": "视频开始时画面为全黑，随后出现米高梅动画公司的标志，标志中央是一只咆哮的狮子，下方有“A Metro-Goldwyn-Mayer CARTOON”字样，底部标注“COLOR BY TECHNICOLOR”。背景为深红色，整体画面逐渐由暗变亮，最终稳定在标志上。",
    "E74.Jerry.and.Jumbo_scene002.mp4": "这是一个米高梅动画片的开场标志，背景为红色，中央有一个蓝色边框的圆形，里面是一只咆哮的狮子。下方写着“A Metro-Goldwyn-Mayer CARTOON”，并注明“COLOR BY TECHNICOLOR”。狮子在标志中不断张嘴咆哮，表现出生动的动态效果。",
    "E74.Jerry.and.Jumbo_scene003.mp4": "视频展示了米高梅动画的片头，先是米高梅的狮子标志和“Cartoon”字样，接着画面转黑，最后出现“Tom and Jerry”的标题，背景为红黄相间的同心圆。",
    "E74.Jerry.and.Jumbo_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景是红色渐变的同心圆，前景是卡通猫汤姆和老鼠杰瑞的头像，下方有黄色的“TOM and JERRY”字样。随后画面叠加了“JERRY and JUMBO”和导演信息“Directed by WILLIAM HANNA and JOSEPH BARBERA”。",
    "E74.Jerry.and.Jumbo_scene005.mp4": "这是一个动画片的片头，标题为“Jerry and Jumbo”，由William Hanna和Joseph Barbera执导。画面中，一只穿着马戏团服装的大象站在一个装饰有星星的圆柱形底座上，举着一个球。旁边，一只戴着礼帽的小老鼠在挥手。背景是渐变的蓝色天空，底部是深色的地面。画面下方还显示了动画师、背景设计师的名字以及版权信息。",
    "E74.Jerry.and.Jumbo_scene006.mp4": "这是一个动画片的片头，展示了制作人员名单，包括动画师Kenneth Muse、Irven Spence和Ed Barge，背景绘制师Robert Gentle，音乐由Scott Bradley创作。片头还显示了制作人Fred Quimby的名字，并有版权信息和制作公司Loew's Incorporated的标志。整个画面背景为蓝色，文字以黄色和红色呈现，风格复古。",
    "E74.Jerry.and.Jumbo_scene007.mp4": "视频开始时显示“PRODUCED BY FRED QUIMBY”的字样，随后画面转为黑色，最后呈现一个夜晚的村庄全景，村庄中房屋的窗户透出灯光，远处有山丘和河流。",
    "E74.Jerry.and.Jumbo_scene009.mp4": "夜晚，一只小老鼠从灌木丛中跑出，沿着小路向一栋亮着灯的房子跑去。它跑到门前，用鼻子推开门，然后迅速跑进屋内。",
    "E74.Jerry.and.Jumbo_scene011.mp4": "汤姆猫裹着毯子在房间里走动，不小心被绊倒，毯子掉在地上。他醒来后发现毯子被弄脏了，于是生气地拿着毯子跑向房间另一侧，最终把毯子扔进一个标有“TOM”的篮子里，然后躺进去睡觉。",
    "E74.Jerry.and.Jumbo_scene012.mp4": "一只小象从门后探出头，先是好奇地张望，然后开心地微笑并伸出鼻子指向某个方向。",
    "E74.Jerry.and.Jumbo_scene013.mp4": "汤姆猫在篮子里睡觉，突然被碗里的牛奶溅到，他惊醒并抓起碗，然后愤怒地离开。",
    "E74.Jerry.and.Jumbo_scene014.mp4": "小象从墙角探出头，悄悄观察四周。随后，它从墙角爬出，小心翼翼地向右移动。此时，汤姆猫拿着一个黄色的盘子从墙角出现，他快速地向右跑动，经过绿色沙发，最终消失在画面右侧。小象则从沙发后面探出头，继续观察汤姆猫的动向。",
    "E74.Jerry.and.Jumbo_scene015.mp4": "一只老鼠正在冰箱前偷喝牛奶，突然被猫发现，老鼠惊慌逃跑，猫则愤怒地拿着盘子追赶。",
    "E74.Jerry.and.Jumbo_scene016.mp4": "一只棕色的老鼠站在墙角，紧张地盯着前方，不断出汗，最后汗滴落在地上。",
    "E74.Jerry.and.Jumbo_scene017.mp4": "在厨房里，汤姆猫手持一个黄色的盘子，站在冰箱旁边，目光凶狠地盯着站在台面上的杰瑞鼠。杰瑞鼠则显得有些紧张，身体微微后缩，但仍然保持着警惕的姿态。汤姆猫似乎在威胁或准备攻击杰瑞鼠，而杰瑞鼠则在努力保持镇定，试图躲避汤姆猫的注意。整个场景充满了紧张的气氛，展现了经典动画片中猫鼠之间的追逐与对抗。",
    "E74.Jerry.and.Jumbo_scene018.mp4": "小象从绿色沙发后面探出头，用鼻子轻轻触碰沙发边缘，然后慢慢将鼻子收回。",
    "E74.Jerry.and.Jumbo_scene019.mp4": "汤姆拿着一个黄色的盘子，试图用它砸杰瑞，但杰瑞敏捷地躲开了，导致盘子摔碎在台面上，汤姆无奈地看着满地的碎片。",
    "E74.Jerry.and.Jumbo_scene020.mp4": "小象躲在绿色沙发后面，探出头来，一只小老鼠突然从它鼻子前飞过，小象惊讶地张大了嘴，随后小象和小老鼠都消失了。",
    "E74.Jerry.and.Jumbo_scene021.mp4": "汤姆猫在厨房里，看到台面上散落的奶酪片，他伸出爪子拿起一片，又拿起另一片，将它们叠在一起。然后，他满意地看着自己的杰作，接着转身跑开。",
    "E74.Jerry.and.Jumbo_scene022.mp4": "一只灰色的猫从画面右侧跑入，经过一个绿色的沙发，然后从沙发后面跑出画面。",
    "E74.Jerry.and.Jumbo_scene023.mp4": "视频中，一只小象从沙发后面探出头，与一只小老鼠互动。小象用鼻子卷起小老鼠，带它到厨房，小老鼠站在小象的鼻子上，从橱柜里拿走一袋花生。小老鼠在花生袋上跳跃，花生洒落一地，小象开心地享受花生。",
    "E74.Jerry.and.Jumbo_scene024.mp4": "一只名叫汤姆的灰色猫在标有“TOM”的篮子里睡觉，随后醒来并警觉地看向一侧。",
    "E74.Jerry.and.Jumbo_scene025.mp4": "一只小老鼠坐在小象的头上，小象突然向前奔跑，小老鼠被甩出，挂在墙上，小象的鼻子伸出来试图抓住它，但小老鼠最终掉落在地上并消失。",
    "E74.Jerry.and.Jumbo_scene026.mp4": "一只老鼠从门后跑过，随后一只小象也从门后跑过，门被关上。",
    "E74.Jerry.and.Jumbo_scene027.mp4": "汤姆猫走进厨房，看到地板上散落着许多花生，他停下脚步，好奇地低头观察。",
    "E74.Jerry.and.Jumbo_scene028.mp4": "一个灰色的小鲨鱼从门缝中探出头来，眼睛圆睁，嘴巴微张，似乎在好奇地观察外面的世界。背景是黄色的墙壁和绿色的地板，旁边有一个米色的烤箱。",
    "E74.Jerry.and.Jumbo_scene029.mp4": "一只灰色的猫站在厨房地板上，面前散落着一排花生。猫先是惊讶地看着花生，然后用爪子捂住嘴巴，表情显得非常震惊和困惑。花生在地板上逐渐排列成一条直线，猫则保持着惊讶的表情，眼睛睁得很大，似乎对这一幕感到不可思议。",
    "E74.Jerry.and.Jumbo_scene030.mp4": "视频展示了一个厨房角落，地上散落着一些黄豆，旁边放着一把绿色扫帚和红色簸箕。黄豆从左侧逐渐滚落至右侧，随后一只灰色的猫（汤姆）从左侧门后探出头来，好奇地观察着地上的黄豆，然后慢慢缩回门后。整个场景色彩鲜明，充满卡通风格。",
    "E74.Jerry.and.Jumbo_scene031.mp4": "视频展示了一只猫（汤姆）在厨房门口的场景。起初，地板上有一排豆子，随后猫从左侧跑入画面，靠近门并试图打开它。猫先是用鼻子嗅门，然后用爪子抓门把手，试图开门。整个过程中，猫表现出急切和专注的神情。背景中可以看到一个烤箱和黄色的墙壁。",
    "E74.Jerry.and.Jumbo_scene032.mp4": "在一间昏暗的房间里，一只小老鼠拿着油漆刷，先是用红色油漆涂在小象的鼻子上，然后用黄色油漆涂在小象的身上。小象一开始显得有些害怕，但随后开始享受这个过程，脸上露出开心的笑容。整个场景充满了欢乐和温馨的氛围。",
    "E74.Jerry.and.Jumbo_scene033.mp4": "汤姆猫用力砸门，门被砸出裂痕。他打开门后，发现杰瑞鼠拿着锤子站在门口，杰瑞鼠用锤子砸向汤姆猫，汤姆猫被砸中后飞了出去。",
    "E74.Jerry.and.Jumbo_scene034.mp4": "汤姆猫用力拍打一扇门，门被撞开后，杰瑞鼠从门后探出头来，手里拿着锤子，对汤姆猫进行攻击，汤姆猫被锤子击中后倒地。",
    "E74.Jerry.and.Jumbo_scene035.mp4": "汤姆猫在门口试图阻止杰瑞鼠进入，他先是用力拉门，但杰瑞鼠从门缝中溜了进来。汤姆猫随后用棒球棒试图击打杰瑞鼠，但杰瑞鼠用锤子反击，最终汤姆猫被击倒在地。",
    "E74.Jerry.and.Jumbo_scene036.mp4": "汤姆拿着棒球棒，试图打开门，但被杰瑞从门后偷袭，被杰瑞用鼻子顶住棒球棒，汤姆被顶得直不起腰，杰瑞得意洋洋地站在汤姆面前。",
    "E74.Jerry.and.Jumbo_scene037.mp4": "动画片中的猫汤姆在空中伸展身体，背景是窗帘和墙壁。",
    "E74.Jerry.and.Jumbo_scene038.mp4": "动画片中，汤姆猫从书桌后探出头，纸张四散飞舞。随后，他从书桌后跳出来，跑到门口，拿着棒球棒，用力拉门把手，试图打开门。",
    "E74.Jerry.and.Jumbo_scene039.mp4": "汤姆猫躲在门后，手持棒球棒，警惕地观察着门外的情况。",
    "E74.Jerry.and.Jumbo_scene041.mp4": "猫汤姆拿着棒球棒从墙角跑出来，他看到地上的捕鼠器后，迅速躲到墙洞里。随后，他从洞里探出头，用爪子调整捕鼠器的位置，然后退回到洞里。接着，一只老鼠从洞里探出头，用手指指向捕鼠器，然后迅速缩回洞里。",
    "E74.Jerry.and.Jumbo_scene042.mp4": "动画片中的猫汤姆在房间里奔跑，突然被水滑倒，然后挣扎着站起来继续奔跑。",
    "E74.Jerry.and.Jumbo_scene043.mp4": "一只灰色的猫（汤姆）在房间里奔跑，突然被一个捕鼠夹夹住，身体被弹起并翻滚，最后落地后显得非常惊讶和痛苦。",
    "E74.Jerry.and.Jumbo_scene044.mp4": "一只小老鼠在房间里奔跑，突然从地板洞里钻出一只猫，猫扑向老鼠但被弹开，最终猫趴在地板上，眼睛盯着洞口。",
    "E74.Jerry.and.Jumbo_scene045.mp4": "一只大老鼠站在角落，伸出戴着白手套的手，似乎在与一只小老鼠互动。小老鼠站在地上，看着大老鼠的手，显得有些紧张或好奇。大老鼠的手在不断摆动，像是在打招呼或试图吸引小老鼠的注意。整个场景发生在室内，背景是墙壁和地板，氛围轻松有趣。",
    "E74.Jerry.and.Jumbo_scene046.mp4": "汤姆猫用扫帚扫地时，意外扫出一个毛绒玩具熊，接着玩具熊突然活过来，将汤姆猫压在身下。汤姆猫被压得变形，最终被玩具熊拖着走下楼梯，变成了一条弯曲的“面条”状。",
    "E74.Jerry.and.Jumbo_scene047.mp4": "一只棕色的小老鼠在房间里快乐地奔跑，它从一个角落跑到另一个角落，经过家具和装饰品，最后在地板上留下了一串脚印。",
    "E74.Jerry.and.Jumbo_scene049.mp4": "一只棕色的小老鼠从一扇绿色的门后跑出来，沿着房屋外墙的红色砖墙快速奔跑。房屋的窗户透出温暖的灯光，窗台上摆放着紫色的花朵。夜空中挂着一轮明月。",
    "E74.Jerry.and.Jumbo_scene051.mp4": "视频开始时显示“THE END”字样，背景为红色渐变。随后，画面逐渐过渡，显示出“An MGM Tom and Jerry CARTOON”字样，下方标注“MADE IN HOLLYWOOD, U.S.A.”，背景保持红色渐变。最后画面逐渐变暗。"
}