{
    "E60.Slicked-up.Pup_scene001.mp4": "视频开始时是全黑画面，随后出现米高梅动画的标志，标志中有一只咆哮的狮子，下方有“A Metro-Goldwyn-Mayer CARTOON COLOR BY Technicolor”的文字。",
    "E60.Slicked-up.Pup_scene002.mp4": "这是一个米高梅动画片头，背景为深红色，中央有一个圆形框架，里面是一只咆哮的狮子。框架下方有金色大字“CARTOON”，上方写着“A METRO-GOLDWYN-MAYER”，底部标注“COLOR BY Technicolor”。狮子在框架内不断咆哮，表情生动。",
    "E60.Slicked-up.Pup_scene003.mp4": "视频展示了米高梅动画公司的标志，随后出现《猫和老鼠》的标题画面。",
    "E60.Slicked-up.Pup_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为红色渐变圆形图案。画面中央是灰色的猫汤姆和棕色的老鼠杰瑞，汤姆张大嘴巴，杰瑞则显得调皮活泼。下方是黄色的“TOM and JERRY”字样。随后，画面中出现粉色的标题“Slicked-up Pup”以及导演名字“Directed by WILLIAM HANNA and JOSEPH BARBERA”。",
    "E60.Slicked-up.Pup_scene005.mp4": "视频片段展示了动画片《Slicked-up Pup》的片头。首先，标题“Slicked-up Pup”以粉色字体出现在深绿色背景上，旁边有一个黑色剪影的小狗在小船上吹泡泡。接着，导演William Hanna和Joseph Barbera的名字出现。随后，动画师名单和音乐制作人Scott Bradley的信息依次显示。最后，制片人Fred Quimby的名字以蓝色字体呈现，整个片头以深绿色背景和逐渐淡出的动画效果结束。",
    "E60.Slicked-up.Pup_scene006.mp4": "一只棕色的斗牛犬正在户外的木桌上洗衣服。它戴着红色项圈，用木制搓衣板在装满肥皂泡水的黑色大盆里搓洗衣物。它时而低头搓洗，时而抬头享受泡沫，表情满足。背景是蓝天、绿树和白色栅栏，环境宁静。",
    "E60.Slicked-up.Pup_scene008.mp4": "一只棕色的小老鼠在后院的草地上奔跑，它跑向木制平台。随后，一只蓝灰色的猫从画面右侧出现，追逐着小老鼠，猫在草地上快速奔跑，最终跳上了木制平台。",
    "E60.Slicked-up.Pup_scene009.mp4": "一只老鼠在地板上奔跑，突然看到一个洞，它停下来观察。接着，一只猫从洞里伸出爪子，把老鼠抓了起来。猫把老鼠放在地上，然后用爪子按住它。最后，猫把老鼠放在一只小狗的身上，小狗看起来很害怕。",
    "E60.Slicked-up.Pup_scene011.mp4": "一只棕色的小老鼠从地板上的洞里探出头来，面带微笑，眼睛睁大，显得非常开心和兴奋。背景是浅蓝色的墙壁和黄色的地板，地板上有几条平行的线条。",
    "E60.Slicked-up.Pup_scene012.mp4": "一只灰色的猫和一只棕色的狗在房屋外的草地上对峙。狗显得非常愤怒，不断挥舞着拳头，而猫则表现出害怕和惊慌，用手捂住脸。随后，狗转身离开，猫则站在原地，先是惊恐地四处张望，然后变得愤怒，挥舞着双臂。",
    "E60.Slicked-up.Pup_scene013.mp4": "一只小猫躺在木制门廊上，一只蓝猫走近并表现出愤怒和威胁的姿态。小猫突然咬住木板，木板断裂，蓝猫被夹住并被弹飞出去，最终消失在画面中。",
    "E60.Slicked-up.Pup_scene014.mp4": "一只小狗狗从空中落下，被汤姆猫用爪子接住。汤姆猫被泥水溅到，站起身来，把小狗狗举在头顶，然后又把小狗狗扔了出去。",
    "E60.Slicked-up.Pup_scene015.mp4": "汤姆猫捡起一只小狗，但小狗身上有污渍，汤姆猫试图用各种方法清洁小狗，包括用毛巾擦拭、用刷子刷洗和用喷雾喷洒，最终小狗变得干净了，汤姆猫满意地看着它。",
    "E60.Slicked-up.Pup_scene016.mp4": "一只小老鼠在地板上拖着一个蓝色的物体，突然，一只猫从画面左侧冲入，试图抓住老鼠，但老鼠迅速逃跑，猫在追赶过程中滑倒，最终猫消失在画面中，只留下地板上的蓝色物体。",
    "E60.Slicked-up.Pup_scene018.mp4": "一只小老鼠在花园里奔跑，它看到一个大番茄，便用力把它摘下来扛在肩上，然后跑开。",
    "E60.Slicked-up.Pup_scene019.mp4": "汤姆猫在院子里奔跑，突然被两个飞来的红色飞盘击中，他痛苦地捂住脸，随后张大嘴巴，露出舌头，表情夸张。接着，他向后翻滚，最后飞出画面。",
    "E60.Slicked-up.Pup_scene020.mp4": "一只灰色的猫从画面右侧跳入，撞到墙后倒地，身上溅满红色液体，表情痛苦。背景中，一只棕色的小狗趴在墙头，似乎在观察。",
    "E60.Slicked-up.Pup_scene021.mp4": "在后院的草坪上，一只小老鼠杰瑞从右侧跑出来，朝前方跑去。突然，一只大猫汤姆从右侧冲出来，追逐杰瑞。汤姆在追逐过程中翻滚着向前冲，最终消失在画面中。",
    "E60.Slicked-up.Pup_scene022.mp4": "一只棕色的小老鼠从画面右侧跑入，穿过草坪，跳上木制平台。随后，一只蓝灰色的猫从画面右侧飞扑而出，紧追小老鼠，最终也跳上了木制平台。",
    "E60.Slicked-up.Pup_scene023.mp4": "汤姆猫在追逐杰瑞鼠的过程中摔倒，表情痛苦。杰瑞鼠拿着墨水瓶和小杯子，站在一旁，似乎在嘲笑汤姆。汤姆猫坐起来，露出得意的笑容，然后站起来离开，杰瑞鼠继续拿着墨水瓶和杯子。",
    "E60.Slicked-up.Pup_scene024.mp4": "汤姆猫从门廊跑下台阶，然后跳过一个水盆，最后消失在画面中。",
    "E60.Slicked-up.Pup_scene025.mp4": "一只小老鼠拿着墨水瓶和刷子，试图在门口涂鸦。猫汤姆突然出现，抓住墨水瓶，小老鼠逃跑。汤姆拿着墨水瓶，摆出各种姿势，似乎在思考如何使用它。",
    "E60.Slicked-up.Pup_scene026.mp4": "一个标有“INK”的墨水瓶从空中掉落，砸在屋顶上，然后弹起并飞向屋檐，最终掉落在屋檐边缘。背景是晴朗的天空和绿色的树木。",
    "E60.Slicked-up.Pup_scene028.mp4": "汤姆猫拿着刷子，把小狗涂满蓝色油漆，然后又用白色油漆涂在小狗身上，小狗从蓝色变成白色。",
    "E60.Slicked-up.Pup_scene029.mp4": "一只棕色的小老鼠正用前爪紧紧抓住一个木制平台的边缘，身体悬挂在平台下方，似乎在努力攀爬或保持平衡。平台上摆放着五个装满不同颜色油漆的油漆桶，颜色从左到右依次为蓝色、橙色、绿色、深蓝色和红色，油漆从桶口溢出，在桶周围形成滴落痕迹。背景是一面浅色的墙壁和绿色的地面。",
    "E60.Slicked-up.Pup_scene030.mp4": "汤姆正在用刷子给小狗刷油漆，他先后使用了黄色、红色、蓝色和绿色的油漆，最后小狗全身被涂成了彩色。汤姆看着被涂满颜色的小狗，表情从得意变为惊讶，最后变得非常沮丧和懊恼。",
    "E60.Slicked-up.Pup_scene031.mp4": "汤姆猫跑向水管，试图抓住水管喷水，但被水管甩开。杰瑞鼠出现，抓住水管并将其拔出，然后迅速跑开。",
    "E60.Slicked-up.Pup_scene032.mp4": "一只老鼠拿着红色的软管，走向一个标有“TAR”的大红色桶，它用嘴咬住软管的喷嘴，然后转动桶上的黄色水龙头，似乎准备抽取桶里的沥青。",
    "E60.Slicked-up.Pup_scene033.mp4": "汤姆拿着水管给站在木桶上的彩色小狗洗澡，小狗被水冲得浑身湿透，变成黑色。汤姆也被水溅到，一脸惊讶。",
    "E60.Slicked-up.Pup_scene034.mp4": "一只戴着红色项圈的棕色斗牛犬站在白色栅栏后，它先是警惕地环顾四周，随后低头嗅闻，接着又抬头四处张望，最后向左转头继续观察。背景是宁静的郊区街道，有房屋、树木和紫色花朵。",
    "E60.Slicked-up.Pup_scene035.mp4": "汤姆猫在院子里被一只小黑狗吓到，他惊慌失措地跳起来，试图抓住小黑狗。结果，他把小黑狗抱起来，小黑狗身上沾满了油漆，汤姆猫也溅了一身油漆，最后汤姆猫被油漆弄得很狼狈。",
    "E60.Slicked-up.Pup_scene037.mp4": "一只戴着红色鸡冠帽的白色小鸡被一只大黑猫抓住，小鸡试图用黄色的物体攻击黑猫，但失败了。小鸡愤怒地咬住黑猫的尾巴，黑猫的尾巴被咬得冒烟，小鸡继续用力咬，最后黑猫的尾巴被咬得变形。",
    "E60.Slicked-up.Pup_scene038.mp4": "汤姆被一只戴着红色帽子的小白狗咬住尾巴，悬在空中，表情痛苦，四肢张开，背景是木栅栏和蓝天。",
    "E60.Slicked-up.Pup_scene039.mp4": "一只戴着红色项圈的棕色斗牛犬在院子里奔跑，它伸出前爪指向远方，随后跃起并用爪子在白色围栏上划出一个大圆圈，最后消失在画面中。",
    "E60.Slicked-up.Pup_scene040.mp4": "汤姆抱着一只戴着红色帽子的小白狗从院子里跑向门口，他把狗塞进屋内后，自己也跟着进去，随后一只大狗从门外冲进来，汤姆迅速把狗塞回屋内并关上了门。",
    "E60.Slicked-up.Pup_scene042.mp4": "汤姆在浴缸里，被泡泡包围，他试图抓住一个红色的瓶子，但瓶子滑落。随后，水从上方喷洒下来，汤姆被淋湿，表情从惊讶变为愤怒。他再次试图抓住瓶子，但瓶子又滑走。水再次喷洒，汤姆被淋得更湿，表情更加愤怒。最后，汤姆愤怒地盯着瓶子，瓶子在泡泡中漂浮。",
    "E60.Slicked-up.Pup_scene043.mp4": "视频展示了一个卡通场景，画面中有一个电视屏幕，屏幕上显示两只狗在洗澡，一只白色的小狗戴着红色帽子，另一只棕色的大狗戴着红色项圈。水从上方洒下，溅起泡沫，两只狗看起来很开心。随后，一只小猫出现在画面左下角，它也加入了洗澡的行列，显得非常高兴。最后，画面逐渐变暗，只留下小猫的脸部特写，然后画面完全变黑，出现“The End”的字样。",
    "E60.Slicked-up.Pup_scene044.mp4": "视频展示了“THE END”字样，随后逐渐显示出“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题，背景为红色渐变。",
    "E60.Slicked-up.Pup_scene045.mp4": "视频展示了MGM动画片《Tom and Jerry》的片头标志，背景为深红色，文字为蓝色，下方标注“MADE IN HOLLYWOOD, U.S.A.”，随后画面转为全黑。"
}