{
    "S1950E36 - Hic-cup Pup_scene001.mp4": "视频开始时是全黑画面，随后出现米高梅卡通片头，背景为深蓝色，中间有“METRO-GOLDWYN-MAYER”字样，下方是“CARTOON”和“COLOR BY TECHNICOLOR”字样，整体风格复古。",
    "S1950E36 - Hic-cup Pup_scene002.mp4": "视频展示了米高梅动画片的开场标志，一只狮子在圆形框架内咆哮，下方有“CARTOON”和“COLOR BY TECHNICOLOR”字样。随后画面转黑，出现“Tom and Jerry”的标题和卡通形象。",
    "S1950E36 - Hic-cup Pup_scene003.mp4": "这是一个《猫和老鼠》动画片的片头画面，背景为深蓝色，画面中央显示着黄色的“Tom and Jerry”字样。左侧是杰瑞，一只棕色的小老鼠，正从洞口探出头，面带微笑，一只前爪抬起。右侧是汤姆，一只灰色的猫，张大嘴巴，露出牙齿，眼睛睁得很大，表情显得非常开心。画面下方逐渐出现“Directed by William Hanna and Joseph Barbera”的字样。",
    "S1950E36 - Hic-cup Pup_scene004.mp4": "视频开始时显示了动画片《猫和老鼠》的片头，标题为“Hic-cup Pup”，由William Hanna和Joseph Barbera执导。随后，屏幕上出现了制作人员名单，包括动画师、背景设计师和音乐作曲家。最后，画面切换到一个夜晚的户外场景，一只大狗抱着一只小猫，旁边有一个狗窝和一个蓝色的婴儿床。",
    "S1950E36 - Hic-cup Pup_scene006.mp4": "动画片段中，一只小老鼠从一扇打开的橙色门前跑出来，随后一只灰猫从门内跳出，追逐小老鼠。猫在追逐过程中被门挡了一下，然后飞出去，消失在画面中。",
    "S1950E36 - Hic-cup Pup_scene007.mp4": "汤姆在草地上追逐杰瑞，最终抓住了它。这时，一只大狗和它的小狗出现在画面中，大狗对汤姆表现出敌意，汤姆则显得紧张和害怕。",
    "S1950E36 - Hic-cup Pup_scene008.mp4": "一只狗和一只猫站在竖条纹墙前，狗戴着红色项圈，表情愤怒，张嘴咆哮，猫则面带微笑，看起来很淡定。狗咆哮了几声后，表情变得疑惑，身体微微前倾。",
    "S1950E36 - Hic-cup Pup_scene009.mp4": "在户外的草地上，一只大狗站在一个蓝色婴儿车旁，车里躺着一只小猫。大狗看起来很生气，对着站在一旁的灰色猫（汤姆）大声说话。随后，大狗弯下腰，把小猫从婴儿车里抱起来，紧紧抱住，似乎在保护或展示它。汤姆则在一旁观察，表情显得有些惊讶和担忧。整个场景充满了紧张和戏剧性。",
    "S1950E36 - Hic-cup Pup_scene010.mp4": "一只小老鼠紧紧抓住一只大猫的尾巴，表情愤怒，似乎在努力攀爬或逃脱。猫的尾巴在动，老鼠的表情从紧张变为得意，最后猫的尾巴突然裂开，老鼠似乎成功逃脱或制造了混乱。背景是绿色的草地和白色的栅栏。",
    "S1950E36 - Hic-cup Pup_scene011.mp4": "一只大狗正在照顾一只小猪，突然一只猫出现并试图偷走小猪。大狗迅速反应，将小猪抱在怀里保护起来，同时猫被吓跑。大狗显得非常担心和保护小猪，而小猪则看起来很害怕。",
    "S1950E36 - Hic-cup Pup_scene012.mp4": "一只猫从墙后探出头，看到一只老鼠在花盆上，猫迅速扑向花盆，但老鼠逃跑了，猫捡起铲子追赶，最终消失在画面中。",
    "S1950E36 - Hic-cup Pup_scene013.mp4": "在户外的草坪上，一只大狗正温柔地照顾着躺在蓝色婴儿车里的小猫。突然，一只老鼠出现并开始捣乱，大狗试图阻止它。这时，一只拿着铲子的猫（汤姆）冲进来，试图保护小猫。大狗被激怒，开始追赶汤姆，两人在草坪上展开追逐。最终，大狗抓住了汤姆，两人在草坪上扭打在一起。",
    "S1950E36 - Hic-cup Pup_scene014.mp4": "一只小猫从狗窝里爬出来，一只大狗突然出现，将小猫抱起并摇晃。",
    "S1950E36 - Hic-cup Pup_scene015.mp4": "夜晚，一只大狗抱着一只小猫在院子里玩耍，随后大狗将小猫放在蓝色的婴儿车里，自己则躺在一旁。",
    "S1950E36 - Hic-cup Pup_scene016.mp4": "在户外的草地上，一只灰色的狗躺在地上，旁边是一个蓝色的狗窝，里面有一只小猫在睡觉。狗先是看着小猫，然后闭上眼睛睡着了。这时，一只小老鼠从画面下方跑过，接着，一只蓝灰色的猫（汤姆）从画面右侧快速跑入，他停在狗窝前，露出愤怒的表情，然后蹲下身子，似乎在计划如何偷走狗窝里的小猫。",
    "S1950E36 - Hic-cup Pup_scene017.mp4": "一只老鼠坐在一个捕鼠夹上，猫的爪子从左侧伸过来，踩在捕鼠夹上，老鼠被夹住并弹起，随后老鼠站起身来。",
    "S1950E36 - Hic-cup Pup_scene018.mp4": "在户外的草地上，汤姆猫拿着一个装有老鼠的盒子，靠近一个婴儿床，婴儿床里躺着一只小猫。汤姆猫给小猫和旁边躺着的狗戴上耳机，然后突然跳起来大叫，接着他把婴儿床抬起来，似乎在玩耍或制造噪音。整个场景充满了卡通式的幽默和混乱。",
    "S1950E36 - Hic-cup Pup_scene019.mp4": "一只棕色的小老鼠从画面左侧跑向右侧，随后消失在画面中。接着，一只灰色的猫从房屋的墙后跳出来，它迅速跑到红色的水管旁，开始用力地用嘴吸水管里的水，表情显得非常专注和用力。",
    "S1950E36 - Hic-cup Pup_scene020.mp4": "一只小老鼠从管道口被吹出来，然后沿着管道爬行，最后消失在管道的另一端。",
    "S1950E36 - Hic-cup Pup_scene021.mp4": "画面中，一只成年狗和一只小狗都戴着耳机，正在草地上睡觉。成年狗躺在地上，小狗在蓝色的摇篮里。一只老鼠从画面右侧爬入，拖着一根红色的管子，管子末端连接着一个蓝色的喷嘴。老鼠在成年狗旁边爬行，似乎在玩弄管子。背景是一堵白色的栅栏和一些绿色的灌木。",
    "S1950E36 - Hic-cup Pup_scene022.mp4": "画面中，两只戴着耳机的灰色小狗正在户外的狗窝里睡觉，一只在窝里，一只在窝外。一只棕色的小老鼠从远处跑来，它先是靠近狗窝，然后试图跳进窝里，但被狗窝的边缘挡住，最后它跳到了窝外的草地上，继续向前跑。两只小狗始终闭着眼睛，似乎没有被惊醒。背景是绿色的草地和一排灌木丛，远处有白色的栅栏。",
    "S1950E36 - Hic-cup Pup_scene023.mp4": "一只小老鼠拿着喇叭靠近睡着的大狗，大狗被惊醒后，小老鼠跑开，大狗和小狗都坐了起来。",
    "S1950E36 - Hic-cup Pup_scene024.mp4": "汤姆正在院子里用水管喷水，这时一只狗拿着喇叭出现，试图抢夺水管。狗用喇叭对准汤姆，汤姆被喷得倒地，喇叭掉在汤姆头上。汤姆从喇叭里探出头来，表情惊讶。",
    "S1950E36 - Hic-cup Pup_scene026.mp4": "一只灰色的猫躲在灌木丛后，眼睛盯着前方洞口。一只棕色的小老鼠从洞里跑出来，向猫靠近。猫突然扑向老鼠，但老鼠躲开了，猫被撞到灌木丛上。猫从灌木丛后跳出来，追着老鼠跑，但老鼠跑得太快，猫追不上。猫摔倒在地，看起来很沮丧。",
    "S1950E36 - Hic-cup Pup_scene028.mp4": "一只灰色的小猫被一只大狗的尾巴夹住，小猫表情痛苦但保持镇定，大狗的尾巴在小猫的头部上方轻轻摆动。",
    "S1950E36 - Hic-cup Pup_scene029.mp4": "视频中，一只蓝色的猫坐在一只紫色的狗背上，手里拿着一个瓶子。狗突然向前奔跑，猫被甩了下来。猫在地上滚动，然后站起来，与狗对峙。猫和狗各自拿着瓶子，互相喷射，最后狗把瓶子扔在地上，两人再次开始奔跑。",
    "S1950E36 - Hic-cup Pup_scene030.mp4": "在后院的草坪上，汤姆猫从墙后跳出，追赶一只正在奔跑的老鼠杰瑞。汤姆猫追着杰瑞跑动，但杰瑞灵活地躲避着，最终汤姆猫扑空，摔倒在地。",
    "S1950E36 - Hic-cup Pup_scene032.mp4": "一只老鼠从画面左侧跑向右侧，钻进一根黄色的排水管。随后，一只猫从画面左侧跑来，试图抓住老鼠，但老鼠已经进入排水管。猫在排水管旁蹲下，然后试图爬进排水管，但排水管突然倾斜，猫被甩出画面。",
    "S1950E36 - Hic-cup Pup_scene033.mp4": "一只老鼠在屋顶上，猫从下方攀爬黄色排水管试图抓住它，过程中排水管断裂，猫被甩向空中，碎片四散飞溅。",
    "S1950E36 - Hic-cup Pup_scene035.mp4": "一只老鼠从洞里跑出来，拿着一个红色的行李箱和一顶黄色的帽子，把一张写着“请勿打扰”的纸条贴在洞口，然后跑开了。随后，一只猫从画面左侧跑来，看到纸条后停下来，用鼻子嗅了嗅纸条，然后转身离开。",
    "S1950E36 - Hic-cup Pup_scene036.mp4": "一个拱形门上贴着一张纸条，上面写着“GONE SOUTH FOR SAKE OF HEALTH Jerry”，纸条用蓝色图钉固定在橙色的门上，门周围是白色的墙壁和绿色的地面。",
    "S1950E36 - Hic-cup Pup_scene037.mp4": "汤姆猫蹲在墙边，眼睛盯着墙上的小门，随后站直身体，表情专注。",
    "S1950E36 - Hic-cup Pup_scene038.mp4": "一个穿着黄色帽子、背着红色背包的小人沿着铁轨向远方跑去，最终消失在视野中。画面随后逐渐变暗，最后出现“The End”的字样。",
    "S1950E36 - Hic-cup Pup_scene039.mp4": "视频显示了“THE END”的字样，随后出现“An MGM Tom and Jerry Cartoon”和“MADE IN HOLLYWOOD, U.S.A.”的字样。背景为红色，文字为蓝色和白色。"
}