{
    "S1950E47 - Designs On Jerry_scene002.mp4": "这是一个米高梅动画片头，蓝色背景上有一个圆形标志，标志内是一只咆哮的狮子，下方写着“A METRO-GOLDWYN-MAYER CARTOON COLOR BY TECHNICOLOR”。狮子在标志内不断咆哮，嘴巴张合，表情凶猛。",
    "S1950E47 - Designs On Jerry_scene003.mp4": "视频展示了米高梅动画公司的标志，随后切换到《猫和老鼠》的标题画面，其中猫和老鼠的角色形象出现在标题旁。",
    "S1950E47 - Designs On Jerry_scene004.mp4": "这是一个《猫和老鼠》动画片的片头，展示了标题“DESIGNS ON JERRY”，并列出了导演、动画师、背景绘制师、音乐作曲家和制片人等制作人员信息。背景是蓝色的，配有机械设计元素。",
    "S1950E47 - Designs On Jerry_scene005.mp4": "夜晚，一座房子的窗户亮着灯。",
    "S1950E47 - Designs On Jerry_scene006.mp4": "夜晚，镜头缓缓推近一座两层楼的房屋，房屋的屋顶上有一个亮着黄光的窗户。随着镜头推进，画面逐渐聚焦于这个窗户，最终切换到室内视角，可以看到一个穿着蝙蝠侠服装的人物坐在钢琴前。",
    "S1950E47 - Designs On Jerry_scene007.mp4": "在昏暗的阁楼里，一只戴着绿色帽子的蓝色猫坐在画板前，专注地绘画。房间内有一张床、堆叠的纸张和一盏悬挂的灯，墙上挂着一块写着“Build a better mousetrap and the world will beat a path to your door”的牌子。猫逐渐靠近画板，似乎在仔细审视自己的作品。",
    "S1950E47 - Designs On Jerry_scene009.mp4": "一只手拿着红色笔在蓝色背景上画出一个闹钟，然后画出一个滑轮装置、奶酪、一只老鼠和一个洞，并分别标注了“CHEESE”、“MOUSE”和“HOLE”。",
    "S1950E47 - Designs On Jerry_scene010.mp4": "汤姆猫戴着绿色帽子，坐在画架前，手里拿着画笔，似乎在创作。他先是兴奋地挥舞着画笔，随后摘下帽子，走向床边，躺下休息。整个场景发生在阁楼里，背景有斜屋顶和一些家具。",
    "S1950E47 - Designs On Jerry_scene012.mp4": "一个卡通老鼠在蓝色图纸上用红色笔画线，随后老鼠被画线缠住，最后被拉出图纸外。",
    "S1950E47 - Designs On Jerry_scene013.mp4": "一根白色的线从上方垂下，逐渐在空中形成一只卡通老鼠的形状。这只老鼠由线条勾勒而成，有圆圆的眼睛和耳朵，以及弯曲的尾巴。它在空中摆动，仿佛在跳舞或玩耍，最终线的末端在地板上形成一个结。背景是一个木质地板和一些散落的纸张。",
    "S1950E47 - Designs On Jerry_scene015.mp4": "一只棕色的小老鼠在床上睡觉，被一个白色的幽灵老鼠惊醒。幽灵老鼠在床边跳舞，然后用手指戳了戳小老鼠，小老鼠被惊醒后坐起来，看着幽灵老鼠。幽灵老鼠继续跳舞，然后跑出了画面。",
    "S1950E47 - Designs On Jerry_scene016.mp4": "一只白色线条勾勒的老鼠从木制结构的拱形洞口出现，它在洞口附近跳跃和摆动，然后钻进洞里。",
    "S1950E47 - Designs On Jerry_scene017.mp4": "一只小老鼠在床上醒来，先是揉眼睛，然后坐起来，接着躺下睡觉。在它睡着时，一个白色的幽灵老鼠出现在床边，它拉着被子，把小老鼠拉出了床，最后小老鼠被拉走了，床空了。",
    "S1950E47 - Designs On Jerry_scene018.mp4": "动画片段中，一只老鼠正在用一根线在蓝色的画板上画出另一个老鼠的轮廓。随着线的拉扯，真实的老鼠被拉到了画板上，它试图挣脱，但最终被线缠住并拉回了画板上，与画中的老鼠重叠在一起。",
    "S1950E47 - Designs On Jerry_scene020.mp4": "一只棕色的小老鼠拿着一个白色的气球，气球上画着一只老鼠的脸。小老鼠在空中飘荡，随后落在地上，气球掉在地上，变成了一只白色的线条老鼠。白色线条老鼠在地上爬行，然后跑出了画面。",
    "S1950E47 - Designs On Jerry_scene021.mp4": "一个线条勾勒的猫形弹簧装置在蓝图上，随着镜头拉远，弹簧猫从蓝图上弹出，落入灰色的地面，弹簧逐渐伸展，猫形轮廓变得清晰。",
    "S1950E47 - Designs On Jerry_scene022.mp4": "一只白色的猫从螺旋线中出现，它走向一个装有蓝色液体的瓶子，瓶子被一只小老鼠推动，液体喷洒在猫身上，猫被淋湿后变成了一滩水，随后一只老鼠拿着画笔在水迹上画出了猫的轮廓，猫重新出现并被老鼠用画笔画走。",
    "S1950E47 - Designs On Jerry_scene023.mp4": "一只棕色老鼠拿着绿色钢笔，试图用钢笔里的墨水攻击一个由白色线条构成的幽灵老鼠。幽灵老鼠在白色墨水瓶旁躲避并反击，最终棕色老鼠放下钢笔，与幽灵老鼠对峙。",
    "S1950E47 - Designs On Jerry_scene024.mp4": "汤姆躺在床上，张大嘴巴打哈欠，伸展身体，表现出困倦的状态。",
    "S1950E47 - Designs On Jerry_scene025.mp4": "一只小老鼠站在桌面上，面对一瓶白墨水。它用爪子在墨水上画出一个卡通老鼠的轮廓，然后跳到桌面上的蓝色图纸上，用爪子在图纸上画线。接着，它用红笔在桌面上画出一个卡通老鼠的轮廓，然后跳到桌面上的蓝色图纸上，用爪子在图纸上画线。",
    "S1950E47 - Designs On Jerry_scene026.mp4": "视频展示了一张蓝色的蓝图，上面标注了“CLOCK”和“SAFE”。一只棕色的老鼠从右侧跳到一根线上，沿着线向左移动。接着，一只红色的笔在图纸上画出一只白色的老鼠，然后将棕色老鼠拉向左侧。最后，镜头切换到另一部分蓝图，显示了“CHEESE”、“MOUSE”和“HOLE”的位置，白色老鼠从“CHEESE”处被拉向“HOLE”。",
    "S1950E47 - Designs On Jerry_scene027.mp4": "汤姆猫站在一张画有捕鼠装置设计图的蓝色图纸前，兴奋地搓手，随后拿起锯子和锤子，准备按照图纸制作陷阱。",
    "S1950E47 - Designs On Jerry_scene028.mp4": "汤姆猫在阁楼里用锤子敲打木板，试图将一块木板钉在木梁上。他先是用锤子敲击木板，然后用力将木板固定在木梁上，最后用锤子继续敲击木板，直到木板被牢固地固定在木梁上。",
    "S1950E47 - Designs On Jerry_scene029.mp4": "汤姆猫正在用锤子钉一块木板，完成后木板上出现了一个牌子，上面写着“THE BETTER MOUSE TRAP DESIGNED AND BUILT by TOM CAT”。",
    "S1950E47 - Designs On Jerry_scene030.mp4": "视频展示了一个标牌，上面写着“THE BETTER MOUSE TRAP DESIGNED AND BUILT by TOM CAT”，随后镜头向右移动，展示了一个充满各种工具和设备的房间。最后，镜头聚焦在一只猫（汤姆猫）身上，它正在调整一个闹钟。",
    "S1950E47 - Designs On Jerry_scene031.mp4": "汤姆在阁楼里设置陷阱，用绳子吊起一块奶酪，然后铺上地毯。杰瑞从洞里出来，看到奶酪后跑过去，但汤姆突然出现，杰瑞被吓到。汤姆用钟表和锯子等工具制造噪音和干扰，试图吓跑杰瑞，但杰瑞依然勇敢地接近奶酪。",
    "S1950E47 - Designs On Jerry_scene032.mp4": "一个黄色的香蕉被绑在杠杆装置上，随后一个金属重物被放置在杠杆的另一端，导致香蕉被抬起并悬空。",
    "S1950E47 - Designs On Jerry_scene033.mp4": "视频展示了一个复杂的机械装置。一开始，一个金色球体在装置上被触发，导致一个透明板上出现太阳图案。随后，机械装置启动，一个红色水桶被吊起，桶中液体倾泻而出，形成一条长长的液体流。整个过程伴随着机械部件的运动和火花飞溅，显示出装置的精密和动态效果。",
    "S1950E47 - Designs On Jerry_scene034.mp4": "视频展示了一个动画场景，其中有一个紫色的桶放在天平的一端，另一端是空的。桶里有一根象牙，正在不断下降。天平的另一侧是一个正在旋转的风扇，风扇旁边有一个模型船在水面上。镜头逐渐向左移动，聚焦在模型船上，最终模型船被一个黑色的柱子遮挡。",
    "S1950E47 - Designs On Jerry_scene035.mp4": "一个红色台球在绿色台球桌上，旁边是一个装满水的椭圆形水池。水池中突然出现一艘小帆船，船身是红色的，船帆是白色的，船头有一根黑色的杆子。小帆船在水面上航行，船身在水中划出波纹。",
    "S1950E47 - Designs On Jerry_scene036.mp4": "一个红色台球在台球桌上滚动，撞击桌边后反弹，最终停在桌角。随后，镜头转向一个装置，该装置由一个开关、弹簧和一个白色机器组成，机器通过电线连接到墙上的插座。接着，镜头聚焦到一个挂在木杆上的蓝色猎枪，猎枪通过绳子连接到机器。当机器启动时，猎枪被拉紧并发射，产生火焰和黑烟。",
    "S1950E47 - Designs On Jerry_scene037.mp4": "一个红色的挂钟悬挂在木制天花板上，钟的下方垂着两个绿色的钟摆。钟摆突然被击中，发出火花，随后钟摆断裂，消失在画面中。",
    "S1950E47 - Designs On Jerry_scene038.mp4": "一个装饰有红色叶子的木制钟表，钟面显示时间。钟表上方的小门打开，一只红色的小鸟从里面飞出，嘴里叼着一把刀。小鸟沿着一根绳子滑行，刀刃划过绳子，留下划痕。小鸟继续滑行，刀刃再次划过绳子，留下更多的划痕。",
    "S1950E47 - Designs On Jerry_scene039.mp4": "一个蓝色的箱子被绳索吊在木制屋顶下，绳索的另一端连接着一个红色的小鸟屋。小鸟屋上有一只红色的小鸟，它挥舞着一把发光的剑，不断砍向绳索，导致绳索不断断裂和重新连接，箱子随之晃动。",
    "S1950E47 - Designs On Jerry_scene041.mp4": "视频展示了“Tom and Jerry”卡通片的片尾画面，背景为红色，中央有蓝色边框的“The End”字样。随后，画面过渡到MGM的标志和“Tom and Jerry CARTOON”字样，下方标注“MADE IN HOLLYWOOD, U.S.A.”，表明该动画片由好莱坞制作。整个画面保持静态，没有角色或动作出现。",
    "S1950E47 - Designs On Jerry_scene042.mp4": "视频开头显示了“MGM Tom and Jerry Cartoon”标志，随后画面转为全黑，接着出现一些彩色的光点在黑暗背景中闪烁。"
}