{
    "E63.The.Flying.Cat_scene001.mp4": "画面从全黑开始，随后出现米高梅动画公司的标志，标志中央是一只咆哮的狮子，下方有“A METRO-GOLDWYN-MAYER CARTOON”字样，以及“COLOR BY Technicolor”的字样。",
    "E63.The.Flying.Cat_scene002.mp4": "这是一个米高梅动画片的开场标志，背景为红色，中央有一个圆形框架，里面是一只咆哮的狮子。下方有文字“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY Technicolor”。狮子在框架内不断咆哮，表情凶猛。",
    "E63.The.Flying.Cat_scene003.mp4": "视频展示了米高梅动画的标志，随后出现《猫和老鼠》的标题画面，画面中有猫汤姆和老鼠杰瑞的卡通形象。",
    "E63.The.Flying.Cat_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为红色渐变圆环，前景是猫汤姆和老鼠杰瑞的卡通形象，下方有黄色的“TOM and JERRY”字样。随后画面淡入文字“The Flying Cat”，并显示导演信息“DIRECTED BY WILLIAM HANNA AND JOSEPH BARBERA”。",
    "E63.The.Flying.Cat_scene005.mp4": "视频开始时展示了一段动画片的片头，标题为《The Flying Cat》，由William Hanna和Joseph Barbera执导。随后，片头展示了制作团队的名单，包括动画师Kenneth Muse、Irven Spence、Ed Barge和Ray Patterson，音乐由Scott Bradley负责，制片人是Fred Quimby。画面中还包含版权信息和制作公司标志，如Loews Incorporated和Western Electric Sound System。最后，画面逐渐变暗，转到一个昏暗的房间，窗户上挂着一个鸟笼，里面有一只黄色的小鸟，窗外摆放着几盆红色的花。",
    "E63.The.Flying.Cat_scene006.mp4": "视频展示了一只黄色的小鸟在蓝色鸟笼中，鸟笼悬挂在打开的窗户上，窗台上摆放着几盆红色的花。镜头逐渐向右平移，展示了粉红色的房屋外墙和窗户，以及房屋旁的绿色植物和远处的树木。随后，一只黑猫从房屋角落出现，它先是偷偷探头观察，然后突然跑出来，表情兴奋，似乎在追逐什么。背景是晴朗的蓝天和远处的田野。",
    "E63.The.Flying.Cat_scene007.mp4": "一只棕色的小老鼠从黄色的拱形门里走出来，它开心地跑向墙边的邮箱，然后停下来看着邮箱。突然，它被一个巨大的猫爪吓了一跳，猫爪从画面右侧走过，小老鼠吓得缩回门里。猫爪消失后，小老鼠又从门里探出头来，小心翼翼地观察四周，然后又缩了回去。",
    "E63.The.Flying.Cat_scene008.mp4": "汤姆猫伸出手去够鸟笼，鸟笼里有一只黄色小鸟。汤姆猫成功抓到鸟笼，但小鸟突然飞走了，汤姆猫一脸惊讶和失望地转身离开。",
    "E63.The.Flying.Cat_scene009.mp4": "汤姆猫用爪子托着一个蓝色鸟笼，笼子里有一只黄色的小鸟。汤姆猫张着嘴，舌头伸出，眼睛瞪着小鸟，表情显得非常得意和满足。小鸟在笼子里，看起来有些紧张或不安。背景是粉红色的墙壁和窗户。",
    "E63.The.Flying.Cat_scene010.mp4": "一只棕色的小老鼠从墙洞中跑出，向右奔跑。一只黑猫从左侧冲出，追逐小老鼠。黑猫在追赶过程中摔倒在地，小老鼠则继续向前奔跑。",
    "E63.The.Flying.Cat_scene011.mp4": "一个蓝色的圆筒形物体在地面上滚动，经过房屋、草地和树木，最终撞上一棵树并变形。随后，一个黄色的小鸟从变形的物体中探出头来，表情惊恐，然后慢慢恢复平静。",
    "E63.The.Flying.Cat_scene012.mp4": "一只蓝猫在追逐一只棕色老鼠，两者在户外的道路上奔跑，背景有栅栏、树木和房屋。",
    "E63.The.Flying.Cat_scene013.mp4": "一只黄色的小鸟从蓝色物体上惊慌地跳起并飞走，留下空荡荡的蓝色物体和一个洞穴背景。",
    "E63.The.Flying.Cat_scene014.mp4": "一只黄色的小鸟飞向电线，挂在了电线上。随后，汤姆猫从地面跳跃起来，试图抓住小鸟，结果被电线缠住，身体被拉得变形，最终摔在地上。汤姆猫站起来，表情愤怒，四处张望。",
    "E63.The.Flying.Cat_scene015.mp4": "一只黄色的小鸟在墙上飞来飞去，一只拿着斧头的黑猫试图用斧头击打小鸟，但小鸟躲过了攻击。黑猫在攻击过程中不小心把树干砍断，导致树干倒下，黑猫被砸倒在地，显得非常沮丧。",
    "E63.The.Flying.Cat_scene016.mp4": "一只棕色的小老鼠在户外奔跑，背景从天空和地面逐渐过渡到绿色的草地和建筑物。小老鼠表情紧张，似乎在逃避什么，不断向前奔跑。",
    "E63.The.Flying.Cat_scene017.mp4": "一只黄色的小鸟站在高高的鸟屋边缘，不断挥动翅膀，似乎在努力保持平衡或试图起飞。背景是蓝天和几棵树，鸟屋位于一根柱子上，远处可见房屋的一部分。",
    "E63.The.Flying.Cat_scene018.mp4": "一只棕色的小老鼠在草地上奔跑，突然被一只蓝色的猫从侧面扑住，猫抓住了老鼠。接着，猫试图爬上一根白色的柱子，但最终没能抓住老鼠，猫挂在柱子上，随后松手掉下。",
    "E63.The.Flying.Cat_scene019.mp4": "一只黄色的小鸟站在鸟屋边缘，一只棕色的小老鼠从下方爬上来，站在鸟屋上。一只蓝猫从下方出现，抓住鸟屋边缘，看着小老鼠和小鸟。猫拿起一个标有“2000 lbs.”的蓝色重物，然后扔了出去。小鸟和小老鼠看着重物飞走，小鸟显得很惊讶。",
    "E63.The.Flying.Cat_scene020.mp4": "一只黄色的小鸟和一只棕色的老鼠在屋顶上对峙，小鸟伸出翅膀试图抓住老鼠，老鼠则表现出惊讶和紧张的表情。",
    "E63.The.Flying.Cat_scene021.mp4": "汤姆猫用尽全力扛着梯子向前奔跑，随后将梯子靠在一根白色的柱子上，自己则顺着梯子向上爬去，最终消失在画面中。",
    "E63.The.Flying.Cat_scene022.mp4": "一只黄色的小鸟在鸟屋上，一只棕色的小老鼠在旁边看着。小鸟突然飞起来，小老鼠被吓了一跳。随后，一只蓝猫从下方出现，表情愤怒地看着鸟屋。",
    "E63.The.Flying.Cat_scene023.mp4": "一只黄色的小鸟飞到一把木梯旁，它用嘴叼着一根点燃的火柴，将火柴靠近梯子底部，火苗迅速蔓延，梯子开始燃烧。小鸟惊恐地后退，但火势越来越大。",
    "E63.The.Flying.Cat_scene024.mp4": "一只猫爬上梯子试图接近鸟屋，但梯子突然着火，猫被烧成黑炭并摔落。随后，猫用绳子荡秋千，试图再次接近鸟屋。",
    "E63.The.Flying.Cat_scene025.mp4": "一只猫用木板滑行接近鸟屋，试图抓住屋上的老鼠和小鸟，但被它们发现后惊慌失措地滑开，最终滑出画面。",
    "E63.The.Flying.Cat_scene026.mp4": "视频展示了动画角色汤姆猫在户外的一系列滑稽动作。一开始，汤姆猫从一个木制围栏后跳出来，接着他被一根绳子吊着，脚踩在木板上，身体倒挂在空中，然后他一头栽进土里，只露出脚和尾巴。随后，镜头切换到汤姆猫趴在一根红色的长杆上，他沿着杆子滑行，最终从杆子上滑落，消失在画面中。整个过程充满了幽默和荒诞的元素，展现了汤姆猫的调皮和不寻常的举动。",
    "E63.The.Flying.Cat_scene027.mp4": "一只黄色的小鸟在草地上推着一辆蓝色的小车，它用力推车，但车轮卡在了柱子旁边，小鸟被弹飞出去。随后，一个红色的长杆从天而降，插进了小车里，把小车固定住了。",
    "E63.The.Flying.Cat_scene028.mp4": "猫汤姆攀爬一根杆子，接近站在高处鸟屋上的老鼠杰瑞。汤姆成功抓住杆子顶部，但杰瑞迅速跳开，汤姆未能抓住它。杰瑞站在鸟屋上，举起前爪，似乎在挑衅或庆祝逃脱。",
    "E63.The.Flying.Cat_scene029.mp4": "动画片中的猫汤姆正攀爬一根红色的杆子，背景是蓝天和树木。汤姆表情专注，双手紧握杆子，双脚踩在杆子上，身体保持平衡，似乎在努力向上爬。随着镜头的移动，可以看到汤姆周围的环境，包括远处的树木和天空中的云朵。汤姆的姿势和表情显示出他正在全力以赴地攀爬。",
    "E63.The.Flying.Cat_scene030.mp4": "动画片段中，汤姆猫攀爬一根红色的杆子，试图进入一栋房子的阁楼窗户。他用爪子抓住杆子，身体悬空，然后用力一跃，撞碎了窗户玻璃。随后，镜头快速切换到屋顶，展示屋顶的木板结构和窗户的破损情况。接着，镜头扫过屋顶和周围的树木，最后回到窗户，显示窗户仍然破碎。整个场景充满动感和紧张感，突出了汤姆猫的冒险和破坏行为。",
    "E63.The.Flying.Cat_scene031.mp4": "一个穿着粉色衣服的猫从窗户探出头，随后身体被拉长成一条长长的、有节的粉白色条状物，不断向上延伸。",
    "E63.The.Flying.Cat_scene032.mp4": "动画片中的猫汤姆被吊在空中，身体倒挂，四肢张开，表情显得有些惊恐或困惑。背景是一个户外庭院，有石墙、绿树和蓝天。",
    "E63.The.Flying.Cat_scene033.mp4": "一个红色的抽屉从房子的窗户中伸出，抽屉里伸出一条长长的白色纸带，纸带末端有紫色的装饰。抽屉突然爆炸，碎片四散飞溅。",
    "E63.The.Flying.Cat_scene034.mp4": "动画片段中，汤姆猫从一个木箱中被弹出，随后展开了一对紫色的蝙蝠翅膀，摆出各种姿势。他先是用翅膀遮住脸，然后展开翅膀，露出得意的表情。接着，他转过身，展示翅膀的背面，然后再次转回正面，继续摆姿势。最后，他转身飞走，消失在画面中。",
    "E63.The.Flying.Cat_scene036.mp4": "一只棕色的老鼠坐在椅子上读着一本书，旁边一只黄色的小鸭子在椅子上睡着了。老鼠读完书后，把书放在椅子上，然后走到窗边，把脸贴在窗户上向外看。",
    "E63.The.Flying.Cat_scene037.mp4": "动画片中，汤姆猫穿着蝙蝠装从圆形窗户飞入，随后飞出画面。",
    "E63.The.Flying.Cat_scene038.mp4": "一只棕色的小老鼠站在一个圆形窗户前，用前爪扶着窗户，眼睛睁得大大的，似乎在观察外面的情况。随后，它闭上眼睛，双手捂住脸，然后又睁开眼睛，继续观察。背景是一个昏暗的房间，有绿色的窗帘和一把椅子。",
    "E63.The.Flying.Cat_scene039.mp4": "一只猫穿着蝙蝠翅膀从圆形开口飞出，随后飞出画面。",
    "E63.The.Flying.Cat_scene041.mp4": "一只穿着蝙蝠翅膀的猫在天空中追逐一只黄色的小鸟。猫和鸟在空中翻滚、追逐，最终猫撞上了一个钟楼的钟，被钟罩住。猫在钟内与小鸟对峙，小鸟飞走，猫试图抓住它但失败了。",
    "E63.The.Flying.Cat_scene042.mp4": "一只老鼠站在鸟屋的屋顶上，一只黄色的小鸟飞来，落在屋顶边缘。小鸟和老鼠开始互相推搡，导致屋顶的木板被推得翘起。最终，屋顶的木板完全掀开，露出里面的钉子，小鸟和老鼠都被钉子刺中，鸟屋的屋顶变成了一座钉子屋。",
    "E63.The.Flying.Cat_scene043.mp4": "汤姆穿着蝙蝠翅膀在空中飞翔，随后撞上了一个带钉子的鸟屋，鸟屋冒出烟雾。",
    "E63.The.Flying.Cat_scene044.mp4": "动画片中，一只穿着蝙蝠装的猫从空中跳入一个圆形水池，溅起水花后坐在水中，表情从惊讶变为平静。随后，猫从池中爬出，站在草地上，水从它的尾巴喷出，浇灌着旁边的花丛。这时，一只老鼠从一根柱子上探出头来，好奇地观察着猫的举动。",
    "E63.The.Flying.Cat_scene045.mp4": "一只棕色的小老鼠从一根白色的柱子后面探出头来，它先是小心翼翼地观察四周，然后突然兴奋地跳起来，高举一只前爪，张大嘴巴似乎在欢呼或叫喊，显得非常开心和得意。背景是一片绿色的草地和远处的树木与土黄色的墙壁。",
    "E63.The.Flying.Cat_scene046.mp4": "一只黄色的小鸟站在鸟屋的屋顶上，张开翅膀，似乎在向观众打招呼或展示自己。背景是纯蓝色的天空。",
    "E63.The.Flying.Cat_scene047.mp4": "杰瑞从柱子后面跑出来，看到自己的影子逐渐变大，变成了一只猫的形状。杰瑞感到害怕，开始逃跑，但他的影子却一直跟着他。突然，影子变成了汤姆，杰瑞被抓住了。",
    "E63.The.Flying.Cat_scene048.mp4": "一只黄色的小鸟站在鸟屋的边缘，突然张开翅膀，向空中飞去，最终飞出了画面。",
    "E63.The.Flying.Cat_scene049.mp4": "一只穿着白色翅膀的猫在空中飞行，手里抓着一只兔子。随后，一只黄色的小鸟飞来，用喙咬住猫翅膀上的绳子，用力拉扯，导致翅膀被扯断，猫失去平衡，翅膀脱落。",
    "E63.The.Flying.Cat_scene050.mp4": "动画片段中，汤姆穿着蝙蝠翅膀在空中飞翔，手里抓着杰瑞。随后，汤姆的翅膀突然破裂，杰瑞被甩出，掉入空中。一只黄色小鸟飞来，抓住杰瑞，两人一同下坠。汤姆看到后，惊恐地张开双臂，试图阻止他们坠落。",
    "E63.The.Flying.Cat_scene051.mp4": "一只猫从空中坠落，撞到一棵树上，随后树的枝干断裂，猫被甩出画面。",
    "E63.The.Flying.Cat_scene052.mp4": "一只长着蝙蝠翅膀的猫正用爪子抓着树干，树皮被撕裂，木屑飞溅，猫的表情显得很得意。背景是蓝色的天空和几棵深绿色的树。",
    "E63.The.Flying.Cat_scene053.mp4": "一只穿着蝙蝠服装的猫从树后探出头来，然后完全现身，展开翅膀，摆出蝙蝠的姿势。",
    "E63.The.Flying.Cat_scene054.mp4": "一只黄色的小鸟抓着一只棕色的小老鼠在空中飞翔，小鸟突然松开，小老鼠自由落体。随后，一只猫从天而降，用翅膀扑向小老鼠。",
    "E63.The.Flying.Cat_scene055.mp4": "一只戴着翅膀的猫在空中追逐一只小鸟，小鸟被猫抓住后，猫继续飞行，经过树木、房屋和铁路，最终飞向一个隧道。",
    "E63.The.Flying.Cat_scene056.mp4": "动画片段中，一只穿着蝙蝠侠服装的猫从隧道中跑出，追逐着两只小鸟。随后，一列色彩鲜艳的火车从隧道中驶过，猫在火车前停下。",
    "E63.The.Flying.Cat_scene057.mp4": "一只猫从高处坠落，悬挂在铁架上，下方有车辆经过。",
    "E63.The.Flying.Cat_scene058.mp4": "视频展示了一个卡通场景，背景是蓝色的天空。画面中有一个带有黄色顶部和红色窗户的金属结构建筑。起初，建筑的边缘出现了一只黄色的小鸟和一只棕色的老鼠。它们从建筑边缘探出头来，互相看着对方。随后，它们开始互动，老鼠用爪子轻轻碰触小鸟，小鸟则用喙回应。接着，画面逐渐变暗，最终完全变黑，显示“THE END”字样。整个场景充满了卡通风格的趣味和温馨。",
    "E63.The.Flying.Cat_scene059.mp4": "视频显示了“THE END”字样，随后过渡到“An MGM Tom and Jerry CARTOON”标题，底部标注“MADE IN HOLLYWOOD, U.S.A.”。整个画面背景为红色，文字为蓝色和白色，具有经典卡通片尾风格。",
    "E63.The.Flying.Cat_scene060.mp4": "视频展示了“Tom and Jerry”卡通片的片头标志，背景为深红色，标志以蓝色字体呈现，下方标注“MADE IN HOLLYWOOD, U.S.A.”，随后画面转为全黑。"
}