{
    "S1950E40 - Neapolitan Mouse_scene001.mp4": "视频开始时全黑，随后出现米高梅动画的标志，标志上方写着“A METRO-GOLDWYN-MAYER”，中间是“CARTOON”，下方是“COLOR BY TECHNICOLOR”，背景为深蓝色。",
    "S1950E40 - Neapolitan Mouse_scene002.mp4": "视频展示了米高梅动画公司的标志，一只狮子在圆形框架内咆哮，下方写着“CARTOON”和“COLOR BY TECHNICOLOR”。随后画面变黑，接着出现“Tom and Jerry”的标题和两个卡通角色的形象。",
    "S1950E40 - Neapolitan Mouse_scene003.mp4": "视频片段展示了经典动画《猫和老鼠》的片头和制作信息。首先，画面中出现“Tom and Jerry”的标题，伴随着卡通猫和老鼠的形象。随后，标题逐渐过渡到“Neapolitan Mouse”并标注“NAPLES”，背景为意大利地图轮廓。接着，显示了导演William Hanna和Joseph Barbera的名字，以及动画、背景、音乐等制作人员的名单。最后，画面聚焦于制片人Fred Quimby的名字，并以“NAPOLI”的路牌作为场景转换，暗示故事发生在那不勒斯。整个片段以复古动画风格呈现，充满怀旧感。",
    "S1950E40 - Neapolitan Mouse_scene004.mp4": "视频展示了一个动画风格的场景，从一个标有“NAPOLI”的路牌开始，镜头逐渐向右移动，展现了一个沿海城市的全景，远处是一座正在喷发的火山，火山口冒出浓烟。接着，镜头继续向右移动，聚焦到一座城堡和一个广场，广场上有骑马雕像和一些行人。一艘大型游轮从海面上驶过，背景是蔚蓝的海水和远处的城市轮廓。整个场景色彩丰富，细节丰富，展现了意大利那不勒斯的美丽风光和历史建筑。",
    "S1950E40 - Neapolitan Mouse_scene005.mp4": "视频展示了汤姆猫和杰瑞鼠在船上的互动。开始时，汤姆猫从船上的一个小圆窗探出头，露出得意的笑容。随后，镜头切换到船的另一侧，杰瑞鼠从一个类似的小洞中探出头，表情狡黠。接着，杰瑞鼠从洞中爬出，手里拿着一块奶酪，得意地站在甲板上，似乎在庆祝自己的胜利。整个场景充满了卡通风格的幽默和紧张感。",
    "S1950E40 - Neapolitan Mouse_scene006.mp4": "在船的甲板上，汤姆从门里走出来，手持拐杖，戴着帽子，看起来很悠闲。杰瑞从门边的小洞里探出头来，汤姆看到后迅速追击，用拐杖试图击打杰瑞，但杰瑞灵活地躲开，最终汤姆失去平衡，摔倒在地，帽子和拐杖也飞了出去。",
    "S1950E40 - Neapolitan Mouse_scene007.mp4": "在码头边，一只灰色的猫从船上的楼梯快速跑下，经过几只行李箱后消失在画面下方。",
    "S1950E40 - Neapolitan Mouse_scene008.mp4": "汤姆猫在甲板上追逐杰瑞鼠，杰瑞鼠用手指指向汤姆猫，汤姆猫被绊倒后站起，表情惊讶。",
    "S1950E40 - Neapolitan Mouse_scene009.mp4": "一只老鼠站在房间角落，突然被一只猫从背后追击，老鼠迅速逃跑，猫紧追不舍，最终猫从画面左侧冲出，老鼠消失在画面中。",
    "S1950E40 - Neapolitan Mouse_scene010.mp4": "在一座喷泉旁，一只灰色的猫（汤姆）追逐着一只棕色的小老鼠（杰瑞）。杰瑞在喷泉的石狮子雕像上，利用喷出的水流躲避猫的追捕。汤姆试图抓住杰瑞，但被水流溅湿，显得狼狈。杰瑞则在雕像上灵活地跳跃和躲避，最终成功逃脱。",
    "S1950E40 - Neapolitan Mouse_scene011.mp4": "一只老鼠在水果摊前偷吃苹果，不小心打翻了装满苹果的篮子。猫汤姆闻声赶来，结果被滚落的苹果砸中，滚进一堆苹果里，狼狈不堪。",
    "S1950E40 - Neapolitan Mouse_scene012.mp4": "动画片段中，汤姆猫戴着蓝色帽子，被苹果砸中后倒在地上，随后粉色花朵从花盆中飞出，环绕在他头上。背景是街道，有花盆和石板路。",
    "S1950E40 - Neapolitan Mouse_scene013.mp4": "在一条石阶街道上，一只小老鼠从画面左下角跑过，一只灰色的猫从远处追来，猫张开嘴，伸出爪子，试图抓住老鼠，但老鼠灵活地躲开了。",
    "S1950E40 - Neapolitan Mouse_scene014.mp4": "视频中，一只棕色小老鼠在石板地上奔跑，随后被一只灰色大猫追赶。大猫挥舞着锅铲试图抓住小老鼠，但小老鼠灵活地躲避。镜头切换到另一个场景，一只穿着绿色条纹衣服的灰色老鼠从洞穴中走出，四处张望，然后开始奔跑。",
    "S1950E40 - Neapolitan Mouse_scene015.mp4": "猫汤姆用平底锅试图抓住老鼠杰瑞，但杰瑞巧妙地躲进了锅里。随后，另一只老鼠出现，汤姆被它吓到并失去平衡。最后，汤姆用锅柄试图击打这只新出现的老鼠，但只击中了空中的锅柄。",
    "S1950E40 - Neapolitan Mouse_scene016.mp4": "动画片中的汤姆猫躺在地上，身体扭曲，表情痛苦。他慢慢坐起，眼睛睁大，显得惊讶或困惑。背景是石板地面和土黄色的墙壁。",
    "S1950E40 - Neapolitan Mouse_scene017.mp4": "两只老鼠在墙角处互动，一只棕色老鼠和一只穿着绿色衣服的灰色老鼠。灰色老鼠先是拉住棕色老鼠的手，然后松开，接着用手指着墙角，似乎在说话或解释什么。棕色老鼠则一直看着灰色老鼠，表情从疑惑到认真倾听。最后，两只老鼠握手，似乎达成了某种协议或和解。",
    "S1950E40 - Neapolitan Mouse_scene018.mp4": "在一条石板路上，一只蓝色的狗和一只灰色的猫正在对峙。狗用爪子抓住猫的尾巴，猫则试图挣脱。随后，狗将猫甩向墙壁，猫被压扁成一个圆柱形物体。狗将猫从墙壁上取下，猫恢复原状，但表情愤怒。狗和猫继续对峙，猫试图攻击狗，但狗灵活地躲避。最后，狗用爪子抓住猫的脖子，猫被压制在地上。",
    "S1950E40 - Neapolitan Mouse_scene019.mp4": "一只穿着绿色衣服、系着红色围巾的小老鼠，正沿着墙边谨慎地奔跑。它突然抓住了一条蓝色的绳子，用力拉扯，试图摆脱某种危险。背景中可以看到一座建筑物和远处的街道，暗示这是一个城市环境。",
    "S1950E40 - Neapolitan Mouse_scene020.mp4": "一只小老鼠抓住一条蓝色长蛇的尾巴，将它拖拽到地面。长蛇被拖拽后倒在地上，小老鼠站在它身上，然后从它身上跳下来，长蛇在地上翻滚，最终消失在画面中。",
    "S1950E40 - Neapolitan Mouse_scene021.mp4": "一个蓝色的精灵在城市街道上飞行，随后躲在一个建筑物的角落里，探出头来观察四周。",
    "S1950E40 - Neapolitan Mouse_scene022.mp4": "一只穿着绿色衣服、系着红色围巾的老鼠站在岩石旁，它先是低头看着自己的手，然后抬头四处张望，接着又低头看手，最后再次抬头环顾四周。",
    "S1950E40 - Neapolitan Mouse_scene023.mp4": "一只蓝色的狗从墙后探出头，表情从紧张到兴奋再到惊讶，最后又回到紧张。背景是一座欧式建筑，天空晴朗。",
    "S1950E40 - Neapolitan Mouse_scene025.mp4": "一只穿着绿红条纹衣服的小老鼠在洞穴里兴奋地跳舞，它挥舞着手臂，做出各种舞蹈动作，然后突然摔倒在地，显得有些惊讶。",
    "S1950E40 - Neapolitan Mouse_scene026.mp4": "在一条石板路上，一只灰色的猫汤姆躺在地上，两只小老鼠杰瑞和米奇站在他面前。杰瑞穿着绿色条纹衣服，米奇穿着棕色衣服。杰瑞兴奋地向汤姆挥手，米奇则在旁边蹦跳。汤姆看着他们，表情从惊讶变为微笑，然后站起身来，被两只小老鼠拉着向前走。背景是破旧的墙壁和远处的建筑。",
    "S1950E40 - Neapolitan Mouse_scene027.mp4": "镜头缓慢推近，展示了一个充满复古风情的市场摊位。摊位是绿色的，上面摆放着各种商品，包括面包、奶酪、水果和香肠。摊位上方挂着红白条纹的遮阳篷，旁边有一扇蓝色的门。地面是石板路，周围摆放着陶罐和木桶。整个场景色彩丰富，充满生活气息。",
    "S1950E40 - Neapolitan Mouse_scene028.mp4": "一只老鼠从门后跑出来，跳上绿色的桌子，然后跑向桌子另一端。一只猫从门后出现，看着老鼠，露出微笑。",
    "S1950E40 - Neapolitan Mouse_scene029.mp4": "一只老鼠在厨房的台面上，将一根香肠放在奶酪上，接着又把一个番茄放在香肠上，堆成一座小塔。背景中有面包、番茄、香肠和奶酪。",
    "S1950E40 - Neapolitan Mouse_scene030.mp4": "一只灰色的猫汤姆站在柜台前，看着一只老鼠杰瑞。杰瑞在柜台上用盘子叠起一堆香肠和奶酪。汤姆伸手拿过盘子，把食物吃掉，然后变得非常胖，身体膨胀变形，最后恢复原状。",
    "S1950E40 - Neapolitan Mouse_scene031.mp4": "一只棕色的小老鼠站在一扇绿色的大门前，它先是兴奋地指向门的方向，然后开心地跳跃着，最后停下并用前爪捂住嘴巴，似乎在笑或惊讶。",
    "S1950E40 - Neapolitan Mouse_scene032.mp4": "一只穿着绿色衣服的小老鼠站在一个装满香肠和面包的货架上，它用前爪推着一个黄色的大袋子，袋子被推得晃动起来，随后袋子从货架上掉落到地面。",
    "S1950E40 - Neapolitan Mouse_scene034.mp4": "在阳台上，汤姆猫抱着杰瑞鼠，杰瑞鼠兴奋地跳舞。汤姆猫突然生气，将杰瑞鼠扔了出去。杰瑞鼠落地后，三只狗（一只蓝色、一只白色、一只棕色）从右侧出现，围住杰瑞鼠，表情凶狠。",
    "S1950E40 - Neapolitan Mouse_scene035.mp4": "一只穿着绿红条纹衣服的老鼠站在一个大物体旁边，它先是双手合十，然后张开双臂，接着又双手合十，最后它用前爪抓着大物体，身体前倾，似乎在努力推动它。",
    "S1950E40 - Neapolitan Mouse_scene036.mp4": "三只狗站在阳台上，中间的蓝色狗和左边的白色狗表情严肃，右边的棕色狗低头不语。一只小老鼠从蓝色狗脚边跑过，白色狗伸手试图抓住它，但老鼠迅速跑开。三只狗随后转头看向别处。",
    "S1950E40 - Neapolitan Mouse_scene037.mp4": "一只穿着绿色背带裤和红色领结的小老鼠从画面左下角跑入，沿着海边的土路向右前方跑去，逐渐远离镜头。背景是广阔的蓝色海洋，远处有一座小岛，近处有石墙和树木，画面右侧可见部分红色柱子和栏杆。",
    "S1950E40 - Neapolitan Mouse_scene038.mp4": "在户外市场的一个摊位上，一只灰色的猫站在绿色的柜台上，柜台上放着一些黄色的香蕉和一个棕色的小老鼠。猫正用爪子抓着香蕉，似乎在与小老鼠互动。背景是一栋带有阳台和拱门的建筑，旁边有装满红色苹果和黑色橄榄的篮子。",
    "S1950E40 - Neapolitan Mouse_scene039.mp4": "一只穿着绿衣的小老鼠从海边的石阶上跑过，随后三只狗从远处冲来，其中一只戴着红色帽子，另一只戴着蓝色帽子，还有一只戴着黄色帽子，它们一起跑过石阶，最后消失在画面右侧。",
    "S1950E40 - Neapolitan Mouse_scene040.mp4": "在一间摆满奶酪的房间里，汤姆猫站在绿色的柜台上，柜台上堆叠着几块圆形奶酪。杰瑞鼠穿着红色披风，站在柜台边缘，汤姆猫伸手推倒一块奶酪，奶酪滚落，汤姆猫随即也滑落下来，最终汤姆猫站在柜台边缘，杰瑞鼠站在柜台边缘，汤姆猫伸手推倒一块奶酪，奶酪滚落，汤姆猫随即也滑落下来，最终汤姆猫站在柜台边缘，杰瑞鼠站在柜台边缘，汤姆猫伸手推倒一块奶酪，奶酪滚落，汤姆猫随即也滑落下来，最终汤姆猫站在柜台边缘，杰瑞鼠站在柜台边缘，汤姆猫伸手推倒一块奶酪，奶酪滚落，汤姆猫随即也滑落下来，最终汤姆猫站在柜台边缘，杰瑞鼠站在柜台边缘，汤姆猫伸手推倒一块奶酪，奶酪滚落，汤姆猫随即也滑落下来，最终汤姆猫站在柜台边缘，杰瑞鼠站在柜台边缘，汤姆猫伸手推倒一块奶酪，奶酪滚落，汤姆猫随即也",
    "S1950E40 - Neapolitan Mouse_scene041.mp4": "几个黄色的圆柱形物体沿着一条土路滚落，逐渐消失在画面左侧。背景是一座建筑物和远处的海景。",
    "S1950E40 - Neapolitan Mouse_scene042.mp4": "三只狗在户外奔跑，随后它们摔倒在地，其中一只狗骑在另外两只狗身上。背景中，几个圆形的干草捆从右侧滚入画面。",
    "S1950E40 - Neapolitan Mouse_scene043.mp4": "动画片段中，两只卡通猫沿着海边的弯曲公路奔跑，它们身后跟着几个滚动的黄色圆筒。背景是蔚蓝的大海和远处的山峦，公路旁有石墙和绿植。",
    "S1950E40 - Neapolitan Mouse_scene044.mp4": "视频中，三只狗在海边的石板路上追逐滚动的金色圆筒。橙色的狗被蓝色和白色的狗追赶，它努力追赶并试图抓住圆筒。它们在石板路上奔跑，经过喷泉和树木，最终橙色的狗成功追上了圆筒，而蓝色和白色的狗则在后面紧追不舍。",
    "S1950E40 - Neapolitan Mouse_scene046.mp4": "一只小老鼠站在码头的系船柱上，挥舞着一条手帕，背景是美丽的日落和远处的山脉。随后，三只动物——一只狗、一只狼和一只棕色小狗——出现在码头上，模仿小老鼠的动作，也挥舞着手帕，看起来非常开心。最后，画面逐渐变暗，出现“The End”字样，标志着视频的结束。",
    "S1950E40 - Neapolitan Mouse_scene047.mp4": "视频展示了“THE END”字样，随后过渡到“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的标题画面。背景为红色渐变，文字以蓝色和白色呈现，具有复古动画风格。"
}