{
    "E112.The.Vanishing.Duck_scene001.mp4": "视频展示了米高梅动画公司的标志，背景为深蓝色，中央是一个咆哮的狮子图案，下方有“CARTOON”字样，标明“COLOR BY TECHNICOLOR”。随后画面转黑，接着出现《猫和老鼠》的标题画面，左侧是猫汤姆，右侧是老鼠杰瑞，中间是作品名称。",
    "E112.The.Vanishing.Duck_scene002.mp4": "视频展示了《Tom and Jerry》动画片的片头，首先出现的是Tom和Jerry的卡通形象以及片名，随后片名逐渐被替换为《The Vanishing Duck》，并出现制作人员名单，包括动画师、布局师、背景设计师、音乐制作人等，最后显示了制片人和导演的名字William Hanna和Joseph Barbera。整个片头以粉色背景为主，文字和图像逐渐显现，具有经典动画片头的风格。",
    "E112.The.Vanishing.Duck_scene003.mp4": "视频开头显示了“Produced and Directed by William Hanna and Joseph Barbera”的字样，随后画面转为一个房间的角落，可以看到一个木制柜子，柜子上放着一面镜子和一个插着玫瑰花的花瓶。",
    "E112.The.Vanishing.Duck_scene004.mp4": "一个穿着灰色大衣、戴着帽子和眼镜的男人，手里拿着一个蓝色的箱子，从一扇门后走进房间。房间内有一面镜子和一个木制柜子，柜子上放着一朵玫瑰花。男人站在门口，面带微笑，似乎对房间内的布置感到满意。",
    "E112.The.Vanishing.Duck_scene005.mp4": "一位穿着粉红色连衣裙的女士站在桌子旁，面带微笑。一位戴着帽子和眼镜、穿着灰色西装的男士走进画面，手里拿着一个蓝色的盒子。他将盒子递给女士，女士显得非常高兴，双手合十，然后接过盒子放在桌子上。",
    "E112.The.Vanishing.Duck_scene006.mp4": "一个黄色的小鸭子从蓝色的盒子里跳出来，手里拿着一张写着“To Joan”的纸条。它在盒子里蹦蹦跳跳，显得非常开心和兴奋，然后又跳回了盒子里。",
    "E112.The.Vanishing.Duck_scene007.mp4": "一个戴眼镜和帽子的男子和一个穿粉色衣服的女子正在对话。男子用手指着女子，女子双手张开，随后双手合十，表情惊讶。背景为单一的黄色。",
    "E112.The.Vanishing.Duck_scene008.mp4": "一对男女在夜晚散步，男子戴帽子和眼镜，女子戴帽子，两人手牵手。随后，女子离开，男子留在原地。接着，一只猫从垃圾桶里探出头来，观察四周，然后悄悄地爬进垃圾桶。",
    "E112.The.Vanishing.Duck_scene009.mp4": "一只灰色的猫从画面左侧爬出，它用头撞开一个蓝色的信箱盖，然后把头伸进信箱里。",
    "E112.The.Vanishing.Duck_scene010.mp4": "画面中，汤姆猫从地板缝隙中探出头来，眼睛瞪得很大，表情显得非常警惕和紧张。他位于一个壁炉前，壁炉里有木柴，两侧是蓝色的装饰柱。汤姆猫的灰色毛发和粉红色的耳朵在画面中十分醒目，他似乎在悄悄观察周围的环境，准备随时应对可能出现的情况。",
    "E112.The.Vanishing.Duck_scene011.mp4": "一只灰色的猫从画面右侧探出头，眼神凶狠，伸出爪子去抓一个蓝色的箱子。",
    "E112.The.Vanishing.Duck_scene012.mp4": "一只灰色的猫汤姆躲在桌子后面，眼睛盯着一只黄色的小鸭子。小鸭子从蓝色的物体上跳下来，站在桌子上，面向汤姆，张着嘴巴似乎在叫唤。汤姆先是眯起眼睛，露出凶狠的表情，然后突然张大嘴巴，似乎要扑向小鸭子，但最终没有行动，只是眯起眼睛，露出得意的笑容。",
    "E112.The.Vanishing.Duck_scene013.mp4": "一只灰色的猫趴在红色的物体上，眼睛睁得大大的。一只黄色的小鸭子从猫的右眼探出头来，它在猫的眼里转来转去，然后从猫的右眼跳出来，落在猫的鼻子上，接着又跳回猫的右眼，最后从猫的左眼跳出来，飞走了。猫的眼睛一直睁着，最后眨了一下眼睛。",
    "E112.The.Vanishing.Duck_scene014.mp4": "一只黄色的小鸭子从画面右侧跑入，随后一只灰色的猫从画面左侧快速跑过。小鸭子继续向前跑，经过一个白色墙壁，最终跑进墙上的一个洞里。",
    "E112.The.Vanishing.Duck_scene016.mp4": "一只小黄鸭从角落里探出头来，接着一只棕色的小老鼠从旁边出现，它们面对面站着，小鸭子用手指着小老鼠，似乎在和它说话，小老鼠则看着小鸭子，表情略显惊讶。",
    "E112.The.Vanishing.Duck_scene017.mp4": "一只黄色的小鸭子从一个绿色的洞里探出头来，好奇地四处张望。",
    "E112.The.Vanishing.Duck_scene018.mp4": "一只黄色的小鸭子从洞里探出头，然后走出洞外。一只灰色的猫突然从空中跳下，扑向小鸭子，将它抓在手中。猫抱着小鸭子跑向洞口，然后将小鸭子扔进洞里，自己也跟着跳进洞里。",
    "E112.The.Vanishing.Duck_scene019.mp4": "一只棕色的小老鼠从洞里跑出来，它在草地上奔跑，然后又跑回洞里。",
    "E112.The.Vanishing.Duck_scene020.mp4": "一只棕色的小老鼠在绿色的木板墙壁间奔跑，它从画面左侧跑向右侧，经过一根蓝色的管道。老鼠表情专注，动作敏捷，似乎在躲避或追逐什么。背景为深绿色的木质结构，整体画面充满卡通风格。",
    "E112.The.Vanishing.Duck_scene021.mp4": "一只橙色的小老鼠从画面左侧跑过，经过一根蓝色的蛇形管道，然后从画面右侧跑出。背景是绿色的木板墙。",
    "E112.The.Vanishing.Duck_scene022.mp4": "一只棕色的小老鼠从墙角探出头，迅速跑过木地板，撞上墙上的蓝色电箱，被弹回并消失在画面中。",
    "E112.The.Vanishing.Duck_scene023.mp4": "杰瑞从墙上的插座后探出头来，然后沿着绿色的电线滑下来。",
    "E112.The.Vanishing.Duck_scene024.mp4": "一只老鼠被夹在捕鼠器中，猫拿着小黄鸭跑过来，被老鼠拉倒在地上。小黄鸭被抛向空中。",
    "E112.The.Vanishing.Duck_scene025.mp4": "一个黄色的小鸭子跳到一罐标有“Vanishing Cream”（隐形霜）的罐子上，然后被罐子里的霜弹起，罐子盖子飞出去。",
    "E112.The.Vanishing.Duck_scene026.mp4": "一只灰色的猫躺在地上，尾巴翘起，眼睛半闭，似乎在打盹。一只棕色的小老鼠被夹在墙上的一个黄色的夹子中，夹子连接着一根黑色的电线。老鼠挣扎着，夹子突然松开，老鼠飞了出去，猫被惊醒，迅速起身并向前扑去，但最终只留下空荡荡的地面和夹子。",
    "E112.The.Vanishing.Duck_scene027.mp4": "一只黄色的小鸭子从一个标有“消失的奶油”的罐子里爬出来，它好奇地探索周围，用喙沾取奶油并涂抹在身上，随后逐渐消失，只留下头部，最后完全消失。",
    "E112.The.Vanishing.Duck_scene028.mp4": "一只棕色的小老鼠在绿色的地面上奔跑，突然被一只灰色的猫用蓝色的叉子抓住。小老鼠被叉子夹住后，挣扎着试图逃脱，但猫紧紧地控制着它。小老鼠被叉子夹住后，猫的表情从愤怒变为得意，而小老鼠则显得惊慌失措。",
    "E112.The.Vanishing.Duck_scene029.mp4": "视频中，一只老鼠被夹在叉子上，被猫用叉子夹住并试图用锤子击打。老鼠在被击打后摔倒在地上，然后迅速爬走。",
    "E112.The.Vanishing.Duck_scene031.mp4": "汤姆猫走进厨房，打开冰箱门，拿出一块西瓜，开心地吃了起来。",
    "E112.The.Vanishing.Duck_scene032.mp4": "一扇橙色的门缓缓打开，门外是紫色的天空和绿色的草地。",
    "E112.The.Vanishing.Duck_scene033.mp4": "汤姆猫站在冰箱前，手里拿着一块西瓜。他先是眯起眼睛，然后睁开眼睛，表情显得有些惊讶或困惑。接着，他再次眯起眼睛，似乎在思考或感到不满。最后，他睁开眼睛，表情恢复平静。",
    "E112.The.Vanishing.Duck_scene034.mp4": "汤姆猫拿着一片西瓜，一边吃一边被西瓜籽溅到，表情痛苦，最后他扔掉西瓜，从窗台上跳了下去。",
    "E112.The.Vanishing.Duck_scene035.mp4": "汤姆猫在浴室镜子前，用舌头舔镜子，然后用舌头接住从镜子中倒出的阿司匹林药片，最后满意地离开。",
    "E112.The.Vanishing.Duck_scene036.mp4": "汤姆猫从左侧冲入画面，滑行一段距离后撞到墙角，随后站起，表情紧张地贴在墙角偷看。",
    "E112.The.Vanishing.Duck_scene037.mp4": "一只灰色的猫用尾巴拿起一罐“消失的奶油”，然后用剪刀剪开罐子，接着用尾巴将奶油涂在门上，导致门被涂满奶油。",
    "E112.The.Vanishing.Duck_scene038.mp4": "汤姆猫在门边疯狂地跳跃和挥舞四肢，表情夸张，似乎在极度兴奋或惊慌中。",
    "E112.The.Vanishing.Duck_scene039.mp4": "一只猫的尾巴蘸取了“消失奶油”，随后被剪刀剪断，尾巴消失不见。",
    "E112.The.Vanishing.Duck_scene040.mp4": "汤姆猫站在门口，先是用爪子推门，然后小心翼翼地探头张望。他表情紧张，眼睛睁大，似乎在寻找什么。他的尾巴不时摆动，显示出他的不安和警觉。他不断左右张望，似乎在确认周围是否安全。",
    "E112.The.Vanishing.Duck_scene041.mp4": "一个灰色尾巴的动物从画面右侧进入，悄悄地走到一把红椅子后面，然后尾巴在椅背上轻轻摆动，最后尾巴从椅背上滑落下来。",
    "E112.The.Vanishing.Duck_scene042.mp4": "一只灰色的猫（汤姆）从桌子后面探出头，看到一个蓝色的盒子。他好奇地打开盒子，发现里面空无一物，表情变得惊讶和困惑。",
    "E112.The.Vanishing.Duck_scene043.mp4": "汤姆猫站在桌子旁，手里拿着一个蓝色的盒子。他先是用爪子打开盒子，然后把盒子放在一边，接着他开始用爪子挠自己的尾巴，似乎在检查它的状态。他看起来很专注，似乎在思考或计划着什么。背景是简单的棕色墙壁和红色的桌面，没有其他明显的物体或人物。",
    "E112.The.Vanishing.Duck_scene044.mp4": "视频展示了一只灰色的猫（汤姆）在室内追逐一个看不见的物体。起初，镜头聚焦在一张红色的桌子腿上，随后镜头向右移动，显示出汤姆从桌子后面爬出来，手持一根黑色的棍子。他表情愤怒，眼睛发亮，似乎在追赶或对抗某个东西。汤姆在地板上翻滚、跳跃，并试图用棍子击打地面，但似乎没有击中目标。最后，他躲到绿色的地毯后面，只露出尾巴和爪子，似乎在躲避或隐藏。整个场景充满动感和幽默感，符合经典动画片的风格。",
    "E112.The.Vanishing.Duck_scene045.mp4": "一只灰色的猫躺在绿色的被子里，突然被一根黄色的绳子缠住鼻子，猫显得非常愤怒和痛苦，它试图挣脱但绳子越缠越紧，猫的表情从惊讶变为愤怒，最终猫完全被绳子勒住，只能张大嘴巴。",
    "E112.The.Vanishing.Duck_scene046.mp4": "一只灰色的猫从拱门中跑出来，它在房间里奔跑，撞到一个柜子，然后摔倒在地。它爬起来，继续跑，撞到一个黄色的弹弓和一个黄色的锤子，这两个物品随后被弹开。",
    "E112.The.Vanishing.Duck_scene048.mp4": "一只灰色的猫从窗户探出头来，表情从愤怒变为惊讶。",
    "E112.The.Vanishing.Duck_scene049.mp4": "一只棕色的小老鼠和一只黄色的小鸭子在房间里玩耍，小老鼠拿着一块白布，小鸭子站在一旁。突然，一只灰色的猫从门后探出头来，表情凶狠，小老鼠和小鸭子吓得赶紧躲到门后。猫继续盯着它们，小鸭子被吓得往后退，小老鼠则试图保护小鸭子。猫最后消失在门后，小鸭子和小老鼠松了一口气。",
    "E112.The.Vanishing.Duck_scene051.mp4": "一个黄色的小鸭子和一只棕色的小老鼠在房间里奔跑，后面跟着一把黄色的扫帚。它们跑过一个红色的柜子，接着跑过一个落地钟，扫帚在后面追逐它们。",
    "E112.The.Vanishing.Duck_scene052.mp4": "一个房间内，一只小老鼠在绿色地毯上奔跑，旁边有一个落地钟和一把黄色扫帚。随后画面变黑，出现“THE END”字样，左侧是猫的图案，右侧是老鼠的图案。",
    "E112.The.Vanishing.Duck_scene053.mp4": "视频展示了《猫和老鼠》动画片的片尾画面，左侧是汤姆猫，右侧是杰瑞鼠，中间是“THE END”字样。随后画面过渡到MGM动画公司的标志，显示“an MGM CARTOON”以及“made in Hollywood, U.S.A.”字样。整个画面背景为蓝色。",
    "E112.The.Vanishing.Duck_scene054.mp4": "视频展示了MGM动画的片头，背景为深蓝色，上方有“an”字样，中间是“M·G·M CARTOON”字样，下方是“made in hollywood, U·S·A.”字样。随后画面逐渐变黑。"
}