{
    "13. The Zoot Cat_scene001.mp4": "视频开始时显示黑色背景，右下角有白色数字“0110544170204083”。随后画面逐渐淡入，出现米高梅卡通公司的经典标志，标志中央是一只咆哮的狮子，上方有“A Metro Goldwyn Mayer”字样，下方有“CARTOON”字样，周围环绕着“ARS GRATIA ARTIS”和“TRADE MARK”字样。整个画面呈现出复古的电影风格。",
    "13. The Zoot Cat_scene002.mp4": "视频展示了米高梅动画公司的标志，一只狮子在圆形框架内咆哮，周围有“Metro Goldwyn Mayer”、“TRADE MARK”和“CARTOON”字样。随后画面变黑，接着出现“TOM and JERRY”的标题画面，背景为红色渐变圆环，上方是汤姆猫的头部，右侧是杰瑞鼠。",
    "13. The Zoot Cat_scene003.mp4": "视频展示了《猫和老鼠》的片头，包括标题“Zoot Cat”和导演、动画师、音乐等制作人员名单，随后切换到一个写着情书的纸条，内容为“亲爱的太太，玫瑰是红色的，紫罗兰是蓝色的，老鼠很好，但你太可爱了，谢尔比 xxxxx”。",
    "13. The Zoot Cat_scene004.mp4": "视频展示了一封写给“Toots”的情书，内容是经典的“Roses are red, violets are blue, mice are nice, but oh you kid”，署名是“Sheikie”。随后镜头转向一个打开的红色礼盒，里面躺着一只被红丝带绑住的棕色小猫，它看起来有些困惑或不悦。背景是室内环境，有窗帘和一个玻璃瓶。",
    "13. The Zoot Cat_scene005.mp4": "一只黑猫用猪油涂抹双手，然后用涂满猪油的手揉搓眼睛。",
    "13. The Zoot Cat_scene006.mp4": "一只黑猫用爪子拿着两把小剪刀，然后把剪刀从嘴里拿出来，接着拿起一个蓝色的瓶子，用瓶子的尖端戳自己的脸。",
    "13. The Zoot Cat_scene007.mp4": "一只猫被放在一个装饰着红色蝴蝶结的盒子里，猫试图挣扎逃脱，但被一只大手用剪刀剪断了绑在它身上的红丝带，随后大手将盒子盖上并拿走。",
    "13. The Zoot Cat_scene008.mp4": "一只黑猫拿着一个红色的包裹，兴奋地跑向门口，然后不小心把包裹掉在地上。接着，一只穿着红色衣服的小猫从门后探出头来，看到地上的包裹后，好奇地走过去捡起它。",
    "13. The Zoot Cat_scene009.mp4": "一只穿着红色衣服的母猫打开一个红色盒子，盒子里躺着一只小猫。小猫抬头看着母猫，母猫微笑着看着小猫，小猫问“有什么事吗，小姐？”。",
    "13. The Zoot Cat_scene010.mp4": "一只穿着红色衣服、头戴红色蝴蝶结的猫坐在椅子上，手里拿着一个打开的红色盒子。一只小老鼠从盒子里探出头来，猫看着老鼠，表情惊讶。",
    "13. The Zoot Cat_scene011.mp4": "一只灰色的猫从柱子后面探出头，张开嘴，挥舞着爪子，然后从柱子后面走出来，手里拿着一把小提琴，开始拉琴。",
    "13. The Zoot Cat_scene012.mp4": "一只猫在户外的柱子旁，手持一把小提琴，兴奋地演奏并跳舞。随后，它从柱子后探出头，用一根线将一个红球拉到空中，写下了“Hello Babe”字样。接着，它继续跳舞，并从柱子后拿出一束花，最后躲进一个洞里，只露出尾巴。",
    "13. The Zoot Cat_scene013.mp4": "一只黑猫从台阶上倒立着滑下来，最终摔在地面上，然后露出得意的笑容。",
    "13. The Zoot Cat_scene014.mp4": "一只穿着红色上衣和米色裙子、头戴红色蝴蝶结的猫站在门口，手里拿着一个红色手提包，包里有一只小老鼠。她一边说话，一边用左手扶着门，身体微微前倾，表情丰富，似乎在抱怨或批评某人。地面上有一张被撕开的纸，纸上有红色的痕迹。背景是房屋的外墙和阳台，阳台上有绿色的植物和一个橙色的吊床。",
    "13. The Zoot Cat_scene015.mp4": "一只灰白相间的猫躺在地上，随后坐起并抱头，表情显得沮丧和困惑。背景是户外的草地和石阶。",
    "13. The Zoot Cat_scene016.mp4": "一只棕色的小老鼠坐在一个打开的红色盒子上，盒子被一只手拿着。小老鼠表情丰富，时而闭眼，时而张嘴，似乎在说话或唱歌。背景中可以看到红色的窗帘和浅色的墙壁。字幕显示：“你不仅是个胆小鬼，还老土，就像在乡下剥玉米壳的土包子。”",
    "13. The Zoot Cat_scene017.mp4": "一只穿着红色衣服、头戴红色蝴蝶结的猫，抱着一个红色盒子，盒子里有一只小老鼠。猫表情丰富，时而微笑，时而张嘴说话，似乎在对小老鼠说话或表达某种情绪。背景为简单的室内墙壁。",
    "13. The Zoot Cat_scene018.mp4": "一只灰色的猫坐在台阶上，它先是蜷缩着身体，然后被一个红色的物体砸中，最后躺在地上。背景是绿色的草地和一些花朵。",
    "13. The Zoot Cat_scene019.mp4": "一只灰色的猫躺在地上，手里拿着一个红色的盒子。一只棕色的小老鼠从盒子里跳出来，然后拿着一个玉米棒子跳到猫的身上。猫被惊醒，愤怒地站起来并跑开。",
    "13. The Zoot Cat_scene020.mp4": "视频展示了一只黑猫和一只小老鼠在户外的场景。一开始，小老鼠在猫的面前奔跑，猫试图抓住它，但猫在追逐过程中失去平衡，摔倒在地。猫躺在地上，看起来很沮丧，然后它开始自言自语，似乎在反思自己的失败。猫的表情和动作显示出它对自己失败的懊恼和自责。整个场景充满了幽默和戏剧性，展现了猫和老鼠之间的经典追逐游戏。",
    "13. The Zoot Cat_scene021.mp4": "一只穿着红色上衣和黄色裙子、头戴红色蝴蝶结的猫坐在沙发上，面前的小桌子上放着一瓶胶水和一个玻璃杯。猫的表情和动作随着字幕变化，似乎在与某人对话，字幕内容包括“有多少女孩对你说过这话啊”、“不，郝雷思，我只能把你当哥哥对待”以及“请把鞋带系好，我的朋友”。背景是温馨的客厅，有落地灯、柜子和地毯。",
    "13. The Zoot Cat_scene022.mp4": "一只灰色的猫从窗户探出头来，表情从慵懒逐渐变得兴奋和得意。它一边说话，一边用手势强调，似乎在讲述一个关于“左特”和“瑞特褶”的有趣故事。背景是一个温馨的室内场景，有粉色窗帘、台灯和一个装有剪刀和线团的篮子。",
    "13. The Zoot Cat_scene023.mp4": "一只穿着红色上衣和白色裙子的猫坐在沙发上，戴着红色蝴蝶结，手里拿着一块手帕擦拭眼睛，表情显得非常开心和满足。沙发前的小桌子上放着一杯饮料和一个红色的瓶子。背景中有一个木制柜子，上面摆放着一盆植物和几本书。整个场景温馨而舒适。",
    "13. The Zoot Cat_scene024.mp4": "一只猫坐在窗台上，一边描述一件衣服的尺寸和设计，一边用手比划。它提到衣服从下巴开始，膝盖处宽约54英寸，逐渐缩小到3英寸宽，鼓励观众紧跟潮流购买。随后，它拿起剪刀，开始剪裁一盏台灯，似乎在准备制作或改造这件衣服。",
    "13. The Zoot Cat_scene025.mp4": "汤姆猫戴着一顶草帽，手持剪刀，站在吊床上，开始剪吊床。他剪得非常用力，吊床被剪得破破烂烂，碎片散落在地板上。汤姆猫剪完后，吊床已经面目全非，汤姆猫也消失在画面中。",
    "13. The Zoot Cat_scene026.mp4": "一个穿着红色上衣和米色裙子、头戴红色蝴蝶结的猫从门后探出头来，随后她兴奋地跳起来，旋转并做出各种舞蹈动作，同时大声喊着“杰克森！”。",
    "13. The Zoot Cat_scene027.mp4": "一只穿着橙色条纹睡衣、戴着宽边草帽的猫站在门廊上，面带微笑，似乎在与人对话。背景是晴朗的天空和绿色的树木，场景显得宁静而悠闲。",
    "13. The Zoot Cat_scene028.mp4": "一只棕色的老鼠从窗帘后探出头，表情惊讶，随后眼睛瞪大，眼中出现裂纹图案，显得非常震惊。",
    "13. The Zoot Cat_scene029.mp4": "一只穿着橙色条纹工作服、戴着宽边草帽的猫站在阳台上，手里拿着一根点燃的火柴。它先是用火柴点燃了自己嘴里的烟斗，然后将火柴丢掉，接着用烟斗吸烟，最后吐出一口烟雾。",
    "13. The Zoot Cat_scene030.mp4": "一只穿着红色上衣和米色裙子、头戴红色蝴蝶结的猫站在门口，兴奋地跳舞并欢呼“你真是太帅了！”。",
    "13. The Zoot Cat_scene031.mp4": "一只穿着橙色条纹衣服、戴着宽边帽的猫站在门廊上，叼着烟斗，摆出各种姿势，包括转身、挥舞手臂和展示披风。它还用卷尺测量自己的身体，并自言自语，字幕显示“你真是太帅了！”、“成熟的男人。”、“现在才听懂我的话啊。”、“做得很好，杰克森。”",
    "13. The Zoot Cat_scene032.mp4": "一只穿着红色上衣和白色裙子、头戴红色蝴蝶结的猫正在房间里跳舞，邀请朋友一起跳舞。随后，另一只穿着橙色条纹衣服、戴着黄色帽子的猫进入房间，与第一只猫手拉手开始跳摇摆舞。两只猫在房间里欢快地跳舞，动作协调，充满活力。",
    "13. The Zoot Cat_scene033.mp4": "一只穿着红色上衣和围裙、头戴红色蝴蝶结的猫正在跳舞，她先是独自舞动，随后另一只穿着橙色服装、戴着草帽的猫加入，两人手拉手继续跳舞。",
    "13. The Zoot Cat_scene034.mp4": "视频中，一只小老鼠在房间里跳舞，突然一只穿着橙色衣服、戴着黄色帽子的猫出现，小老鼠继续跳舞并试图拉住猫的衣袖。猫被小老鼠拉住后，表情变得严肃。随后，另一只穿着红色衣服、戴着红色蝴蝶结的猫从右侧进入画面，伸出手指向小老鼠，似乎在嘲笑或指责它。小老鼠继续跳舞，而两只猫则在一旁观看。",
    "13. The Zoot Cat_scene035.mp4": "一只棕色的小老鼠在桌子上跳舞，突然一只穿着橙色衣服戴着草帽的猫从桌子后面出现，猫露出凶狠的表情，抓住了小老鼠。",
    "13. The Zoot Cat_scene036.mp4": "一只穿着橙色和绿色衣服、戴着黄色帽子的猫从桌子后面出现，站在一个金属水槽前。水槽里有一只老鼠，正叼着一根点燃的香烟。猫看着老鼠，老鼠也看着猫，然后老鼠把烟递给猫。猫吸了一口烟，然后老鼠把烟从猫嘴里拿走，猫看起来很生气。猫转身离开，老鼠留在水槽里，开心地笑着。",
    "13. The Zoot Cat_scene037.mp4": "一只穿着红色上衣和白色裙子、头戴红色蝴蝶结的猫正在跳舞，随后另一只戴着草帽、穿着橙色条纹衣服的猫加入，两人手拉手跳起了舞。",
    "13. The Zoot Cat_scene038.mp4": "一只小老鼠在桌子上用香蕉皮滑行，然后抓住香蕉皮跳起并飞出去。",
    "13. The Zoot Cat_scene039.mp4": "一个穿着橙色衣服、戴着草帽的猫在香蕉皮上滑倒，随后画面切换到一个穿着红色衣服、戴着红色蝴蝶结的小猫坐在地上。",
    "13. The Zoot Cat_scene040.mp4": "一个穿着橙色衣服、戴着草帽的卡通猫从窗户跳进房间，落在钢琴上，然后翻滚着坐到钢琴凳上，开始弹钢琴。",
    "13. The Zoot Cat_scene041.mp4": "视频中，一只戴着草帽、穿着橙色条纹衣服的猫坐在钢琴前，他先是调整帽子，然后与一只戴着红色蝴蝶结、穿着橙色衣服的猫进行互动。戴草帽的猫表现出兴奋和喜悦，而戴蝴蝶结的猫则显得有些害羞和紧张。戴草帽的猫向戴蝴蝶结的猫靠近，似乎在表达爱意或进行某种亲密的互动。",
    "13. The Zoot Cat_scene042.mp4": "一只戴着宽边帽、穿着橙绿条纹衣服的猫在说话，表情丰富，时而张嘴，时而闭嘴，似乎在表达爱意和自我调侃，字幕显示其话语内容。",
    "13. The Zoot Cat_scene043.mp4": "一只戴着红色头巾和眼镜的猫坐在钢琴上，与另一只戴着宽边帽的猫对话。戴眼镜的猫先是自信地展示自己，然后表达对对方的强烈心动，称对方让自己灵魂燃烧。戴帽子的猫则回应并表现出惊讶和喜悦。",
    "13. The Zoot Cat_scene044.mp4": "一只小老鼠拿着火柴，点燃了挂在墙上的鬼魂画作，画中的鬼魂被点燃后开始燃烧，小老鼠看着燃烧的鬼魂画作，露出得意的笑容。",
    "13. The Zoot Cat_scene045.mp4": "汤姆戴着一顶宽边草帽，帽子上有橙色和绿色条纹，正对着杰瑞说话，嘴里冒出热气，显得很热。杰瑞穿着红色衣服，头上戴着红色蝴蝶结，趴在钢琴上，眼睛睁得很大，面带微笑地看着汤姆。背景是深色的，有钢琴的轮廓。",
    "13. The Zoot Cat_scene046.mp4": "一只老鼠站在地上，看着一个被火焰包围的幽灵。幽灵穿着红绿相间的衣服，身体被火焰吞噬，但仍然保持着微笑的表情。老鼠先是开心大笑，随后表情变得惊讶和担忧。",
    "13. The Zoot Cat_scene047.mp4": "动画片段中，一只戴着宽边帽、穿着橙色条纹西装的猫和一只穿着红色衣服、头戴红色蝴蝶结的猫在烟雾弥漫的环境中对话。戴帽子的猫情绪激动，似乎在指责或强调某事，而另一只猫则显得平静或略带得意。背景中烟雾缭绕，暗示着某种紧急或危险的情况。戴帽子的猫随后转身，表情愤怒，似乎在确认或强调火灾的存在，然后突然消失在画面中，留下烟雾弥漫的场景。",
    "13. The Zoot Cat_scene048.mp4": "动画片中，一只穿着橙色条纹睡衣、戴着草帽的猫在房间里剧烈地咳嗽，烟雾从它的身体和尾巴冒出，最后它停下咳嗽，表情痛苦。",
    "13. The Zoot Cat_scene049.mp4": "一只小老鼠在房间里奔跑，它推开了地板上的一个盖子，然后从盖子下面钻出来。与此同时，一只穿着橙色衣服的猫从旁边跑过，它似乎在追赶老鼠。接着，小老鼠从盖子下面钻出来，被猫抓住了。最后，一只穿着红色衣服的猫坐在沙发上，开心地笑着，手里拿着小老鼠。",
    "13. The Zoot Cat_scene050.mp4": "一只老鼠在桌子上跳舞，突然一只穿着橙色衣服、戴着草帽、拿着铲子的猫从桌子后面出现。猫试图用铲子抓住老鼠，但老鼠跳起来躲开了。猫被老鼠的举动激怒，用铲子将老鼠扫飞。老鼠落在地上，猫则被自己的铲子绊倒，最终猫被自己的衣服裹住，只能露出头部，表情无奈。",
    "13. The Zoot Cat_scene051.mp4": "一只小老鼠从柜子底下跑出来，躲在柜子腿后，然后看到一个穿着橙色衣服、戴着黄色帽子的猫躺在地上，小老鼠吓得飞起来，然后跑掉了。",
    "13. The Zoot Cat_scene052.mp4": "一个穿着橙色条纹衣服、戴着草帽的卡通猫从沙发底下爬出来，它先是摔倒在地，然后站起来，做出夸张的舞蹈动作，最后又摔倒在地。",
    "13. The Zoot Cat_scene053.mp4": "一只戴着黄色帽子的猫趴在沙发上，看着窗外的小老鼠。小老鼠抓住窗帘绳子荡到窗内，然后跳到猫的帽子上，猫被吓了一跳，张大嘴巴。小老鼠从猫的帽子上跳开，猫追着它，最后猫把帽子甩了出去。",
    "13. The Zoot Cat_scene054.mp4": "一只穿着橙色衣服、戴着草帽的猫被一根黄色的绳子拖着在房间里奔跑，绳子的另一端被一只小老鼠拉着。猫在奔跑过程中表情痛苦，最终被拖到一个桌子旁，老鼠把绳子从猫的手里拽出来，猫摔倒在地。",
    "13. The Zoot Cat_scene055.mp4": "动画片中，一只穿着橙色条纹衣服的猫从窗户外面被卷入室内，被窗帘卷住，表情惊恐，随后被窗帘拉扯着旋转，最后被窗帘完全包裹住。",
    "13. The Zoot Cat_scene056.mp4": "一个穿着橙色衣服的角色从上方跳入鱼缸，溅起大量水花，随后角色被水冲出鱼缸，水花四溅，最后鱼缸内只剩下水和装饰物。",
    "13. The Zoot Cat_scene057.mp4": "一只穿着橙色衣服的猫被挂在衣架上，衣服被水淋湿后脱落，猫露出本色，表情痛苦。",
    "13. The Zoot Cat_scene058.mp4": "两个橙色带绿色条纹的卡通角色在窗户格子间上下移动，一个黄色的香蕉皮从上方掉落。",
    "13. The Zoot Cat_scene059.mp4": "一只老鼠站在窗台上，先是兴奋地张开双臂，随后穿上了从空中落下的橙色条纹衣服，接着戴上了一顶草帽。它开始跳舞，随着舞步移动，逐渐靠近窗帘，最后从窗帘后探出头来，举起帽子欢呼。最后画面变黑，出现“The End”字样。",
    "13. The Zoot Cat_scene060.mp4": "视频展示了一个经典的动画片结束画面，背景为红色，中央有银色的“The End”字样，随后逐渐出现“An M.G.M Tom and Jerry CARTOON”和“MADE IN HOLLYWOOD, U.S.A.”字样。",
    "13. The Zoot Cat_scene061.mp4": "视频开头显示了“An MGM Tom and Jerry Cartoon”标题，背景为红色，文字为白色和黑色，下方有“MADE IN HOLLYWOOD, U.S.A.”字样。随后画面转为全黑，持续数秒。"
}