{
    "E47.Little.Quacker_scene001.mp4": "画面从全黑开始，随后出现米高梅动画的标志，标志中央是一只咆哮的狮子，下方有“CARTOON”字样和“COLOR BY Technicolor”的文字。背景为深红色，整体风格复古。",
    "E47.Little.Quacker_scene002.mp4": "视频展示了米高梅动画片的标志，背景为红色，中央有一个圆形框架，内有一只咆哮的狮子，下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY Technicolor”。狮子在框架内不断张合嘴巴，做出咆哮的动作。",
    "E47.Little.Quacker_scene003.mp4": "该视频片段展示了米高梅动画公司的标志，随后是《猫和老鼠》的标题画面，其中汤姆猫和杰瑞鼠的形象出现在红色背景上。",
    "E47.Little.Quacker_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为红色渐变圆环，前景是猫汤姆和老鼠杰瑞的卡通形象，汤姆张大嘴巴，杰瑞则在旁边笑着。下方有黄色的“TOM and JERRY”字样。随后画面出现红色文字“Little Quacker”，并标注导演为William Hanna和Joseph Barbera。",
    "E47.Little.Quacker_scene005.mp4": "这是一个动画片的片头，画面中展示了一只黄色的小鸭子在水中游泳，背景是深蓝色的水面，上面有波浪状的线条。画面中央显示了动画片的标题“Little Quacker”，并注明由William Hanna和Joseph Barbera执导。随后，画面显示了动画制作人员名单，包括动画师Irven Spence、Ray Patterson、Ed Barge和Kenneth Muse，以及音乐由Scott Bradley负责。最后，画面显示了制片人Fred Quimby的名字。整个片头背景是深蓝色的水面，小鸭子在水中游动，营造出一种宁静的氛围。",
    "E47.Little.Quacker_scene007.mp4": "画面中，一只灰色的猫从高高的草丛中探出头来，眼睛闪烁着兴奋的光芒，嘴巴张开，露出尖尖的牙齿，似乎在兴奋地注视着下方的鸟巢。鸟巢位于水边，里面有一颗白色的蛋。猫的姿势和表情显示出它对蛋的强烈兴趣和渴望。背景是绿色的草丛和淡蓝色的天空，营造出宁静的自然环境。",
    "E47.Little.Quacker_scene008.mp4": "一只白手从草丛中伸出，将草窝中的白色蛋拿走，然后迅速抽回。",
    "E47.Little.Quacker_scene009.mp4": "汤姆猫在乡间小路上奔跑，嘴里叼着一个白色的蛋，表情兴奋，舌头伸出，背景是田园风光和农舍。",
    "E47.Little.Quacker_scene010.mp4": "汤姆猫从门外冲进厨房，兴奋地在空中翻滚，落地后他开心地在厨房里跳舞。他拿起一个鸡蛋，然后从抽屉里拿出一个平底锅和一把叉子，戴上厨师帽，准备打蛋。",
    "E47.Little.Quacker_scene011.mp4": "汤姆戴着厨师帽，手持叉子和鸡蛋，准备在平底锅里煎蛋。他用叉子敲开鸡蛋，蛋黄和蛋清掉进锅里，结果孵化出一只小黄鸭。汤姆兴奋地用盐和胡椒瓶给小鸭调味，小鸭在锅里开心地蹦跳。",
    "E47.Little.Quacker_scene012.mp4": "一只小黄鸭坐在煎锅里，戴着黑色帽子。汤姆猫戴着厨师帽从上方探头观看，小黄鸭突然张嘴，帽子掉落，冒出黑烟，随后小黄鸭被烟熏得睁大眼睛，汤姆猫皱眉。烟散去后，小黄鸭恢复原状，汤姆猫表情惊讶。",
    "E47.Little.Quacker_scene013.mp4": "汤姆戴着厨师帽，看着煎锅里的小黄鸭，表情从愤怒变为兴奋。他拿起一本名为《如何准备烤鸭》的书，似乎在研究如何烹饪这只小鸭子。",
    "E47.Little.Quacker_scene014.mp4": "画面中，一双戴着白色手套的手正拿着一本蓝色封面的书，书的封面上用黑色字体写着“How to prepare Roast Duck”（如何准备烤鸭）。背景是浅棕色的，整体画面风格为卡通动画。",
    "E47.Little.Quacker_scene015.mp4": "汤姆戴着厨师帽，手持一本《如何制作烤鸭》的书，看着煎锅里的小黄鸭。他先是兴奋地阅读，接着小黄鸭在锅里被烤成了棕色，汤姆开心地舔着嘴唇。随后，他不小心把书弄湿，书页被水浸湿，汤姆又重新翻开书，继续阅读。",
    "E47.Little.Quacker_scene016.mp4": "视频片段中，汤姆戴着厨师帽，手持菜刀，兴奋地盯着一只小黄鸭。小黄鸭在面包上啄食，面包被啄出洞，面包屑四溅。汤姆舔着舌头，眼神充满期待，似乎准备对小黄鸭采取行动。背景是厨房，有调料瓶和厨具。",
    "E47.Little.Quacker_scene017.mp4": "一只小黄鸭在面包上啄食，突然一只戴着厨师帽的猫拿着大刀出现，准备砍面包。小黄鸭被吓到后躲进刀子的洞里，猫把刀子放下，小黄鸭从洞里跳出来，飞到面包上，猫惊讶地看着它。",
    "E47.Little.Quacker_scene018.mp4": "一只黄色的小鸭子在地板上奔跑，突然从墙角探出一个男孩的头，小鸭子被吓到摔倒。随后，一只戴着厨师帽、手持菜刀的灰色猫从墙角冲出来，似乎准备攻击男孩。",
    "E47.Little.Quacker_scene020.mp4": "一只棕色的小老鼠从画面左侧走进来，它站在一个洞口前，好奇地向洞内张望。洞口上方有蓝色的冰凌，洞内是绿色的地面和棕色的顶部。小老鼠的表情显得有些惊讶和好奇。",
    "E47.Little.Quacker_scene021.mp4": "杰瑞从墙洞中探出头来，小心翼翼地观察四周。随后，它完全钻出洞口，准备逃跑。这时，汤姆手持菜刀，从上方俯视着杰瑞，准备追捕。",
    "E47.Little.Quacker_scene022.mp4": "一只黄色的小鸭子坐在床上，突然惊恐地尖叫并从床上弹起，随后以极快的速度飞出画面，留下一道橙色的尾迹。",
    "E47.Little.Quacker_scene023.mp4": "一只黄色的小鸡跑进一个房间，看到一只躺在地上的棕色老鼠。小鸡试图拖走老鼠，但老鼠突然翻身并反击，将小鸡摔在地上。老鼠站起来，愤怒地面对小鸡，而小鸡则坐在地上，看起来很害怕。",
    "E47.Little.Quacker_scene024.mp4": "一只黑猫坐在地上，手持一把蓝色的刀，眼睛盯着墙上的插座。插座突然打开，一只小老鼠从里面探出头来，随后爬了出来，站在插座上。黑猫伸出尾巴试图抓住老鼠，但老鼠迅速缩回插座里，黑猫的尾巴也跟着缩了回去。",
    "E47.Little.Quacker_scene025.mp4": "一只棕色的小老鼠正拖着一条蓝色的长尾巴，尾巴末端是白色的。它从画面左侧向右移动，经过一个绿色的洞口，途中遇到一只黄色的小鸭子。小老鼠停下来看着小鸭子，然后继续拖着尾巴向右移动。背景是深色的，地面是浅色的。",
    "E47.Little.Quacker_scene026.mp4": "汤姆猫挥舞着一把大菜刀，表情愤怒，随后被自己的动作甩得向后飞去，身体扭曲，嘴巴大张，似乎在尖叫。",
    "E47.Little.Quacker_scene027.mp4": "一只棕色的小老鼠拉着一只黄色的小鸭子从木屋门口跑出来，它们沿着木板路奔跑。小鸭子突然张大嘴巴，似乎在尖叫。这时，一只拿着大菜刀的灰色猫从木板路的另一端冲出来，试图追赶它们。猫在追赶过程中滑倒，摔倒在木板路上，然后又爬起来继续追赶。小鸭子和小老鼠继续逃跑，猫在后面紧追不舍。",
    "E47.Little.Quacker_scene028.mp4": "在农场的谷仓外，一只棕色的小老鼠和一只黄色的小鸡正在奔跑。突然，一只拿着大菜刀的灰色猫从右侧冲出，试图攻击它们。小老鼠和小鸡躲到红色柱子后面，猫挥刀砍向柱子，结果柱子被砍断，碎石飞溅，猫被砸得晕头转向。小老鼠和小鸡趁机从碎石堆中跑出来，继续逃跑，而猫则呆呆地坐在地上，头上顶着一块木板，目送它们离开。",
    "E47.Little.Quacker_scene029.mp4": "一只黄色的小鸟在草地上奔跑，随后一只棕色的小老鼠从画面右侧出现并追赶小鸟。小老鼠跑到一棵大树旁，躲进树洞里。这时，一只灰色的猫拿着一把大斧头出现，试图用斧头劈开树干，但小老鼠从树洞里探出头来，猫则不断挥舞斧头，试图吓唬小老鼠。",
    "E47.Little.Quacker_scene030.mp4": "一只黄色的小鸭子在地面上快速奔跑，背景是蓝天白云和几丛草。小鸭子跑动时双臂张开，表情专注，随后从画面右侧消失。",
    "E47.Little.Quacker_scene031.mp4": "汤姆猫正在用锯子锯一根木头，杰瑞鼠从木头后面探出头来。一只小黄鸭突然出现，用斧头砍向汤姆猫，汤姆猫被吓得跳开，木头也被砍断了。",
    "E47.Little.Quacker_scene032.mp4": "一只灰色的猫在草地上奔跑，突然被一根从天而降的木头砸中，木头从空中落下，猫被砸倒在地，木头停在草地上。",
    "E47.Little.Quacker_scene033.mp4": "画面一开始展示了一根躺在草地上的原木，天空中有几朵云。随后画面变暗，接着出现两个小动物——一只棕色的小熊和一只黄色的小鸭子——在夜晚的玉米地里行走。",
    "E47.Little.Quacker_scene034.mp4": "在一片茂密的芦苇丛中，一只棕色的小老鼠和一只黄色的小鸭子手拉手，愉快地向前走着。它们的步伐轻快，似乎在享受这段旅程。小鸭子时不时地张开嘴巴，好像在开心地叫唤，而小老鼠则专注地向前看，偶尔回头看看小鸭子。周围的芦苇高大挺拔，随风轻轻摇曳，营造出一种宁静而自然的氛围。",
    "E47.Little.Quacker_scene035.mp4": "在红色谷仓外，一只黑猫汤姆从门后探出头，手持蓝色猎枪，瞄准绿色木箱，随后将枪口对准箱子并扣动扳机，但枪口只冒出一小团烟雾，汤姆随即消失在画面中。",
    "E47.Little.Quacker_scene036.mp4": "一只棕色的小老鼠和一只黄色的小鸭子在高高的芦苇丛中手牵手奔跑。它们穿过密集的芦苇，小鸭子在前，小老鼠在后，两者都显得非常开心和兴奋。芦苇随风摇曳，背景是茂密的绿色植物，营造出一种自然和谐的氛围。",
    "E47.Little.Quacker_scene037.mp4": "一只小黄鸭被一只棕色老鼠拉着跑，它们跑过一片芦苇丛，然后跑到一个红色木门旁。老鼠拉着鸭子撞到门上，鸭子被撞得飞出去，老鼠则抱住了鸭子，躲在门后。",
    "E47.Little.Quacker_scene038.mp4": "汤姆猫从木屋角落探出头，拿着黄色小喇叭吹奏，表情得意，随后将喇叭扔出画面。",
    "E47.Little.Quacker_scene039.mp4": "一只棕色老鼠和一只黄色小鸭子站在红色幕布前。老鼠先是用爪子指着小鸭子，然后突然转身跑开，小鸭子则留在原地，看起来有些困惑和失落。",
    "E47.Little.Quacker_scene040.mp4": "一只老鼠拿着点燃的红色烟花筒从木箱后探出，猫从旁边探头，也拿着一个黄色烟花筒，两相对峙。猫把烟花筒对准老鼠，老鼠被吓到后退，烟花筒掉在地上。猫惊讶地看着烟花筒，然后将烟花筒放入口中，烟花筒爆炸，猫被熏黑，表情痛苦，随后恢复平静。",
    "E47.Little.Quacker_scene041.mp4": "一只黄色的小鸭子拉着一只棕色的小老鼠奔跑，它们跑向一棵大树并躲进树洞。随后，一只灰色的猫拿着猎枪从树洞中探出，试图瞄准并射击，但猎枪被卡在树洞口，猫被卡住并被猎枪的后坐力弹飞。",
    "E47.Little.Quacker_scene043.mp4": "猫汤姆躺在树下，头顶有一根蓝色的管子，周围有烟雾缭绕，随后烟雾散去，露出晴朗的天空。",
    "E47.Little.Quacker_scene045.mp4": "一只小黄鸭和一只棕色老鼠在草地上奔跑，随后画面切换到一只蓝猫推着割草机在草地上快速移动。",
    "E47.Little.Quacker_scene047.mp4": "一只灰色的鹅抱着一只黄色的小鸭子，小鸭子不断挣扎并指向鹅。鹅显得很无奈和惊讶。随后，一只猫出现，与鹅对峙，猫看起来很生气，而鹅则显得害怕和惊讶。猫和鹅之间似乎发生了冲突。",
    "E47.Little.Quacker_scene048.mp4": "视频中，汤姆猫站在红色木墙前，面对一只抱着黄色小鸭子的灰鸭子和一只体型较大的棕鸭子。灰鸭子在说话并展示小鸭子，棕鸭子则在一旁观察。随后，灰鸭子展开翅膀，似乎在保护小鸭子，而汤姆猫显得惊讶和紧张。最后，灰鸭子和棕鸭子一起快速旋转，导致羽毛飞散，汤姆猫被卷入其中，显得非常慌张。整个场景充满了卡通式的夸张和幽默。",
    "E47.Little.Quacker_scene049.mp4": "汤姆猫在草地上奔跑，撞到一棵树上。一只鸭子拿着割草机靠近汤姆，开始割草。突然，一只母鸭和小鸭子出现在水中，被鸭子拉着前进。随后，汤姆猫出现在水中，被小鸭子拉着前进。最后，汤姆猫和小鸭子一起在水中漂浮，汤姆猫拿着望远镜观察周围。",
    "E47.Little.Quacker_scene050.mp4": "视频开始时显示“THE END”字样，背景为红色渐变，随后逐渐出现“An MGM Tom and Jerry Cartoon”和“MADE IN HOLLYWOOD, U.S.A.”字样，最后画面渐暗至全黑。"
}