{
    "E62.Cat.Napping_scene001.mp4": "画面从全黑开始，随后出现米高梅动画公司的经典标志，标志中央是一只咆哮的狮子，下方有“A Metro-Goldwyn-Mayer CARTOON”字样，以及“COLOR BY Technicolor”的彩色文字。背景为深红色，整体风格复古，充满经典动画片头的氛围。",
    "E62.Cat.Napping_scene002.mp4": "这是一个米高梅动画片头，背景为红色，中央有一个圆形框架，里面是一只咆哮的狮子，下方写着“A Metro-Goldwyn-Mayer CARTOON”和“COLOR BY Technicolor”。狮子在框架内不断张合嘴巴，表现出咆哮的动作。",
    "E62.Cat.Napping_scene003.mp4": "视频展示了米高梅动画的片头，首先出现的是米高梅的狮子标志和“CARTOON”字样，接着画面转为黑色，最后出现“TOM and JERRY”的标题，背景为红色渐变圆环。",
    "E62.Cat.Napping_scene004.mp4": "视频展示了经典动画《猫和老鼠》的片头画面，背景为红色渐变圆形，中央是猫汤姆和老鼠杰瑞的卡通形象，下方有黄色的“TOM and JERRY”字样。随后画面过渡，出现“CAT NAPPING”字样和导演信息“DIRECTED BY WILLIAM HANNA and JOSEPH BARBERA”。",
    "E62.Cat.Napping_scene005.mp4": "这是一个动画片的片头，显示了“CAT NAPPING”标题，导演是William Hanna和Joseph Barbera。接着展示了动画师和音乐制作人的名字，以及制作公司和版权信息。最后，画面淡出并转到一个夜晚的场景，一只老鼠在吊床上睡觉。",
    "E62.Cat.Napping_scene006.mp4": "一只棕色的小猫躺在蓝色的吊床上，吊床悬挂在两棵树之间。小猫闭着眼睛，看起来非常放松和惬意。背景是一栋黄色的房子和绿色的树木，天空是蓝色的，有几朵白云。突然，一个红色的物体从上方飞过，似乎是某种玩具或物品，但没有对小猫造成任何影响。整个场景宁静而悠闲。",
    "E62.Cat.Napping_scene007.mp4": "汤姆猫从黄色房子的蓝色门前走出，手里拿着一杯饮料和一把筷子，怀里抱着一个红色手提箱和一个黄色枕头，他沿着石板路欢快地走着。",
    "E62.Cat.Napping_scene008.mp4": "在户外的庭院里，汤姆猫拿着一杯饮料和一个收音机走向一张黄色的桌子。他把收音机放在桌上，然后打开一个黄色的枕头，发现里面藏着一个黄色的猫。汤姆猫惊讶地瞪大眼睛，然后张开双臂，似乎对这个意外感到震惊和困惑。",
    "E62.Cat.Napping_scene009.mp4": "一只棕色的小老鼠正在一个蓝色的斜坡上攀爬，它抓住一个黄色的布袋，努力向上爬。突然，一只灰色的大猫从左侧出现，它伸出爪子抓住布袋，将小老鼠甩了下来。小老鼠从斜坡上滑落，但仍然保持着开心的表情。",
    "E62.Cat.Napping_scene010.mp4": "汤姆猫躺在吊床上，先是皱眉，然后双手叉腰，表情变得愤怒。",
    "E62.Cat.Napping_scene011.mp4": "汤姆猫躺在吊床上，伸出爪子拉扯吊床的绳索，表情显得非常愤怒和不满。",
    "E62.Cat.Napping_scene012.mp4": "一只棕色的小猫躺在蓝色的垫子上，垫子被两根绳子固定在两端。小猫在垫子上翻滚，镜头逐渐向左移动，露出背景中的树木和围墙。",
    "E62.Cat.Napping_scene013.mp4": "汤姆猫用舌头卷住杰瑞鼠，试图将他拉向池塘边，但杰瑞鼠被拉入水中后，迅速游动并跳出水面，最后在水中游泳。",
    "E62.Cat.Napping_scene014.mp4": "汤姆猫躺在吊床上悠闲地吃冰激凌，杰瑞鼠突然出现并试图偷吃，结果被汤姆猫发现并用冰激凌棍子打飞。",
    "E62.Cat.Napping_scene015.mp4": "一只蓝色的猫躺在地上，头部被一个类似吸管的物体插入，表情痛苦。背景是蓝色的天空和白色的波浪形装饰。",
    "E62.Cat.Napping_scene016.mp4": "一只棕色的小老鼠躺在蓝色的吊床上，显得非常放松。随后，一只灰色的猫从吊床的一侧探出头来，表情愤怒，似乎对小老鼠的悠闲状态感到不满。背景是户外的环境，有树木和天空。",
    "E62.Cat.Napping_scene017.mp4": "汤姆猫躺在吊床上，他用力拉扯吊床的绳子，试图将吊床从树上拉下来。他先是拉住吊床的一端，然后又拉住另一端，最终将吊床完全拉到地面。",
    "E62.Cat.Napping_scene018.mp4": "一只棕色的猫在蓝天中飞翔，它从云层上方飞过，逐渐接近地面，最终坠入一片树林中。",
    "E62.Cat.Napping_scene019.mp4": "一只棕色的小猫从树上的鸟巢里爬出来，躺在树枝上，然后鸟巢掉下来，小猫继续躺在树枝上，享受着阳光。",
    "E62.Cat.Napping_scene020.mp4": "一只棕色的小熊从树洞中爬出，躺在树枝上，随后又缩回树洞里。镜头向下移动，展示树干和树叶。",
    "E62.Cat.Napping_scene021.mp4": "一只棕色的小猫从树洞中探出头，被一根绳子吊在空中，绳子连接着树干上的钩子。小猫在空中滑行，背景是蓝天和几片树叶。",
    "E62.Cat.Napping_scene022.mp4": "汤姆躺在吊床上打哈欠，杰瑞跳到他身上的枕头上。汤姆惊醒后，发现杰瑞在枕头上睡觉。汤姆生气地用一个透明的塑料板将杰瑞盖住，然后坐起来观察杰瑞。杰瑞被盖住后，汤姆放松下来，但随后又变得紧张，继续盯着杰瑞。",
    "E62.Cat.Napping_scene023.mp4": "一群红黑相间的甲虫在绿色草地上排成一行，从画面左侧向右侧缓慢爬行。背景是一堵白色的墙和一些绿色灌木，上方是红白相间的波浪形遮阳篷。",
    "E62.Cat.Napping_scene024.mp4": "汤姆猫坐在蓝色的吊床上，用一根绳子拉着杰瑞鼠。杰瑞鼠躺在吊床的黄色垫子上，看起来很放松。汤姆猫突然用力拉绳子，吊床开始晃动，汤姆猫也跟着晃动起来，表情变得愤怒。最后，汤姆猫用爪子抓住绳子，吊床停止晃动。",
    "E62.Cat.Napping_scene025.mp4": "一只棕色的小老鼠被一群蚂蚁拖着走，它先是躺着，然后坐起来，接着被拖到一个蓝色的滑梯下，最后从滑梯上滑下来，躺在地上。",
    "E62.Cat.Napping_scene026.mp4": "汤姆猫躺在蓝色的躺椅上，头枕着黄色的枕头，闭着眼睛，表情放松。他微微张开嘴，似乎在享受阳光，偶尔动动耳朵和眼睛，显得非常惬意。背景是蓝天和远处的绿色灌木。",
    "E62.Cat.Napping_scene027.mp4": "一只棕色的小老鼠从一个大型金属装置的蓝色底座下钻过，随后迅速跑开，消失在画面右侧。",
    "E62.Cat.Napping_scene028.mp4": "一群蚂蚁排成一列在草地上行走，一只小老鼠从画面左侧跑入，它追赶着蚂蚁。小老鼠跑到一个蓝色耙子和一张木桌旁，它在桌腿间躲藏，同时继续观察蚂蚁的行进。蚂蚁队伍逐渐靠近桌子，小老鼠在桌腿间来回移动，试图躲避或接近蚂蚁。",
    "E62.Cat.Napping_scene029.mp4": "一只小老鼠出现在桌子上，它抓住一根绿色的棍子，棍子的另一端有一条由许多小虫子组成的链条。小老鼠用力抬起棍子，链条上的虫子逐渐增多，最终形成一条长长的虫子链。",
    "E62.Cat.Napping_scene030.mp4": "视频中展示了一把蓝色的耙子被绑在树上，耙子的齿间有几条白色的绳子。随着镜头的推进，可以看到许多蚂蚁沿着耙子的齿和绳子爬行，它们从树干上出发，沿着耙子的齿和绳子向远处爬去。背景是蓝天和白云，以及部分建筑物和树木。",
    "E62.Cat.Napping_scene031.mp4": "汤姆猫躺在蓝色的躺椅上，头枕着一个黄色的枕头，闭着眼睛，似乎在享受阳光。突然，他睁开眼睛，表情变得警觉，然后又闭上眼睛，似乎在思考什么。背景是蓝天和一些绿色的植物。",
    "E62.Cat.Napping_scene032.mp4": "一艘红蓝相间的小船被绳索牵引着，从画面右侧向左侧移动。绳索的一端固定在左侧的树干上，另一端连接着小船。随着小船的移动，绳索逐渐绷紧，最终在小船和树干之间发生断裂，绳索飞出并消失在画面中。背景是蓝天和一朵白云。",
    "E62.Cat.Napping_scene033.mp4": "汤姆猫躺在吊床上，悠闲地喝着饮料，享受着宁静的午后时光。他先是放松地躺着，随后拿起饮料杯，慢慢品尝，脸上露出满足的表情。接着，他将饮料放下，双手交叉放在胸前，闭上眼睛，似乎进入了梦乡。整个场景充满了宁静和惬意的氛围。",
    "E62.Cat.Napping_scene034.mp4": "一只棕色的小老鼠站在户外的草地上，它正用前爪抓着一个黄色的竹制结构，似乎在用力拉扯。背景是一堵红砖墙、一个小水池和一些花草。小老鼠的表情从专注逐渐变为惊讶或困惑。",
    "E62.Cat.Napping_scene035.mp4": "一只棕色的小老鼠跑向池塘边，靠近坐在荷叶上的绿色青蛙。小老鼠先是好奇地观察青蛙，然后小心翼翼地靠近，最后成功跳上荷叶，与青蛙并肩而坐。",
    "E62.Cat.Napping_scene036.mp4": "一只棕色老鼠站在荷叶上，面对着一只绿色青蛙。老鼠先是张开双臂，然后弯下腰，靠近青蛙，似乎在与青蛙互动或交谈。青蛙保持静止，眼睛看向老鼠。背景是蓝色的水面和绿色的水生植物。",
    "E62.Cat.Napping_scene037.mp4": "一只青蛙趴在草地上，视角从青蛙背部开始，逐渐拉近到一个圆形视野，聚焦在远处的吊床上。吊床上有一双白色的脚，旁边的小桌上放着一杯带吸管的饮料和一个红色的收音机。背景是蓝天白云和沙滩。",
    "E62.Cat.Napping_scene038.mp4": "一只棕色的小老鼠站在荷叶上，面对着一只绿色的青蛙。青蛙突然跳起，将老鼠吓了一跳，老鼠在荷叶上惊慌失措地跳动，最后稳住身形。背景是蓝色的水面和绿色的水草。",
    "E62.Cat.Napping_scene039.mp4": "一只绿色的小青蛙从树上跳起，飞向一个装有吸管的红色杯子，最终落入杯中，溅起水花。",
    "E62.Cat.Napping_scene040.mp4": "汤姆猫躺在吊床上，先是打了个哈欠，然后坐起来四处张望，接着又躺下，最后伸手拿起旁边桌子上的饮料杯。",
    "E62.Cat.Napping_scene041.mp4": "汤姆猫手持一杯饮料，用吸管喝着，突然饮料喷出，他惊讶地用手捂住嘴，随后继续喝，最后满意地躺下。",
    "E62.Cat.Napping_scene042.mp4": "汤姆猫在吊床上悠闲地躺着，随后突然从吊床中弹起，坐在地上。接着，他开始做各种动作，包括倒立和翻滚，最后在草地上翻滚并坐起。",
    "E62.Cat.Napping_scene043.mp4": "汤姆猫从桌子底下爬出来，然后跳到池塘里，导致水花四溅。",
    "E62.Cat.Napping_scene044.mp4": "一只青蛙跳到池塘里的荷叶上，随后一只猫从水下探出头，青蛙爬到猫的头上，猫试图甩掉青蛙，最终青蛙被甩进水里，猫露出愤怒的表情。",
    "E62.Cat.Napping_scene045.mp4": "一只棕色的小老鼠在蓝色的吊床上，用吸管喝着红色杯子中的饮料。它喝完后，突然被吊床甩出，飞向空中。随后，一只黑色的猫从画面右侧冲入，抓住吊床的一端，将吊床拉向自己。",
    "E62.Cat.Napping_scene046.mp4": "杰瑞在院子里奔跑，不小心撞到了一台割草机，割草机启动后冒出黑烟，杰瑞被甩到一旁。这时，汤姆从画面右侧冲进来，试图抓住杰瑞，但被割草机撞到，割草机失控飞了出去。杰瑞趁机逃跑。",
    "E62.Cat.Napping_scene047.mp4": "汤姆猫在草地上奔跑，撞上一个吊床，吊床被撕裂成红色和蓝色的碎片。汤姆猫被吊床缠住，变成纸链形状，随后画面变黑。接着，汤姆猫在吊床上睡觉，手里拿着一根棒球棒。",
    "E62.Cat.Napping_scene048.mp4": "一只棕色的小老鼠拿着一个黄色的钩子，钩子连接着一根白色的绳子。小老鼠用钩子钩住绳子，然后用力拉扯，导致绳子被拉直，小老鼠被拉向空中，最终消失在画面中。背景是一片绿色的草地和一棵树，远处有建筑物和灌木丛。",
    "E62.Cat.Napping_scene049.mp4": "一只棕色的小老鼠站在井沿上，用力拉扯一根绳子。绳子的另一端连接着一个吊篮，吊篮里坐着一只黑猫汤姆。汤姆手持一根黄色的棍子，表情严肃。小老鼠在拉绳子的过程中，从井沿上捡起一把绿色手柄的剪刀，并用剪刀剪断了绳子，导致吊篮和汤姆被拉离井口。背景是一片蓝天、绿树和围墙。",
    "E62.Cat.Napping_scene050.mp4": "一只猫躺在吊床上，手持棒球棒，随着吊床的摆动，猫逐渐被甩出画面，最终吊床和猫消失，只留下飘落的树叶。",
    "E62.Cat.Napping_scene051.mp4": "一只鸟儿在蓝天中飞翔，它挥舞着一根黄色的棒子，随后飞向远方，最终消失在画面中。背景是蓝天白云和树木。",
    "E62.Cat.Napping_scene052.mp4": "动画片中的猫汤姆在空中飞行，手持棒球棒。他先是被一架黄色飞机的螺旋桨卷起，随后从飞机下方飞过。接着，一只海鸥从他身边飞过，汤姆转头看着海鸥，表情惊讶。最后，汤姆的棒球棒掉落，他张大嘴巴，露出惊恐的表情，然后从画面中消失。",
    "E62.Cat.Napping_scene053.mp4": "动画片中的汤姆猫从空中跳入海中，起初他四肢张开在水面漂浮，随后身体逐渐被海水分解成碎片，最终完全消失，只留下水面上的涟漪。",
    "E62.Cat.Napping_scene054.mp4": "一只小老鼠拿着一根大骨头，试图把它挂在吊床上。一只灰色的大狗突然出现，兴奋地冲向骨头，结果被吊床吊起，骨头被挂在吊床上。大狗在吊床上开心地舔着骨头，口水四溅，显得非常满足。小老鼠在一旁看着，露出得意的笑容。",
    "E62.Cat.Napping_scene055.mp4": "动画片段中，汤姆猫手持棒球棒从远处跑来，冲向一个砖墙柱子，他撞上柱子后摔倒在地，随后消失在画面中。",
    "E62.Cat.Napping_scene056.mp4": "汤姆猫拿着棒球棒，试图从吊床上救出被压住的自己。他用力挥棒，但最终只是把吊床和自己弄得更乱。",
    "E62.Cat.Napping_scene057.mp4": "汤姆猫手持棒球棒，手里拿着一个红色项圈。他脑海中浮现出杰瑞鼠戴着项圈的画面，接着又出现了一只戴着相同项圈的愤怒斗牛犬。汤姆表情从得意转为惊恐，最终斗牛犬从毯子下现身，汤姆吓得跳开，斗牛犬则怒目圆睁地盯着他。",
    "E62.Cat.Napping_scene059.mp4": "视频展示了一个经典的动画片尾画面，背景为红色，中央有一个橙色的圆形光斑，上面用白色和蓝色字体写着“The End”。随后，画面逐渐过渡到一个更完整的标题画面，显示“An M.G.M Tom and Jerry CARTOON”，下方标注“MADE IN HOLLYWOOD, U.S.A.”。整个画面风格复古，具有20世纪中期好莱坞动画片的典型特征。"
}