{
    "33. The Invisible Mouse_scene001.mp4": "视频开始时显示黑色背景，右下角有白色数字“0110544170204083”。随后画面渐变为深蓝色背景，出现米高梅卡通片头标志，标志上写有“A METRO-GOLDWYN-MAYER CARTOON”和“COLOR BY TECHNICOLOR”。",
    "33. The Invisible Mouse_scene002.mp4": "这是一个米高梅卡通片头，背景为深蓝色，中央有一个圆形标志，标志内是一只咆哮的狮子。标志上方写着“A METRO-GOLDWYN-MAYER”，下方是“CARTOON”字样，再下方是“COLOR BY TECHNICOLOR”。画面底部有一串数字“0110544170204083”。狮子在标志内不断咆哮，表情凶猛，随后画面逐渐变暗。",
    "33. The Invisible Mouse_scene003.mp4": "视频展示了经典动画《猫和老鼠》的片头，首先出现的是“CARTOON”字样，随后切换到蓝色背景上，显示“Tom and Jerry”标题，旁边是卡通猫汤姆和老鼠杰瑞的形象。",
    "33. The Invisible Mouse_scene004.mp4": "这是一个《猫和老鼠》的片头画面，展示了主角汤姆猫和杰瑞鼠的卡通形象，背景为蓝色，标题“Tom and Jerry”以黄色字体呈现。随着画面推进，出现了该集的标题“The Invisible Mouse”以及导演信息“Directed by William Hanna and Joseph Barbera”。整个画面充满经典动画风格，角色表情生动。",
    "33. The Invisible Mouse_scene005.mp4": "视频展示了动画片《The Invisible Mouse》的片头。首先，屏幕显示了动画的标题和导演威廉·汉纳与约瑟夫·巴伯拉的名字，背景是实验室设备。随后，画面切换到制作人员名单，包括动画师、音乐家等，以及版权和制作信息。最后，画面显示制片人弗雷德·奎姆比的名字，并逐渐变暗，过渡到下一个场景。",
    "33. The Invisible Mouse_scene006.mp4": "一只老鼠从洞里探出头，看到一块奶酪后兴奋地跑出来，试图拉住奶酪，但奶酪被绳子牵着，老鼠被拉得跌倒又爬起，继续努力拉扯，最终老鼠被奶酪拖着跑动，显得非常吃力。",
    "33. The Invisible Mouse_scene007.mp4": "在室内，猫汤姆手持一个蓝色水壶，另一只手拿着一个黄色奶酪块，眼睛发亮，表情凶狠。小老鼠杰瑞从画面左侧跑出来，看到汤姆后吓得张大嘴巴，惊慌失措地向汤姆扑去。汤姆则保持着攻击姿态，准备用奶酪引诱杰瑞，但杰瑞显然已经吓坏了。",
    "33. The Invisible Mouse_scene009.mp4": "一只棕色小老鼠在房间里奔跑，突然被一个巨大的猫爪绊倒。它迅速抓住猫爪，用力一拉，猫爪被拉出，露出一个蓝色的熨斗。小老鼠得意地看着熨斗，而猫爪则被熨斗压住，冒出红蓝相间的蒸汽。",
    "33. The Invisible Mouse_scene010.mp4": "汤姆猫愤怒地追着杰瑞鼠，杰瑞鼠逃跑时不小心撞倒了熨斗，熨斗飞出去，汤姆猫也跟着飞了出去。",
    "33. The Invisible Mouse_scene011.mp4": "一只小老鼠从楼梯下跑过，一只黑猫从楼梯后跳出来追逐它。",
    "33. The Invisible Mouse_scene012.mp4": "一只老鼠沿着楼梯向上跑，猫从后面追来，抓住了老鼠，但老鼠被甩到楼梯扶手上，猫也跟着滑下去，最后猫挂在扶手上。",
    "33. The Invisible Mouse_scene013.mp4": "一只小老鼠趴在楼梯扶手上，一只大灰猫从后面出现，张开嘴露出尖牙，准备扑向小老鼠。",
    "33. The Invisible Mouse_scene014.mp4": "一只小老鼠正沿着楼梯扶手向上爬，突然一只猫从上方冲下来，试图抓住它，但小老鼠敏捷地躲开了。",
    "33. The Invisible Mouse_scene015.mp4": "汤姆猫从楼梯扶手上滑落，身体在空中翻滚，最终消失在画面中。",
    "33. The Invisible Mouse_scene016.mp4": "猫被钟摆击中后，钟被拆解，猫戴上钟的部件，嘴里叼着一只小鸟。",
    "33. The Invisible Mouse_scene017.mp4": "一只灰色的猫在追逐一只棕色的小老鼠。猫在追逐过程中，从桌下爬出，经过壁炉，捡起一把黄色的伞，然后用伞追赶老鼠。猫的表情专注而凶狠，显示出它对捕获老鼠的决心。整个场景发生在一个室内环境中，背景有窗帘、桌子和壁炉等家具。",
    "33. The Invisible Mouse_scene018.mp4": "一只棕色的小老鼠在房间里奔跑，它跑过一张桌子的腿，然后冲向墙角的一个洞，最后钻进了洞里。",
    "33. The Invisible Mouse_scene020.mp4": "汤姆猫拿着一个装有杰瑞老鼠的气球，气球被挤压后又恢复原状，杰瑞在气球顶部被弹起，随后在房间的天花板上爬行并最终滑落。",
    "33. The Invisible Mouse_scene021.mp4": "汤姆猫拿着一个红黄相间的锥形物体，杰瑞鼠从物体顶部出现，抓住物体边缘。汤姆猫露出得意的笑容，杰瑞鼠被物体弹起，物体破裂成碎片，杰瑞鼠在空中奔跑，最终消失在画面中。",
    "33. The Invisible Mouse_scene022.mp4": "一只老鼠从空中跳到木柜上，接着跳到台灯上，然后从台灯上跳起，撞到一个蓝色花瓶，导致花瓶破裂，液体喷溅。随后，一只灰猫出现，愤怒地将台灯摔在地上，然后迅速离开。",
    "33. The Invisible Mouse_scene023.mp4": "在实验室里，杰瑞从一瓶标有“隐形墨水”的墨水中探出头来，然后跳出来，发现地上有一滴墨水。杰瑞好奇地观察这滴墨水，然后小心翼翼地靠近，似乎想弄清楚它的性质。背景中有各种颜色的试管和化学试剂瓶。",
    "33. The Invisible Mouse_scene025.mp4": "镜头从书架和紫色沙发的局部开始，逐渐拉近并聚焦于沙发。沙发上有一个红色的枕头，随后枕头突然变形，变成了一张张开的嘴，接着又慢慢闭合。最后，枕头完全消失，露出沙发扶手上的一团白色布料，布料逐渐飘起，变成了一只白色的猫，猫在空中翻滚，最终变成了一只白色的鸟，鸟在空中飞翔。",
    "33. The Invisible Mouse_scene026.mp4": "视频展示了一只白色的猫爪从画面顶部缓缓落下，轻轻触碰地面后，逐渐蜷缩成一团。随后，镜头向右移动，露出一旁的粉红色窗帘，窗帘随着微风轻轻摆动，最终完全遮挡了猫爪。整个画面背景是浅色墙壁和粉色地毯，营造出一种宁静温馨的氛围。",
    "33. The Invisible Mouse_scene027.mp4": "汤姆猫手持熨斗，试图用电熨斗烫老鼠杰瑞。他先是蹲在地上，将熨斗举高，然后站起来，用脚踩住电源插头，确保熨斗通电。杰瑞躲在墙洞里，似乎在躲避汤姆的攻击。",
    "33. The Invisible Mouse_scene028.mp4": "一个奶酪块被绳子绑着，放在墙洞前。奶酪块被拉扯着向前移动，最终被拉断，绳子散落在地上。",
    "33. The Invisible Mouse_scene029.mp4": "汤姆猫拿着熨斗，试图用绳子拉住一只躲在墙洞里的老鼠。他把熨斗放在桌子上，然后用力拉绳子，结果熨斗掉在地上并冒出火花。汤姆猫被吓了一跳，跳了起来，然后又蹲下来看着地上的熨斗，表情惊讶。",
    "33. The Invisible Mouse_scene030.mp4": "一只猫的尾巴触碰到一个黄色的电器插头，导致插头冒出火花并引发爆炸，最终画面被强烈的光芒充满。",
    "33. The Invisible Mouse_scene031.mp4": "视频开始时，画面呈现红色和黄色的爆炸状图案，随后迅速切换到黑色背景上布满白色烟雾状的云朵，云朵缓慢移动并逐渐扩散。",
    "33. The Invisible Mouse_scene032.mp4": "一只灰色的猫在房间里奔跑，突然撞到一张紫色的沙发上，它显得非常痛苦和疲惫，舌头伸出，眼睛半闭，似乎在喘息。背景中可以看到烟雾弥漫，暗示可能发生了火灾或爆炸。猫试图用爪子抓住沙发，但看起来无力反抗，最终坐在地上，继续喘息和呻吟。",
    "33. The Invisible Mouse_scene033.mp4": "一只灰色的猫（汤姆）走到一个装有牛奶的蓝色碗前，它伸出舌头舔了舔碗边，然后突然表现出痛苦的表情，似乎对牛奶过敏或感到不适。它开始用爪子揉眼睛，然后弯腰，似乎在努力控制自己的身体。最后，它再次伸出舌头舔碗，但似乎仍然感到不适。",
    "33. The Invisible Mouse_scene034.mp4": "汤姆猫俯身看着一个蓝色碗，碗里装着白色液体。他伸出舌头舔了一下碗沿，然后突然碗里的液体消失了，汤姆猫露出惊讶的表情。",
    "33. The Invisible Mouse_scene035.mp4": "汤姆猫看到水盆里的水，伸出舌头舔水，然后拿起水盆倒水，水洒在脸上，汤姆猫被水淋湿，表情惊讶，随后跑开。",
    "33. The Invisible Mouse_scene036.mp4": "汤姆猫走到梳妆台前，看着镜子里的自己，伸出舌头舔了舔镜中的自己。",
    "33. The Invisible Mouse_scene037.mp4": "汤姆猫对着镜子梳理毛发，然后吐舌头，接着走到一个红色的枕头旁，躺下睡觉。",
    "33. The Invisible Mouse_scene038.mp4": "一只猫的爪子出现在画面中，它用爪子拿起一根火柴，然后将火柴放在火柴盒上点燃。火柴盒被点燃后，火焰迅速蔓延，火柴盒开始燃烧并冒出黑烟。",
    "33. The Invisible Mouse_scene039.mp4": "一只灰色的猫躺在红色的被子上，起初闭着眼睛，表情放松。随后，乌云从上方聚集，猫开始流汗，表情逐渐变得焦虑和痛苦，眼睛睁大，汗珠不断滴落。猫的头部抬起，似乎在承受巨大的压力或不适。",
    "33. The Invisible Mouse_scene040.mp4": "一只灰色的猫躺在红色的枕头上，旁边有火焰和黑烟。猫起初看起来很放松，但随后注意到火焰，变得惊慌并试图用爪子扑灭它，最终被火焰包围并被弹开。",
    "33. The Invisible Mouse_scene042.mp4": "一个香蕉在绿色盘子上逐渐剥皮，旁边有一个红苹果。随后，墙上出现了一只老鼠和一只猫的影子，老鼠似乎在偷吃水果，猫则在监视它。",
    "33. The Invisible Mouse_scene043.mp4": "汤姆猫躲在沙发后面，表情愤怒，张大嘴巴似乎在大声喊叫。随后，他伸手拿起沙发上的红色书本，翻阅了一下后又迅速躲回沙发后面。",
    "33. The Invisible Mouse_scene044.mp4": "视频中，汤姆猫从桌子下方探出头，眼睛闪烁着黄色的光芒，盯着桌上的水果盘。盘子里有一根剥开的香蕉和一个红苹果。汤姆猫慢慢站起来，手里拿着一本书，似乎在思考如何获取水果。背景中，墙上有两个老鼠的影子，暗示着可能有老鼠在附近活动。整个场景充满了紧张和期待的氛围。",
    "33. The Invisible Mouse_scene045.mp4": "汤姆猫坐在桌前，桌上有一本书、一个苹果和一根香蕉。他先是愤怒地盯着墙上的老鼠影子，然后伸手去抓香蕉，但被影子戏弄。接着，他愤怒地咬住香蕉，但苹果被影子拿走，他显得非常沮丧。",
    "33. The Invisible Mouse_scene046.mp4": "一个红苹果滚落在厨房地板上，靠近冰箱。汤姆猫从冰箱后面探出头，眼睛盯着苹果，然后迅速扑过去，但苹果被咬了一口后滚到一边，汤姆猫一脸惊讶地看着它。",
    "33. The Invisible Mouse_scene047.mp4": "汤姆猫伸手拿起放在橱柜上的绿色面粉桶，桶上标有“FLOUR”字样。",
    "33. The Invisible Mouse_scene048.mp4": "汤姆猫拿着一罐面粉，撒在地板上，制造了一片白色的面粉云。随后，他坐在椅子上，用平底锅试图捕捉躲在面粉云中的杰瑞鼠，但未能成功。杰瑞鼠在面粉云中躲藏，而汤姆猫则在地板上留下绿色的脚印，最终他发现杰瑞鼠并未被抓住，感到沮丧。",
    "33. The Invisible Mouse_scene049.mp4": "一只黑猫在厨房的泡沫地上滑行，留下绿色脚印，最终冲进客厅。",
    "33. The Invisible Mouse_scene050.mp4": "汤姆猫在房间里追逐着一个看不见的目标，他从粉色窗帘前飞奔而过，撞上黄色窗帘后摔倒在地，扬起一阵灰尘，然后痛苦地蜷缩在地上。",
    "33. The Invisible Mouse_scene051.mp4": "汤姆猫愤怒地伸出拳头，随后一根细线从他的鼻子上拉出，鼻子被拉长变形成一根长管。他发出“啊呀！”的惊叫声，双手捂住脸，眼睛瞪大，显得非常惊讶和痛苦。",
    "33. The Invisible Mouse_scene052.mp4": "汤姆猫用力拉扯黄色窗帘，被窗帘拖拽着向前翻滚，最终消失在画面中。",
    "33. The Invisible Mouse_scene053.mp4": "汤姆猫悄悄地从墙角探出头，手里拿着一条黄色的毯子，他小心翼翼地观察着前方，似乎在等待什么。随后，他看到地上出现了一串白色的脚印，他露出了得意的笑容，然后迅速消失在画面中。",
    "33. The Invisible Mouse_scene055.mp4": "一只灰色的猫在黄色的毯子上伸展身体，然后突然发现毯子是粘性的，它试图拉扯毯子，结果被粘住并被拖走。",
    "33. The Invisible Mouse_scene056.mp4": "汤姆猫拿着一本红色的书和一条黄色的布，他先是兴奋地挥舞着书和布，然后跪在地上，把书放在布上，接着又把书高高举起，似乎在准备做某件事情。",
    "33. The Invisible Mouse_scene057.mp4": "一个灰色的卡通角色用黄色的布擦拭一本红色的书，然后把书放回原处。接着镜头切换到一个房间角落，一个高尔夫球杆从地上慢慢抬起，似乎在寻找什么。",
    "33. The Invisible Mouse_scene058.mp4": "一只猫趴在地板上，用高尔夫球杆击打一个黄色的高尔夫球，球飞向一个粉红色的脚凳，最终球停在了脚凳上。",
    "33. The Invisible Mouse_scene059.mp4": "汤姆猫从地上跳起，站在房间内，表情愤怒，双手叉腰，来回踱步。",
    "33. The Invisible Mouse_scene060.mp4": "一只猫从门后冲出来，发现一只狗躺在地上，手里拿着高尔夫球杆。猫愤怒地用球杆戳狗，结果球杆戳穿了地板，狗掉进洞里。狗从洞里爬出来，和猫争夺球杆，最终狗用球杆击中了猫。",
    "33. The Invisible Mouse_scene061.mp4": "一只灰色的猫（汤姆）从门廊上摔下来，砸碎了三个花盆。随后，一只灰色的狗（杰瑞）拿着高尔夫球杆出现，试图用球杆击打汤姆，但汤姆成功躲过并反击，最终杰瑞被击中。",
    "33. The Invisible Mouse_scene062.mp4": "一只灰色的猫在户外奔跑，突然被另一只拿着高尔夫球杆的灰色猫从背后攻击。被攻击的猫撞到砖柱后弹起，随后沿着斜坡向上跑，最终消失在画面中。",
    "33. The Invisible Mouse_scene063.mp4": "视频展示了一只老鼠从枕头的破洞中探出头来，用一根黄色的吸管喝巧克力牛奶。老鼠喝得非常开心，眼睛眯成一条线，显得非常满足。随后，画面逐渐变暗，最后出现“The End”的字样，表示视频结束。",
    "33. The Invisible Mouse_scene064.mp4": "视频显示了“THE END”字样，随后逐渐显示出“An M.G.M Tom and Jerry CARTOON MADE IN HOLLYWOOD, U.S.A.”的字样，背景为红色渐变。",
    "33. The Invisible Mouse_scene065.mp4": "视频开始时显示了“An MGM Tom and Jerry Cartoon MADE IN HOLLYWOOD, U.S.A.”的标题画面，随后画面转为全黑，持续数秒。整个片段没有其他视觉内容或动作。"
}